[
 {
  "author": "hwright", 
  "date": "2010-09-29T14:20:52.338901Z", 
  "msg": [
   "Remove the 1.6.x-r997457 branch, reintegrated in r1002644."
  ], 
  "revision_id": "1002645"
 }, 
 {
  "author": "hwright", 
  "date": "2010-09-29T14:20:23.121587Z", 
  "msg": [
   "Reintegrate the 1.6.x-r997457 branch:", 
   "* r997457, r997466", 
   "Fix some error transmission problems in svnserve.", 
   "Justification:", 
   "It's hard to automatically react to a particular error code when", 
   "you can't accurately receive it from the server.", 
   "Notes:", 
   "r997457 fixes svnserve to send only the \"real\" error across the", 
   "wire in places where there is more than one level of magic", 
   "wrapping errors.", 
   "r997466 teaches the client to forgive still-broken servers by", 
   "ignoring wrapping errors and digging down to find the \"real\"", 
   "error itself.  And forgiveness is, as they say, divine.", 
   "Branch:", 
   "^/subversion/branches/1.6.x-r997457", 
   "Votes:", 
   "+1: cmpilato, danielsh, pburba"
  ], 
  "revision_id": "1002644"
 }, 
 {
  "author": "minfrin", 
  "date": "2010-09-29T14:17:52.599907Z", 
  "msg": [
   "mod_disk_cache: Change on-disk header file format to support the", 
   "link of the device/inode of the data file to the matching header", 
   "file, and to support the option of not writing a data file when", 
   "the data file is empty. Refactor the mod_disk_cache code so that", 
   "headers are written as late as possible (on commit), allowing the", 
   "device and inode of the body to be written to the header. At this", 
   "point, writes to the cache are now atomic, without locks."
  ], 
  "revision_id": "1002643"
 }, 
 {
  "author": "hindessm", 
  "date": "2010-09-29T14:14:55.280435Z", 
  "msg": [
   "Merge change from /harmony/enhanced/java/trunk@1002476:", 
   "r1002476 | littlee | 2010-09-29 06:26:48 +0100 (Wed, 29 Sep 2010) | 8 lines", 
   "Applying patch from HARMONY-6638:", 
   "1. In Linux, ServerSocketChannel should be acceptable if its server socket bind any address.", 
   "2. In Linux, SocketChannel should be connectable if it does not connect anything.", 
   "3. The Selector should also return if an error occurred.", 
   "4. If user change the interested operations of a selector, this", 
   "selector should treated as a new one (but with the same", 
   "SelectionKey). On the other hand, if the selector was return once and", 
   "no interested operation changed, it should not  be selected next time."
  ], 
  "revision_id": "1002642"
 }, 
 {
  "author": "mbenson", 
  "date": "2010-09-29T14:14:21.746486Z", 
  "msg": [
   "repackage"
  ], 
  "revision_id": "1002641"
 }
]