[
 {
  "author": "dreiss", 
  "date": "2010-10-06T17:09:52.606227Z", 
  "msg": [
   "THRIFT-922. cpp: Convert protocol classes to use non-virtual functions", 
   "Updated the thrift protocol classes to use non-virtual calls for most", 
   "functions.  The correct implementation is determined at compile time via", 
   "templates now.  Only the base TProtocol class falls back to using", 
   "virtual function calls."
  ], 
  "revision_id": "1005135"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-10-06T17:09:50.315786Z", 
  "msg": [
   "THRIFT-922. cpp: Convert transport classes to use non-virtual calls", 
   "Update the thrift transport classes to use non-virtual calls for most", 
   "functions.  The correct implementation is determined at compile time via", 
   "templates now.  Only the base TTransport class falls back to using", 
   "virtual function calls."
  ], 
  "revision_id": "1005134"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-10-06T17:09:47.945084Z", 
  "msg": [
   "THRIFT-922. cpp: Add shortcutted version of readAll() in TBufferBase", 
   "Just perform a memcpy() if all of the requested data is available in the", 
   "buffer.  This improves performance a little in the common case.  It has", 
   "a bigger impact with the upcoming template changes."
  ], 
  "revision_id": "1005133"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-10-06T17:09:46.501861Z", 
  "msg": [
   "THRIFT-922. cpp: When reading strings, borrow first", 
   "Attempt to get a pointer to the internal transport buffer before copying", 
   "onto the heap.  This improves performance TFramedTransport and", 
   "TMemoryBuffer, and with TBufferedTransport if the string fits within the", 
   "buffer."
  ], 
  "revision_id": "1005132"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-10-06T17:09:45.076853Z", 
  "msg": [
   "THRIFT-923. cpp: Add completion notification to async clients", 
   "Add a virtual function \"completed__(bool)\" to xxxCobClient that is", 
   "called by recv_xxx() after reception of a response (arg = true) or an", 
   "exception (arg = false). This allows the TAsyncClient to intercede at", 
   "that point, permitting, e.g., the load-balancing of persistent", 
   "connections that would otherwise remain bound to a single server.", 
   "A new \"no_client_completion\" flag inhibits generation of this mechanism."
  ], 
  "revision_id": "1005131"
 }
]