[
 {
  "author": "olamy", 
  "date": "2010-10-08T15:11:38.120236Z", 
  "msg": [
   "[MSITE-513] use release final maven 3.0 artifacts"
  ], 
  "revision_id": "1005855"
 }, 
 {
  "author": "arkurth", 
  "date": "2010-10-08T15:01:19.524357Z", 
  "msg": [
   "VCL-394", 
   "Updated Module.pm::get_semaphore to accept a semaphore ID string rather than just a specific file path.  Added code to Semaphore.pm to display the name of the process holding a lock on a file if unable to obtain a lock.", 
   "Updated VMware.pm:", 
   "-Added code to normalize the datastore and VM paths when initialized in case they arrive escaped.  Subroutines which use these paths expect them to not be escaped.", 
   "-Commented out code which deletes the vmdk directory on the VM host during image capture if it has been copied to the image repository for safety.", 
   "-Added check in prepare_vmx to determine if the network name should be specified using 'networkName' or 'vnet'.", 
   "-Added 'svga.autodetect = TRUE' to vmx files.  This should allow the screen to be displayed properly in the vSphere console.", 
   "-Added code to obtain a semaphore lock in prepare_vmdk to prevent multiple concurrent copies of the same files.", 
   "-Added code to check if the image repository path is mounted on the VM host. If so, files are copied using VMware's disk copy methods.  If not available (meaning repository path resides on the management node), SCP is used.", 
   "-Added vmware_cmd.pm which can control a VMware Server 1.x host using vmware-cmd.", 
   "Other", 
   "Made minor change to output in Module.pm::new and State.pm::Destroy.  Commented out unnecessary log messages in utils.pm::nmap_port."
  ], 
  "revision_id": "1005854"
 }, 
 {
  "author": "rhuijben", 
  "date": "2010-10-08T14:58:49.746763Z", 
  "msg": [
   "Remove a temporary/prototype/RFC public conflict api that I added about a", 
   "year ago as it will most likely never be implemented like this. This api is", 
   "superseded by the skel definition we are working on in", 
   "^/subversion/trunk/notes/wc-ng/conflict-storage", 
   "* subversion/include/svn_wc.h", 
   "(svn_wc_conflict_t): Remove typedef.", 
   "(svn_wc_conflict_dup): Remove function.", 
   "(svn_wc_get_conflict_info): Remove function.", 
   "(svn_wc_get_conflict_marker_files): Remove function.", 
   "(svn_wc_get_conflict_sources): Remove function.", 
   "(svn_wc_get_property_conflict_data): Remove function.", 
   "(svn_wc_create_property_conflict): Remove function.", 
   "(svn_wc_create_text_conflict): Remove function.", 
   "(svn_wc_create_tree_conflict): Remove function.", 
   "* subversion/libsvn_wc/conflicts.c", 
   "(svn_wc_conflict_t): Remove struct.", 
   "(conflict_alloc): Remove function.", 
   "(svn_wc_conflict_dup): Remove function.", 
   "(svn_wc_create_property_conflict): Remove function.", 
   "(svn_wc_create_text_conflict): Remove function.", 
   "(svn_wc_create_tree_conflict): Remove function.", 
   "(svn_wc_get_conflict_info): Remove function.", 
   "(svn_wc_get_conflict_marker_files): Remove function.", 
   "(svn_wc_get_conflict_sources): Remove function.", 
   "(svn_wc_get_property_conflict_data): Remove function."
  ], 
  "revision_id": "1005853"
 }, 
 {
  "author": "rickmcguire", 
  "date": "2010-10-08T14:53:15.963952Z", 
  "msg": [
   "GERONIMO-5230 Add Bean Validation Support to the connector 1.6 implementation.", 
   "Changes to Geronimo base."
  ], 
  "revision_id": "1005852"
 }, 
 {
  "author": "arkurth", 
  "date": "2010-10-08T14:47:27.697893Z", 
  "msg": [
   "VCL-196", 
   "Removed the explicit System32 path in all the places cmd.exe is called.  Calling cmd.exe with the full path causes problems if the Windows OS is 64-bit.  In this case, System32 is C:\\Windows\\Sysnative, pointing to the 64-bit copy of the System32 directory.  When cmd.exe is called in this manner, you're running the native 64-bit cmd.exe shell, which does not have access to the Sysnative link.  As a result, if you pass a Sysnative path to a subroutine which calls cmd.exe, this path doesn't exist with the cmd.exe shell and problems occur.", 
   "Updated Windows.pm::create_directory().  Removed unused option which allowed an array of directories to be passed.  This was done to simplify the subroutine.", 
   "VCL-390", 
   "Added code to Windows.pm::get_public_ip_address to detect if an auto-generated 169.254 IP address is retrieved.  It this is the case and DHCP is being used, the subroutine attempts to renew the public IP address to obtain a valid one.", 
   "VCL-391", 
   "Added check to see if tsshutdn.exe exists on the computer where shutdown.exe is called.  shutdown.exe often fails on Windows 2003 when called remotely and tsshutdn.exe works.  tsshutdn.exe is called if it exists.  Otherwise, shutdown.exe is called.", 
   "Other", 
   "Improved output in Windows.pm::delete_file if an error occurs.", 
   "Changed return code of Windows.pm::delete_files_by_pattern from undefined to 1 if the base directory does not exist (meaning there's nothing to delete).  This was causing warnings to be displayed during capture when attempting to delete some files.", 
   "Added Windows.pm::create_text_file.  It isn't being called by anything yet."
  ], 
  "revision_id": "1005851"
 }
]