[
 {
  "author": "rcm", 
  "date": "2005-01-31T14:27:44.000000Z", 
  "msg": [
   "file EcsApplication.java was initially added on branch POJO_EXPLORATION."
  ], 
  "revision_id": "1006550"
 }, 
 {
  "author": "rcm", 
  "date": "2005-01-21T15:28:37.000000Z", 
  "msg": [
   "Fixed bug with dialog lookups where the field was no longer allowing the instances to be shown.", 
   "Changed the default invalid colour to a more suitable one for use as backgrounds behind text fields (when invalid entry is made).", 
   "Modified the the selection overlay view (as used for lookups) so that it has it bounds limited by the application window.  Also added a scroll border to it so that if the list is too big to fit on the screen then the list will be scrollable.", 
   "Fixed the repeated laying out of a view when it is too big to fit on the application window, which caused a performance problem.  Now the view is laid out once.", 
   "Removed the 'clear collection' option from list/tables."
  ], 
  "revision_id": "1006549"
 }, 
 {
  "author": "rcm", 
  "date": "2005-01-21T14:31:57.000000Z", 
  "msg": [
   "Modfied the error dialog so that the message is displayed within a scrollable window allowing all text to be more easily seen."
  ], 
  "revision_id": "1006548"
 }, 
 {
  "author": "rcm", 
  "date": "2005-01-17T15:56:41.000000Z", 
  "msg": [
   "Modified field builder (ObjectFieldBuilder) so that for elements in a collection the fields to be displayed are derived from the type of element the collection is designed to hold; and not the type of element that is actually.  A flag has been added to the builder to mark that this distinction should be made.  This defaults to false, but the table row specification creates its builder with this flag set."
  ], 
  "revision_id": "1006547"
 }, 
 {
  "author": "rcm", 
  "date": "2005-01-14T20:03:19.000000Z", 
  "msg": [
   "Added external graphic to field border and window border to flag when an object is transient.  This shows an image loaded from the images directory with the filename 'transient'.", 
   "Modified the empty field view to show an external graphic instead of drawing an oval.  This shows an image loaded from the images directory with the filename 'emptyField'."
  ], 
  "revision_id": "1006546"
 }
]