[
 {
  "author": "dkhaywood", 
  "date": "2009-01-03T12:44:06.560187Z", 
  "msg": [
   "altered the archetype's fixture pom.xml to depend only on the applib rather than the entire framework (now possible due to recent refactorings with LogonFixture, PerspectiveFixture etc).  NB: this is a dummy edit, the actual change was done in previous rev by accident"
  ], 
  "revision_id": "1019685"
 }, 
 {
  "author": "dkhaywood", 
  "date": "2009-01-03T12:31:44.884448Z", 
  "msg": [
   "added guard to NakedObjectActionParameterAbstract.java so can deal with DefaultFacets that don't in fact return any default"
  ], 
  "revision_id": "1019684"
 }, 
 {
  "author": "dkhaywood", 
  "date": "2009-01-03T12:11:54.213573Z", 
  "msg": [
   "NakedObjectActionParameterParseable was calling wrong method of InteractionResultSet; renamed a couple of methods in InteractionResultSet and InteractionResult to better express their intent"
  ], 
  "revision_id": "1019683"
 }, 
 {
  "author": "dkhaywood", 
  "date": "2009-01-03T09:10:45.959763Z", 
  "msg": [
   "reverted semantics of UpdateNotifier's getChangedObjects and getDisposedObjects so that a call to them also implicitly clears the underlying arrays.  Was getting flickering hourglass in dnd viewer on action dialog as result of not clearing.  All seems to work ok, all tests passing"
  ], 
  "revision_id": "1019682"
 }, 
 {
  "author": "dkhaywood", 
  "date": "2009-01-02T23:05:02.178349Z", 
  "msg": [
   "moved PerspectiveFixture and also Perspective into the applib - introduced PerspectivePersistenceService (cf SwitchUserService) as a way of decoupling from the runtime framework; simplified the interplay between FixtureInstaller and the FixtureBuilder helper, renaming the latter to FixtureInstallerDelegate; introduced explicit interfaces (InstallableFixture, CompositeFixture) which simplifies implementation of FixtureInstallerDelegate; introduced LogonFixture (was SessionFixture in the XAT testlib) as a means of specifying who to log in as in fixture - this is different that the SwitchUserService mechanism for chaning current user while installing fixtures; passing DeploymentType through to NakedObjectClient impls - can now install a LogonFixture for prototyping and/or exploration for both DnD and HTML viewers"
  ], 
  "revision_id": "1019681"
 }
]