[
 {
  "author": "ianh", 
  "date": "2003-12-15T23:04:40.000000Z", 
  "msg": [
   "mod_proxy with ProxyErrorOverride On in a reverse-proxy configuration attaches", 
   "a body to the 302 response and a wrong Content-Length header.", 
   "PR: 22951", 
   "Submitted by:\tErmanno Scaglione <scaglione ..at.. starnetone.de>", 
   "Reviewed by:\tBlaise Tarr <blaise.tarr .. at .. cnet.com>"
  ], 
  "revision_id": "102069"
 }, 
 {
  "author": "coar", 
  "date": "2003-12-15T19:59:23.000000Z", 
  "msg": [
   "Allow retention of header fields on non-200 responses"
  ], 
  "revision_id": "102068"
 }, 
 {
  "author": "martin", 
  "date": "2003-12-15T14:30:12.000000Z", 
  "msg": [
   "We need the error strings loaded as early as possible"
  ], 
  "revision_id": "102067"
 }, 
 {
  "author": "martin", 
  "date": "2003-12-15T14:24:31.000000Z", 
  "msg": [
   "Flame bait: mod_charset_lite would decide in the mime checker phase", 
   "whether a conversion was required, and would stick with that decision,", 
   "even if a later handler (like CGI script) would modify the actual", 
   "MIME type returned in the response. That was fatal when an EBCDIC", 
   "machine was going to return, say, an image/gif (because the initial", 
   "MIME type would be text/plain, and only later on be set to image/gif).", 
   "But even for \"ordinary\" ASCII-based machines the conversion fails", 
   "if a CGI script decides to return UTF-16 data.", 
   "At the moment the following change is #if #system(bs2000), but IMHO", 
   "it should be enabled globally: I moved the conversion decision into", 
   "the filter itself (because it is the handler which does the final", 
   "decision which MIME time is tagged on the response, and we can only", 
   "evaluate its decision after it started the output generation)."
  ], 
  "revision_id": "102066"
 }, 
 {
  "author": "martin", 
  "date": "2003-12-15T14:11:35.000000Z", 
  "msg": [
   "Mention in the comment that we expect a _space_separated_ list of module", 
   "names. Translate '-' to '_' so that the shell does not complain about", 
   "invalid variable names."
  ], 
  "revision_id": "102065"
 }
]