[
 {
  "author": "julianfoad", 
  "date": "2010-10-11T17:08:54.131414Z", 
  "msg": [
   "* subversion/libsvn_wc/adm_ops.c", 
   "(svn_wc_add4): Remove an unused variable."
  ], 
  "revision_id": "1021430"
 }, 
 {
  "author": "jleroux", 
  "date": "2010-10-11T17:07:56.352194Z", 
  "msg": [
   "A patch from Sascha Rodekamp \"Ecommerce Migration\" (https://issues.apache.org/jira/browse/OFBIZ-3978) - OFBIZ-3978", 
   "Fixes a problems when hovering on images on main page.", 
   "Removes some Prototype calls.", 
   "JLR: I also renamed the VisualThemeResource sequenceId and removed the old newcustomer screen in CustomerScreens.xml (I thought I had already committed it, but anyway)"
  ], 
  "revision_id": "1021429"
 }, 
 {
  "author": "rjung", 
  "date": "2010-10-11T17:03:22.774163Z", 
  "msg": [
   "Fix link path for bundled expat used by apr-util.", 
   "Linking was broken after moving libexpat from", 
   "xml/expat/lib to xml/expat, which is the default", 
   "location for the original expat library.", 
   "The breakage only occured when using bundled expat", 
   "without explicitely giving \"--with-expat=builtin\" on", 
   "BeOS, Darwin, AIX and CYGWIN. Those platforms", 
   "link explicitely against libexpat. The other *nix", 
   "platforms just leave the expat symbols unresolved", 
   "and the app using apr-util needs to load libexpat", 
   "during runtime linking."
  ], 
  "revision_id": "1021428"
 }, 
 {
  "author": "bimargulies", 
  "date": "2010-10-11T16:59:48.751063Z", 
  "msg": [
   "fix simple content restriction to store list of more descriptive type"
  ], 
  "revision_id": "1021427"
 }, 
 {
  "author": "mamta", 
  "date": "2010-10-11T16:51:15.015028Z", 
  "msg": [
   "DERBY-4835 Trigger plan does not recompile with upgrade from 10.5.3.0 to 10.6.1.0 causing java.lang.NoSuchMethodError", 
   "The problem was that the clearing of stored statements during the upgrade was conditional. The clearing should happen unconditionally during upgrade. Unconditional clearing of SPSes has fixed the problem with this jira.", 
   "Also, added a test in upgrade suite for triggers. The test has been added to BasicSetup.java which will ensure that this trigger test will automatically get run with even future releases."
  ], 
  "revision_id": "1021426"
 }
]