[
 {
  "author": "buscob", 
  "date": "2010-10-14T21:26:40.823804Z", 
  "msg": [
   "Commented lookup reference to \"LookupUserLoginAndPartyDetails\" in the EditPortalPage form.", 
   "This lookup was not present (in the same file) and caused an exception whenever the form was showed.", 
   "I did not change it to reference to the LookupUserLoginAndPartyDetails in the Party component because this would add a framework dependence from Party.", 
   "If we decide to put a part of the Party component in the framework the lookup can be used again."
  ], 
  "revision_id": "1022725"
 }, 
 {
  "author": "djencks", 
  "date": "2010-10-14T21:23:35.986591Z", 
  "msg": [
   "GERONIMO-5646 if jetty doesn't start a web app, don't start the gbean for it either"
  ], 
  "revision_id": "1022724"
 }, 
 {
  "author": "niallp", 
  "date": "2010-10-14T21:21:27.984897Z", 
  "msg": [
   "Move/reuse static empty arrays"
  ], 
  "revision_id": "1022723"
 }, 
 {
  "author": "rajith", 
  "date": "2010-10-14T21:21:02.663919Z", 
  "msg": [
   "QPID-2418", 
   "The tests \"testResubscribeWithChangedSelectorNoClose\" and \"testDurSubAddMessageSelectorNoClose\" are failing against the c++ broker due to wrong assumptions made in the test cases.", 
   "It creates subscriptions, then sends messages and tries to check the queue depth. However the c++ broker (not sure what the java broker behaviour is) will imediately send the messages to the java client. All though the messages are received in no-acquire mode the broker will not show them as available unless the client releases them.", 
   "I added a connection stop immediately before the messages were sent, preventing the broker from sending them to the consumer.", 
   "And then I added a connection start soon after the queue depth is querried."
  ], 
  "revision_id": "1022722"
 }, 
 {
  "author": "cutting", 
  "date": "2010-10-14T21:20:53.645629Z", 
  "msg": [
   "MAPREDUCE-2128.  Switch website to use Sematext's search.  Contributed by Alex Baranau."
  ], 
  "revision_id": "1022721"
 }
]