[
 {
  "author": "mturk", 
  "date": "2010-10-16T05:31:23.573204Z", 
  "msg": [
   "Move the sample script to it's proper location (well, samples are samples :)"
  ], 
  "revision_id": "1023185"
 }, 
 {
  "author": "sdeboy", 
  "date": "2010-10-16T05:29:57.279192Z", 
  "msg": [
   "Minor layout fixes", 
   "- Added space around search table so it is the same width as the primary table", 
   "- added 'MESSAGE' entry to receiver config default format drop down (a defaul that can be used no matter what the file format is)", 
   "- Updated the left and right thumbnail drawing logic so that it stays within the bounds of the table", 
   "- Fixed a bug where the color rules were being evaluated before the log4jid property was set (was preventing color rules that used prop.log4jid from taking effect)"
  ], 
  "revision_id": "1023184"
 }, 
 {
  "author": "stack", 
  "date": "2010-10-16T05:27:57.653597Z", 
  "msg": [
   "HBASE-2933 Skip EOF Errors during Log Recovery"
  ], 
  "revision_id": "1023183"
 }, 
 {
  "author": "mturk", 
  "date": "2010-10-16T05:26:53.338302Z", 
  "msg": [
   "Update -home/-java-home"
  ], 
  "revision_id": "1023182"
 }, 
 {
  "author": "stack", 
  "date": "2010-10-16T05:14:15.638311Z", 
  "msg": [
   "HBASE-3114 Test up on hudson are leaking zookeeper ensemble", 
   "Trying this patch to see if it cures hudson of leakage", 
   "M src/test/java/org/apache/hadoop/hbase/HBaseTestingUtility.java", 
   "Add a passedZkCluster flag.  If we didn't start the zk cluster,", 
   "don't shut it down on way out.", 
   "M src/test/java/org/apache/hadoop/hbase/TestHBaseTestingUtility.java", 
   "Add a test that starts up three clusters in a vm all sharing single", 
   "zk, each to its own chroot location.  Add to tables in each and", 
   "very the add by doing same as the old TestMultiClusters used)", 
   "M src/test/java/org/apache/hadoop/hbase/replication/TestReplication.java", 
   "Reenable shutdown of started clusters.  Hopefully this clears", 
   "the leaking of zk ensembles up on hudson.", 
   "M src/main/java/org/apache/hadoop/hbase/zookeeper/ZooKeeperWatcher.java", 
   "Testing, it looks like legitimately the callback for session connected", 
   "can be invoked before construction of zookeeperwatcher finishes.  In", 
   "particular the zookeeper data member can be null.  Hang around for a", 
   "second of so before throwing an exception (Make the exception", 
   "indicate the particular zkw by adding to the error message stack", 
   "trace made at zkw construction -- helps with debugging this stuff)"
  ], 
  "revision_id": "1023181"
 }
]