[
 {
  "author": "pamarcelot", 
  "date": "2010-10-18T10:04:26.566158Z", 
  "msg": [
   "Renamed accessor method to 'getConnectionWrapper()'."
  ], 
  "revision_id": "1023720"
 }, 
 {
  "author": "jleroux", 
  "date": "2010-10-18T10:02:23.015693Z", 
  "msg": [
   "A patch from Sascha Rodekamp \"sendMailFrom Screen don't need to load uiLabels\" (https://issues.apache.org/jira/browse/OFBIZ-3969) - OFBIZ-3969", 
   "Sascha: I noticed an issue in the sendOrderNotificationScreen method. There is no need of loading uiLabels in the method, because the labels will be loaded in the screen (which will be used for the email). The point is, when someone (for whatever reason) don't add English uiLabels and the service try to access the default English labels the an exception will be thrown . This can be simply avoided.", 
   "The patch was 1st applied at r1003836, but I finally reverted it at r100390 because I'd like to be sure there were no issues. According to Sascha, there should be any since all needed labels are loaded in screens before triggering the mail service."
  ], 
  "revision_id": "1023719"
 }, 
 {
  "author": "esjewett", 
  "date": "2010-10-18T10:01:11.134815Z", 
  "msg": [
   "[ESME-287] [ESME-289] Update conversation timeline to use same formatting as the main timeline (mostly just some CSS and HTML tweaking in this case) and to have new messages pushed via comet whenever new messages are available. Also some serious refactoring of templates to improve DRY-ness, and refactoring of the comet Timeline classes to accomodate this change as well as the upcoming change for tag timelines."
  ], 
  "revision_id": "1023718"
 }, 
 {
  "author": "danhaywood", 
  "date": "2010-10-18T10:00:52.324214Z", 
  "msg": [
   "updated the poms for archetypes, in line with MavenModules standard; also added some empty pages for src/site etc"
  ], 
  "revision_id": "1023717"
 }, 
 {
  "author": "sijskes", 
  "date": "2010-10-18T09:57:50.351118Z", 
  "msg": [
   "remove unused imports, in order to cure warnings"
  ], 
  "revision_id": "1023716"
 }
]