[
 {
  "author": "danhaywood", 
  "date": "2010-10-20T08:17:25.603380Z", 
  "msg": [
   "working on docbkx, pick up config from trunk; also moved some archived code in applib"
  ], 
  "revision_id": "1024545"
 }, 
 {
  "author": "lhazlewood", 
  "date": "2010-10-20T08:17:05.181853Z", 
  "msg": [
   "SHIRO-186 - ensured 'credentialsSalt' attribute has symmetric getter/setter methods per peer review."
  ], 
  "revision_id": "1024544"
 }, 
 {
  "author": "davsclaus", 
  "date": "2010-10-20T08:14:21.918205Z", 
  "msg": [
   "CAMEL-3255: reset lazy load flag."
  ], 
  "revision_id": "1024543"
 }, 
 {
  "author": "davsclaus", 
  "date": "2010-10-20T08:05:45.379729Z", 
  "msg": [
   "CAMEL-3255: Type converters can now be lazy loaded. Thanks to Mark Ford for patch which I can leverage pieces from."
  ], 
  "revision_id": "1024542"
 }, 
 {
  "author": "mgoulish", 
  "date": "2010-10-20T08:03:36.041004Z", 
  "msg": [
   "SASLizing Interbroker Links", 
   "-------------------------------------------------------------", 
   "1. Brokers already knew how to handle the server side of SASLized", 
   "links, but not the client side.  So we promoted the client-side", 
   "SASL code from the client library to the common library so that", 
   "the broker could also use it.  This affected SaslFactory.{h,cpp}", 
   "and Sasl.h", 
   "TODO -- can the server-side and client-side code be unified here?", 
   "2. Some of the SASL verbs in broker/ConnectionHandler.cpp are", 
   "expanded: start, secure, tune.", 
   "3. broker/SecureConnection is altered to get the client-broker and", 
   "the server-broker to agree on when the security layer should be", 
   "inserted.", 
   "4. the python tool qpid-route is modified so that, in the \"route add\"", 
   "command, you can specify the security mechanism for SASL to use.", 
   "TODO -- should we also pass in {min,max}SSF ?", 
   "5. Changes in broker/LinkRegistry to allow the information input by", 
   "qpid-route to be passed up to where it is needed.", 
   "6. A bash script test run by \"make check\" that creates a SASLized", 
   "federation link and sends some messages down it.", 
   "TODO - write a python unit test instead of a bash script.  I", 
   "think I uncovered a bug in the python code when I tried.", 
   "7. NOTE - testing for this feature does not work with versions of", 
   "SASL earlier than 2.1.22, becuase I can't tell SASL to use a", 
   "SASL database file in a nonstandard location.  The test is", 
   "disabled for earlier versions."
  ], 
  "revision_id": "1024541"
 }
]