[
 {
  "author": "sdeboy", 
  "date": "2010-10-22T07:36:35.438213Z", 
  "msg": [
   "Minor button layout updates, changes to support third party look & feels (copy jars to $USERHOME/.chainsaw/plugins and update   <lookAndFeelClassName>fully-qualified-class-name</lookAndFeelClassName> in $USERHOME/.chainsaw/chainsaw.settings.xml", 
   "Also updated the TableCellRenderer to use a basic JLabel renderer if highlighted search, wrap and time delta rendering aren't enabled (still supports border display & color rules)"
  ], 
  "revision_id": "1026230"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2010-10-22T07:27:24.430353Z", 
  "msg": [
   "Used StudioTrustManager to allow connection on LDAPS servers."
  ], 
  "revision_id": "1026229"
 }, 
 {
  "author": "jeremias", 
  "date": "2010-10-22T07:21:34.721559Z", 
  "msg": [
   "PDFBOX-865:", 
   "Added initial support for optional content groups (OCGs aka layers).", 
   "Details:", 
   "- Adds PD-layer classes to deal with optional content groups", 
   "- Made COSArray an Iterable", 
   "- COSDocument: Allow to remove an object from the document objects", 
   "- PDPageContentStream: added some functionality from marked content (incomplete)", 
   "- PDPageContentStream Bugfix: Form XObjects were always \"forgotten\" when a second PDPageContentStream was constructed for the same page.", 
   "- PDXObjectForm: allow to set the Matrix.", 
   "- PDDocumentCatalog: allow to set the PDF version and OCProperties", 
   "- PDResources: allow to set Properties (PDPropertyList, used for marked content lookups)", 
   "- COSObjectKey learns Comparable", 
   "- Moved object cloning functionality from PDFMergerUtility to separate class PDFCloneUtility, because it's reused by LayerUtility introduced below.", 
   "- LayerUtil allows to import pages a Form XObjects and create layers with them. These layers can later be switched on and off through the OCG PD-layer classes. The code for is largely adapted from my PDF-plug-in for Apache FOP."
  ], 
  "revision_id": "1026228"
 }, 
 {
  "author": "mgoulish", 
  "date": "2010-10-22T07:13:34.956692Z", 
  "msg": [
   "Make the \"SASL enabled\" log message also print out the SASL version number.   This will be useful in one test that depends on some SASL functionality that was not available before 2.1.22 ."
  ], 
  "revision_id": "1026227"
 }, 
 {
  "author": "jrthomerson", 
  "date": "2010-10-22T07:00:21.557311Z", 
  "msg": [
   "found another piece of lying javadoc"
  ], 
  "revision_id": "1026226"
 }
]