[
 {
  "author": "trawick", 
  "date": "2004-03-19T11:16:03.000000Z", 
  "msg": [
   "*) SECURITY: CAN-2004-0174 (cve.mitre.org)", 
   "Fix starvation issue on listening sockets where a short-lived", 
   "connection on a rarely-accessed listening socket will cause a", 
   "child to hold the accept mutex and block out new connections until", 
   "another connection arrives on that rarely-accessed listening socket.", 
   "With Apache 2.x there is no performance concern about enabling the", 
   "logic for platforms which don't need it, so it is enabled everywhere", 
   "except for Win32.  [Jeff Trawick]", 
   "(already in 2.0.49, propagating to mirrors now)"
  ], 
  "revision_id": "103029"
 }, 
 {
  "author": "wrowe", 
  "date": "2004-03-19T10:33:13.000000Z", 
  "msg": [
   "2.0.49 requires new license & usual updates"
  ], 
  "revision_id": "103028"
 }, 
 {
  "author": "trawick", 
  "date": "2004-03-19T02:32:25.000000Z", 
  "msg": [
   "mod_dav: Fix a problem that could cause crashes when manipulating", 
   "locks on some platforms.", 
   "crashes seen on Sparc when the integer copied out of the database", 
   "was not aligned properly", 
   "also, sizeof(int) not necessarily sizeof(apr_size_t), so that could", 
   "be a concern; we copy in sizeof(apr_size_t field) so we should copy", 
   "out sizeof(apr_size_t field)"
  ], 
  "revision_id": "103027"
 }, 
 {
  "author": "martin", 
  "date": "2004-03-18T21:40:12.000000Z", 
  "msg": [
   "Caching content from sources where Content-Length is not specified", 
   "(these were passed through uncached until now):", 
   "This needed additional checks for CacheMinFileSize and CacheMaxFileSize", 
   "after the response has completed. That means that we are checking at two", 
   "places now:", 
   "-> when the C-L is known, we check before we cache", 
   "-> when it is unknown we check \"on-the-way\" for CacheMaxFileSize, and", 
   "after caching completion for CacheMinFileSize", 
   "We now compare the actual size of the cached copy against the C-L", 
   "header, and discard it if the two don't match."
  ], 
  "revision_id": "103026"
 }, 
 {
  "author": "rbowen", 
  "date": "2004-03-18T19:30:12.000000Z", 
  "msg": [
   "Eric tells me I need to make the change on this side too."
  ], 
  "revision_id": "103025"
 }
]