[
 {
  "author": "jm", 
  "date": "2010-11-14T00:00:23.319365Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "1034915"
 }, 
 {
  "author": "rgoers", 
  "date": "2010-11-13T23:43:31.375209Z", 
  "msg": [
   "Change vfs artifactId to vfs2"
  ], 
  "revision_id": "1034914"
 }, 
 {
  "author": "rgoers", 
  "date": "2010-11-13T23:43:21.961789Z", 
  "msg": [
   "Change vfs artifactId to vfs2"
  ], 
  "revision_id": "1034913"
 }, 
 {
  "author": "rgoers", 
  "date": "2010-11-13T23:43:00.997279Z", 
  "msg": [
   "Change artifactid to vfs2"
  ], 
  "revision_id": "1034912"
 }, 
 {
  "author": "kkolinko", 
  "date": "2010-11-13T23:39:57.296062Z", 
  "msg": [
   "Reimplemented the Windows installer GUI using nsDialogs and MUI2 libraries,", 
   "instead of deprecated InstallOptions.", 
   "The *.ini files are no more used. All is specified in the nsi script.", 
   "Migration was straightforward, except for a DirRequest field", 
   "(the field on the JVM selection page that displays path to JRE):", 
   "I had to create the Browse button explicitly and implement an OnClick handler. It is not spelled in the docs, but is discussed a lot on forums.", 
   "Other improvements:", 
   "- Added a textfield to display/edit the roles for the user that we add to tomcat-user.xml", 
   "- The roles are calculated depending on what webapps are installed (manager, host-manager, or both).", 
   "- I do not display \"username\", \"password\", \"roles\" fields when neither manager nor host-manager are selected. In the previous version we showed them as disabled. Now I do not show them on screen.", 
   "- Implemented creating Windows Shortcuts for the Manager, Host Manager apps and Documentation. There was implementation for that already (Manager and Docs shortcut only), but it was not working: it used IfFileExist check that always evaluated to false, because shortcuts were created before those files were installed.", 
   "- Added support for the '/?' command line option. It displays a message box with some short text about the /S and /D options. See .onInit function in tomcat.nsi for details.", 
   "- Using LogicLib.nsh for logic. I hope that the script became more easily readable."
  ], 
  "revision_id": "1034911"
 }
]