[
 {
  "author": "jleroux", 
  "date": "2010-11-17T20:13:57.652930Z", 
  "msg": [
   "2 slightly modified patches from Sascha Rodekamp \"Content Navigation Tree implemented with jQuery\" (https://issues.apache.org/jira/browse/OFBIZ-3815) - OFBIZ-3815", 
   "+ the elrteEditor jQuery plugin", 
   "Sascha:", 
   "Migrates the last WebCms Content Screens.", 
   "Adds the jsTree for the CMS Web Site Page and replace the old dojo WYSIWYG Editor by editor from elrte http://elrte.org/.", 
   "There is still one issue regarding the new editor. When you write a text and store it with the Editor everything is fine, the HTML code is stored in the electronicText Table.", 
   "But when you reload the site and the editor get the stored data from the DB it has HTML tags in it. Freemarker encode the Tags in HTML Save Characters (works as designed). So we need a method which decodes the HTML Save output into normal HTML output to let the editor handle the data the right way. So we need something like 'encodeXmlValue' (the other way round).", 
   "JLR remarks:", 
   "* I have used jQuery 1.4.2 as I just reverted to this version", 
   "* I have replaced PageTitleNavigate by PageTitleNavigateDataResources", 
   "* We will need to localize labels and alert messages", 
   "I noticed", 
   "+    function destroyEditor() {", 
   "+        // TODO", 
   "+    }", 
   "not sure it needs something or not", 
   "* I have used 'maxi' as elrte Editor option to have table buttons by default", 
   "* To decodes HTML as input to elrte Editor, I have tried to use simple Freemarker replaces. I was surprised to see that some were not decoded. I then tried to use a regexp but without more success... to be continued..."
  ], 
  "revision_id": "1036195"
 }, 
 {
  "author": "bergmark", 
  "date": "2010-11-17T20:13:23.180955Z", 
  "msg": [
   "[OWB-472] Add optional support for archive centric beans.xml", 
   "Submitted by: Jacquelle Leggett"
  ], 
  "revision_id": "1036194"
 }, 
 {
  "author": "jonathan", 
  "date": "2010-11-17T20:13:15.824842Z", 
  "msg": [
   "Fixed README.txt to give correct instructions."
  ], 
  "revision_id": "1036193"
 }, 
 {
  "author": "jbellis", 
  "date": "2010-11-17T20:10:38.972473Z", 
  "msg": [
   "index scan treats missing columns as not matching secondary expressions", 
   "patch by jbellis; reviewed by Stu Hood for CASSANDRA-1745"
  ], 
  "revision_id": "1036192"
 }, 
 {
  "author": "bommel", 
  "date": "2010-11-17T20:05:27.573740Z", 
  "msg": [
   "markup fixes"
  ], 
  "revision_id": "1036191"
 }
]