[
 {
  "author": "danhaywood", 
  "date": "2010-11-17T18:33:01.765464Z", 
  "msg": [
   "commented out fitnesse module from viewer/bdd - it's not part of Isis and will be moved to isis-contrib."
  ], 
  "revision_id": "1036155"
 }, 
 {
  "author": "jleroux", 
  "date": "2010-11-17T18:21:16.025752Z", 
  "msg": [
   "Today in a custom app we experienced a weird issue. We use Ajax (actually \"jQuery load\") to dynamically load FTL forms which contains lookups. For this to work, we made a small change in the fieldlookup.js script by adding \"jQuery live\" on the lookup button related click(allow future associations)", 
   "It happened that today the lookups build from the load request (Ajax) did not work anymore, nor the other lookups. It was working a week ago and we discovered that was due to the update of jQuery (to 1.4.4 this week and 1.4.3 last week). So I have reverted the calls to the jQuery lib to 1.4.2. I will report the problem to the jQuery team (nothing like that seems to be known for now on the Internet).", 
   "This commit introduces", 
   "* the \"jQuery live\" change in fieldlookup.js script", 
   "* revert calls to the jQuery lib from 1.4.4 version to 1.4.2", 
   "* in order to help investigations put back jQuery libs 1.4.2 and 1.4.3", 
   "Something to note though: the problem was detected on Windows with Firefox and Chrome (on both XP and Win7) but it was working fine on Mac with 1.4.4. I checked and it works also well on Windows (XP) when using Safari with jQuery 1.4.4!"
  ], 
  "revision_id": "1036154"
 }, 
 {
  "author": "mturk", 
  "date": "2010-11-17T18:20:20.188127Z", 
  "msg": [
   "Although jk_shutdown_socket preserves the errno across the call, use the error returned from the jk_tcp_socket_recvfull. This will make sure the rare ocasion with errno == 0 doesn't get unnoticed"
  ], 
  "revision_id": "1036153"
 }, 
 {
  "author": "knoaman", 
  "date": "2010-11-17T18:15:40.871402Z", 
  "msg": [
   "Fix couple of bugs in xs:override implementation"
  ], 
  "revision_id": "1036152"
 }, 
 {
  "author": "gawor", 
  "date": "2010-11-17T18:09:40.356804Z", 
  "msg": [
   "ensure we are adding a non-empty package list"
  ], 
  "revision_id": "1036151"
 }
]