[
 {
  "author": "jbeard", 
  "date": "2010-11-21T15:54:44.189289Z", 
  "msg": [
   "Manually removing src/python/scxml/cgf/backends/js, which will hopefully fix conflict preventing proper dcommit with git-svn."
  ], 
  "revision_id": "1037485"
 }, 
 {
  "author": "jbeard", 
  "date": "2010-11-21T15:45:23.227988Z", 
  "msg": [
   "Intermediate commit. Correct mdoule paths are now passed to generated requirejs modules."
  ], 
  "revision_id": "1037484"
 }, 
 {
  "author": "trawick", 
  "date": "2010-11-21T15:45:03.744545Z", 
  "msg": [
   "account for first process in class in the spawn score, possibly", 
   "slowing down process creation, depending on the configuration", 
   "previously, the score was not incremented by FcgidSpawnScore when", 
   "creating the first process", 
   "refactor the code so that the same logic is used to adjust the", 
   "score and process count whether this is the first process in the", 
   "class or the Nth"
  ], 
  "revision_id": "1037483"
 }, 
 {
  "author": "jbeard", 
  "date": "2010-11-21T15:44:25.487400Z", 
  "msg": [
   "Intermediate commit. Primarily added new tasks to build."
  ], 
  "revision_id": "1037482"
 }, 
 {
  "author": "jbeard", 
  "date": "2010-11-21T15:42:22.643204Z", 
  "msg": [
   "Intermediate (broken) commit. Includes the following changes:", 
   "* initial stylesheet that gets passed into topo-sort.xsl is treated specially as source in the stylesheet, and not included in dependency list", 
   "* add stylehseets to build modules for each language frontend (javascript, python, bash) from xslt list.", 
   "* dependency paths in stylesheets are rooted in src/xslt", 
   "* stylesheets get generally built, reference transparently in target/ dir (src/xslt/* mapped to target/xslt/*)", 
   "Next steps:", 
   "* Add generating module code to build process.", 
   "* Refactor existing frontend to use these generated modules.", 
   "* Add to build process automated testing of each language frontend to ensure consistency."
  ], 
  "revision_id": "1037481"
 }
]