[
 {
  "author": "bentmann", 
  "date": "2010-12-04T15:11:01.909301Z", 
  "msg": [
   "[MNG-4926] ExecutionEvent give on the exception encountered (when having projectFailed , forkedProjectFailed)", 
   "o Also revised changes for MNG-4922 to follow the same pattern"
  ], 
  "revision_id": "1042200"
 }, 
 {
  "author": "davidb", 
  "date": "2010-12-04T15:09:52.971409Z", 
  "msg": [
   "Work in progress. Generating an additional method in the calling class that can pass appropriate information to the classloader lookup component."
  ], 
  "revision_id": "1042199"
 }, 
 {
  "author": "covener", 
  "date": "2010-12-04T15:06:29.599892Z", 
  "msg": [
   "Per the existing comment and setrlimit() behavior --  only prevent attempts to", 
   "raise the hard limit, not to lower it, by nonroot users."
  ], 
  "revision_id": "1042198"
 }, 
 {
  "author": "norman", 
  "date": "2010-12-04T15:03:27.538459Z", 
  "msg": [
   "upgrade to jackrabbit 2.2-SNAPSHOT and remove the NodeLocker usage in JCRMessageMapper. I also removed the nested folder structure to store mails (break done per day). This allows us to store 8x faster then before"
  ], 
  "revision_id": "1042197"
 }, 
 {
  "author": "buscob", 
  "date": "2010-12-04T14:58:18.027724Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/OFBIZ-4037", 
   "Moved the feature that allows a new user to register for an account from MyPortal to the framework so that it is available in any application.", 
   "It has also been slightly reworked (code cleaning and internationalization).", 
   "Two flags in general.properties allows to configure if the register function must be enabled or not and if the captcha function should be used.", 
   "The captcha function needs to be improved because at the moment the code is contained in an hidden field so that it is very easy for a computer to bypass it.", 
   "A possible fix for this could be to put the MD5 coding of the captcha code in the hidden field.", 
   "Then the event that checks the code should compare the MD5 codes."
  ], 
  "revision_id": "1042196"
 }
]