[
 {
  "author": "rwesten", 
  "date": "2010-12-05T18:00:18.783196Z", 
  "msg": [
   "RICK ServicesAPI", 
   "- added a utility method to the NamespaceEnum that converts short URIs (prefix:localName) to the fullURI (namespace+localName)", 
   "- FieldMapper now returns the target representation to allow chaining calls.", 
   "- Added support for Sign-Ranking: This is the ranking of an Entity within an referenced site (e.g. based on the incoming links to that Entity)", 
   "- ReferencedSites now have a method to get the preferred query factory", 
   "RICK Core", 
   "- implementation of the API changes", 
   "- corrected a bug in ReferencedSiteImpl where the EntitySearcher was called after a successful Query on the local Cache (CacheStrategy.all)", 
   "- merged http://code.google.com/p/iks-project/source/detail?r=1121)", 
   "SolrYard", 
   "- added support for parsing the score for query results (result scores are parsed by using the field \"http://www.iks-project.eu/ontology/rick/query/score\"", 
   "- added support for document boost and field boosts. Currently the field used to read the Document boost is configurable by the SolrYardConfig. Future versions might hard wire this feature to \"http://www.iks-project.eu/ontology/rick/model/signRank\" (the according field defined in the RICK schema). Field Boost values can be defined by parsing a map with the field as key and the float boost as value.", 
   "Generic RDF Indexer:", 
   "First version of a generic RDF Indexer. The configuration is currently done by a Dictionary. Supported keys are defines as static fields.", 
   "Future versions will add specific configuration classes for typical use cases. The dbPedia indexer provide a good usage example", 
   "Features:", 
   "- reads multiple RDF files from a directory", 
   "- supports compressed RDF files", 
   "- supports several RDF formats", 
   "- uses a Jena TDB (file based triple store)", 
   "- supports skipping of RDF data (e.g. to use an existing Triple store)", 
   "Performance depends extremely on the hard disc.", 
   "dbPedia Indexer:", 
   "This indexer allows to create a FULL Index of dbPedia within a SolrYard.", 
   "It has support for EntityRanks based on incoming links within DB-Pedia. A precalculated file is available at http://public.dev.nuxeo.com/~ogrisel/incoming-counts.tsv.gz", 
   "geonames Indexer", 
   "- changed artifactID form eu.iksproject.indexing.geonames to eu.iksproject.rick.indexing.geonames"
  ], 
  "revision_id": "1042390"
 }, 
 {
  "author": "lgentis", 
  "date": "2010-12-05T17:50:36.439804Z", 
  "msg": [
   "Mise à jour."
  ], 
  "revision_id": "1042389"
 }, 
 {
  "author": "tabish", 
  "date": "2010-12-05T17:09:31.064190Z", 
  "msg": [
   "test case for: https://issues.apache.org/jira/browse/AMQCPP-330"
  ], 
  "revision_id": "1042388"
 }, 
 {
  "author": "cmoulliard", 
  "date": "2010-12-05T17:06:52.996160Z", 
  "msg": [
   "karaf-310: Add LDAP login module - code comes from ActiveMq"
  ], 
  "revision_id": "1042387"
 }, 
 {
  "author": "tabish", 
  "date": "2010-12-05T17:02:19.852969Z", 
  "msg": [
   "fix for: https://issues.apache.org/jira/browse/AMQCPP-330"
  ], 
  "revision_id": "1042386"
 }
]