[
 {
  "author": "hwright", 
  "date": "2010-12-03T22:08:08.106080Z", 
  "msg": [
   "* publish/roadmap.html:", 
   "Put more realistic dates on a few releases."
  ], 
  "revision_id": "1042025"
 }, 
 {
  "author": "jleroux", 
  "date": "2010-12-03T22:05:19.324120Z", 
  "msg": [
   "A patch from Anne Jessel \"Improve handling and display of additional product images\" (https://issues.apache.org/jira/browse/OFBIZ-4024) - OFBIZ-4024", 
   "This patch adds several closely-related features, intended to improve the display of products and their images in the ecommerce webapp.", 
   "When additional images for a product are uploaded via the Catalog, the scaled versions that were already being created in service addAdditionalViewForProduct are now recorded as ProductContent. This makes them easily available for use elsewhere.", 
   "New ProductContentType values were added to identify these content types. The obviously consistent string to use for these was too long, and so I had to choose something less consistent, but shorter and hopefully still clear. I used XTRA instead of ADDITIONAL.", 
   "The sizes to which additional images are rescaled has been changed, so they better fit in the ecommerce display. Relevant sizes in productdetail.ftl have been updated to match these sizes.", 
   "The ecommerce product display now uses the scaled additional images if available, rather than relying on the web browser to scale the images.", 
   "When displaying a single product in ecommerce, the main image is larger than the additional images. Hovering over an additional image displays a larger version in place of the main image.", 
   "Clicking on an additional image displays a popup with a detailed version of the image.", 
   "To use the new features, one or more large images (suggest at least 600x600) should be attached as additional images to a product, using the form on the bottom of the content tab for a product in Catalog. Viewing the product in ecommerce should then exhibit the above behaviour.", 
   "I have tried to maintain backwards compatibility, so that products with the old-style use of additional images will continue to display as they did previously. This means some of the code is not as streamlined as it might be.", 
   "JLR: You might prefer to keep the old ImageProperties.xml values..."
  ], 
  "revision_id": "1042024"
 }, 
 {
  "author": "mxmanghi", 
  "date": "2010-12-03T22:01:03.345938Z", 
  "msg": [
   "2010-12-03 Massimo Manghi <mxmanghi@apache.org>", 
   "* configure.ac: new macros to set default values of configuration parameters.", 
   "* src/apache-2/mod_rivet.c,mod_rivet.h: Default values are set in rivet_config.h through autotools. The Tcl", 
   "Rivet environment is now loaded from mod_rivet by calling Tcl_PackageRequire(\"RivetTcl\",\"1.1\"); after auto_path", 
   "is properly set. Configuration scripts are now stored in Tcl_Obj objects", 
   "* doc/xml/install.xml: Add documentation for new 'configure' switch.", 
   "* rivet/init.tcl: the path to RIVETLIB_DESTDIR is added to auto_path in mod_rivet."
  ], 
  "revision_id": "1042023"
 }, 
 {
  "author": "slaurent", 
  "date": "2010-12-03T22:00:58.705353Z", 
  "msg": [
   "bug 48973 (enhancement): Don't create SESSIONS.ser when no session exists", 
   "https://issues.apache.org/bugzilla/show_bug.cgi?id=48973"
  ], 
  "revision_id": "1042022"
 }, 
 {
  "author": "markt", 
  "date": "2010-12-03T21:49:54.644712Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=50408", 
   "Fix <code>NoSuchMethodException</code> when using scoped variables with EL method invocation."
  ], 
  "revision_id": "1042021"
 }
]