[
 {
  "author": "veithen", 
  "date": "2010-12-29T22:28:59.297462Z", 
  "msg": [
   "AXIOM-12: Improved the Javadoc of OMOutputFormat to explain in which way SwA and MTOM are mutually exclusive."
  ], 
  "revision_id": "1053760"
 }, 
 {
  "author": "mfreedman", 
  "date": "2010-12-29T22:28:47.843665Z", 
  "msg": [
   "First checkin that Fixes 2.0 TCK to run in 3.0 (JSF 2.0) bridge environment."
  ], 
  "revision_id": "1053759"
 }, 
 {
  "author": "mfreedman", 
  "date": "2010-12-29T22:27:33.543131Z", 
  "msg": [
   "Mike's update: merged from final 2.0.0 RI and then fixed code problems encountered when running TCK and examples.  Note: also added the examples to the project."
  ], 
  "revision_id": "1053758"
 }, 
 {
  "author": "sabob", 
  "date": "2010-12-29T22:03:41.817249Z", 
  "msg": [
   "roadmap. CLK-745"
  ], 
  "revision_id": "1053757"
 }, 
 {
  "author": "snoopdave", 
  "date": "2010-12-29T21:59:02.363177Z", 
  "msg": [
   "Fix for https://issues.apache.org/jira/browse/ROL-1899", 
   "\"Media Files system does not work well for Java applets\"", 
   "Roller's media file system was designed for images, videos and not for arbitrary uploads. File URLs are opaque, do not include directory path information or file extensions. There is a directory hierarchy that you can use to organize your files, but moving files around will not break links. That is all \"by design\".", 
   "If you really need to have file paths and extensions, you can enable a setting that allows you to edit the \"originalPath\" of a file. It's called original path because it is intended to support old Roller 4 style file URLs for a blog's old migrated uploads. It was not intended for general purpose use and therefore it is not editable by default.", 
   "This fix adds a configuration option that allows you to enable editing of the \"original path\" setting of a media file. This allows you to set an alternative full path, e.g. 'photos/picture1.jpg' for media files. All file URLs will use the old file upload base path of /resources/"
  ], 
  "revision_id": "1053756"
 }
]