[
 {
  "author": "nd", 
  "date": "2011-01-02T20:01:18.964254Z", 
  "msg": [
   "update translation", 
   "Reviewed by: Kess <kess apache.org>"
  ], 
  "revision_id": "1054465"
 }, 
 {
  "author": "sarowe", 
  "date": "2011-01-02T19:45:59.012676Z", 
  "msg": [
   "LUCENE-2611: When the CWD is solr/build/tests/, the hack in SolrTestCaseJ4.determineSourceHome() fails while running the Solr module tests because of classpath ordering: the CWD is checked first to locate the solr/conf/ dir; this succeeds, but the relative path used for the CWD excludes its ancestry, so the source home can't be navigated to without converting to absolute, which determinSourceHome() does not do.", 
   "This change works around the issue by making the CWD for the Solr module tests be solr/build/tests/solr/, which does not contain solr/conf/, so the remainder of the classpath is searched, and the absolute classpath element .../solr/build/tests/ allows the source home to be located."
  ], 
  "revision_id": "1054464"
 }, 
 {
  "author": "veithen", 
  "date": "2011-01-02T19:43:51.082332Z", 
  "msg": [
   "Avoid invalid use of iterator: removing items while iterating over a collection should be done with Iterator#remove()."
  ], 
  "revision_id": "1054463"
 }, 
 {
  "author": "jcorvel", 
  "date": "2011-01-02T19:20:48.396111Z", 
  "msg": [
   "On the diff-optimizations-bytes branch:", 
   "Bring up to date with trunk again, to get the build.conf fix of r1054421."
  ], 
  "revision_id": "1054462"
 }, 
 {
  "author": "dennisl", 
  "date": "2011-01-02T18:59:05.919097Z", 
  "msg": [
   "[MCHANGES-203] Use the POMs issueManagement.system when selecting the system to use", 
   "The way this is implemented may unfortunately mean that some users will need to reconfigure the plugin if they upgrade. This is because we still have to carry along some backward compatibility luggage. I have added instructions for this on the usage page. If you look at the changes made to the ITs in this commit, you'll see what kind of changes I'm talking about."
  ], 
  "revision_id": "1054461"
 }
]