[
 {
  "author": "pamarcelot", 
  "date": "2011-01-05T17:59:51.837937Z", 
  "msg": [
   "Part of a fix for DIRSTUDIO-718 (Update Eclipse dependencies to version 3.6.1).", 
   "Fixed Mac OS X x86 launcher."
  ], 
  "revision_id": "1055560"
 }, 
 {
  "author": "arkurth", 
  "date": "2011-01-05T17:58:43.039839Z", 
  "msg": [
   "VCL-424", 
   "Updated vSphere.pm:", 
   "Moved check to determine if the virtualDiskManager object is available in is_restricted to earlier in the subroutine to save a little time.", 
   "Added check in initialize to parse the output of the connection attempt to determine if the attempt failed due to an incorrect username or password.  A warning is displayed if this is the case, a normal debug message otherwise.  Some connection attempts are normal if the vSphere SDK isn't available and SSH is used instead."
  ], 
  "revision_id": "1055559"
 }, 
 {
  "author": "arkurth", 
  "date": "2011-01-05T17:53:05.523975Z", 
  "msg": [
   "VCL-424", 
   "Updated VIM_SSH.pm:", 
   "Added multiple attempts to _run_vim_cmd because calls to vim-cmd will occasionally fail due to heavy load on the VM host.  Subsequent attempts usually succeed.", 
   "Added check in get_registered_vms and _get_vm_id to determine if return value from _get_vm_list is defined.  If undefined an error occurred.", 
   "Changed get_task_ids to return an array rather than a single value.  Also changed get_task_info to return a hash keyed by task ID rather than an array.  This makes it easier for calling subs to use the task info.", 
   "Updated get_virtual_disk_type to call 'vim-cmd search' if the host is ESX, and 'vim-cmd disksearch' if Server 2.0.  Unforturnaly VMware's vim-cmd produces different results based on the version of the host.  The value of the 'thin' parameter isn't returned under ESX if disksearch is used.", 
   "Other", 
   "Added counter for performance tuning purposes to keep track of the number of times vim-cmd was called throughout the process."
  ], 
  "revision_id": "1055558"
 }, 
 {
  "author": "mikemccand", 
  "date": "2011-01-05T17:50:15.905010Z", 
  "msg": [
   "cleanup: don't track flushedFiles when we can just compute that from the SegmentInfo"
  ], 
  "revision_id": "1055557"
 }, 
 {
  "author": "dkulp", 
  "date": "2011-01-05T17:50:00.269635Z", 
  "msg": [
   "Merged revisions 1055554 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r1055554 | dkulp | 2011-01-05 12:47:53 -0500 (Wed, 05 Jan 2011) | 2 lines", 
   "[CXF-3037] Pass the builder and registry around throughout the policies", 
   "so that the normalize calls can all have the registry passed in.", 
   "........"
  ], 
  "revision_id": "1055556"
 }
]