[
 {
  "author": "markt", 
  "date": "2011-01-11T15:11:25.028094Z", 
  "msg": [
   "Add missing license header"
  ], 
  "revision_id": "1057685"
 }, 
 {
  "author": "mgrigorov", 
  "date": "2011-01-11T15:09:07.694255Z", 
  "msg": [
   "WICKET-3321 Ajax submit link does not show busy indicator under IE", 
   "Bind the precondition function for the indicator showing. This way the submitting element can be checked whether it is part of the current DOM document after Ajax refresh."
  ], 
  "revision_id": "1057684"
 }, 
 {
  "author": "brucem", 
  "date": "2011-01-11T15:07:07.710435Z", 
  "msg": [
   "AVRO-549. Custom allocator interface.", 
   "You can now provide a custom allocation function, which the Avro library", 
   "will use for all of the memory that it obtains.  The allocator function", 
   "prototype is the same one used by the Lua interpreter; it's a generic", 
   "function that includes the functionality of malloc, realloc, and free.", 
   "It takes in the old pointer (ptr), the old size (osize), and the new", 
   "size (nsize) of the buffer.  For realloc, all three have real values.", 
   "For malloc, ptr will be NULL, and osize 0.  For free, nsize will be 0.", 
   "One wrinkle is that we have to be able to provide the allocated size of", 
   "the buffer when we free it, since we have to provide a value for osize.", 
   "For most of our allocations, this isn't a problem, since we allocated a", 
   "fixed-size buffer for a struct of some kind.  It's also not a problem", 
   "for the buffers associated with a bytes or fixed field, since we have", 
   "the buffer size right there.  For strings, however, we have to be more", 
   "clever; for most cases, our strdup replacement adds additional space to", 
   "the buffer to store its size.  This prevents us from having to add lots", 
   "of additional size_t fields all over the place.  We can't do this in the", 
   "string datum, however, since the givestring methods need to be able to", 
   "take in an arbitrary string pointer; this means we can't assume it has", 
   "our special size prefix."
  ], 
  "revision_id": "1057683"
 }, 
 {
  "author": "gbrown", 
  "date": "2011-01-11T15:04:36.932024Z", 
  "msg": [
   "Add starter build.xml and build.properties; trim whitespace."
  ], 
  "revision_id": "1057682"
 }, 
 {
  "author": "markt", 
  "date": "2011-01-11T15:00:05.932562Z", 
  "msg": [
   "Get checkstyle to check Java files for AL2 headers"
  ], 
  "revision_id": "1057681"
 }
]