[
 {
  "author": "eric", 
  "date": "2011-01-14T11:40:13.963595Z", 
  "msg": [
   "mv back torque tests to integration cause many depend on imap"
  ], 
  "revision_id": "1058960"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-01-14T11:39:26.026289Z", 
  "msg": [
   "Short Summary:", 
   "- Added Unit Tests for RICK Model implementations", 
   "- Applied this tests to the two current implementations", 
   "- Resolved several Bugs, improved code and documentation", 
   "- Some added functionalities for indexing utilities", 
   "Detailed Changes", 
   "Services API", 
   "- corrected xml,xmi and xsd namespace within the NamespaceEnum (used '/' instead of '#')", 
   "- Improved Java Doc especially regarding what Exception MUST BE thrown in specific cases (e.g. when NULL is parsed for an parameter)", 
   "- added missing RuntimeExceptions to the throws declaration of methods", 
   "- generally NullPointerExceptions are now thrown instead of IllegalArgumentExeptions if null is parsed as a parameter that does not support it. IllegalArgumentExceptions are now only used if the parsed parameter is not valid.", 
   "- UnsupportedTypeException now extends IllegalArgumentException", 
   "Test Framework (eu.iksproject.rick.test)", 
   "This component is intended to define Unit Tests that can be used (and extended) by implementations of the Interfaces defined in the Services API.", 
   "- added Unit Tests for Representation, ValueFactory, Text and Reference", 
   "Core (eu.iksproject.rick.core)", 
   "- added Unit Tests for Representation, ValueFactory, Text and Reference", 
   "- adapted Exception handling to confirm with the changes described for the Services API", 
   "- Changed all the different Iterator implementations within the utils package to use the generic AdaptingInterator implementation.", 
   "- Introduced a FilteringIterator that can be used in case one needs only to filter values of an Iteration but does not need to adapt/convert values", 
   "- Fixed a Bug with the remove() method of all the previous Iterator implementations.", 
   "- Corrected several Bugs discovered by the added Unit Tests", 
   "- Removed the unused EnumIterator", 
   "- remove the createComponentInstance from OsgiUtils because it was no longer used", 
   "Clerezza based Model Implementation (eu.iksproject.rick.model.clerezza)", 
   "- added Unit Tests for Representation, ValueFactory, Text and Reference", 
   "- added additional tests for specific types supported by this implementation", 
   "- remove specific Iterator implementations and replaced them by Adapters and Filters using the AdaptingIterator and FilteringIterator provided by the Core bundle.", 
   "- adapted Exception handling to confirm with the changes described for the Services API", 
   "- Corrected several bugs related to handling natural language texts.", 
   "- Corrected several bugs related to adding/removing Clerezza model instances.", 
   "- Corrected bug that prevented removing multiple values with RdfRepresentation.remove(Stirng,Object) method.", 
   "- Corrected several other bugs discovered while adding the unit tests", 
   "SolrYard", 
   "- Corrected a bug where the SolrYard tried to modify the Collection returned by FieldQuery.getSelectedFields() in oder to add the Lucene Score.", 
   "indexing/genericRdf", 
   "Started to add support for an API based configuration for the RdfIndexer. This should make it more easy to used this Utiliy.", 
   "- renamed a Constant to make its meaning more clear", 
   "- removed unused Clerezza dependencies (this indexer directly uses Jena and Jena TDB)", 
   "indexing/dbPedia", 
   "- An adaption needed to reflect the changes of the RdfIndexer"
  ], 
  "revision_id": "1058959"
 }, 
 {
  "author": "eric", 
  "date": "2011-01-14T11:37:45.563405Z", 
  "msg": [
   "non integration torque tests back to mailbox torque"
  ], 
  "revision_id": "1058958"
 }, 
 {
  "author": "peter_firmstone", 
  "date": "2011-01-14T11:36:04.254232Z", 
  "msg": [
   "River-300 set up river-libs module"
  ], 
  "revision_id": "1058957"
 }, 
 {
  "author": "eric", 
  "date": "2011-01-14T11:35:35.600424Z", 
  "msg": [
   "Repackage immemory integration test - define 2 sub-packages imap and host (MAILBOX-33)"
  ], 
  "revision_id": "1058956"
 }
]