[
 {
  "author": "davsclaus", 
  "date": "2011-01-21T13:57:50.656269Z", 
  "msg": [
   "Skipping test which occational fail on CI."
  ], 
  "revision_id": "1061805"
 }, 
 {
  "author": "fmui", 
  "date": "2011-01-21T13:55:04.116273Z", 
  "msg": [
   "added implementation for LOCALE_ISO639_LANGUAGE and LOCALE_ISO3166_COUNTRY … finally"
  ], 
  "revision_id": "1061804"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-01-21T13:45:54.781512Z", 
  "msg": [
   "STANBOL-38 : Changes related to the refactoring from \"eu.iksproject.rick\" to \"org.apache.stanbol.entityhub\"", 
   "This includes", 
   "- Changing the namespace to \"org.apache.stanbol.entityhub\"", 
   "- Rename all classes and methods that use \"rick\" in its name will have it changed to \"entityhub\"", 
   "- Rename all constants using eu.iksproject to org.apache.stanbol", 
   "- Rename all constans using rick to entityhub", 
   "- Adapt JavaDoc", 
   "- Update bundle metadata (via pom.xml)", 
   "This excludes", 
   "- updates to documentation currently located at http://wiki.iks-project.eu/index.php/RICK. This will be done when we move the Documentation over to Apache", 
   "- updates to Ontology Namespaces. This will be done as soon as we agree on a namespace (see STANBOL-3)", 
   "- The FieldMapper interface (SolrYard) still uses the old values for two constants. Changing that would have caused existing SolrIndexing to become invalid.", 
   "- Within the README.txt only the component names are changed. The documentation may still contain some references to the old names. Because this text is", 
   "largely the same as on the Wiki documentation this will be changed as soon as the documentation is moved from http://wiki.iks-project.eu over to Apache.", 
   "Additional change:", 
   "I removed \"rick/generic/query/**\": This was never included in the mvn build process. The contents looked like a old copy of \"rick/generic/servicesapi/\". After some research in the svn on \"iks-project@code.google.com\" (still providing the history of the code base before the incubation to apache) it was clear that the code was part of the first commit but was never be used since then. Based on that I decided to remove this code rather than refactoring it to delete it shortly afterwards.", 
   "best", 
   "Rupert Westenthaler"
  ], 
  "revision_id": "1061803"
 }, 
 {
  "author": "davsclaus", 
  "date": "2011-01-21T13:39:46.201478Z", 
  "msg": [
   "Fixed test"
  ], 
  "revision_id": "1061802"
 }, 
 {
  "author": "rmatthews", 
  "date": "2011-01-21T13:33:57.853294Z", 
  "msg": [
   "added target to ignore list. Remove unused imports"
  ], 
  "revision_id": "1061801"
 }
]