[
 {
  "author": "akarasulu", 
  "date": "2011-01-22T22:37:04.979960Z", 
  "msg": [
   "Refactoring shared:", 
   "o removed most of utils pkg in ldap effectively", 
   "- util class methods used only once moved to regions using them", 
   "- unused classes were deleted", 
   "- moved relavent classes to where they're best situated for use like", 
   "for example I moved AttributeUtils to entry pkg because it's primarily", 
   "closest to where Attributes may be manipulated in the API.", 
   "o cleaned up exceptions", 
   "o cleaned up code referrences that did not need to have a dependency on", 
   "schema classes in StringTools and removed finally string tools after breaking", 
   "it totally apart into relavent classes, Chars, Strings, and Unicode.", 
   "o consolidated some utility classes which did not need to be separate like", 
   "UTFUtils and Unicode.", 
   "o cleaned up imports", 
   "o cleaned up dead code snippets", 
   "o removed some unused methods causing unnecessary dependencies throughout", 
   "shared ldap packages."
  ], 
  "revision_id": "1062285"
 }, 
 {
  "author": "marrs", 
  "date": "2011-01-22T22:34:23.046139Z", 
  "msg": [
   "Added better support for resource processors. Resource processors can never be directly associated with features and drag and drop now caters for this. Also, a resource processor will show up as such in the 'description' column of the artifact. Finally, since you cannot associate resource processors, there is no need to give them a button to remove the association either."
  ], 
  "revision_id": "1062284"
 }, 
 {
  "author": "szetszwo", 
  "date": "2011-01-22T22:06:06.358789Z", 
  "msg": [
   "MAPREDUCE-2282. Fix TestMRServerPorts for the changes in TestHDFSServerPorts.  Contributed by shv"
  ], 
  "revision_id": "1062283"
 }, 
 {
  "author": "szetszwo", 
  "date": "2011-01-22T22:03:42.097294Z", 
  "msg": [
   "MAPREDUCE-2282. Fix TestMRServerPorts for the changes in TestHDFSServerPorts.  Contributed by shv"
  ], 
  "revision_id": "1062282"
 }, 
 {
  "author": "roger", 
  "date": "2011-01-22T21:43:59.815612Z", 
  "msg": [
   "THRIFT-1045 Support \"included\"ed thrift files", 
   "Patch: Wade Simmons"
  ], 
  "revision_id": "1062281"
 }
]