[
 {
  "author": "nd", 
  "date": "2004-11-23T00:03:45.344903Z", 
  "msg": [
   "property cleanup for the rest of the files"
  ], 
  "revision_id": "106244"
 }, 
 {
  "author": "nd", 
  "date": "2004-11-22T23:55:03.640710Z", 
  "msg": [
   "restore the files"
  ], 
  "revision_id": "106243"
 }, 
 {
  "author": "germuska", 
  "date": "2004-11-22T23:54:57.116269Z", 
  "msg": [
   "fix context key: should use method-scoped variable 'actionsKey', not instance-scoped variable 'actionKey'"
  ], 
  "revision_id": "106242"
 }, 
 {
  "author": "rich", 
  "date": "2004-11-22T23:53:44.930708Z", 
  "msg": [
   "Several changes:", 
   "- Revamped the ServerAdapter layer.  Cleaned up the interface and its usage, and removed all hardcoded logic for choosing the ServerAdapter appropriate for the current environment.  This is replaced with a combination of discovery and acceptance: ServerAdapters are declared on classpath through the file META-INF/services/org.apache.beehive.netui.pageflow.ServerAdapter, where the file contains the implementation class name (e.g., org.apache.beehive.netui.tomcat.TomcatServerAdapter).  Each ServerAdapter that is discovered is given a chance to \"accept\", which means that it looks in the current environment to see if it is the right one.  The first one that accepts wins.  Log messages detail the process for choosing, including exceptions and LinkageErrors.", 
   "- Ported TomcatServerAdapter to Tomcat 5 (and removed the old Tomcat 4 version).", 
   "- Fixed a bug where netui tags would render secure anchors for secure (transport-guarantee of CONFIDENTIAL in web.xml) URIs even when there was no ServerAdapter to specify the port.  This resulted in URLs like this:", 
   "http://myserver:-1/webapp/secure.do", 
   "- Added the following configuration parameters to the schema for netui-config.xml:", 
   "max-forwards-per-request: the number of consecutive server forwards before we return an error to the user.", 
   "max-nesting-stack-depth: the maximum size of the Page Flow nesting stack; nesting deeper than this causes an error.", 
   "ensure-secure-forwards: tells whether to run server-specific security checks before doing a server forward (normally these may only happen on direct hits).", 
   "All three of these settings were formerly read from context-params in web.xml, which still works but is deprecated.", 
   "- General API and constants cleanup.", 
   "DRT/BVT: netui (WinXP)", 
   "BB: self (WinXP)"
  ], 
  "revision_id": "106241"
 }, 
 {
  "author": "ips", 
  "date": "2004-11-22T23:51:23.552776Z", 
  "msg": [
   "fixed typo in ASF repo URL"
  ], 
  "revision_id": "106240"
 }
]