[
 {
  "author": "nd", 
  "date": "2004-11-24T19:31:09.516893Z", 
  "msg": [
   "general property cleanup"
  ], 
  "revision_id": "106449"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-11-24T19:26:19.608438Z", 
  "msg": [
   "Tweak the build script to pick up Commons Chain (which is now a dependency", 
   "for the core Shale classes), and the 1.1 version of the JSTL Standard Tag", 
   "Library (required for use with Servlet 2.4 / JSP 2.0)."
  ], 
  "revision_id": "106448"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-11-24T19:25:18.049329Z", 
  "msg": [
   "Implement the mechanism for application-wide controller actions (as described", 
   "in the original Shale proposal), by virtue of turning the filter's processing", 
   "into the execution of a Commons Chain chain.  The standard behavior can be", 
   "customized in two different ways:", 
   "* You can completely replace the \"standard\" command in the \"shale\" catalog", 
   "with something of your own devising.  Note that you'll likely want to use", 
   "something like the InvokeCommand command included in the standard chain", 
   "to invoke the remainder of the servlet container's filter chain.", 
   "* You can define your own \"preprocess\" and/or \"postprocess\" commands in the", 
   "\"shale\" catalog, which will be invoked before, or after, the remainder of", 
   "the servlet container's filter chain, respectively.  If you have commands", 
   "in the preprocess chain, you can do things like an HTTP redirect and then", 
   "return true (which tells Commons Chain that the request has been completely", 
   "processed), so that all remaining activities will be skipped.", 
   "As Shale initializes itself, it determines whether the application has already", 
   "set up a \"standard\" command in the \"shale\" catalog.  If not, it configures this", 
   "command based on a \"shale-config.xml\" file embedded in the JAR.  This does not", 
   "require any extra configuration work by the application developer."
  ], 
  "revision_id": "106447"
 }, 
 {
  "author": "rgoers", 
  "date": "2004-11-24T19:21:34.382455Z", 
  "msg": [
   "Added support for stornig JSR-168 portlet preferences."
  ], 
  "revision_id": "106446"
 }, 
 {
  "author": "rgoers", 
  "date": "2004-11-24T19:20:55.822485Z", 
  "msg": [
   "Added support for storing JSR-168 portlet preferences."
  ], 
  "revision_id": "106445"
 }
]