[
 {
  "author": "rwesten", 
  "date": "2011-02-01T13:33:19.818614Z", 
  "msg": [
   "STANBOL-62: Added Unit Tests for the Yard Interface and applied them for the Clerezza based Yard implementation", 
   "Details:", 
   "Yard Interface", 
   "- Added YardException to the create(..) methods", 
   "- Adapt JavaDoc to make clear, that the create(..) methods create and store a representation within the yard", 
   "- Converted all IllegalArgumentException that was declared as thrown when null is parsed to NullPointerExceptions", 
   "Unit Test Framework", 
   "- added the abstract YardTest class that defines around 50 Unit tests to be used for each Yard Implementation", 
   "- Moved an utility method used previously only within the unit tests for Representation to an own utility class to have it available for all unit test classes", 
   "ClerezzaYard", 
   "- adaptions to the changes in the Yard Interface", 
   "- added several Exceptions that where not correctly thrown when illegal arguments where parsed.", 
   "- The ClerezzaYard does no longer use the Clerezza GraphNode utility, because this Utility uses outgoing AND incoming relations as context of an resource. An representation as defined by the Entityhub only considers outgoing relations as context. Therefore using the GraphNode caused unnecessary triples to be copied. In addition when removing an Representation there was the danger that also incoming relations where deleted (something that MUST NOT be the case)", 
   "- The check for if an Representation is stored within a Yard was outdated and no longer in sync with the current implementation of Representation. The old representation was replaced with one that does no longer make any assumption on any kind of structure within an Representation.", 
   "- Activated Unit Tests for the Clerezza Yard implementation", 
   "other:", 
   "- various changes needed because the yard.create(..) methods now throw a YardException", 
   "open issues", 
   "- Activate the Yard unit tests for the SolrYard implementation. To do that  without external dependencies it is necessary to support an embedded Solr Server Mode for the SolrYard - a Feature that would be nice anyway (created STANBOL-63)."
  ], 
  "revision_id": "1066040"
 }, 
 {
  "author": "ningjiang", 
  "date": "2011-02-01T13:30:45.495886Z", 
  "msg": [
   "CAMEL-3608 HttpProducer should keep the content-type when it is working as a proxy"
  ], 
  "revision_id": "1066039"
 }, 
 {
  "author": "ltheussl", 
  "date": "2011-02-01T13:00:59.221943Z", 
  "msg": [
   "make SiteDeployMojo extend AbstractSiteMojo. this makes project parameters like locales, reactorProjects, etc available in the deploy and stage mojos, which will be needed for fixing MSITE-322, MSITE-537"
  ], 
  "revision_id": "1066038"
 }, 
 {
  "author": "rdebusscher", 
  "date": "2011-02-01T12:59:59.814584Z", 
  "msg": [
   "EXTVAL-124, EXTVAL-125, EXTVAL-126"
  ], 
  "revision_id": "1066037"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2011-02-01T12:59:27.915239Z", 
  "msg": [
   "Updated schema related classes to use this new LdapSchemaException."
  ], 
  "revision_id": "1066036"
 }
]