[
 {
  "author": "pramirez", 
  "date": "2011-02-02T17:56:16.637240Z", 
  "msg": [
   "Tagging release 0.2."
  ], 
  "revision_id": "1066550"
 }, 
 {
  "author": "kkolinko", 
  "date": "2011-02-02T17:54:36.881054Z", 
  "msg": [
   "* Backport Windows installer improvements from Tomcat 7.0.5.", 
   "- Use *modern* types of nsis install/uninstall icons (r999976, mturk)", 
   "- Create service-install.log file during installation with params that were used to invoke commons daemon. (r1003840, mturk; r1035083,r1035088 kkolinko)", 
   "- Allow 32-bit or 64-bit JVMs to be selected when installing on a 64-bit platform. (r1027504, markt; r1033856,r1033882 kkolinko)", 
   "- Reimplemented the Windows installer GUI using nsDialogs and MUI2 libraries, instead of deprecated InstallOptions. The *.ini files are no more used. All is specified in the nsi script. (r1034911, kkolinko)", 
   "- Use new admin-gui and manager-gui roles for the user (r982151, mturk)", 
   "- Add a field to display/edit the roles for the user that we add to tomcat-user.xml", 
   "- The roles are calculated depending on what webapps are installed (only manager, vs. host-manager, vs. both of them).", 
   "- Do not display \"username\", \"password\", \"roles\" fields when neither manager nor host-manager are selected. In the previous version we showed them as disabled. Now we do not show them on screen.", 
   "- Add support for the '/?' command line option. It displays a message box. See .onInit function in tomcat.nsi for details. (r1034911, kkolinko)", 
   "- When installing on Windows, do not leave undeleted stale files in $TEMP/src/res/confinstall/. Pack only needed fines, not duplicates. Place those files into $PLUGINSDIR instead of $TEMP.", 
   "- Add DetailPrint statements for operations that take noticeable time. (r1034924, kkolinko)", 
   "- Improve descriptions of the components. (r964211, r1035051)", 
   "The following fixes were backported as well:", 
   "- Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=50140", 
   "Don't ignore a user specified install directory on 64-bit platforms.", 
   "- Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=45332", 
   "Specify the correct encoding (the current Windows code page) rather than assuming UTF-8 when creating tomcat-users.xml with the Windows installer.", 
   "- Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=45852", 
   "Add special handling for cp932 (aka ms932) when creating tomcat-users.xml with Windows installer."
  ], 
  "revision_id": "1066549"
 }, 
 {
  "author": "nick", 
  "date": "2011-02-02T17:54:26.217427Z", 
  "msg": [
   "TIKA-372 follow-on: Set two more XMPDM metadata values for MP3, and add unit tests"
  ], 
  "revision_id": "1066548"
 }, 
 {
  "author": "benniven", 
  "date": "2011-02-02T17:50:21.370964Z", 
  "msg": [
   "This commit is for EMPIREDB-38 and EMPIRE-77:", 
   "- log4j and jcl dependencies have been removed from core components (empre-db, empre-db-struts2, empire-db-codegen)", 
   "- added slf4j as logging api in the core components and modified the code to comply with the slf4j-api", 
   "- preserved log4j and jcl in the examples", 
   "still to do:", 
   "- check if logging is configured properly in the examples", 
   "- use parameterized logging instead of \".toString()\""
  ], 
  "revision_id": "1066547"
 }, 
 {
  "author": "coheigea", 
  "date": "2011-02-02T17:44:46.175862Z", 
  "msg": [
   "[SANTUARIO-259] - More refactoring."
  ], 
  "revision_id": "1066546"
 }
]