[
 {
  "author": "akarasulu", 
  "date": "2004-11-28T05:46:49.488477Z", 
  "msg": [
   "directory no longer needed"
  ], 
  "revision_id": "106789"
 }, 
 {
  "author": "quinlan", 
  "date": "2004-11-28T05:32:22.387908Z", 
  "msg": [
   "bug 2127: T_AS_SEEN_ON"
  ], 
  "revision_id": "106788"
 }, 
 {
  "author": "djd", 
  "date": "2004-11-28T05:02:21.660147Z", 
  "msg": [
   "Fix for Derby-33 - not implemented exception when passing in empty type map to JBDC calls.", 
   "Handling the map conditions the following way", 
   "null Map      --> throw a SQLException", 
   "empty Map     --> no-op", 
   "non-empty Map --> throw notImplemented.", 
   "Patch contributed by Shreyas Kaushik (Shreyas.Kaushik@Sun.COM)"
  ], 
  "revision_id": "106787"
 }, 
 {
  "author": "adc", 
  "date": "2004-11-28T04:56:21.880746Z", 
  "msg": [
   "Temporary work around."
  ], 
  "revision_id": "106786"
 }, 
 {
  "author": "rick", 
  "date": "2004-11-28T03:51:02.956820Z", 
  "msg": [
   "Lots of changes.  Was on a roll. :)", 
   "Note to self: Create documentation for this plugin that highlights the", 
   "features and discusses some of the limitations (ie. table cells have min", 
   "width of 10)", 
   "The big changes are:", 
   "* Lists with hanging indents", 
   "* Nested lists", 
   "* Tables", 
   "* Nested Tables", 
   "* Lists in Tables", 
   "* Tables in Lists (I think)", 
   "* Better handling of in-line elements, in particluar the spacing", 
   "before and after such elements.", 
   "* source elements are indented nicely.", 
   "The gory details:", 
   "- Handle nested lists by including a width parameter that is called from", 
   "the table templates", 
   "- Handle the padding of the table cells.  This just required not", 
   "including padding if we were at a muitiple of the cell width.", 
   "- The wrapping of the text in the table cells is handled by the applied", 
   "templates.  Just needed to pass the correct width to wrap on, which is", 
   "the colwidth - 2.  The '2' is for the padding in the cells.", 
   "- Emit the whole table at once.  This will allow for tables to be in", 
   "lists or other tables", 
   "- Handle em, strong and code in-line elements and proper spacing after", 
   "such elements", 
   "- Correct some usage of passing in the level parameter.  A number of", 
   "elements were incrementing the level for no reason", 
   "- Added CR for abstract and notice sections;  cleaned up extraneous w/s", 
   "- trailing space issue when a text node consists purely of white space.", 
   "Such a string will have a null trailing-space variable defined.", 
   "Cleans up some of the issues with in-line elements and odd padding", 
   "behaviour in definition lists.", 
   "- Handle source element separately from p[@xml:space='preserve']", 
   "elements.  The source element will be emitted with the current", 
   "indentation.  No such liberty will be taken with the xml:space", 
   "preserve.", 
   "- Removed width paramenter from the emit-with-indent template.  It is", 
   "not used.  Width considerations are handled by the wrap-text()", 
   "template instead.", 
   "- Renamed emit() to wrap-text().", 
   "- Handled trailing-space in adding it to the text-remaining variable in", 
   "order to carry the trailing-space forward through recursive calls to", 
   "wrap-text().", 
   "- Move the responsibility of emit()'ing carriage returns to the element", 
   "being handled rather than doing it in emit() directly.", 
   "This has the benefit of finer control in how line spacing is done,", 
   "especially when nested lists are involved.", 
   "- Handle nested lists nicely with proper indent.", 
   "- Change the indentation of notes, warnings, fixmes to be zero when", 
   "embedded within a list.", 
   "- Added an emit-with-indent() that handles markers for dealing with", 
   "ordered and unordered lists with hanging indents"
  ], 
  "revision_id": "106785"
 }
]