[
 {
  "author": "cmpilato", 
  "date": "2011-02-08T16:53:14.851446Z", 
  "msg": [
   "* subversion/tests/libsvn_subr/dirent_uri-test.c", 
   "(test_uri_canonicalize): Fix a bit of test data.  (I *think* this is", 
   "what Bert had intended, here.)"
  ], 
  "revision_id": "1068475"
 }, 
 {
  "author": "mikem", 
  "date": "2011-02-08T16:45:14.353577Z", 
  "msg": [
   "DERBY-5002 In case of checksum error, insure correct error reported to user.", 
   "backported change #1067357 from trunk to 10.6 branch, some manual merging", 
   "required.", 
   "Changed the order of sanity page checking to make sure that if there is a", 
   "checksum error on reading the page from disk, then it is the error reported.", 
   "Before this change certain page inconsistencies would be found before doing", 
   "the checksum check and would report different kinds of errors depending on", 
   "where the corruption happened on the page. The main error case checksums", 
   "try to catch is partially written page where because a derby page is made up", 
   "of multiple OS/drive blocks some blocks can make it to disk before others and", 
   "in the case of a hardware crash an incomplete page may be written. In this", 
   "case, the current derby implementation can not recover from log as it needs", 
   "a valid page to look at in order to apply log records. The db must be", 
   "recovered from derby backup in this case."
  ], 
  "revision_id": "1068474"
 }, 
 {
  "author": "jrbauer", 
  "date": "2011-02-08T16:44:38.692812Z", 
  "msg": [
   "OPENJPA-1935 Updated Informix dictionary to examine nested SQL exceptions when determining whether a generic exception is a lock exception.  Added Informix JDBC profile to jdbc and locking poms."
  ], 
  "revision_id": "1068473"
 }, 
 {
  "author": "jrbauer", 
  "date": "2011-02-08T16:42:22.010451Z", 
  "msg": [
   "OPENJPA-1935 Updated Informix dictionary to examine nested SQL exceptions when determining whether a generic exception is a lock exception.  Added Informix JDBC profile to jdbc and locking poms."
  ], 
  "revision_id": "1068472"
 }, 
 {
  "author": "sebb", 
  "date": "2011-02-08T16:40:28.273483Z", 
  "msg": [
   "Use a property for the Clover version."
  ], 
  "revision_id": "1068471"
 }
]