[
 {
  "author": "rajith", 
  "date": "2011-02-09T21:09:28.849489Z", 
  "msg": [
   "QPID-2994", 
   "The commit made in rev 1068661 will only close and throw an exception if the user tries to invoke an action (Ex sending a message or calling commit) on the transactional session while failover is in progress (i.e session in detached state).", 
   "We also need to handle the case where the application is not doing anything during failover. But the application may still be in the middle of an uncommitted transaction. Therefore any session that is marked transactional should not be resumed.", 
   "This commit removes tranactional sessions and close them inside the 'resume' method in Connection.java", 
   "Any subsequent operation on this session will cause an exception being thrown, saying the session is closed.", 
   "However the exception doesn't really contain the reason, other than to say the session is closed.", 
   "The Java client in general needs a better error reporting scheme to convey more information to a client application.", 
   "That will be handled under a separate JIRA.", 
   "For the purpose of this JIRA the session being closed is good enough for the time being."
  ], 
  "revision_id": "1069105"
 }, 
 {
  "author": "mrisaliti", 
  "date": "2011-02-09T21:09:04.485038Z", 
  "msg": [
   "Add a @SuppressWarning(\"serial\") of classes of package org.ofbiz.service.semaphore (OFBIZ-4102)"
  ], 
  "revision_id": "1069104"
 }, 
 {
  "author": "mrisaliti", 
  "date": "2011-02-09T21:08:12.263127Z", 
  "msg": [
   "Add a @SuppressWarning(\"serial\") of classes of package org.ofbiz.service.rmi.socket.ssl (OFBIZ-4102)"
  ], 
  "revision_id": "1069103"
 }, 
 {
  "author": "aconway", 
  "date": "2011-02-09T21:07:50.888603Z", 
  "msg": [
   "Remove out-dated comment."
  ], 
  "revision_id": "1069102"
 }, 
 {
  "author": "hlship", 
  "date": "2011-02-09T21:07:50.553709Z", 
  "msg": [
   "TAP5-1390: Be more specific about Comparators used when sorting", 
   "Add new Comparator factories for the first or second value in a Tuple"
  ], 
  "revision_id": "1069101"
 }
]