[
 {
  "author": "mgrigorov", 
  "date": "2011-02-13T09:34:43.485920Z", 
  "msg": [
   "WICKET-3351 Add class for span with text in wicket-extensions\\treetable", 
   "Add CSS class \"text\" to the label (just like it is in TreeTable$TreeFragment.html)"
  ], 
  "revision_id": "1070200"
 }, 
 {
  "author": "mgrigorov", 
  "date": "2011-02-13T09:30:54.060918Z", 
  "msg": [
   "WICKET-3364 StatelessLink should not force the model type to Void", 
   "StatelessLink now can have non-void model type.", 
   "This way it is in sync with other stateless components like BookmarkablePageLink and StatelessForm."
  ], 
  "revision_id": "1070199"
 }, 
 {
  "author": "jvs", 
  "date": "2011-02-13T09:29:54.905633Z", 
  "msg": [
   "HIVE-1896 HBase and Contrib JAR names are missing version numbers", 
   "(Carl Steinbach via jvs)"
  ], 
  "revision_id": "1070198"
 }, 
 {
  "author": "mgrigorov", 
  "date": "2011-02-13T09:21:09.743686Z", 
  "msg": [
   "WICKET-3412 RememberMe doesn't remember me", 
   "First save/remove the secure cookie then redirect to the intercept page."
  ], 
  "revision_id": "1070197"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-02-13T09:07:29.410237Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 1070193\"", 
   "------------------------------------------------------------------------", 
   "r1070193 | jleroux | 2011-02-13 09:54:27 +0100 (dim., 13 févr. 2011) | 5 lines", 
   "A patch from Martin Kreidenweis \"savePaymentGatewayResponse throws exceptions due to foreign key constraints\" (https://issues.apache.org/jira/browse/OFBIZ-4176) - OFBIZ-4176", 
   "If you use a CC payment service provider that actually wants to save not only PaymentGatewayResponses, but also PaymentGatewayResponseMessages, saving these to the database actually might fail because they are created in the wrong order. The response and the messages are scheduled as separate async rollback services in processCreditResult. So it's not guaranteed the Response is there before OFBiz tries to add the ResponseMessages.", 
   "Fix for the issue: we created a new savePaymentGatewayResponseAndMessages service, that takes both the Response and the ResponseMessages and writes them to the database in the right order.", 
   "------------------------------------------------------------------------", 
   "?\\026"
  ], 
  "revision_id": "1070196"
 }
]