[
 {
  "author": "rwesten", 
  "date": "2011-02-17T12:00:19.212478Z", 
  "msg": [
   "Indexer for dblp (see README.txt for details", 
   "other stuff:", 
   "- added the swrc namespace prefix to the namespace enum.", 
   "- corrected some bugs in the RdfIndexer", 
   "Open Issues:", 
   "The Code for this Indexer is mainly the same as for the dbPedia one. The main differences are the defaults.", 
   "The open Issue is to implement an generic version of Indexers for DataSets that are available as RDF dumps.", 
   "This Indexer and the dbPedia Indexer can than be replaced by configurations for the more generic one."
  ], 
  "revision_id": "1071590"
 }, 
 {
  "author": "concelvio", 
  "date": "2011-02-17T11:59:34.644714Z", 
  "msg": [
   "STANBOL-35", 
   "1) Has been excluded the library slf4j-log4j12 which is given as \"provider\" with a version 1.5.6. This gives conflict during the test with the version 1.5.2 of slf4j-api.", 
   "2) Has been added as test library slf4j-simple 1.5.2", 
   "Issue #STANBOL-35 - Failing tests in KReS Reasoners"
  ], 
  "revision_id": "1071589"
 }, 
 {
  "author": "kristwaa", 
  "date": "2011-02-17T11:55:32.121265Z", 
  "msg": [
   "DERBY-4940: Tune istat operational characteristics", 
   "DERBY-5038: updatelocks test failing in tinderbox when background update statistics are enabled.", 
   "Changed the default absdiff threshold from zero to 1000, as the current setting", 
   "causes the automatic index statistics update feature to be too aggressive.", 
   "It also causes a set of regression tests to fail (not all of them fails", 
   "always).", 
   "The \"diff mechanism\" may be replaced later, for instance with a plain lower", 
   "limit on the number of rows in the table, discussion is ongoing.", 
   "Patch file: derby-4940-1a-absdiff_to_1k.diff"
  ], 
  "revision_id": "1071588"
 }, 
 {
  "author": "norman", 
  "date": "2011-02-17T11:49:07.328677Z", 
  "msg": [
   "Remove unused imports / method"
  ], 
  "revision_id": "1071587"
 }, 
 {
  "author": "norman", 
  "date": "2011-02-17T11:47:40.589368Z", 
  "msg": [
   "Remove unused import"
  ], 
  "revision_id": "1071586"
 }
]