[
 {
  "author": "rwesten", 
  "date": "2011-02-16T12:53:32.185245Z", 
  "msg": [
   "2nd attempt to changed the package \"constraintEncoders\" to its lower case version - seams not so easy on a file system that does not allow multiple files/directories that only differ in lower/upper case letters ..."
  ], 
  "revision_id": "1071235"
 }, 
 {
  "author": "abroekhuis", 
  "date": "2011-02-16T12:52:19.274040Z", 
  "msg": [
   "Fixed small type"
  ], 
  "revision_id": "1071234"
 }, 
 {
  "author": "bimargulies", 
  "date": "2011-02-16T12:51:16.257546Z", 
  "msg": [
   "Initial reaction to release of XmlSchema 2.0."
  ], 
  "revision_id": "1071233"
 }, 
 {
  "author": "abroekhuis", 
  "date": "2011-02-16T12:48:36.079761Z", 
  "msg": [
   "Added template files"
  ], 
  "revision_id": "1071232"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-02-16T12:45:36.226941Z", 
  "msg": [
   "Fixes STANBOL-89 and improves the documentation provided for the default configuration of Solr Server used together with the SolrYard implementation", 
   "Details to STANBOL-89:", 
   "- The IndexDataTypeEnum now allows to specify if a data type is interpreted natural language texts.", 
   "- This property is enabled for TXT (entityhub:Text) and STR (xsd:string)", 
   "- The encodeLangeuage(..) methods of the SolrFieldMapper do no longer add the \"_!@\" field to the encoding", 
   "- The SolrFieldMapper does now add the \"_!@\" field for all values with a datatype that has the  natural language property set to true", 
   "- The language constraint encoder does no longer add the \"str\" data type field when encoding lanugage constraints.", 
   "other:", 
   "- changed the location of the README.txt explaining the default configuration to the root folder.", 
   "- The \"schema.xml\" of the default configuration now contains detailed descriptions about how to change/optimise it without breaking assumptions made by the SolrYard implementation.", 
   "- updated the documentation of the solr.xml (multi core configuration)", 
   "- Changed remaining occurrences of \"rick\" to \"entityhub\" within the default configuration", 
   "- changed the package \"constraintEncoders\" to its lower case version"
  ], 
  "revision_id": "1071231"
 }
]