[
 {
  "author": "stsp", 
  "date": "2011-02-22T13:51:16.067543Z", 
  "msg": [
   "Make parameters for svn_apply_autoprops.py configurable,", 
   "fixing TODO number 2 listed at the top of this file.", 
   "The working copy path was hardcoded to the current working directory.", 
   "Add an optional WC_PATH argument to override this.", 
   "The configuration file path was hardcoded to ~/.subversion/config.", 
   "This file affects all svn clients and settings for all working copies.", 
   "In some situations users might want to use a different configuration file", 
   "to configure a specific set of autoprops, so add a new --config option.", 
   "* contrib/client-side/svn_apply_autoprops.py", 
   "(): Import getopt.", 
   "(SVN_CONFIG_FILENAME): Expand vars (i.e. $HOME) at point of definition.", 
   "(PROGNAME): New. Basename of argv[0].", 
   "(usage): New helper function. Prints usage information which contains text", 
   "that was previously sitting in a comment at the top of the file.", 
   "(main): Parse options with getopt. In addition to the --config option", 
   "described above, accept --help and -h options that print usage text.", 
   "Error out if the config file cannot be opened.", 
   "Accept an optional WC_PATH argument to override the default ('.').", 
   "Error out if too many arguments were passed."
  ], 
  "revision_id": "1073325"
 }, 
 {
  "author": "tommaso", 
  "date": "2011-02-22T13:46:12.386575Z", 
  "msg": [
   "[UIMA-2047] - solrmapping.xml to use the CAS API type"
  ], 
  "revision_id": "1073324"
 }, 
 {
  "author": "elecharny", 
  "date": "2011-02-22T13:44:07.606193Z", 
  "msg": [
   "o Injected the SchemaManager into the AV class", 
   "o Added some tests for schema aware AVAs", 
   "o Made the Ava class final", 
   "o Modified the Ava constructor to be package visible only when they are not schema aware", 
   "o The Ava.toString() method returns the UP form instead of the norm form"
  ], 
  "revision_id": "1073323"
 }, 
 {
  "author": "bdelacretaz", 
  "date": "2011-02-22T13:35:47.428266Z", 
  "msg": [
   "SLING-1981 - server only needs to be started once, and with this change the JSONResponseTest passes ;-)"
  ], 
  "revision_id": "1073322"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2011-02-22T13:23:25.971485Z", 
  "msg": [
   "make sure an alias is really defined"
  ], 
  "revision_id": "1073321"
 }
]