[
 {
  "author": "markt", 
  "date": "2011-02-25T19:19:13.950653Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=49284", 
   "Support SSL re-negotiation in the HTTP NIO connector", 
   "There is a fair amount of renaming in this patch. The real work is in the new rehandshake() method in the SecureNioChannel."
  ], 
  "revision_id": "1074675"
 }, 
 {
  "author": "arkurth", 
  "date": "2011-02-25T19:16:54.630528Z", 
  "msg": [
   "VCL-434", 
   "Updated version in INSTALLATION and UPGRADE files from 2.2 to 2.2.1.", 
   "Updated UPGRADE file to specify using the upgrade-vcl.sql file.", 
   "Changed copyright year in NOTICE file to 2011.", 
   "Removed author and copyright sections from esxthin.pm to match the other Perl modules."
  ], 
  "revision_id": "1074674"
 }, 
 {
  "author": "cstamas", 
  "date": "2011-02-25T19:11:22.937526Z", 
  "msg": [
   "Returned a method removed by mistake."
  ], 
  "revision_id": "1074673"
 }, 
 {
  "author": "jm", 
  "date": "2011-02-25T19:10:50.974502Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "1074672"
 }, 
 {
  "author": "cstamas", 
  "date": "2011-02-25T19:07:10.312209Z", 
  "msg": [
   "Cleanup in indexer-artifact module:", 
   "o GavCalculator UTs moved to their place (they left in wrong place since the time these two modules were actually one)", 
   "o Fixed GAV constructor, and needless IllegalArtifactCoordinate exception, the passed in version already \"tells\" is this snap or not", 
   "o Fixed inconsistency wrt GavCalculator, contract changed! Before, it was returning null in both cases, \"valid file but not artifact\" (ie. metadata), and \"invalid path\". Now, the contract is: if GAV is returned, the path is correct and obeys layout. Null means it obeys layout but is not artifact (is metadata or such), and exception means \"this is broken path from layout aspect\".", 
   "o Removed some kludge remains from Nexus times not used in nexus either anymore"
  ], 
  "revision_id": "1074671"
 }
]