[
 {
  "author": "bodewig", 
  "date": "2011-02-25T16:21:15.720658Z", 
  "msg": [
   "build order"
  ], 
  "revision_id": "1074615"
 }, 
 {
  "author": "dcreager", 
  "date": "2011-02-25T16:19:42.522560Z", 
  "msg": [
   "AVRO-762. C: Promotion of values during schema resolution", 
   "The avro_resolver_new function now takes into the schema promotion", 
   "rules: an int can be read as a long, float, or double; a long can be", 
   "read as a float or double; and a float can be read as a double.  The", 
   "test_avro_data test program includes test cases for each of these", 
   "promotions."
  ], 
  "revision_id": "1074614"
 }, 
 {
  "author": "coheigea", 
  "date": "2011-02-25T16:18:38.635564Z", 
  "msg": [
   "Fix for CXF trunk test failure."
  ], 
  "revision_id": "1074613"
 }, 
 {
  "author": "dcreager", 
  "date": "2011-02-25T16:17:56.506807Z", 
  "msg": [
   "AVRO-762. C: Better schema resolution", 
   "This patch adds a new class that implements Avro's schema resolution", 
   "rules.  Before, the writer and reader schemas were resolved each time a", 
   "datum was read from an Avro file.  Now, we can examine the two schemas", 
   "before reading and data values, and \"remember\" the resolution result in", 
   "a tree of avro_resolver_t objects.  The avro_resolver_new function", 
   "creates this tree of resolvers.  The result is an instance of a generic", 
   "\"consumer\" interface, which is an abstract API for consuming Avro data", 
   "that conforms to some writer schema.  In this case, the resolver", 
   "implementation of the consumer API fills in an avro_datum_t that", 
   "conforms to the reader schema, promoting data and dropping fields as", 
   "necessary.  The avro_consume_binary function takes care of parsing the", 
   "Avro binary encoding, passing off the data that it reads in to a", 
   "consumer.", 
   "We currently don't support the AVRO_LINK schema type; we'll need to add", 
   "some memoization to handle recursive schemas properly."
  ], 
  "revision_id": "1074612"
 }, 
 {
  "author": "gsim", 
  "date": "2011-02-25T16:14:32.578570Z", 
  "msg": [
   "QPID-2999: set redelivered on replay"
  ], 
  "revision_id": "1074611"
 }
]