[
 {
  "author": "sascharodekamp", 
  "date": "2011-02-28T12:08:26.665415Z", 
  "msg": [
   "Bug - Content Tree is not shown in IE7 (https://issues.apache.org/jira/browse/OFBIZ-3815). The JSON Object was not defined in a clean way so the IE couldn't interprete the structure.", 
   "Thnkas Ankit for reporting!", 
   "Orig. Msg.:", 
   "We have two issues:", 
   "1. https://demo-trunk.ofbiz.apache.org:8443/content/control/findContent, the alert box open and say \"Operation Aborted\". see Image1.jpg", 
   "#Here https://demo-trunk.ofbiz.apache.org:8443/content/control/navigateContent the tree is not rendering. see Image2.jpg", 
   "Both the above issue are on IE7 only they are working fine on FF and Chrome.", 
   "I have attached the two images please have a look."
  ], 
  "revision_id": "1075310"
 }, 
 {
  "author": "bentmann", 
  "date": "2011-02-28T12:07:53.945474Z", 
  "msg": [
   "o Restored runtime compatibility with plugins that implement custom ArtifactRepositoryLayouts (e.g. appassembler-maven-plugin). The method getId() was added in 3.0 and as such is not implemented by those custom impls. The refactoring done in r1073990 for MNG-4991 eventually made this discrepancy show up during plugin execution."
  ], 
  "revision_id": "1075309"
 }, 
 {
  "author": "joern", 
  "date": "2011-02-28T12:07:46.990636Z", 
  "msg": [
   "UIMA-2047 Fixed small mistake in new mapping file, it should of course be org.apache and not com.apache"
  ], 
  "revision_id": "1075308"
 }, 
 {
  "author": "joern", 
  "date": "2011-02-28T12:07:09.379118Z", 
  "msg": [
   "UIMA-2047 Replaced mapping file with a real world sample mapping file."
  ], 
  "revision_id": "1075307"
 }, 
 {
  "author": "cstamas", 
  "date": "2011-02-28T11:55:20.460006Z", 
  "msg": [
   "Redoing GAV fixes and simplification: removed the checked exception, was a very bad idea anyway.", 
   "Now, GavCalculator simply returns GAV if \"all is fine\" and path does represents a GAV, null otherwise."
  ], 
  "revision_id": "1075306"
 }
]