[
 {
  "author": "mrisaliti", 
  "date": "2011-02-28T21:40:32.519635Z", 
  "msg": [
   "Remove unused variable in TextFormRenderer (OFBIZ-4102)"
  ], 
  "revision_id": "1075545"
 }, 
 {
  "author": "erans", 
  "date": "2011-02-28T21:32:33.503627Z", 
  "msg": [
   "MATH-503", 
   "Added derivative function."
  ], 
  "revision_id": "1075544"
 }, 
 {
  "author": "brandonwilliams", 
  "date": "2011-02-28T21:32:08.647181Z", 
  "msg": [
   "CFRW no longer loses mutations.", 
   "Patch by Eldon Stegall, reviewed by Stu Hood and brandonwilliams for", 
   "CASSANDRA-2255"
  ], 
  "revision_id": "1075543"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-02-28T21:31:56.548474Z", 
  "msg": [
   "STANBOL-3 First Proposal for the Stanbol Enhancement Structure that will replace the FISE Enhancement Structure currently used by the Stanbol Enhancer.", 
   "Background:", 
   "Currently the Stanbol Enhancer still uses the FISE Enhancement Structure. Changing this is unavoidable but will break all the current clients.", 
   "Therefore the current plan is to keep using the current structure for some time and switch only to a new one as soon as we also implement new features that do require an extended Enhancement Structure (e.g. support for extracting metadata from parsed content)", 
   "As discussed with ogrisel: The Issues STANBOL-12 and STANBOL-48 can and will be resolved by extending the current FISE Enhancement Structure (and therefore without breaking existing clients)", 
   "Main Goals of this Proposal:", 
   "- start the discussion early and give peoples time to contribute", 
   "- inspire usage scenarios to catch as many requirements as possible", 
   "- propose solutions for shortcomings and missing features of the FISE Enhancement Structure", 
   "As reminder:", 
   "The biggest shortcoming of the current FISE Enhancement Structure was the complexity to consume (understand/parse/query) it on the client side. This can - to some extend - be improved by providing clients, but a good design of the Enhancement Structure will always be a central point for the ease of use of the Stanbol Enhancer component.", 
   "I my opinion the easiness depends on a lot of things including", 
   "- human readable default serialisation (JSON-LD): A flat structure that uses less resources with a lot of properties would help with that. Having small pieces of information that link each other randomly distributed over the whole file is a disaster typically for many serialised RDF data and something we must aim to avoid.", 
   "- easy to read/write and modify (SPARQL) queries", 
   "- meaningful property and concept names", 
   "- usage of well known and understood metadata standards such as Dublin Core", 
   "best", 
   "Rupert Westenthaler"
  ], 
  "revision_id": "1075542"
 }, 
 {
  "author": "mrisaliti", 
  "date": "2011-02-28T21:31:27.952638Z", 
  "msg": [
   "Remove unused variable in FoFormRenderer (OFBIZ-4102)"
  ], 
  "revision_id": "1075541"
 }
]