[
 {
  "author": "bhofmann", 
  "date": "2011-02-28T13:46:30.303034Z", 
  "msg": [
   "SHINDIG-1507: changed some links to point to the current spec instead of old google docs"
  ], 
  "revision_id": "1075325"
 }, 
 {
  "author": "erwan", 
  "date": "2011-02-28T13:45:02.046876Z", 
  "msg": [
   "More improvements on help, adding more descriptions and a French page"
  ], 
  "revision_id": "1075324"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2011-02-28T13:44:54.391011Z", 
  "msg": [
   "Fixed the test case (ignored for now) for DIRSERVER-1610 (No error is reported when adding an entry with a non-existing attribute).", 
   "Added another one (active) to test the addition of an entry with a non existing object class (the test pass)."
  ], 
  "revision_id": "1075323"
 }, 
 {
  "author": "sascharodekamp", 
  "date": "2011-02-28T13:43:23.217069Z", 
  "msg": [
   "Improvement - if-regexp conditions in Minilang and Screens not thread safe (https://issues.apache.org/jira/browse/OFBIZ-4107). I added another getTestPattern Method to support case insensitive tests. The case insensitive testPattern is needed from the UtilHttp.checkURLforSpiders.", 
   "Thanks Martin & Dimitri for your effort.", 
   "Orig. Msg.:", 
   "The Perl5Matcher Perl5Compiler are not thread safe, as mentioned in their documentation: http://jakarta.apache.org/oro/api/org/apache/oro/text/regex/Perl5Compiler.html", 
   "A separate instance should be used per thread.", 
   "The concrete issue occurred in our system in the createCommContentDataResource service. The service tries to save emails to the database after they have been sent. It failed because of the described issue. This caused the whole email service (sendMailFromScreen) to be rescheduled. So customers got emails twice.", 
   "The Perl5Matcher and Perl5Compiler instances are assigned to static fields in the org.ofbiz.minilang.method.ifops.IfRegexp class. So every thread will use the same instance. No synchronization is done currently. Changing the fields to be non-static will not work either, as SimpleMethods are cached. So all calls to the same simple method use the same IfRegexp instance.", 
   "We fixed the problem by moving the instantiation of the Perl5Matcher and Perl5Compiler to the exec() method in IfRegexp.", 
   "Other classes are most likely affected, too: org.ofbiz.entity.condition.EntityComparisonOperator, org.ofbiz.minilang.method.conditional.RegexpCondition, org.ofbiz.minilang.operation.Regexp, org.ofbiz.widget.menu.ModelMenuCondition$IfRegexp, org.ofbiz.widget.screen.ModelScreenCondition$IfRegexp, org.ofbiz.widget.tree.ModelTreeCondition$IfRegexp"
  ], 
  "revision_id": "1075322"
 }, 
 {
  "author": "bdelacretaz", 
  "date": "2011-02-28T13:39:24.032268Z", 
  "msg": [
   "SLING-1963 - test selection refactored using TestSelector interface"
  ], 
  "revision_id": "1075321"
 }
]