[
 {
  "author": "jocaba", 
  "date": "2011-03-01T06:40:01.669230Z", 
  "msg": [
   "[NPANDAY-314] Adding a Maven artifact from VS plugin generates NPANDAY-180-017 error", 
   "Modified behavior of generating group Id to only use the solution name if no company name is registered in the machine. note: in VS2010 if no company name is registered VS automatically uses Microsoft as companyName registered."
  ], 
  "revision_id": "1075675"
 }, 
 {
  "author": "bayard", 
  "date": "2011-03-01T06:32:00.105224Z", 
  "msg": [
   "Noting the SystemUtils java.version property change"
  ], 
  "revision_id": "1075674"
 }, 
 {
  "author": "bayard", 
  "date": "2011-03-01T06:31:41.623351Z", 
  "msg": [
   "Resolving LANG-428 - Changing StringUtils.isAlpha, isAlphanumeric and isNumeric to return false when passed an empty String. Documenting this in the changes report and in the upgrade article. Also fixing a Javadoc c+p error in isNumericSpace and isAlphanumericSpace."
  ], 
  "revision_id": "1075673"
 }, 
 {
  "author": "mukulg", 
  "date": "2011-03-01T06:24:20.121366Z", 
  "msg": [
   "there was an recent guideline from XML Schema WG that schema 1.1 assertions work on a parentless element tree (rooted at an element node). as per this guideline schema 1.1 assertions xpath expressions cannot begin with / or //. i've made changes to Xerces schema 1.1 implementation to meet this guidelines (now it's a static error to have assert xpath expressions that begin with / or //). a corresponding change to psychopath xpath2 engine was also needed to implement this change, whose latest jar (with version number incremented to 1.2.0) is also included with this commit.", 
   "committing also the modified ant build file, and eclipse license files wording changes.", 
   "ref: corresponding eclipse bug report, https://bugs.eclipse.org/bugs/show_bug.cgi?id=338494"
  ], 
  "revision_id": "1075672"
 }, 
 {
  "author": "crossley", 
  "date": "2011-03-01T06:15:40.640575Z", 
  "msg": [
   "Use the person name as title of document.", 
   "Issue: FOR-1225", 
   "Contributed by: Antoine Levy-Lambert"
  ], 
  "revision_id": "1075671"
 }
]