[
 {
  "author": "aconway", 
  "date": "2011-03-07T21:43:27.053507Z", 
  "msg": [
   "QPID-3121: Cluster management inconsistency when using persistent store.", 
   "With the store doing async completions, completion IO callbacks could", 
   "be queued differently on different nodes. This led to inconsistent", 
   "management changes in a cluster when a connection was modified in an", 
   "IO callback.", 
   "Fix was to mark IO callback processing as not cluster safe, so", 
   "connections don't record management stats during an IO callback.", 
   "Test changes:", 
   "- enable durable tests in test_management.", 
   "- add substitutions to mask known issue of inconsistent \"stats changed\" messages.", 
   "- add transactional client to test_management.", 
   "- ignore heartbeat connection close logs in cluster_test_logs.py", 
   "- make brokertest.retry more accurate", 
   "- fix minor bug in brokertest.log_ready."
  ], 
  "revision_id": "1078965"
 }, 
 {
  "author": "tomwhite", 
  "date": "2011-03-07T21:42:51.405403Z", 
  "msg": [
   "MAPREDUCE-2336. Tool-related packages should be in the Tool javadoc group."
  ], 
  "revision_id": "1078964"
 }, 
 {
  "author": "fuankg", 
  "date": "2011-03-07T21:42:06.971019Z", 
  "msg": [
   "Added dbm stuff to NetWare build."
  ], 
  "revision_id": "1078963"
 }, 
 {
  "author": "hwright", 
  "date": "2011-03-07T21:41:11.899338Z", 
  "msg": [
   "Move lock adding and removing into a wc-ng txn.  We both read and write data", 
   "in these operations, and the writes should be done in a manner consistent", 
   "with the reads.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(lock_add_txn, lock_remove_txn): New.", 
   "(svn_wc__db_lock_add, svn_wc__db_lock_remove): Call the above through a txn."
  ], 
  "revision_id": "1078962"
 }, 
 {
  "author": "rajith", 
  "date": "2011-03-07T21:38:52.878478Z", 
  "msg": [
   "QPID-3109", 
   "Added a null check for the destination in both MessageConsumer and MessageProducer close methods.", 
   "According to the JMS spec the MessageProducer can be created with a null destination and still be used properly by specifying a destination on the send. Therefore this null check especially important on the message producer side."
  ], 
  "revision_id": "1078961"
 }
]