[
 {
  "author": "pgoldstein", 
  "date": "2002-08-12T06:19:01.000000Z", 
  "msg": [
   "This is a bugfix for bug #11256.  Code was changes to properly handle", 
   "bad AUTH parameters in the SMTP transaction."
  ], 
  "revision_id": "107974"
 }, 
 {
  "author": "pgoldstein", 
  "date": "2002-08-10T23:13:12.000000Z", 
  "msg": [
   "Improved the synchronization and state handling for LinearProcessor.java.", 
   "Added comments to LinearProcessor.java", 
   "Encapsulated and refactored the end of processor chain logic.", 
   "Changed the code so renaming of mails resubmitted to the spool is no", 
   "longer necessary.", 
   "Thanks to Steve Short and Shilpia Dalmia for the original revisions of these", 
   "changes", 
   "Special thanks to Noel Bergman for his comments as well as his work to debug", 
   "an issue with the original submission."
  ], 
  "revision_id": "107973"
 }, 
 {
  "author": "pgoldstein", 
  "date": "2002-08-10T17:53:08.000000Z", 
  "msg": [
   "Adding code to log IOException details for an exception observed on a", 
   "RemoteManager."
  ], 
  "revision_id": "107972"
 }, 
 {
  "author": "pgoldstein", 
  "date": "2002-08-10T17:24:02.000000Z", 
  "msg": [
   "This is a correction to the SMTP AUTH code to close an open relay hole.", 
   "In short, there was an unnecessary clause in the SMTP AUTH code that", 
   "excluded emails with null senders from validation, under the premise", 
   "that these are delivery failure notifications.", 
   "This is incorrect.  Delivery failure notifications generated by the", 
   "James server are placed directly on the outgoing spool.  With SMTP", 
   "AUTH configured external delivery failure notifications should", 
   "be routed through the James server if and only if they are", 
   "intended for delivery to the James server.  Most critically,", 
   "before this patch a James server in a minimal SMTP AUTH config is", 
   "recognized as an open relay by ORDB.org.  After, it is not."
  ], 
  "revision_id": "107971"
 }, 
 {
  "author": "pgoldstein", 
  "date": "2002-08-10T01:05:51.000000Z", 
  "msg": [
   "*** empty log message ***"
  ], 
  "revision_id": "107970"
 }
]