[
 {
  "author": "jbonofre", 
  "date": "2011-03-18T14:22:15.754303Z", 
  "msg": [
   "[SM-2055] Prepare ServiceMix 3.4 release."
  ], 
  "revision_id": "1082935"
 }, 
 {
  "author": "trawick", 
  "date": "2011-03-18T14:21:33.126283Z", 
  "msg": [
   "transformation"
  ], 
  "revision_id": "1082934"
 }, 
 {
  "author": "trawick", 
  "date": "2011-03-18T14:21:01.729267Z", 
  "msg": [
   "describe the ap_log_error(...,ap_server_conf,...) idiom"
  ], 
  "revision_id": "1082933"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-03-18T14:16:03.299375Z", 
  "msg": [
   "Summary:", 
   "Implemented support for the EmbeddedSolrServerProvider to manage an internal Solr Server when running outside an OSGI Environment. This will be used to improve current Indexing Tools (related to STANBOL-92). Also improved the configuration capabilities for the storage location of the internal Solr Server and adapted the default configuration of the Apache Stanbol Enhancer full launcher to use this feature.", 
   "Details:", 
   "Entityhub: SolrYard", 
   "The EmbeddedSolrServerProvider can now also initialise and register an EmbeddedSolrServer when running outside an OSGI Environment. This is important for the indexing utils (e.g. for geonames.org, dbPedia.orf ...) because this allows to modify such tools to automatically create an EmbeddedSolrServer within there working directory. Users do no longer setup the SolrServer first! (related to STANBOL-92)", 
   "Added support that allows to configure the default location of the managed EmbeddedSolrServer: Within an OSGI environment the component configuration is used otherwise the property is searched in the System properties.", 
   "In case an relative path is configured the:", 
   "- \"user.dir\" property is used when outside an OSGI environment", 
   "- data directory of the SolrYard bundle", 
   "is used as root directory (for applying the relative path)", 
   "Note that also property substitution is supported so parsing \"${user.home}/.stanbol/entityhub/solrYard/indexes\" will create the indexes in the home directory of the user!", 
   "The internally managed SolrServer is now shutdown if the EmbeddedSolrServerProvider is deactivated. On activation the server is started again.", 
   "The SolrYardTest uses now both the support for managing an internal SolrServer when running outside an OSGI environment as the property substitution feature to parse \"${basedir}/target/indexes\" as index location. The \"basedir\" property is set by JUnit.", 
   "This allowed to remove all the resources previously required for this UnitTest.", 
   "Entityhub: ClerezzaYard", 
   "Corrected a missing dependency to the ClerezzaModel implementation", 
   "Enhancer: Full Launcher Configuration", 
   "Added a configuration for the EmbeddedSolrServerProvider so that the default Solr Index of the SolrYard is located at \"${user.dir}/sling/entityhub/solrYard/indexes\". Previously the index was stored under \"/sling/felix/bundle?/data/index\" - a location a user would not expect application data."
  ], 
  "revision_id": "1082932"
 }, 
 {
  "author": "bommel", 
  "date": "2011-03-18T14:15:54.114944Z", 
  "msg": [
   "added rat plugin configuration"
  ], 
  "revision_id": "1082931"
 }
]