[
 {
  "author": "jonm", 
  "date": "2011-03-23T19:59:00.831957Z", 
  "msg": [
   "HTTPCLIENT-1073: caching module should not reject an origin 405", 
   "(Method Not Allowed) response just because it is missing an Allow", 
   "header, even though this is required by RFC2616; this has no", 
   "effect on the caching module itself. (backport of r1084610 from trunk", 
   "to 4.1.x branch)"
  ], 
  "revision_id": "1084705"
 }, 
 {
  "author": "jonm", 
  "date": "2011-03-23T19:56:42.823267Z", 
  "msg": [
   "HTTPCLIENT-1073: if caching module strips off a body for an origin response", 
   "that should not contain one, it should consume the body off the connection", 
   "as well to ensure resources are released. (backport of r1084607 from trunk", 
   "to 4.1.x branch)"
  ], 
  "revision_id": "1084704"
 }, 
 {
  "author": "norman", 
  "date": "2011-03-23T19:55:58.104120Z", 
  "msg": [
   "Make sure we return the SMTPResponse back to client if needed. Thanks to Felix for spot this!"
  ], 
  "revision_id": "1084703"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-03-23T19:55:01.062081Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 1084671\"", 
   "------------------------------------------------------------------------", 
   "r1084671 | jleroux | 2011-03-23 19:52:45 +0100 (mer., 23 mars 2011) | 6 lines", 
   "A modified patch from Konstantin Nikkel \"Exception while creating a productBarCode\" https://issues.apache.org/jira/browse/OFBIZ-4226 - OFBIZ-4226", 
   "If you try to create a barcode of a product that has no productName as content, you get the exception \"Variable pruductName does not exist\".", 
   "An exclamation mark in the \"ProductBarCode.fo.ftl\" manages this problem.", 
   "I added this feature, so I changed it a bit more by using also internalName as default for productName and changed the decorator since now productName is not needed (better to do that only in the ProductBarCode.fo screen, I checked it's no used anywhere else)", 
   "------------------------------------------------------------------------", 
   "?\\026"
  ], 
  "revision_id": "1084702"
 }, 
 {
  "author": "felixk", 
  "date": "2011-03-23T19:54:03.193397Z", 
  "msg": [
   "Methods in final classes are automatically of final modifier"
  ], 
  "revision_id": "1084701"
 }
]