[
 {
  "author": "koji", 
  "date": "2011-03-26T00:38:28.509533Z", 
  "msg": [
   "SOLR-2417: typo"
  ], 
  "revision_id": "1085615"
 }, 
 {
  "author": "daijy", 
  "date": "2011-03-26T00:38:08.813053Z", 
  "msg": [
   "PIG-1934: Fix zebra test TestCheckin1, TestCheckin4"
  ], 
  "revision_id": "1085614"
 }, 
 {
  "author": "mamta", 
  "date": "2011-03-26T00:19:02.033657Z", 
  "msg": [
   "DERBY-5121 Data corruption when executing an UPDATE trigger", 
   "Changes made for DERBY-1482 caused corruption which is being worked", 
   "under DERBY-5121. The issue is that the generated trigger action", 
   "sql could be looking for columns (by positions, not names) in", 
   "incorrect positions. With DERBY-1482, trigger assumed that the", 
   "runtime resultset that they will get will only have trigger columns", 
   "and trigger action columns used through the REFERENCING column.", 
   "That is an incorrect assumption because the resultset could have", 
   "more columns if the triggering sql requires more columns. DERBY-1482", 
   "changes are in 10.7 and higher codelines. Because of this bug, the", 
   "changes for DERBY-1482 have been backed out from 10.7 and 10.8", 
   "codelines so they now match 10.6 and earlier releases. This in", 
   "other words means that the resultset presented to the trigger", 
   "will have all the columns from the trigger table and the trigger", 
   "action generated sql should look for the columns in the trigger", 
   "table by their absolution column position in the trigger table.", 
   "This disabling of code will make sure that all the future triggers", 
   "get created correctly. The existing triggers at the time of", 
   "upgrade (to the releases with DERBY-1482 backout changes in them)", 
   "will get marked invalid and when they fire next time around with", 
   "the release with DERBY-1482 changes backed out, the regenerated sql", 
   "for them will be generated again and they will start behaving", 
   "correctly. So, it is *highly* recommended that the users upgrade", 
   "from 10.7.1.1 to next point release of 10.7 or to 10.8"
  ], 
  "revision_id": "1085613"
 }, 
 {
  "author": "rding", 
  "date": "2011-03-26T00:07:41.876932Z", 
  "msg": [
   "PIG-1931: Integrate Macro Expansion with New Parser"
  ], 
  "revision_id": "1085612"
 }, 
 {
  "author": "reto", 
  "date": "2011-03-26T00:05:03.905137Z", 
  "msg": [
   "CLEREZZA-475: the static web resources where missing all together, added them clerezza-inf style, not sure what happened to the old fileserver"
  ], 
  "revision_id": "1085611"
 }
]