[
 {
  "author": "ssc", 
  "date": "2011-03-30T19:36:37.578156Z", 
  "msg": [
   "MAHOUT-643 Wrong parameter order in LoglikelihoodSimilarity and DistributedLoglikelihoodVectorSimilarity"
  ], 
  "revision_id": "1087055"
 }, 
 {
  "author": "jrbauer", 
  "date": "2011-03-30T19:32:41.774885Z", 
  "msg": [
   "OPENJPA-1966 Updated attach strategies to query attach cache before going to the broker for entity references.  Prevents merging in a detached entity that is being used for field attachment."
  ], 
  "revision_id": "1087054"
 }, 
 {
  "author": "antelder", 
  "date": "2011-03-30T19:32:33.230976Z", 
  "msg": [
   "Set the logging level for hazelcast classes to WARNING when the Tuscany level is the default (INFO) level. Thats because hazelcast creates lots of info log messages especially when using the client which we don't really need or want to see. When necessary those hazelcast messages can still be got by setting the tuscany or individual hazxelcast classes to log level to FINE"
  ], 
  "revision_id": "1087053"
 }, 
 {
  "author": "aconway", 
  "date": "2011-03-30T19:30:16.031647Z", 
  "msg": [
   "QPID-3129: cluster_tests.LongTests.test_failover hangs", 
   "Fix is a race condition in posix/Socket.cpp Socket::connect.", 
   "When connecting to a port on the same host which no longer has a", 
   "process associated with it the OS occasionally chooses the remote", 
   "port (which is unoccupied) as the port to bind the local end of the", 
   "socket, resulting in a \"circular\" connection.", 
   "This seems like something the OS should prevent but I have confirmed", 
   "that the sporadic hangs in cluster_tests.LongTests.test_failover on", 
   "RHEL5 are caused by such a circular connection.", 
   "The fix is to detect circular connections and raise an error."
  ], 
  "revision_id": "1087052"
 }, 
 {
  "author": "tabish", 
  "date": "2011-03-30T19:26:59.358220Z", 
  "msg": [
   "fix for https://issues.apache.org/jira/browse/AMQCPP-358 on 3.2.x fixes branch."
  ], 
  "revision_id": "1087051"
 }
]