[
 {
  "author": "tveronezi", 
  "date": "2011-03-31T14:08:21.968773Z", 
  "msg": [
   "Tomahawk version 1.1.6 has an internal dependency issue. Moving to the version 1.1.9."
  ], 
  "revision_id": "1087305"
 }, 
 {
  "author": "jukka", 
  "date": "2011-03-31T14:06:56.241867Z", 
  "msg": [
   "JCR-2890: Deadlock in acl.EntryCollector / ItemManager", 
   "Make it possible to switch from writer to reader preference in", 
   "the DefaultISMLocking class. This makes it possible to work around", 
   "this specific issue, though there may be consequences to write performance", 
   "during heavy concurrent read loads. Note that the FineGrainedISMLocking", 
   "strategy prefers readers."
  ], 
  "revision_id": "1087304"
 }, 
 {
  "author": "jm", 
  "date": "2011-03-31T14:02:15.427601Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "1087303"
 }, 
 {
  "author": "cmpilato", 
  "date": "2011-03-31T14:01:31.085240Z", 
  "msg": [
   "Followup to r1087015, fixing some minor problems and explicitly", 
   "testing the failure mode.", 
   "* subversion/libsvn_client/switch.c", 
   "(switch_internal): When erroring out due to unrelated resources,", 
   "point out which resources were unrelated.", 
   "* subversion/svn/switch-cmd.c", 
   "(svn_cl__switch): Wrap an error string with the _() macro.", 
   "* subversion/tests/cmdline/basic_tests.py", 
   "(basic_switch): Tweak this test to first try to switch without", 
   "--ignore-ancestry, expecting an error, before doing the original switches."
  ], 
  "revision_id": "1087302"
 }, 
 {
  "author": "cstamas", 
  "date": "2011-03-31T13:52:09.731251Z", 
  "msg": [
   "MINDEXER-14 and others.", 
   "* re-introduced \"count\" on AbstractSearchRequest to overcome problem of Group searches being \"wide open\" for OOM and no way to limit them.", 
   "* cleanup the API wrt \"search paging\": there was paging support in indexer, but it never worked for grouped and flat searches. Only pageable search was much later implemented Iterator search. Now, the API properly reflects this fact, unlike before, when it suggested that flat and grouped supports paging but actually they did not.", 
   "* Javadoc improvements, clearing up the meaning of \"count\" and hits.", 
   "* Some UTs commented out -- those that were testing (and were disabled) paging on flat search, but actually did nothing, see MINDEXER-22 for more."
  ], 
  "revision_id": "1087301"
 }
]