[
 {
  "author": "tabish", 
  "date": "2011-03-30T19:24:22.849015Z", 
  "msg": [
   "fix for https://issues.apache.org/jira/browse/AMQCPP-358", 
   "Adds some small refactoring to support future work needed."
  ], 
  "revision_id": "1087050"
 }, 
 {
  "author": "mamta", 
  "date": "2011-03-30T19:23:11.933538Z", 
  "msg": [
   "DERBY-5121 Data corruption when executing an UPDATE trigger", 
   "With the earlier checkin for DERBY-5121, DERBY-1482 changes weren't completely backed out on trunk and 10.7. We have backed out", 
   "the code for the triggers so that now triggers look for the columns in their actual column positions at execution time. But", 
   "DERBY-1482 also made changes to UPDATE code to read only the colunms needed by it and the triggers that it is going to fire.", 
   "We need to backout the changes to UPDATE code to make sure that it reads all the columns from the trigger table and not do", 
   "selective column reading.", 
   "Also adding an upgrade case testing the behavior of UPDATE reading correct columns from the trigger table so that trigger", 
   "finds the columns it needs.", 
   "derbyall and junit suite runs fine with these changes"
  ], 
  "revision_id": "1087049"
 }, 
 {
  "author": "arobinson74", 
  "date": "2011-03-30T19:22:26.867390Z", 
  "msg": [
   "TRINIDAD-2072 - apply Gary VanMatre's patch to the 1.2.12.5.0 branch"
  ], 
  "revision_id": "1087048"
 }, 
 {
  "author": "mgoulish", 
  "date": "2011-03-30T19:11:09.226191Z", 
  "msg": [
   "qpid-3171", 
   "The registration of the codec happens on a different thread from the", 
   "use of the codec.  It is possible for the registration to occur after", 
   "the first attempted use.  In my testing, this happened 3% of the time", 
   "-- 165 times out of 5000 tests -- when using RDMA transport, and 0 times", 
   "out of 5000 when using TCP.  Which is why we didn't notice it earlier.", 
   "We have a function that tells when we are ready to encode --", 
   "CyrusSecurityLayer::canEncode.  But it does not check the validity of", 
   "the codec pointer before using it, so it cores in this situation.", 
   "I believe simply checking that pointer is probably the best solution.", 
   "Introducing that check caused the crash not to show up in 10,000", 
   "trials.  There were also no hangs."
  ], 
  "revision_id": "1087047"
 }, 
 {
  "author": "eevans", 
  "date": "2011-03-30T19:06:03.233271Z", 
  "msg": [
   "set level to DEBUG for tests (inadvertently changed to TRACE)", 
   "Patch by eevans"
  ], 
  "revision_id": "1087046"
 }
]