[
 {
  "author": "bdelacretaz", 
  "date": "2011-04-06T13:25:46.498961Z", 
  "msg": [
   "STANBOL-146 - DataFileProvider service (WIP, no OSGi console plugin yet)"
  ], 
  "revision_id": "1089445"
 }, 
 {
  "author": "joern", 
  "date": "2011-04-06T13:24:37.489618Z", 
  "msg": [
   "UIMA-2100 Improved output folder handling"
  ], 
  "revision_id": "1089444"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-04-06T13:14:26.684648Z", 
  "msg": [
   "This revision adds support to install ReferencedSites for the Entityhub by adding a Bundle to the OSGI Web Console.", 
   "STANBOL-141: Adds Support for installing SolrIndexes provided as archives with the name <indexName>.solrindex.[<compressionFormat>] where", 
   "- indexname is the name of the core added to the EmbeddedSolrServer managed by the SolrYard", 
   "- compressionFormat is the format used for the archive. ZIP is the default.", 
   "Open:", 
   "- support for uninstalling Solr Indexes", 
   "The implementation is part of the SolrYard Bundle.", 
   "STANBOL-140: Adds Support for installing resources contained in Bundles that define the \"Install-Path\" header in there manifest.", 
   "Open:", 
   "- remove configuration if a Bundle is uninstalled", 
   "- update the configuration if an bundle is updated", 
   "- no support for Jars.", 
   "The implementation can be found in\"/commons/installer/bundleprovider\"", 
   "other Changes", 
   "SolrYard:", 
   "- added the functionality to add SolrIndexes to the SolrDirectoryManager", 
   "- moved the ConfigUtils to the impl package because it is no longer intended to be used from outside of the SolrYard bundle", 
   "- Text Queries for multiple words now create \"Word1 AND Word2 AND Wordn\" type SolrQueries. Previously \"Word1+Word2+Wordn\" was used. This had not worked with the the Tokenizers used for  such fields. Queries in STR field (that do not use Tokenizers) still use the old pattern.", 
   "- adapted unit test", 
   "Stanboltools/Offline", 
   "- the pom.xml now uses the parent", 
   "Enhancer/Full launcher", 
   "- added the BundleInstaller: Now it is possible to install ReferencedSites for the Entityhub by adding a Bundle to the OSGI Web Console"
  ], 
  "revision_id": "1089443"
 }, 
 {
  "author": "mukulg", 
  "date": "2011-04-06T13:14:11.961593Z", 
  "msg": [
   "removing little bit of redundant code."
  ], 
  "revision_id": "1089442"
 }, 
 {
  "author": "carlucci", 
  "date": "2011-04-06T13:12:34.171440Z", 
  "msg": [
   "added my name to the contributor list"
  ], 
  "revision_id": "1089441"
 }
]