[
 {
  "author": "rhuijben", 
  "date": "2011-04-09T23:54:31.301271Z", 
  "msg": [
   "Two small optimizations in the commit handler: Assume absolute paths are", 
   "already absolute and only send fulltexts for local additions, instead of", 
   "for additions and copies.", 
   "* subversion/libsvn_client/commit_util.c", 
   "(svn_client__do_commit): Don't make path absolute. Use one for for calling", 
   "callbacks. Extend fulltext check."
  ], 
  "revision_id": "1090715"
 }, 
 {
  "author": "sebb", 
  "date": "2011-04-09T23:54:15.629559Z", 
  "msg": [
   "Ensure that tailer is stopped even if test aborts"
  ], 
  "revision_id": "1090714"
 }, 
 {
  "author": "rhuijben", 
  "date": "2011-04-09T23:51:34.847644Z", 
  "msg": [
   "Assume that the pristine sharding directory already exists when installing", 
   "the pristine; in any reasonably sized working copy this is more likely then", 
   "assuming that it doesn't exist.", 
   "Instead of always taking the pain of trying to create a new directory we can", 
   "just try to create the directory if the rename fails. The new code outperforms", 
   "the old code on installs when there are/were more then 128 unique files in the", 
   "pristine store (assuming the first byte of their sha1 is random).", 
   "On Windows the old always create directory code took about 2% of the checkout", 
   "time of ^/subversion/trunk from a local mirror.", 
   "(Pristine install was 4.3% and is now 1.9% of the checkout time)", 
   "* subversion/libsvn_wc/wc_db_pristine.c", 
   "(pristine_install_txn): Pass false for make dir.", 
   "(pristine_install_txn): When the rename fails because we see", 
   "a ENOENT error, try to create the directory and retry."
  ], 
  "revision_id": "1090713"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2011-04-09T23:50:51.012624Z", 
  "msg": [
   "using an hashset is more canonical to store already load resources"
  ], 
  "revision_id": "1090712"
 }, 
 {
  "author": "jbellis", 
  "date": "2011-04-09T23:46:28.558963Z", 
  "msg": [
   "Add unified UUIDType", 
   "patch by Ed Anuff; reviewed by jbellis for CASSANDRA-2233"
  ], 
  "revision_id": "1090711"
 }
]