[
 {
  "author": "rwesten", 
  "date": "2011-04-11T12:25:07.855343Z", 
  "msg": [
   "STANBOL-141: The last missing things to support for Installing SolrIndexes based on Archives.", 
   "Added support for Index Data References (Index Archives that just contain a link to the actual data). The reference to the index data is resolved by the DataFileProvider Service. The SolrYard now keeps track of \"uninitialised indexes\" - this are indexes that where installed, but could not be initialised because the required data where not available via the DataFileProvider service.", 
   "- Updated the SolrDirectoryManager interface to deal with \"uninitialized\" indexes.", 
   "- Added a parameter to the SolrYardConfig that allows to specify if the Solr Index is allowed to be initialised with the default schema (and without data).", 
   "- The DefaultSolrDirectoryManager now keeps a persistent list of \"uninitialised\" indexes. This means that index data references (property files) are stored within the data directory of the SolrYard bundle so that they can be resent to the DataFileProvider service when the initialisation of the index is requested the next time.", 
   "This functionality requires an OSGI environment. In case the SolrYard is running outside an OSGI Environment such methods will throw an IllegalStateException with an according message.", 
   "Note that directly including the index data in the solr archive is still supported and still the preferred way to go for small or empty indexes. Empty indexes can be used to use a special Solr Schema/Configuration for the initialisation of an yard."
  ], 
  "revision_id": "1091050"
 }, 
 {
  "author": "andygumbrecht", 
  "date": "2011-04-11T12:17:05.990427Z", 
  "msg": [
   "Hibernate 3.6.3.Final"
  ], 
  "revision_id": "1091049"
 }, 
 {
  "author": "gertv", 
  "date": "2011-04-11T12:00:36.136194Z", 
  "msg": [
   "KARAF-564: Add missing org.apache.karaf.features.obr.cfg file to assembly"
  ], 
  "revision_id": "1091048"
 }, 
 {
  "author": "gertv", 
  "date": "2011-04-11T12:00:12.104192Z", 
  "msg": [
   "KARAF-564: Add missing org.apache.karaf.features.obr.cfg file to assembly"
  ], 
  "revision_id": "1091047"
 }, 
 {
  "author": "nick", 
  "date": "2011-04-11T11:52:37.738380Z", 
  "msg": [
   "TIKA-622 - Switch the POI based parser from the old POIFS to the new, lower memory NPOIFS"
  ], 
  "revision_id": "1091046"
 }
]