[
 {
  "author": "vincenzo", 
  "date": "2004-07-27T15:12:57.000000Z", 
  "msg": [
   "Fixes JAMES-312: AttachmentFileNameIs matcher may throw an Exception examining a multipart/alternative message. Such messages do not have attachments and so the matcher should simply fail."
  ], 
  "revision_id": "109174"
 }, 
 {
  "author": "vincenzo", 
  "date": "2004-07-27T15:05:08.000000Z", 
  "msg": [
   "Fixes JAMES-312: AttachmentFileNameIs matcher may throw an Exception examining a multipart/alternative message. Such messages do not have attachments and so the matcher should simply fail."
  ], 
  "revision_id": "109173"
 }, 
 {
  "author": "mcconnell", 
  "date": "2004-07-18T05:58:33.000000Z", 
  "msg": [
   "Remove the implementation dependencies on store by putting a couple of the old io util classes into james.util.io and updating references in the james sources."
  ], 
  "revision_id": "109172"
 }, 
 {
  "author": "sbrewin", 
  "date": "2004-07-17T20:03:52.000000Z", 
  "msg": [
   "Resolution for Jira issue JAMES-270.", 
   "Resolution for Jira issue JAMES-300.", 
   "Workaround to circumvent dependency on Jira issue JAMES-302.", 
   "JAMES-270: Mail attributes are added to notify hen default values are used.", 
   "JAMES-300: Fixed missing assignment of headers value.", 
   "JAMES-302: Replaced use of the literal 'localhost' with the canonical name of the local machine and if this cannot be deduced, with the loopback address 127.0.0.1.", 
   "Also fixed up linefeeds in the source. Should now all be Unix format."
  ], 
  "revision_id": "109171"
 }, 
 {
  "author": "vincenzo", 
  "date": "2004-07-16T13:46:16.000000Z", 
  "msg": [
   "Added:", 
   "1) Fixed JIRA JAMES-303 \"AttachmentFileNameIs matcher should be able to analyze zip file attachments\"", 
   "2) Fixed JIRA JAMES-305 \"AttachmentFileNameIs never matches if the message is S/MIME signed\". Does recursion, looking for embedded multiparts.", 
   "3) Fixed JIRA JAMES-306 \"AttachmentFileNameIs may throw UnsupportedEncodingException\".", 
   "a) Such exceptions are totally harmless and as such are now completely ignored.", 
   "b) Other exceptions are thrown up (to be handled by \"onMatchException\" clause) and now logged if debug is requested (\"-d\" parameter).", 
   "To analyze zip files code", 
   "... match=\"AttachmentFileNameIs=-z ...\";", 
   "to debug code", 
   "... match=\"AttachmentFileNameIs=-d ...\"."
  ], 
  "revision_id": "109170"
 }
]