[
 {
  "author": "erwan", 
  "date": "2011-04-15T14:04:58.571152Z", 
  "msg": [
   "Automatic imports reorganization in SeleniumXml.java -- no functional changes"
  ], 
  "revision_id": "1092710"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2011-04-15T13:58:59.051906Z", 
  "msg": [
   "Commented a sysout that was showing in the tests."
  ], 
  "revision_id": "1092709"
 }, 
 {
  "author": "rhuijben", 
  "date": "2011-04-15T13:57:32.372373Z", 
  "msg": [
   "Make the commit processing of a file an atomic operation again by using the", 
   "working queue the way it was intended; but temporary in the wrong place.", 
   "This is the last step before removing the commit post processing from the", 
   "working queue and performing the changes directly instead.", 
   "(Installing information in the DB which tells us what to change in the DB...)", 
   "* subversion/libsvn_wc/workqueue.c", 
   "(OP_DELETION_POSTCOMMIT,", 
   "OP_POSTCOMMIT): Move to 'to be removed' in preparation for my next patch.", 
   "(OP_FILE_COMMIT): New define.", 
   "(process_commit_file_install): New function, extracted from log_do_committed.", 
   "(log_do_committed): Use svn_wc__wq_build_file_commit() to build a work item", 
   "that calls process_commit_file_install() instead of doing the work", 
   "directly.", 
   "(run_file_commit): New function.", 
   "(svn_wc__wq_build_file_commit): New function.", 
   "(dispatch_table): Move commit operations down and insert OP_FILE_COMMIT.", 
   "* subversion/libsvn_wc/workqueue.h"
  ], 
  "revision_id": "1092708"
 }, 
 {
  "author": "scottbw", 
  "date": "2011-04-15T13:56:53.096554Z", 
  "msg": [
   "Removed the \"convenience\" methods for getting shared data from the Widget and WidgetInstance beans and replaced with accessing the SharedDataHelper facade - this is mainly to make sure all access to shared data uses the same method so we can simplify the data model more easily, but also as it cuts out a fair amount of boilerplate code that has to be implemented across both the JPA and JCR persistence frameworks."
  ], 
  "revision_id": "1092707"
 }, 
 {
  "author": "erwan", 
  "date": "2011-04-15T13:55:38.438795Z", 
  "msg": [
   "Now OFBiz is able to run HTML selenium testsuites. Non specific java code is coming from SeleniumHtmlClient (https://github.com/takamori/selenium-html-client-driver) which is under the Apache2 license.", 
   "A testsuite is provided with the commit, just go to the selenium webtools' page, and execute it. For now, you still need to change the url.properties file, and start the selenium server."
  ], 
  "revision_id": "1092706"
 }
]