[
 {
  "author": "stefan", 
  "date": "2011-04-15T16:37:54.467168Z", 
  "msg": [
   "MicroKernel prototype (WIP)"
  ], 
  "revision_id": "1092760"
 }, 
 {
  "author": "cmpilato", 
  "date": "2011-04-15T16:27:50.709600Z", 
  "msg": [
   "Fix issue #3857 (\"Segmentation Fault in foreign repository merge with", 
   "prop conflict (propmod atop missing prop)\").", 
   "* subversion/libsvn_wc/util.c", 
   "(svn_wc__cd2_to_cd): Don't operate on NULL paths.", 
   "* subversion/tests/cmdline/merge_tests.py", 
   "(foreign_repos_prop_conflict): New regression test.", 
   "(test_list): Add reference to new test."
  ], 
  "revision_id": "1092759"
 }, 
 {
  "author": "jcian", 
  "date": "2011-04-15T16:26:20.531533Z", 
  "msg": [
   "Missed the copyright in PageService (I had created it before I had my IDE setup to insert the copyright automatically in new files).  Sorry for the extra commit..."
  ], 
  "revision_id": "1092758"
 }, 
 {
  "author": "jcian", 
  "date": "2011-04-15T16:18:57.368096Z", 
  "msg": [
   "It seemed like we'd reached lazy consensus on the mailing list to go ahead with POJO's models for now and move to interfaces later if needed, so I went ahead and updated our models to be concrete POJO's.  I also went ahead and made the following changes:", 
   "-- Moved the models and internationalization support up one level from the web package to the portal package (since there didn’t seem to be anything web specific about them).", 
   "-- Removed the internationalization support from the name field on the Page object since that is something that I think users will be entering when they create their pages.", 
   "-- Added in packages and stub empty interfaces for the service and repository layers (which I'm planning to continue to fill in, but not sure I'll get to it today so I wanted to at least check in what I had).", 
   "-- Changed the render sequence field on the RegionWidget to render position instead (for reasons documented in the JavaDoc for the getter, so I won't repeat them here).  I will add however that I'm not crazy about the idea of overloading the type of data contained in that field, but it seems the simplest mechanism for doing what is described in the JavaDoc.  If anyone feels strongly about it please feel free to propose an alternate solution."
  ], 
  "revision_id": "1092757"
 }, 
 {
  "author": "jeromer", 
  "date": "2011-04-15T16:17:13.467816Z", 
  "msg": [
   "- Added missing PHPDoc"
  ], 
  "revision_id": "1092756"
 }
]