[
 {
  "author": "kylem", 
  "date": "2004-12-01T19:33:41.587807Z", 
  "msg": [
   "Implemented full support for providing custom BeanInfo data via JSR-175 annotations.  Annotation", 
   "types now exist for all of the various java.beans.*Descriptor classes in the", 
   "org.apache.beehive.controls.api.packaging package. These annotations are used in the generation", 
   "of custom BeanInfo.   Providing custom BeanInfo data is now supported for bean type (interface and", 
   "extension), bean methods (and their parameters), bean properties, bean event sets (and event", 
   "methods and their parameters).  The controls test suite has a util class", 
   "(org.apache.beehive.test.controls.util.ControlIntrospector) that will introspect and dump", 
   "BeanInfo data in an XML format and a test case that uses BeanInfo annotations and validates", 
   "them against expected results.  Still remaining is a mechanism where annotations can contain", 
   "string data that indirects to a resource bundle (to support localization).", 
   "Did some fairly major cleanup of the controls codegen support in", 
   "org.apache.beehive.runtime.generator.*.   Refactored and removed a vestigial layer of", 
   "abstraction that was just making things more complicated than necessary.", 
   "Fixed JIRA issue: (BEEHIVE-97) Event notifiers aren't registered for Control extensions"
  ], 
  "revision_id": "109374"
 }, 
 {
  "author": "erodriguez", 
  "date": "2004-12-01T19:26:34.246725Z", 
  "msg": [
   "Tweaks and updates to sitedocs."
  ], 
  "revision_id": "109373"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-12-01T19:23:56.133863Z", 
  "msg": [
   "thanks to Trustin this change fixes the deadlock issues"
  ], 
  "revision_id": "109372"
 }, 
 {
  "author": "rich", 
  "date": "2004-12-01T19:21:03.533195Z", 
  "msg": [
   "Some small mods to MutableURI:", 
   "- Changed ArrayList to List wherever it appeared in APIs (return values, method arguments).", 
   "- Fixed an NPE in getParameters when there are no parameters.", 
   "- Changed addParameters() to accept an empty map of parameters.", 
   "Also added the missing META-INF directory for beehive-netui-tomcat-webapp-5x.jar.", 
   "DRT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "109371"
 }, 
 {
  "author": "ips", 
  "date": "2004-12-01T19:18:16.119665Z", 
  "msg": [
   "."
  ], 
  "revision_id": "109370"
 }
]