[
 {
  "author": "ssc", 
  "date": "2011-04-17T10:09:42.659567Z", 
  "msg": [
   "MAHOUT-667 Persistent storage of factorizations in SVDRecommender"
  ], 
  "revision_id": "1094125"
 }, 
 {
  "author": "berndf", 
  "date": "2011-04-17T10:09:16.070760Z", 
  "msg": [
   "JAMES-1226: add add/remove methods for domain mappings management"
  ], 
  "revision_id": "1094124"
 }, 
 {
  "author": "davsclaus", 
  "date": "2011-04-17T09:57:02.404411Z", 
  "msg": [
   "CAMEL-3877: Fixed adviceWith when using a context scoped error handler with XML DSL"
  ], 
  "revision_id": "1094123"
 }, 
 {
  "author": "mtylenda", 
  "date": "2011-04-17T09:27:31.770483Z", 
  "msg": [
   "OPENJPA-1932: Documentation update: Update links to Java Logging Overview and jconsole."
  ], 
  "revision_id": "1094122"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-04-17T09:17:21.010924Z", 
  "msg": [
   "A patch from Pierre Gaudin \"Add a parameter to forbid order decimal quantity\" https://issues.apache.org/jira/browse/OFBIZ-4257", 
   "Behavior before the patch :", 
   "* you can add decimal quantity on shopping cart item (front office and back office) even if the product is a unit", 
   "* there is no rounding on quantity on shopping cart item thus you get amount with a large number of decimal", 
   "* reorder widget display quantity to reorder with a large number of decimal", 
   "What does this patch :", 
   "* a new field \"orderDecimalQuantity\" is added into ProducStore entity. The value of this field can be set from EditProducStore form (into shopping cart section). Value can be \"Y\", \"N\" or empty.", 
   "* a new field \"orderDecimalQuantity\" is added into Product entity. The value of this field can be set from EditProduc form (into shopping cart section). Value can be \"Y\", \"N\" or empty.", 
   "* a new method \"isDecimalQuantityOrderAllowed\" have been add into productWorker class. This method test if order decimal quantity is allow for a product and a productStore. Product is superior on producStore. Here is the table of value :", 
   "* ProductStore.orderDecimalQuantity = \"Y\" && Product.orderDecimalQuantity = \"Y\" => return True", 
   "* ProductStore.orderDecimalQuantity = \"N\" && Product.orderDecimalQuantity = \"Y\" => return True", 
   "* ProductStore.orderDecimalQuantity = empty && Product.orderDecimalQuantity = \"Y\" => return True", 
   "* ProductStore.orderDecimalQuantity = \"Y\" && Product.orderDecimalQuantity = \"N\" => return False", 
   "* ProductStore.orderDecimalQuantity = \"N\" && Product.orderDecimalQuantity = \"N\" => return False", 
   "* ProductStore.orderDecimalQuantity = empty && Product.orderDecimalQuantity = \"N\" => return False", 
   "* ProductStore.orderDecimalQuantity = \"Y\" && Product.orderDecimalQuantity = empty => return True", 
   "* ProductStore.orderDecimalQuantity = \"N\" && Product.orderDecimalQuantity = empty => return False", 
   "* ProductStore.orderDecimalQuantity = empty && Product.orderDecimalQuantity = empty => return True", 
   "* addToCat and modifyCart car method have been modify to call isDecimalQuantityOrderAllowed. If result is true then quantity is rounding with order config value. If result is false then quantity is rounding to 0. No message is return.", 
   "* to fix reorder quantity, then getQuickReorderProducts method have been modify to call isDecimalQuantityOrderAllowed. If result is true then quantity is rounding with order config value. If result is false then quantity is rounding to 0.", 
   "What the result :", 
   "* You can forbid or accept to manage order decimal quantity for all product", 
   "* You can forbid or accept to manage order decimal quantity for one product", 
   "* Decimal quantity are now rounded with order config value.", 
   "* reorder quantity is rounded with order config value or rounding to 0"
  ], 
  "revision_id": "1094121"
 }
]