[
 {
  "author": "markt", 
  "date": "2011-04-18T16:59:26.546771Z", 
  "msg": [
   "Add missing @Override"
  ], 
  "revision_id": "1094650"
 }, 
 {
  "author": "wrowe", 
  "date": "2011-04-18T16:57:24.520876Z", 
  "msg": [
   "/agree"
  ], 
  "revision_id": "1094649"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-04-18T16:57:23.783461Z", 
  "msg": [
   "resolves STANBOL-175: All methods of the Entityhub now correctly return null instead of an IllegalArgumentException when the creation of a Sign with the wrong type is requested for an parsed ID. This resolves STANBOL-175 because in case null is returned the RESTful service returns the expected NOT_FOUND code.", 
   "Other changes:", 
   "- The type of the Sign is now stored in the Representation. This allows the type checks needed to reslove STANBOL-175", 
   "- All Constructors of the default implementations for Signs (Sign, EntityMapping and Symbol) are now protected. The new DefaultSignFactory needs now to be used to create instances. This change makes now sense because with the added sign type information the new factory allows an easy and consistent way to create Signs.", 
   "- Corrected three occasions where ReferencedSite specific configuration had not overridden defaults of the Entityhub.", 
   "- Some clarification in the JavaDoc of the Entityhub Interfaces (especially related to RuntimeExceptions)", 
   "- All Enumerations for States and the new one for SignTypes do now include static methods to lookup the Enum instance for the URL", 
   "Changes in Entityhub Jerey", 
   "Added the Documentation for the RESTful API had some side effects. Especially a missing Accept header on a normal service call caused to HTML documentation to be returned.", 
   "Changed the Implementation to only return the Documentation if \"text/html\" is part of the Accept header AND if no further (form) parameters are parsed with the request."
  ], 
  "revision_id": "1094648"
 }, 
 {
  "author": "jbellis", 
  "date": "2011-04-18T16:56:57.991928Z", 
  "msg": [
   "avoid caching token-only decoratedkeys", 
   "patch by jbellis; reviewed by slebresne for CASSANDRA-2416"
  ], 
  "revision_id": "1094647"
 }, 
 {
  "author": "mturk", 
  "date": "2011-04-18T16:54:32.069125Z", 
  "msg": [
   "Add more Posix api methods. We'll use those where ever possible"
  ], 
  "revision_id": "1094646"
 }
]