[
 {
  "author": "rhuijben", 
  "date": "2011-04-18T20:41:33.782330Z", 
  "msg": [
   "* subversion/libsvn_wc/questions.c", 
   "(compare_and_verify): Disable the extra check I added in r1094733. Our", 
   "testsuite thinks its ok, but I don't trust this enough yet."
  ], 
  "revision_id": "1094735"
 }, 
 {
  "author": "aconway", 
  "date": "2011-04-18T20:40:53.672741Z", 
  "msg": [
   "QPID-3208: Exchanges make best effort to route messages if there is an error.", 
   "Previously if multiple queues were bound to the same routing key,", 
   "then a failure to deliver to one of the queues (e.g. policy limit", 
   "error) could prevent delivery on some of the other queues.", 
   "With this commit the exchange delivers to every queue that did not", 
   "have an error before raising an error.", 
   "Note: this was originally committed as r1092765, but it caused test", 
   "failures was reverted as r1092804. The original commit did not create", 
   "exceptions of the correct type."
  ], 
  "revision_id": "1094734"
 }, 
 {
  "author": "rhuijben", 
  "date": "2011-04-18T20:35:14.050651Z", 
  "msg": [
   "* subversion/libsvn_wc/questions.c", 
   "(compare_and_verify): Following up on r1094707, apply one more check to", 
   "avoid comparing.", 
   "(svn_wc__internal_file_modified_p): Update caller and use standard naming", 
   "for variables."
  ], 
  "revision_id": "1094733"
 }, 
 {
  "author": "jcian", 
  "date": "2011-04-18T20:34:15.288842Z", 
  "msg": [
   "Updated HomeController to fetch all pages for the current authenticated user, add them to the model and render out the regions and widgets for the first page in the view.  Currently using static mock data for the authenticated user (until we wire in real authentication) and static mock data for repository layer.  Once we're all comfortable with where the current code is heading (or no one strongly objects) we can go ahead and annotate the models and start doing real persistence."
  ], 
  "revision_id": "1094732"
 }, 
 {
  "author": "gawor", 
  "date": "2011-04-18T20:32:14.819995Z", 
  "msg": [
   "GERONIMO-5918: Resolve unresolved application only"
  ], 
  "revision_id": "1094731"
 }
]