[
 {
  "author": "dvryaboy", 
  "date": "2011-04-22T18:53:54.856057Z", 
  "msg": [
   "PIG-2011: Speed up TestTypedMap.java"
  ], 
  "revision_id": "1095985"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-04-22T18:51:10.415630Z", 
  "msg": [
   "A patch from Nicolas Malin \"Add famfamfam icons has generic and add possibility to surchage\" https://issues.apache.org/jira/browse/OFBIZ-4259", 
   "Adds the possibility to use famfamfam icons contained in framework/images/webapp/images/famfamfam/icons.", 
   "If you want use a specific icon, it's possible to define an attribute VT_ICONS_LOC that contains the location to themes icons directory to use", 
   "It improves form rendering to pass a flexible string on image-location attribute and screen and form renderer to display an image with a text.", 
   "JLR: I just added à &nbsp; before menus texts", 
   "After Erwan's remark I wondered If I should remove the CSS on buttons. But I finally found that it was complementary. Because when no image is used on a specific button you still have the default CSS style applied (typical for Add buttons as Erwan outlined). And when no default CSS style is applied you can have an image like now shown OTTB on print button when editing an Example. So I see these 2 features as complementary for now. Maybe one day, one will replace the other, but at this stage both are welcome IMO.", 
   "BTW the famfamfam (strange name ;o) icons lib is well done and really full of possibilities..."
  ], 
  "revision_id": "1095984"
 }, 
 {
  "author": "sobryan", 
  "date": "2011-04-22T18:48:02.353128Z", 
  "msg": [
   "TRINIDAD-2089 : Patch submitted by Venkata.  Thanks!"
  ], 
  "revision_id": "1095983"
 }, 
 {
  "author": "sobryan", 
  "date": "2011-04-22T18:47:20.463571Z", 
  "msg": [
   "TRINIDAD-2089 : Patch submitted by Venkata.  Thanks!"
  ], 
  "revision_id": "1095982"
 }, 
 {
  "author": "hwright", 
  "date": "2011-04-22T18:44:41.287987Z", 
  "msg": [
   "Make file-private a function which is only used in one file.", 
   "* subversion/libsvn_wc/props.c", 
   "(svn_wc__internal_propset): Rename to...", 
   "(do_propset): ...this.", 
   "(svn_wc_prop_set4): Update caller.", 
   "* subversion/libsvn_wc/props.h", 
   "(svn_wc__internal_propset): Remove."
  ], 
  "revision_id": "1095981"
 }
]