[
 {
  "author": "arkurth", 
  "date": "2011-04-29T14:51:24.450036Z", 
  "msg": [
   "VCL-466", 
   "Added check_cygwin subroutine to Windows.pm. Added call to this subroutine from pre_capture. This subroutine checks/sets the CYGWIN environment variable configured for the sshd service. It should be set to 'ntsec nodosfilewarning'. The 'nodosfilewarning' parameter is necessary to overcome a problem with Cygwin 1.7 where a warning is displayed the first time a DOS-style file path is used to run a command. If the value isn't correct, it sets it and restarts the sshd service. Added get_environment_variable_value and restart_service subroutines to accomplish this.", 
   "Updated Version_6.pm::set_ignore_default_routes to handle computers with a single interface.", 
   "VCL-465", 
   "Updated Windows.pm::get_network_configuration to return the configuration if the computer has a single interface.", 
   "VCL-450", 
   "Updated Linux.pm::remove_existing_vms. Added a check after the matching VMs were deleted to make sure the computer assigned to the reservation isn't responding to SSH. If it is, then there is a VM running which the code couldn't find. This will cause problems and may cause the user to connect to a VM with an image other than the one requested.  If a running VM is detected, an attempt is made to determine the vmx path of the running VM by calling get_active_vmx_file_path. This VM isn't shutdown or deleted but the path is included in the error message.", 
   "Updated VMware.pm::get_active_vmx_file_path to check the type of OS loaded on the computer before calling the OS subroutines. Added OS.pm::get_os_type to accomplish this. The OS doesn't necessarily match the OS of the reservation image so the normal $self->os calls will fail if the OS doesn't match. A new OS object is created and used if they don't match.", 
   "Other", 
   "Copied execute subroutine from Linux.pm to OS.pm since it can be used by Windows too.", 
   "Updated Windows.pm::search_and_replace_in_files to improve error checking.", 
   "Updated Provisioning.pm::wait_for_power_off to make the code more readable and to prevent the possibility of a 'uninitialized concatenation' error from occurring if power_status returns undefined."
  ], 
  "revision_id": "1097825"
 }, 
 {
  "author": "adrianc", 
  "date": "2011-04-29T14:46:18.192467Z", 
  "msg": [
   "Small code cleanup in Base64.java - no functional change."
  ], 
  "revision_id": "1097824"
 }, 
 {
  "author": "arkurth", 
  "date": "2011-04-29T14:17:36.349741Z", 
  "msg": [
   "VCL-464", 
   "Updated Linux.pm::generate_ext_sshd_config to set PasswordAuthentication to yes to ensure it is available when connecting via the public IP address."
  ], 
  "revision_id": "1097823"
 }, 
 {
  "author": "mturk", 
  "date": "2011-04-29T14:01:07.073302Z", 
  "msg": [
   "Use a proper name for OutputStream wrapper"
  ], 
  "revision_id": "1097822"
 }, 
 {
  "author": "davidb", 
  "date": "2011-04-29T13:45:43.246923Z", 
  "msg": [
   "Bug fix in the code that finds the classloader for a bundle (which is pre-4.2 compliant). Also fixed the BundleListener code."
  ], 
  "revision_id": "1097821"
 }
]