[
 {
  "author": "djencks", 
  "date": "2004-12-04T23:20:12.699676Z", 
  "msg": [
   "somewhat better validation checking for web.xml descriptors"
  ], 
  "revision_id": "109829"
 }, 
 {
  "author": "felicity", 
  "date": "2004-12-04T22:24:20.689714Z", 
  "msg": [
   "more dealing with malformed messages"
  ], 
  "revision_id": "109828"
 }, 
 {
  "author": "djencks", 
  "date": "2004-12-04T21:40:28.142287Z", 
  "msg": [
   "fix for GERONIMO-509"
  ], 
  "revision_id": "109827"
 }, 
 {
  "author": "jlaskowski", 
  "date": "2004-12-04T21:09:00.847842Z", 
  "msg": [
   "The first attempt to create a builder for Apache Tomcat.", 
   "It breaks the way Apache Tomcat have been embedded into Geronimo, which means", 
   "no webapps directory is supported. Unfortunatelly, it doesn't work yet, so although", 
   "some webapps can be deployed using the builder they may not run due to missing jars or classes.", 
   "To give it a try uncomment the marked sections in the assembly module's files:", 
   "o modules/assembly/project.xml", 
   "o modules/assembly/src/plan/j2ee-server-plan.xml", 
   "o modules/assembly/src/plan/j2ee-deployer-plan.xml", 
   "and build Geronimo again (actually, the changes require to build assembly module only).", 
   "Hopefully, it won't break the assembly module.", 
   "TODO:", 
   "o Handle classloading for deployed webapps (see TomcatWebAppContext class)", 
   "o Introduce WEB-INF/geronimo-tomcat.xml where Geronimo-specific configuration will be made", 
   "o Generate valid context root (now it's a random string; see TomcatModuleBuilder class)", 
   "NOTE: Currently, the context root of a deployed webapp is generated using System.currentTimeMillis", 
   "and as such it will be visible in your browser", 
   "NOTE: I don't know why but webapps can't be correctly started up. The mysterious 'Error getConfigured' shows up", 
   "(see org/apache/catalina/core/StandardContext:4036). It doesn't only show up while starting up in Geronimo -", 
   "I couldn't get it run as a standalone app. Any ideas?"
  ], 
  "revision_id": "109826"
 }, 
 {
  "author": "djencks", 
  "date": "2004-12-04T20:59:00.318784Z", 
  "msg": [
   "merge trunk changes to rev 109772, second try"
  ], 
  "revision_id": "109825"
 }
]