[
 {
  "author": "davsclaus", 
  "date": "2011-05-03T11:01:28.639568Z", 
  "msg": [
   "Polished"
  ], 
  "revision_id": "1099000"
 }, 
 {
  "author": "philip", 
  "date": "2011-05-03T10:48:43.836673Z", 
  "msg": [
   "Try a non-trigger approach to single-txn delete.  This is sufficient", 
   "to pass all but three Python, and one C, regression tests.", 
   "* subversion/libsvn_wc/wc-queries.sql", 
   "(STMT_UPDATE_OP_DEPTH_RECURSIVE, STMT_DELETE_WORKING_NODE_NOT_DELETED,", 
   "STMT_DELETE_WORKING_ORPHAN, STMT_DROP_DELETE_LIST_TRIGGERS): Remove.", 
   "(STMT_CREATE_DELETE_LIST): Don't create triggers.", 
   "(STMT_INSERT_DELETE_LIST): New.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(op_delete_txn): Explicitly populate delete list, remove all working", 
   "nodes and if necessary insert a whole layer, handle actual nodes.", 
   "(svn_wc__db_op_delete): Don't use triggers.", 
   "* subversion/tests/cmdline/tree_conflict_tests.py", 
   "(query_absent_tree_conflicted_dir): Accept unordered delete notifications."
  ], 
  "revision_id": "1098999"
 }, 
 {
  "author": "davidb", 
  "date": "2011-05-03T10:39:22.691725Z", 
  "msg": [
   "Started documenting SPI-Fly"
  ], 
  "revision_id": "1098998"
 }, 
 {
  "author": "ashish", 
  "date": "2011-05-03T10:34:01.196935Z", 
  "msg": [
   "Most of the new developers start exploring project with README file. Adding reference of Beginner guide in README file so it will be easy for a developer to start development with OFBiz project once they are done with project setup on development machine."
  ], 
  "revision_id": "1098997"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-05-03T10:33:45.686542Z", 
  "msg": [
   "STANBOL-187: Added support for initialising configurations based defaults included in the classpath", 
   "Typically the defaults for the configuration will be included in the classpath and the user will only need to provide (download) the source files (e.g. the RDF dump(s) of dbPedia)", 
   "With this change it is now possible to", 
   "- provide a configuration within the classpath", 
   "- the IndexerConfig will copy missing configurations from the defaults in the classpath", 
   "- there is also support for missing source file, but this feature is only intended to be used with small source files", 
   "Starting the Indexing utility the first time will no copy the default configuration from the classpath to the local directory (default \"indexing/**\"). Users can now use this default to customise there settings.", 
   "A first version of the Indexing utiliy (Main.java directly within the core package) is also included. As the migration work on the current indexers is going on this will most likely be improved, extended and will most likely also move to an own bundle.", 
   "The unit test has been adapted to use the new feature."
  ], 
  "revision_id": "1098996"
 }
]