[
 {
  "author": "crossley", 
  "date": "2004-12-06T08:04:21.081068Z", 
  "msg": [
   "New correlate-table.sh script", 
   "to scan java source files and compare with list from the xdocs table."
  ], 
  "revision_id": "109959"
 }, 
 {
  "author": "crossley", 
  "date": "2004-12-06T08:04:18.489439Z", 
  "msg": [
   "New correlate-table.sh script", 
   "to scan java source files and compare with list from the xdocs table."
  ], 
  "revision_id": "109958"
 }, 
 {
  "author": "dain", 
  "date": "2004-12-06T07:52:06.202010Z", 
  "msg": [
   "Kernel is not totally decoupled from JMX.  By default the kernel will no longer boot an MBeanServer.  The only place we boot the MBean server is when we are booting a full blown long running Geronimo server.", 
   "Introduced GBeanRegistry which manages the map ObjectName to GBeanInstance.", 
   "Added BasicGBeanRegistry which manages the map with no dependency on JMX.", 
   "Added JMXGBeanRegistry which creates an MBeanServer on startup.  It mounts a o.a.g.kernel.jmx.GBeanMBean into an MBeanServer for each GBeanInstance registered.  The a o.a.g.kernel.jmx.GBeanMBean does not interact directly with GBeanInstances, instead it simply redirects all calls to a GBean.  GBeanMBean in the o.a.g.gbean.jmx package is just a proxy for a GBeanData, and should be removed soon.", 
   "Added KernelDelegate which replaces the MBeanServerFactory use on the client side to create a proxy to the server side geronimo kernel.", 
   "Added MBeanServerDelegate which is used to provide apis such as the JSR 88 MEJB which needs a something that implements MBeanServer.  The MBeanServerDelegate only implements the operations of the MBeanServer that easily map to Kernel.  All unimplemented methods throw a SecurityException.", 
   "Moved Lifecycle* classes to o.a.g.kernel.lifecycle"
  ], 
  "revision_id": "109957"
 }, 
 {
  "author": "", 
  "date": "2004-12-06T07:19:13.158630Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "109956"
 }, 
 {
  "author": "antonio", 
  "date": "2004-12-06T06:47:40.604438Z", 
  "msg": [
   "Update Deli to x031104.jar (Bugzilla #32083)"
  ], 
  "revision_id": "109955"
 }
]