[
 {
  "author": "rwesten", 
  "date": "2011-05-04T12:51:29.993592Z", 
  "msg": [
   "STANBOL-187: The DBLP indexer now uses the new Indexing Infrastructure:", 
   "Note that the DBLP Indexer does no longer contain any source code. It defines only the default configuration and the pom.xml to build (and assembly) the indexing Utility.", 
   "By calling the utility with the command \"init\" the configuration will be initialised with the defaults (see the README.txt for details).", 
   "other Changes:", 
   "SolrYard:", 
   "- has now support for the Solr commitWithin feature: This allows to tell solr the maximum duration until changes to the index need to be committed. This feature is very nice for indexing, because it reduces the number of commits.", 
   "- added a public close() method to the SolrYard to allow the deactivation of a SolrYard outside an OSGI environment.", 
   "The SolrYard IndexingDestination now uses the new features of the SolrYard", 
   "Indexing Core:", 
   "Added two very simple EntityScoreProvider. The first one simple returns null as score and is intended to be used if no scores are available. The second can be configured to return the same score for all entities (default is 1).", 
   "Parent POM:", 
   "- added all Entityhub Indexing bundles", 
   "- added SLF4J Bundles for log4j and the log4j bundle"
  ], 
  "revision_id": "1099435"
 }, 
 {
  "author": "mbenson", 
  "date": "2011-05-04T12:51:15.547985Z", 
  "msg": [
   "sp"
  ], 
  "revision_id": "1099434"
 }, 
 {
  "author": "jbonofre", 
  "date": "2011-05-04T12:44:57.066563Z", 
  "msg": [
   "Remove SLF4J dependency from ServiceMix Core (only required at runtime)."
  ], 
  "revision_id": "1099433"
 }, 
 {
  "author": "kkolinko", 
  "date": "2011-05-04T12:44:53.062221Z", 
  "msg": [
   "vote"
  ], 
  "revision_id": "1099432"
 }, 
 {
  "author": "jbonofre", 
  "date": "2011-05-04T12:43:41.574671Z", 
  "msg": [
   "Downgrade to ServiceMix core 3.3.2 dependency and add SLF4J dependency (required by ServiceMix Core 3.4)."
  ], 
  "revision_id": "1099431"
 }
]