[
 {
  "author": "davidbau", 
  "date": "2003-09-26T01:28:47.000000Z", 
  "msg": [
   "Practicing safe IP practices.  (Thanks robert for catching this!)", 
   "Removed build-time dependency on Sun's JAXB API JAR, and deleting the", 
   "JAR.  When we get into JAXB v2 we will check in a clean-room version", 
   "of this API.", 
   "(Infrastructure will still need to rm the jar from the repository,", 
   "and we still need to remove the qname jar.)", 
   "Code review: eric", 
   "Regression tests: passed"
  ], 
  "revision_id": "110174"
 }, 
 {
  "author": "daveremy", 
  "date": "2003-09-26T00:40:05.000000Z", 
  "msg": [
   "- Some relatively minor changes to update the xmlbeans disributable:", 
   "-- renamed the build.xml xkit ant target to dist", 
   "-- no longer include source in the distributable", 
   "-- minor changes to the .zip structure", 
   "-- minor changes to the readme.txt", 
   "-  Renamed the unix utilities from .sh to having no suffix.", 
   "CR: Eric Vasilik", 
   "DRTs:  none"
  ], 
  "revision_id": "110173"
 }, 
 {
  "author": "ericvas", 
  "date": "2003-09-25T22:40:12.000000Z", 
  "msg": [
   "This fixes a drt failure where an instance tree becomes non-left-only after a parse when the load option addition namespaces is specified.", 
   "Review: Remy", 
   "drt: passes", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "110172"
 }, 
 {
  "author": "daveremy", 
  "date": "2003-09-25T00:47:31.000000Z", 
  "msg": [
   "Initial forrest website source.  Contains basic structure of the xmlbeans website", 
   "with content however missing some key things:", 
   "1.  No link to a binary distribution.  Need to work out where and how to", 
   "do this distribution.  Pointing users to CVS for now.", 
   "2.  User doc and javadoc not available from website yet (although they are", 
   "in the source distribution).  Need to create good process for copying the", 
   "doc to the website/documentation/content directory.", 
   "Still a lot of other things to do.", 
   "This check-in will not result in a new xmlbeans website yet.", 
   "The next step is to get the forrest build into the apache cvs site module."
  ], 
  "revision_id": "110171"
 }, 
 {
  "author": "ericvas", 
  "date": "2003-09-24T23:31:18.000000Z", 
  "msg": [
   "- Updated Apache license to mention the year 2003 only", 
   "- Fixed bug in copyXml where attribute values were screwed up", 
   "- Changed the begin splay statistic to count all splays, not just begins", 
   "- Removed some unused files", 
   "Code Review: David Bau", 
   "Drt: passed", 
   "Diffs: too many to include (primary ones sent earlier)", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "110170"
 }
]