[
 {
  "author": "tfischer", 
  "date": "2011-05-15T12:18:13.143947Z", 
  "msg": [
   "TORQUE-150: also use criterionMap in hashCode()"
  ], 
  "revision_id": "1103335"
 }, 
 {
  "author": "jgoodyear", 
  "date": "2011-05-15T12:11:31.560234Z", 
  "msg": [
   "[KARAF-548] Apache Karaf 2.2.1 Release.", 
   "Updating website for 2.2.1 release."
  ], 
  "revision_id": "1103334"
 }, 
 {
  "author": "stsp", 
  "date": "2011-05-15T12:06:15.754768Z", 
  "msg": [
   "Make multi-revision-range merges stop early if a range causes a conflict.", 
   "We already did this for text and prop conflicts, but not for tree conflicts.", 
   "Also, the merge was only aborted if a continuous revision ranges was split", 
   "due to merge tracking. Multiple ranges passed in from the command line were", 
   "all merged regardless of whether a conflict occurred while merging one of", 
   "these ranges.", 
   "The new behaviour makes it easier to resolve conflicts one-by-one.", 
   "The old behaviour could lead to nodes being both tree-conflicted", 
   "and text-conflicted, for instance. This is no longer possible.", 
   "Discussed briefly with gstein, jerenkrantz, and philip in Ireland.", 
   "Surprisingly, no tests are failing due to this change.", 
   "* subversion/libsvn_client/merge.c", 
   "(tree_conflict, tree_conflict_on_add): Add victim paths to the merge", 
   "baton's list of conflicted paths, which is checked later to see whether", 
   "the multi-range merge should be aborted.", 
   "(do_directory_merge): New parameter ABORT_ON_CONFLICTS which, if true,", 
   "causes an SVN_ERR_WC_FOUND_CONFLICT error if a conflict occurred.", 
   "This is necessary since do_directory_merge() is called for each revision", 
   "range separately and does not know if it might be called again to merge", 
   "additional ranges. It already handled the case where the range it is merging", 
   "is split up due to merge-tracking, and this behaviour is not changed.", 
   "(do_merge): While looping over revision ranges, set the ABORT_ON_CONFLICTS", 
   "parameter of do_directory_merge() depending on whether there are ranges", 
   "remaining to be merged."
  ], 
  "revision_id": "1103333"
 }, 
 {
  "author": "tfischer", 
  "date": "2011-05-15T11:48:31.305243Z", 
  "msg": [
   "TORQUE-150: Let Criteria not inherit from Hashtable any more but retain previous functionality"
  ], 
  "revision_id": "1103332"
 }, 
 {
  "author": "minfrin", 
  "date": "2011-05-15T11:39:00.588116Z", 
  "msg": [
   "Use namespace protection on mode and type constants."
  ], 
  "revision_id": "1103331"
 }
]