[
 {
  "author": "kkrouse", 
  "date": "2004-11-11T22:15:49.000000Z", 
  "msg": [
   "Moving ..underlyingXmlObject() method from FilterXmlObject abstract class to", 
   "DeletageXmlObject interface.", 
   "DRTs passed"
  ], 
  "revision_id": "111099"
 }, 
 {
  "author": "cezar", 
  "date": "2004-11-11T21:52:12.000000Z", 
  "msg": [
   "Partial fixes to XMLBEANS-85 on Jira (http://nagoya.apache.org/jira/browse/XMLBEANS-85). Here are the issues and fixes:", 
   "- missing import statements in source code -- fixed.", 
   "- generated code won't compile because easypo.xsdconfig is present -- not an issue for the tutorial. This would be an issue if the tutorial asked users to scomp the entire contents of the schemas/easypo directory; instead, the tutorial does (and did) tell users to compile easypo.xsd within that folder -- ignoring the xsdconfig.", 
   "- release readme tells users to set XMLBEANS_HOME to the release lib folder -- not an issue for the tutorial. I agree that this is a readme problem. I added a line to the tutorial that users should use the environment described in the installation topic.", 
   "- compile statement is bad. And indeed it was a copy/paste mess. I fixed it, and also made the command more Windows-specific (percents, semicolons, backslashes), in keeping with the rest of the tutorial.", 
   "This mail includes a couple of other opportunistic fixes to the site.", 
   "- \"V1 Javadoc\" was appearing twice on the home page. I fixed this in the site.xml.", 
   "Contributed by: Steve Traut"
  ], 
  "revision_id": "111098"
 }, 
 {
  "author": "cezar", 
  "date": "2004-11-11T18:58:40.000000Z", 
  "msg": [
   "Contributed by: Jacob Danner.", 
   "Repro case for OOM Error when classloading with threads.", 
   "Should not error when run in detailed suite since Memory requirements are greater,", 
   "but running with java from shell and decreased mem setting should create repro instance."
  ], 
  "revision_id": "111097"
 }, 
 {
  "author": "radup", 
  "date": "2004-11-11T04:02:21.000000Z", 
  "msg": [
   "Performance improvements loading xsb files."
  ], 
  "revision_id": "111096"
 }, 
 {
  "author": "cezar", 
  "date": "2004-11-09T20:42:24.000000Z", 
  "msg": [
   "Fix for sDownload tool. Added correct v2 classpath entries.", 
   "Submitted by: Jacob Danner"
  ], 
  "revision_id": "111095"
 }
]