[
 {
  "author": "andy_seaborne", 
  "date": "2004-01-29T15:45:31.000000Z", 
  "msg": [
   "Jena 2.1 RC 2"
  ], 
  "revision_id": "1111355"
 }, 
 {
  "author": "chris-dollin", 
  "date": "2004-01-29T15:40:07.000000Z", 
  "msg": [
   "new test for InfGraph base"
  ], 
  "revision_id": "1111354"
 }, 
 {
  "author": "chris-dollin", 
  "date": "2004-01-29T15:15:00.000000Z", 
  "msg": [
   "Tidied up some comments in union & reasoner code for changes I'd made.", 
   "Arranged that ModelRDBMakers produced ModelRDBs, not just Models wrapped", 
   "round GraphRDBs."
  ], 
  "revision_id": "1111353"
 }, 
 {
  "author": "chris-dollin", 
  "date": "2004-01-29T12:34:04.000000Z", 
  "msg": [
   "updates to allow OntModels to delegate reification to their distinguished", 
   "base element.", 
   "I made sure MultiUnion passed the Graph tests - this exposed some problems,", 
   "ie it didn't, because a listener on an OntModel got poked twice for each", 
   "update. To fix this, MultiUnions suppress notifyAdd and notifyDelete,", 
   "because the MultiUnion shares the base graph's event handler, and *that*", 
   "will produce notifications.", 
   "It turned out also that simply delegating the MultiUnion reifier to the", 
   "base didn't work. Tests failed. It turns out that ModelComs [and hence", 
   "OntModelImpls] grab the underlying Graph's reifier when they are constructed,", 
   "but a MultiUnion's reifier can change as the base changes, and starts out", 
   "as a default non-base reifier; the MultiUnion base was not set when the", 
   "MultiUnion was created.", 
   "To fix this, the OntModelImpl constructor now passes the base model down", 
   "to the code that constructs its underlying MultiUnion graph, and that", 
   "code puts the base graph into the union, so that it's available when", 
   "the OntModelImpl's parent class constructor [ie ModelCom's] runs and", 
   "grabs the reifier.", 
   "BaseInfGraph and its descendants delegate their reifiers to their raw", 
   "graphs."
  ], 
  "revision_id": "1111352"
 }, 
 {
  "author": "andy_seaborne", 
  "date": "2004-01-29T09:49:42.000000Z", 
  "msg": [
   "Jena 2.1 RC 1"
  ], 
  "revision_id": "1111351"
 }
]