[
 {
  "author": "rbowen", 
  "date": "2011-05-26T13:40:46.916065Z", 
  "msg": [
   "Mention that the error log format is now configurable."
  ], 
  "revision_id": "1127905"
 }, 
 {
  "author": "julianfoad", 
  "date": "2011-05-26T13:38:37.939723Z", 
  "msg": [
   "* subversion/libsvn_wc/wc_db.c", 
   "(insert_external_node): Move a local variable inside the conditional block", 
   "that uses it so it doesn't shadow a variable in the outer scope."
  ], 
  "revision_id": "1127904"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-05-26T13:32:09.716772Z", 
  "msg": [
   "resolves STANBOL-207: Replaced specific Entity types (Sign, Symbol, EntityMapping) with Entity. Added metadata to Entities. Renamed methods in Interfaces that used \"Sign\" and \"Symbol\" to Entity. Added Support for storing Metadata to the Entityhub.", 
   "Details:", 
   "(does not list changes because renaming methods in the Entityhub APIs)", 
   "Servicesapi:", 
   "- Removed Interfaces Sign, Symbol and EntityMapping", 
   "- Added Interface Entity", 
   "- Added ManagedEntityState and MappingState enumerations replacing the inner enums of the deleted Symbol and EntityMapping interfaces", 
   "- Adapted the name of several methods in all the Service Interfaces of the Entityhub", 
   "- Moved the ModelUtils form the core to the servicesapi bundle", 
   "- Metadata use the \"dcTerms:subject\" property to link to the data", 
   "- Metadata are of type \"foaf:Document\"", 
   "Core:", 
   "- According changes to the default implementations of the changed interfaces", 
   "- The Entityhub now stores also the metadata of entities. Previously the fixed set of metadata was stored in the same Representation os the data.", 
   "- Removed the SignFactory because it is no longer needed with the singe Entity type", 
   "- Functionality of the old Symbol and EntityMapping implementations where moved to Wrappers over Entity. Such Implementations are now private and are not exported by the core bundle.", 
   "Entityhub Jersey:", 
   "- corrected a Bug with the RESTful Service API Documentation of the entityhub/symbol service endpoint.", 
   "- Classes in that package still use Symbol and Sign. This is because this module will be reimplemented soonish (see http://incubator.apache.org/stanbol/docs/trunk/entityhub/entityhubandlinkeddata.html)", 
   "- added Metadata are now serialized for the JSON and the RDF serialization."
  ], 
  "revision_id": "1127903"
 }, 
 {
  "author": "julianfoad", 
  "date": "2011-05-26T13:31:41.995433Z", 
  "msg": [
   "A follow-up to r1127899.  Commit a change that I missed in that commit.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(create_db): Update the call to svn_wc__db_util_open_db()."
  ], 
  "revision_id": "1127902"
 }, 
 {
  "author": "gsim", 
  "date": "2011-05-26T13:30:41.303057Z", 
  "msg": [
   "QPID-3278: pass container for expired messages by reference"
  ], 
  "revision_id": "1127901"
 }
]