[
 {
  "author": "jasvir", 
  "date": "2011-05-27T15:37:43.091230Z", 
  "msg": [
   "Patch from Felix Lee", 
   "Description", 
   "opensocial-reference/taming.js tries to whitelist some JsonPerson methods, which fails because JsonPerson isn't whitelisted yet.", 
   "These methods are already being whitelisted in opensocial-base/taming.js, which is also where JsonPerson is whitelisted.", 
   "This patch deletes the broken taming.", 
   "Testing", 
   "SocialActivitiesWorld.xml demo works in sample container with Caja enabled, running in Chrome."
  ], 
  "revision_id": "1128365"
 }, 
 {
  "author": "jasvir", 
  "date": "2011-05-27T15:35:21.917566Z", 
  "msg": [
   "Patch from Felix Lee.", 
   "Description", 
   "Currently, when Caja is enabled, the data passed to an osapi callback is read-only.  The SocialHelloWorld demo tries to push a new element into that read-only data, which fails.  I might be able to modify the Caja taming to return writeable data, but I have to think through the implications of that.  In the meantime, this patch modifies the demo to make a copy of the read-only data.", 
   "Testing", 
   "Demo works in sample container with Caja enabled, on Chrome."
  ], 
  "revision_id": "1128364"
 }, 
 {
  "author": "jdcasey", 
  "date": "2011-05-27T15:34:21.418457Z", 
  "msg": [
   "move MAEPrompter out to a separate module, to allow the use of mae-api without the need to depend on jline unless you have a use case that requires prompting from the CLI."
  ], 
  "revision_id": "1128363"
 }, 
 {
  "author": "mduerig", 
  "date": "2011-05-27T15:34:06.069908Z", 
  "msg": [
   "spi2microkernel prototype (WIP)"
  ], 
  "revision_id": "1128362"
 }, 
 {
  "author": "jfthomps", 
  "date": "2011-05-27T15:31:11.433662Z", 
  "msg": [
   "VCL-463", 
   "modified selectProfileChanged - added extra check for existance of dijit.byId('profileid').getOptions(0)", 
   "modified saveServerProfile - set save button text to 'Working...' and disable", 
   "modified saveServerProfileCB - set save button text to 'Save Profile' and enable; if profileslist was hidden, show it", 
   "modified getServerProfileData - set fetchProfilesBtn text to 'Working...' and disable if id = 'profileid'; set mouse cursor to wait", 
   "modified getServerProfileDataDeployCB - set mouse cursor to default", 
   "modified getServerProfileDataManageCB - set mouse cursor to default; set fetchProfilesBtn text to 'Configure Profile' and enable", 
   "modified delServerProfile - if no more profiles, set profileslist to hidden", 
   "modified delServerProfileCB - also remove profile from deployprofileid", 
   "modified getGroups - if profileid is empty, set mouse cursor to default and return", 
   "modified getProfiles - if inprofiles does not exist, return; if profilesGroups does not exist, return", 
   "modified getProfilesCB - if no profiles, set profileslist, deployprofileslist, and groupprofilesspan to hidden and unhide noprofilegroupsspan; if there are profiles, do the opposite", 
   "removed updateWaitTime"
  ], 
  "revision_id": "1128361"
 }
]