[
 {
  "author": "jm", 
  "date": "2011-05-27T13:49:45.504713Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "1128305"
 }, 
 {
  "author": "jfthomps", 
  "date": "2011-05-27T13:47:58.062261Z", 
  "msg": [
   "VCL-30", 
   "overall - changed to connection methods being assigned by imagerevisionid instead of imageid", 
   "modified selectImageOption - (unrelated to VCL-30) added labels to radio buttons so that text can be clicked to select radio button", 
   "modified editOrAddImage - removed several initial definitions of variables that were no longer used; changed to update connectionmethods immediately only when editing and to pass the selected methods along to next function when adding", 
   "modified connectmethodDialogContent - update to allow imagerevision to be selected if image has more than one revision", 
   "modified jsonImageConnectMethods - changed to provide code that updates connectionmethods immediately only when editing and to pass the selected methods along to next function when adding", 
   "modified AJaddImageConnectMethod - changed to update connectionmethods immediately only when editing and to pass the selected methods along to next function when adding; changed to assign methods by imagerevisionid instead of imageid", 
   "modified AJremImageConnectMethod - changed to update connectionmethods immediately only when editing and to pass the selected methods along to next function when adding; changed to assign methods by imagerevisionid instead of imageid", 
   "modified confirmEditOrAddImage - if adding, print selected connection methods", 
   "modified updateExistingImage - add any connection methods to new revisionid that were enabled in previous revision", 
   "modified processImageInput - process connectmethodids", 
   "modified addImage - add entries to connectmethodmap"
  ], 
  "revision_id": "1128304"
 }, 
 {
  "author": "rhuijben", 
  "date": "2011-05-27T13:42:56.250969Z", 
  "msg": [
   "Make libsvn_client call the necessary functions to register externals in the", 
   "soon to be enabled externals store.", 
   "* subversion/include/private/svn_wc_private.h", 
   "(svn_wc__externals_defined_below): New function.", 
   "(svn_wc__external_register): New function.", 
   "* subversion/libsvn_client/externals.c", 
   "(svn_wc__externals_defined_below): New function.", 
   "(svn_wc__external_register): New function.", 
   "* subversion/libsvn_wc/externals.c", 
   "(header): Document a temporary define.", 
   "(switch_dir_external): Add defining_abspath argument. Register", 
   "directory externals after a successfull checkout or switch.", 
   "(handle_external_item_change): Use switch_dir_external for checkout", 
   "scenarios.", 
   "(svn_client__handle_externals): Add test code for using the store instead", 
   "of walking the old information. Resolve variable shadowing.", 
   "* subversion/libsvn_wc/wc-queries.sql", 
   "(STMT_SELECT_EXTERNALS_DEFINED): Redefine as recursive query.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(svn_wc__db_external_read): Add missing newline.", 
   "(svn_wc__db_externals_defined_below): New function.", 
   "* subversion/libsvn_wc/wc_db.h", 
   "(svn_wc__db_externals_defined_below): New function."
  ], 
  "revision_id": "1128303"
 }, 
 {
  "author": "mgrigorov", 
  "date": "2011-05-27T13:40:20.031445Z", 
  "msg": [
   "WICKET-3723 Introduce StorageSettings for the settings related to default inmemory and disk storages", 
   "Make the type of maxSizePerSession (the size of the file where session data is written) strongly typed - Bytes."
  ], 
  "revision_id": "1128302"
 }, 
 {
  "author": "nick", 
  "date": "2011-05-27T13:36:00.771424Z", 
  "msg": [
   "Add unit test from Stefan for bug #51172 - DOCX gif support"
  ], 
  "revision_id": "1128301"
 }
]