[
 {
  "author": "rwesten", 
  "date": "2011-06-02T19:00:20.627873Z", 
  "msg": [], 
  "revision_id": "1130735"
 }, 
 {
  "author": "eli", 
  "date": "2011-06-02T18:59:56.419980Z", 
  "msg": [
   "HDFS-2022. ant binary should build libhdfs. Contributed by Eric Yang"
  ], 
  "revision_id": "1130734"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2011-06-02T18:59:29.701675Z", 
  "msg": [
   "fixed Stack<List<Rule>> access"
  ], 
  "revision_id": "1130733"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-02T18:59:04.098324Z", 
  "msg": [
   "Resolves STANBOL-208:", 
   "* The SolrYard now uses Solr index archives for its configuration.", 
   "* Added a parameter to ReferencedSite that allows to load such a configuration based on it's name.", 
   "* Configurations are loaded by using the Stanbol DataFileProvider", 
   "* Added a SolrYard specific DataFileProvider that searches configurations via the classpath (\"{name}.solrindex.zip\" is used as file name)", 
   "* This DataFileProvider also works outside an OSGI environment (needed because the Yards are also used outside OSGI e.g. by the Indexing tools)", 
   "* The default configuration is reduced to an \"solr.xml\" file with no configured cores. All cores are initialized on demand. This allows to delete all the (duplicated) index configurations.", 
   "* The entityhubYard uses a named configuration (entityhub.solrindex.zip)", 
   "* The old functionality (copying directories) is still supported by the ConfigUtils but no longer used within the SolrYard. Currently it is still used by the Indexing Utilities because there it allows users to directly change SolrYard configurations without creating Archives after every change.", 
   "* Adapted existing configurations (in \"data/site/\", default configurations of the launchers)", 
   "STANBOL-187:", 
   "New Feature:", 
   "* The Indexing Utilities now create the Bundle needed to add and configure a ReferencedSite for the indexed data!", 
   "* Added a \"genericrdf\" Indexer configuration. This configuration is intended to be used as base for indexing any kind of RDF data. See the README.md file for details.", 
   "Changes:", 
   "* Several changes related to STANBOL-208", 
   "* remanned most of the files form mixed case to lower case", 
   "* removed some configurations that are no longer needed", 
   "* added additional RDF data for the Jena TDB unit tests", 
   "* deleted Solr index configuration of DBLP. This can now use a named configuration (default)", 
   "* deleted an unused Solr index configuration directly under the in the dblp directory", 
   "Open:", 
   "* Currently the creation of the OSGI configurations and the Bundle is implemented in a Utility class and created within the SolrYard destination. This is sub-optimal because each IndexingDestionation implementation would need to provide the same feature. This should be refactored to an independent component of the indexing process that cares about the creation of such configurations.", 
   "Other Changes:", 
   "* Corrected a bug in the ReferencedSiteManager not forwarding Requests to ReferencedSites that have not defined and EntityPrefixes (such site should get all requests).", 
   "* Improved error handling in the FieldMappings utility. Now a single illegal formatted mapping does no longer cause all mappings to be ignored."
  ], 
  "revision_id": "1130732"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2011-06-02T18:57:53.434824Z", 
  "msg": [
   "added Stack<List<Rule>> getter accessor"
  ], 
  "revision_id": "1130731"
 }
]