[
 {
  "author": "kaz", 
  "date": "2003-03-03T21:27:17.000000Z", 
  "msg": [
   "Just adding myself to the list of developers."
  ], 
  "revision_id": "113034"
 }, 
 {
  "author": "kaz", 
  "date": "2003-03-03T21:20:57.000000Z", 
  "msg": [
   "Restored the ability to allow a user to select the name of the tag to be", 
   "used for the generation of the tasklist instead of the hardcoding of", 
   "\"@todo\" in the vdoclet template.  I didn't even realize this", 
   "functionality was removed until doing a doc update that Tim O'Brien", 
   "supplied and I saw the maven.tasklist.taskTag.  Fixing this required", 
   "some changes to vdoclet, namely, adapting the JellyContext to a Velocity", 
   "context."
  ], 
  "revision_id": "113033"
 }, 
 {
  "author": "kaz", 
  "date": "2003-03-03T21:18:08.000000Z", 
  "msg": [
   "Enhanced the vdoclet plugin.  Previous versions did not provide access", 
   "to the Jelly context within the vdoclet velocity templates.  Thus, as a", 
   "result, support of the maven.tasklist.taskTag was dropped and the", 
   "tasklist plugin was hardcoded to use \"@todo\" because there was no way to", 
   "get the value from the Jelly context.", 
   "- VDocletBean can now be passed a JellyContext which gets wrapped in the", 
   "same JellyContextAdapter that I wrote from the Velocity taglib.  To", 
   "access the context from a vdoclet template, use '$jellyContext'.", 
   "- Updated the taglib and tag defined in plugin.jelly to automatically", 
   "include the current context.", 
   "- Updated the POM to include the jelly deps.  On a side note, also had", 
   "to update the POM of the xdoc plugin as it had a dependency on the", 
   "velocity taglib as well, and it was being loaded before the jar", 
   "specified in this POM."
  ], 
  "revision_id": "113032"
 }, 
 {
  "author": "kaz", 
  "date": "2003-03-03T15:41:23.000000Z", 
  "msg": [
   "Updated docs.  Patch from Tim O'Brien.  thanks!"
  ], 
  "revision_id": "113031"
 }, 
 {
  "author": "dion", 
  "date": "2003-03-03T15:20:00.000000Z", 
  "msg": [
   "Fix ognl entry"
  ], 
  "revision_id": "113030"
 }
]