[
 {
  "author": "kristwaa", 
  "date": "2011-06-03T13:33:04.427167Z", 
  "msg": [
   "DERBY-5097: testMTSelect(org.apache.derbyTesting.functionTests.tests.store.AutomaticIndex StatisticsMultiTest)junit.framework.AssertionFailedError: failed to get statistics for table MTSEL (#expected=2, timeout=0) on AIX IBM JDK 1.5", 
   "Added timeout to the system table query logic to stop the test from failing", 
   "when the index statistic worker thread is starved. A starved worker thread", 
   "won't be able to update the statistics soon enough in this test case, so we", 
   "give it some time to do its thing after the test query threads have stopped.", 
   "Patch file: derby-5097-1a-add_timeout.diff"
  ], 
  "revision_id": "1131030"
 }, 
 {
  "author": "yonik", 
  "date": "2011-06-03T13:30:27.202824Z", 
  "msg": [
   "LUCENE-2514: fix NPE in solr's toString when range endpoints are null"
  ], 
  "revision_id": "1131029"
 }, 
 {
  "author": "mfojtik", 
  "date": "2011-06-03T13:22:51.821452Z", 
  "msg": [
   "Fixed typo in deltacloud-core.gemspec"
  ], 
  "revision_id": "1131028"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-03T13:21:24.348780Z", 
  "msg": [
   "Bug corrections in the FieldQuery implementation of the SolrYard", 
   "- For Value Constraints the check for \"text\" types compared IndexDataTypeEnum with IndexDataType. This caused that ' ' where not replaced with '+' in QueryStrings", 
   "- For Value Constraints of Type \"text\" no language constraint was set. This caused the creation of invalid Solr Queries", 
   "Improvements:", 
   "- The lang Encoder accepts now null, an empty list and an list with only an null element to indicate that a search should include labels of any language.", 
   "- For value constraints there is now a clear warning that only a single data type is supported.", 
   "- added a logging in case of JSON parsing errors in the FieldQueryReader"
  ], 
  "revision_id": "1131027"
 }, 
 {
  "author": "mfojtik", 
  "date": "2011-06-03T13:19:35.804996Z", 
  "msg": [
   "Added missing state to Image in Mock driver", 
   "Signed-off-by: Michal fojtik <mfojtik@redhat.com>"
  ], 
  "revision_id": "1131026"
 }
]