[
 {
  "author": "benh", 
  "date": "2011-06-05T08:47:32.949708Z", 
  "msg": [
   "Made some fixes suggested by Ben. Also replaced the way unit tests get a", 
   "deterministic date: there's now a DateUtils class with the currentDate()", 
   "method, and it is possible to set a mock date to use through one of its", 
   "methods."
  ], 
  "revision_id": "1132125"
 }, 
 {
  "author": "benh", 
  "date": "2011-06-05T08:47:24.002832Z", 
  "msg": [
   "Stop master and slave from sending TASK_KILLED status updates before", 
   "actually passing a kill task command to the executor. Fixes #35."
  ], 
  "revision_id": "1132124"
 }, 
 {
  "author": "benh", 
  "date": "2011-06-05T08:47:16.028649Z", 
  "msg": [
   "Fix some tabs"
  ], 
  "revision_id": "1132123"
 }, 
 {
  "author": "benh", 
  "date": "2011-06-05T08:47:08.552737Z", 
  "msg": [
   "Added the master start date into slave and framework IDs to make it", 
   "easier to locate output from each framework. Before this, when ZooKeeper", 
   "was not in use, slave IDs were just of the form 0-N, and each slave", 
   "machine tended to have many slave IDs over time that could get reused in", 
   "weird ways. Now, the slave ID and framework ID both begin with a master", 
   "ID that contains the start date and ZooKeeper ephemeral ID. These makes", 
   "the slave and framework IDs unique over time and also more correlated", 
   "with each other (knowing a framework ID, I can figure out its slave ID", 
   "on a given node, unless that node happens to have run multiple slaves).", 
   "To simplify testing, the local runner also has an option to disable", 
   "including the date in the master ID."
  ], 
  "revision_id": "1132122"
 }, 
 {
  "author": "benh", 
  "date": "2011-06-05T08:46:59.808902Z", 
  "msg": [
   "Make install was creating <PREFIX>/mesos/deploy/deploy<DEPLOY-SCRIPTS>", 
   "dir, updated rsync command to have it now create", 
   "<PREFIX>/mesos/deploy/<DEPLOY-SCRIPTS> instead."
  ], 
  "revision_id": "1132121"
 }
]