[
 {
  "author": "mbenson", 
  "date": "2011-06-06T20:30:47.063914Z", 
  "msg": [
   "test overriding grandparent properties also"
  ], 
  "revision_id": "1132750"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-06-06T20:26:35.697236Z", 
  "msg": [
   "Closes \"Login out on a cluster handled by DeltaManager causes a NPE\" https://issues.apache.org/jira/browse/OFBIZ-4289", 
   "It works locally but not on clusters. You simply get a NPE.", 
   "Problem", 
   "When we logout we cross an issue due to Tomcat sessions persistence.", 
   "Because we set distributable to true, to allow sessions failover,", 
   "and use and DeltaManager for replication.", 
   "Delegator and other main Classes (notably Dispatcher) are not serialized in OFBiz. This is the origin of the problem", 
   "Tried solutions", 
   "By default DeltaManager save active sessions on disk. It uses a private String variable pathname for that (default to \"SESSIONS.ser\"). You can set it to null, to avoid session persistence, using a context.xml file in the WEB-INF folder with content like below. But I tried it in webtools app on staging qs001 (only) and it did not work (with distributable set to false). And we have no other means to set it from OFBiz (OOTB).", 
   "<Context>", 
   "<Manager className=\"org.apache.catalina.session.DeltatManager\" pathname=\"\">", 
   "</Manager>", 
   "</Context>"
  ], 
  "revision_id": "1132749"
 }, 
 {
  "author": "thobbs", 
  "date": "2011-06-06T20:24:11.981777Z", 
  "msg": [
   "Added release notes from Jira"
  ], 
  "revision_id": "1132748"
 }, 
 {
  "author": "tiago", 
  "date": "2011-06-06T20:20:12.816712Z", 
  "msg": [
   "DERBY-5014 Tests should restore the timeout values to default after they are done running.", 
   "Fixed one test that was not restoring the timeout value.", 
   "Contributed by Siddharth Srivastava <akssps011@gmail.com>"
  ], 
  "revision_id": "1132747"
 }, 
 {
  "author": "struberg", 
  "date": "2011-06-06T20:18:37.774835Z", 
  "msg": [
   "WAGON-330 enable TCK for wagon-http.", 
   "This also improves the redirect test and a fix for 'broken' DNS", 
   "which redirects requests to an unknown host to a search URL even", 
   "if you use test URLs as specified in", 
   "http://tools.ietf.org/rfc/rfc2606.txt"
  ], 
  "revision_id": "1132746"
 }
]