[
 {
  "author": "danielsh", 
  "date": "2011-06-10T23:04:45.224267Z", 
  "msg": [
   "Tweak the svn_repos_notify_* API to be less tailored for svnadmin.", 
   "Note, since the notifications were printed both during the dump and once", 
   "more at the end, the API will now generate the same svn_repos_notify_action_t", 
   "twice: once during the dump and once at the end.  This should be fine for API", 
   "users since we have (or are about to have) a \"Done\" notification.", 
   "* subversion/include/svn_repos.h", 
   "(svn_repos_notify_warning_t): New enum and typedef.", 
   "(svn_repos_notify_t):", 
   "Rename 'warning' to 'warning_str' and add 'warning' members.", 
   "* subversion/libsvn_repos/deprecated.c", 
   "(repos_notify_handler): Track rename.", 
   "* subversion/libsvn_repos/dump.c", 
   "(dump_node, svn_repos_dump_fs3): Track rename.", 
   "Don't format the error message in an svnadmin-specific way.", 
   "* subversion/svnadmin/main.c", 
   "(repos_notify_handler): Format the error message here."
  ], 
  "revision_id": "1134470"
 }, 
 {
  "author": "mfranklin", 
  "date": "2011-06-10T22:58:17.875107Z", 
  "msg": [
   "Updated to reflect June report"
  ], 
  "revision_id": "1134469"
 }, 
 {
  "author": "ssc", 
  "date": "2011-06-10T22:56:55.533607Z", 
  "msg": [
   "MAHOUT-729 still more cleanup"
  ], 
  "revision_id": "1134468"
 }, 
 {
  "author": "mamta", 
  "date": "2011-06-10T22:28:51.008446Z", 
  "msg": [
   "DERBY-1482", 
   "This commit adds a new test case which creates a table with LOB column and insets large data into that column. There is a trigger defined on this table but the trigger does not need access to the LOB column. In 10.8 and prior releases, even though we don't need the LOB column to execute the trigger, we still read all the columns from the trigger table when the trigger fired. With 10.9, only the columns required by the firing triggers are read from the trigger table and hence for our test here, LOB column will not be materialized. In 10.8 and prior releases, the trigger defined in this test can run into OOM errors depending on how much heap is available to the upgrade test and hence the test will make sure that we do not fire the trigger is 10.8 and lower. But in 10.9 and higher, OOM won't happen for this test because LOB is never read into memory because it is not needed for the firing trigger."
  ], 
  "revision_id": "1134467"
 }, 
 {
  "author": "chirino", 
  "date": "2011-06-10T22:25:39.033169Z", 
  "msg": [
   "Further work to support https://issues.apache.org/jira/browse/APLO-39 : we now handle web admin updates, store updates, and connector updates."
  ], 
  "revision_id": "1134466"
 }
]