[
 {
  "author": "cmpilato", 
  "date": "2011-06-15T14:19:02.002521Z", 
  "msg": [
   "* site/publish/download/download.html", 
   "Attempt to make the default mirror selection match the preferred one."
  ], 
  "revision_id": "1136060"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-15T14:15:10.634165Z", 
  "msg": [
   "A lot of small improvements/bug fixes/version upgrades ...", 
   "### Upgraded Launchers from Jersey 1.2 > 1.7", 
   "This required also a lot of changes in the source, because the newer version does no longer support multipart mime with the @FormParam annotation.", 
   "* Removed \"jersey-json\" because I think it is not used.", 
   "* Removed \"jsr311-api\" because it is now included (and exported) by \"jersey-core\".", 
   "* Added \"jersey-multipart\" for handling multipart mime", 
   "### Entityhub (core)", 
   "* Added support for create/update/delete entities both via the java API and the RESTful API", 
   "* Removed default values for OSGI properties because such values where also used when creating instances directly via the ConfigAdmin (see http://markmail.org/thread/7easpsv6wj5wewb7#query:+page:1+mid:nw4tpkzno4k3u65n)", 
   "* EntityDereferencer and EntitySearcher are no longer created if no accessUri and/or queryUri is configured", 
   "### Entityhub RESTful and Web", 
   "Some updates to the RESTful interface. NOTE: In september the RESTful interface will be reimplemented as proposed by http://incubator.apache.org/stanbol/docs/trunk/entityhub/entityhubandlinkeddata.html", 
   "* Completed/Improved and updated the RESTful API documentation of all RESTful services provided by the Entityhub. Click on \"REST API\" in the top right corner on any running Entityhub instance (http://localhost:8080/entityhub)", 
   "* Now the RESTful API reflect changes implemented by STANBOL-207", 
   "* Removed the Symbol and EntityMapping resource", 
   "* Moved functionality over to the EntityhubRootResource", 
   "* added support for creating (POST), updating (PUT) and deleting (DELETE) entities of the Entityhub (http://localhost:8080/entityhub/entity", 
   "* All /query services (entityhub, site manager and referenced site) do no longer POST forms (query={query}), but \"application/json\" encoded data.", 
   "* Improved Error messages for malformed queries parsed to the /query services. Now a complete list of the problems should be listed instead of an Exception without any Message (that was actually caused by a bug in Jersey 1.2)", 
   "### FieldQuery to SPARQL", 
   "Based on the feedback provided by Andrea several improvements to the generated SPARQL queries where made (see http://markmail.org/thread/wxd4rdjcssi5b4u6 for details)", 
   "* Fixed a bug in the full text search optimization for Virtuoso that prevented results for queries containing spaces.", 
   "* The usage of SPARQL 1.1 sub-select should solve problems with LIMIT. Currently sub-selects are only supported by Virtuoso.", 
   "* OPTIONAL selects are now only selected for previously selected entities. This greatly improves performance in such cases", 
   "### Indexing Utils", 
   "* corrected some typos in the mapping files (thx floret for reporting)", 
   "* corrected Solr schema.xml to use textgen instead of text_en_Tight for dbp-ont:abstract in other languages than english", 
   "### other changes", 
   "* changed \"DBpedia\" to \"dbpedia\" for \"/data/sites/dbpedia\" and the configuration of the full launcher to bring it in line with the naming rules used by the Entityhub indexing tools", 
   "* converted some info loggings in the InMemoryJobManager to debug", 
   "* Added a constructor to EngineException that allows to parse an additional message."
  ], 
  "revision_id": "1136059"
 }, 
 {
  "author": "mfranklin", 
  "date": "2011-06-15T14:13:22.292949Z", 
  "msg": [
   "Added side navigation link to release management (Supports RAVE-46)"
  ], 
  "revision_id": "1136058"
 }, 
 {
  "author": "kstam", 
  "date": "2011-06-15T14:10:33.353047Z", 
  "msg": [
   "ignoring derby.log file"
  ], 
  "revision_id": "1136057"
 }, 
 {
  "author": "andy", 
  "date": "2011-06-15T14:10:23.279709Z", 
  "msg": [], 
  "revision_id": "1136056"
 }
]