[
 {
  "author": "simonetripodi", 
  "date": "2011-06-20T13:08:03.312214Z", 
  "msg": [
   "[maven-release-plugin] prepare release commons-digester3-3.0"
  ], 
  "revision_id": "1137620"
 }, 
 {
  "author": "thobbs", 
  "date": "2011-06-20T13:00:41.602392Z", 
  "msg": [
   "Merged changes from trunk into release branch"
  ], 
  "revision_id": "1137619"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2011-06-20T12:58:48.463250Z", 
  "msg": [
   "re-generated the download page"
  ], 
  "revision_id": "1137618"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-20T12:57:29.912419Z", 
  "msg": [
   "STANBOL-230: Adds support for using the Entityhub for linking Entities for TextAnnotations", 
   "* By configuring \"local\" or \"entityhub\" one can now use the Entityhub to suggest Entities for TextAnnotations", 
   "* Because now it is no longer true that only ReferencedSites can be used for entity tagging the engine was renamed to NamedEntityTaggingEngine. All Configuration files (e.g. in the launcher) where adapted to the new name.", 
   "* Added a second default configuration to the full launcher that uses the Entityhub for enhancing Entities. This Configuration uses \"http://schema.org\" types for \"Person\", \"Organization\" and \"Place\" as well as the \"name\" field for lookup.", 
   "* The ids \"local\" and \"entityhub\" are now reserved for the Entityhub and MUST NOT be used as IDs for Referenced Sites.", 
   "* added a list of IDs reserved for the Entityhub to the Entityhub Interface.", 
   "* added a list of prohibited IDs for ReferencedSites to the ReferencedSite interface. Currently only the IDs assigned to the Entityhub are in that list", 
   "### other changes", 
   "* corrected a type in the Entityhub interface (getQueryFavtory -> getQueryFactory)", 
   "* added \"http://schema.org\" to the NamespaceEnum (prefix is \"schema\")", 
   "* added support for a default namespace to the NamespaceEnum.", 
   "* the NamespaceEnum now uses schema.org as default namespace. This means that the property \"name\" in configurations would be mapped to \"http://schema.org/name\".", 
   "* The \"indexing.properties\" files of all indexing utilities used wrong IDs for EntityDereferencer and EntitySearcher implementations. This is now corrected", 
   "* \"rdfs:label\" was hard coded to retrieve the value for the entity-label property of TextAnnotations. Now the value of the property used to search for entities is used.", 
   "* corrected a bug in ContentItemResource (enhancer.jersey) that caused NPEs in case a Clerezza PlainLiteral had no language defined."
  ], 
  "revision_id": "1137617"
 }, 
 {
  "author": "julianfoad", 
  "date": "2011-06-20T12:54:16.628233Z", 
  "msg": [
   "Code simplification around the use of svn_dirent_is_under_root().", 
   "* subversion/libsvn_client/patch.c", 
   "(resolve_target_path): Eliminate a svn_dirent_get_absolute() call and a", 
   "variable.", 
   "* subversion/libsvn_wc/update_editor.c", 
   "(check_path_under_root): Rename to path_join_under_root() and add a", 
   "result_path parameter.", 
   "(make_dir_baton, make_file_baton): Call path_join_under_root() here", 
   "instead of svn_dirent_join() ...", 
   "(add_directory, open_directory, add_file, open_file): ... and eliminate", 
   "the check_path_under_root() call here.", 
   "(delete_entry): Use path_join_under_root() instead of", 
   "check_path_under_root() and svn_dirent_join()."
  ], 
  "revision_id": "1137616"
 }
]