[
 {
  "author": "uschindler", 
  "date": "2011-06-24T20:38:22.516080Z", 
  "msg": [
   "LUCENE-3179: Fix bug in handling of indexes >= size in OpenBitSet.prevSetBit()"
  ], 
  "revision_id": "1139430"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-24T20:33:58.913603Z", 
  "msg": [
   "STANBOL-234: Implementation of the DataFileProvider that uses the BundleExtender pattern to provide data files within bundles.", 
   "There are two components: First the DataFileProvider Implementation using the Bundle API to load resources within the bundle and second an component that uses a BundleListener to keep track of activated/deactivated bundles and starts/stop the BundleDataFileProvider if this bundle defines the according extension header.", 
   "Note that the defaultdata bundle (version 0.0.2) already uses this extension to provide it's data files via the DataFilePrpvider", 
   "STANBOL-235 A new bundle that exprots OpenNLP and provides an Compoent \"OpenNLP\" that allows to create Modles. Will be extended in future versions.", 
   "Also", 
   "* updated the opennlp-ner engine to use the new OpenNLP component", 
   "* removed the classloader based DataFileProvider implementation used by the opennlp-ner engine, because with STANBOL-234 it is no longer needed. Note that the tests still use this class, because they run outside an OSGI environment.", 
   "* added the two new bundles to the parent pom and to the full/light and kres launcher.", 
   "* removed annotations for the LabelBasedEntityTaggingEngine so that this (currently empty) class does no longer show up as OSGI component.", 
   "Note that now it should be very easy to extend the opennlp-ner engine to support multiple languages. The only thing missing is a language detection. The currently available lang-id engine can not be used because it has a LGPL dependency."
  ], 
  "revision_id": "1139429"
 }, 
 {
  "author": "cbartlett", 
  "date": "2011-06-24T20:32:44.042429Z", 
  "msg": [
   "Remove empty package/directory"
  ], 
  "revision_id": "1139428"
 }, 
 {
  "author": "zwoop", 
  "date": "2011-06-24T20:29:50.336300Z", 
  "msg": [
   "TS-847 Oops, fixed the comment too, thanks amc."
  ], 
  "revision_id": "1139427"
 }, 
 {
  "author": "cbartlett", 
  "date": "2011-06-24T20:28:15.183054Z", 
  "msg": [
   "Move example from 'tutorials' into 'examples'"
  ], 
  "revision_id": "1139426"
 }
]