[
 {
  "author": "marvin", 
  "date": "2011-06-30T22:21:54.491475Z", 
  "msg": [
   "Separate base makefiles into distinct variable assignment and target", 
   "definition sections."
  ], 
  "revision_id": "1141740"
 }, 
 {
  "author": "reto", 
  "date": "2011-06-30T22:19:54.800496Z", 
  "msg": [
   "CLEREZZA-510: re-enabled usingAsciiArrows test using RichGraphNodes and simplified EzGraph"
  ], 
  "revision_id": "1141739"
 }, 
 {
  "author": "ronnie", 
  "date": "2011-06-30T22:10:30.222514Z", 
  "msg": [
   "- moved download to w.a.o/dist"
  ], 
  "revision_id": "1141738"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-30T22:05:20.348997Z", 
  "msg": [
   "STANBOL-241:", 
   "* updated version of the defaultdata bundle to 0.0.3", 
   "* The configuration and the default data for dbpedia is now loaded form the defaultdata bundle. Therefore the according configurations where removed from the stable and the full launcher.", 
   "* The dbpedia referenced site (entityhub) and the Entity Linking Engine (Enhancer) now fully operates in offline mode (on a 43k Entity big local index)", 
   "STANBOL 245:", 
   "* added metatype.properties file for this engine", 
   "* The TaxonomylinkingEngine is now part of the full launcher", 
   "Broken Build (266,267 and 268)", 
   "Resolved a cyclic build dependency maven was not aware of because internal dependencies of the maven-launchpad-plugin (defined in the bundles/list.xml file) are not exposed to maven. Previously the reasoners/web bundle included integration tests that needed the full launcher. In the meantime those test where moved to stanbol/integration-tests  however the dependency was never removed. When recently the reasoners/web bundle was also added to the full launcher maven started to build the full launcher before the reasonsers/web bundle what caused the build to fail.", 
   "This removes the unused dependency to the full launcher and therefore should resolve this problem."
  ], 
  "revision_id": "1141737"
 }, 
 {
  "author": "hboutemy", 
  "date": "2011-06-30T21:55:48.220003Z", 
  "msg": [
   "added pom documentation"
  ], 
  "revision_id": "1141736"
 }
]