[
 {
  "author": "norman", 
  "date": "2011-06-30T17:04:58.313990Z", 
  "msg": [
   "[maven-release-plugin] prepare for next development iteration"
  ], 
  "revision_id": "1141625"
 }, 
 {
  "author": "norman", 
  "date": "2011-06-30T17:04:17.312352Z", 
  "msg": [
   "[maven-release-plugin]  copy for tag apache-james-mailbox-0.3"
  ], 
  "revision_id": "1141624"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-06-30T17:03:30.811850Z", 
  "msg": [
   "STANBOL-245: First version of the TaxonomyLinkingEngine", 
   "Parses the content provided by the ContentItem. Tokenizes it by using an OpenNLP Tokenizer. If a Sentence Detector is available is processes sentences. Otherwise the whole text is processed at once. If a POS tagger is available it performs only lookups for Nouns. Also creating chunks based on POS tags is already implemented. If a chunker is available is uses this instead of the POS tags.", 
   "Entity Lookup is implemented based on the ReferencedSite Interface. Lookups do not restrict by types, but the types of the results are used to determine the type of the extracted words.", 
   "This Engine has also experimental support for following of rdf:seeAlso links often used to represent redirects within RDF data.", 
   "open Issues:", 
   "* Language support: Currently \"en\" is hardcoded, but the implementation would already support it.", 
   "* Code cleanup: The opennlp-ner engine shares some functionality with this one. The same is true for the EntityTagging Engine. OpenNLP specific stuff could be moved to the commons.opennlp bundle. For the Entityhub related stuff that is useful for all engines using the Entityhub one need to find a place.", 
   "* Integration tests are missing", 
   "* Finding a taxonomy to demonstrate this Engine: IPTC can be used, but would be rather something for a DocumentCategorizationEngine than for this one. Domain specific thesaurus would be good candidates. Any Ideas?", 
   "other Changes", 
   "* the ContentItemResource by two additional Categories \"Concpets\" and \"others\" in addition to \"Person\" Organization\" and \"Places\". Concepts is linked to skos:Concept and others are all TextAnnotations without any dc:type value", 
   "* added skis:Concept to the OntologicalClasses list because the TaxonomyEngine uses this as dc:type value in case a TextAnnotation stands for a Concept of a Taxonomy", 
   "Note:", 
   "* as long as the \"org.apache.stanbol.defaultdata\" bundle version 0.0.3 is not available this engine will not be able to use the english POS tagger nor chunker. As a workaround users can download this files form http://opennlp.sourceforge.net/models-1.5/ and copy them in the \"{stanbolhome}/sling/datafiles\" folder.", 
   "* this engine is not yet added to the full launcher. Just install the bundle to a running stanbol instance", 
   "* this engine does not provide a default configuration. users will need to create a configuration by setting at least the \"Referenced Site\" in the configuration tab of the Apache Felix Webconsole. As soon as this engine is included in the full launcher it will be pre configured with a default taxonomy provided by a referenced site."
  ], 
  "revision_id": "1141623"
 }, 
 {
  "author": "norman", 
  "date": "2011-06-30T17:02:17.832721Z", 
  "msg": [
   "[maven-release-plugin] prepare release apache-james-mailbox-0.3"
  ], 
  "revision_id": "1141622"
 }, 
 {
  "author": "norman", 
  "date": "2011-06-30T17:01:10.123951Z", 
  "msg": [
   "Fix thread counting"
  ], 
  "revision_id": "1141621"
 }
]