[
 {
  "author": "gtully", 
  "date": "2011-07-01T17:45:54.135405Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/AMQ-2484,https://issues.apache.org/jira/browse/AMQ-2324: Forwarded message cannot be distributed to the original broker, Avoid stuck messages in a network of brokers - implement destination policy that allows the network filter factory to be provided. A new implementation will allow queues to replay messages with a configurable delay once there are no local consumers. Also it allows a rate limit on the network consumer such that a statically included dest does not consume all messages if there is a slow local consumer"
  ], 
  "revision_id": "1142005"
 }, 
 {
  "author": "apurtell", 
  "date": "2011-07-01T17:39:54.166190Z", 
  "msg": [
   "HBASE-4048 Support configuration of coprocessor at load time"
  ], 
  "revision_id": "1142004"
 }, 
 {
  "author": "uschindler", 
  "date": "2011-07-01T17:37:17.300927Z", 
  "msg": [
   "SOLR-2630: Added new XsltUpdateRequestHandler that works like XmlUpdateRequestHandler but allows to transform the POSTed XML document using XSLT"
  ], 
  "revision_id": "1142003"
 }, 
 {
  "author": "kmarsden", 
  "date": "2011-07-01T17:36:30.781999Z", 
  "msg": [
   "DERBY-3337 convert jdbcapi/derbyStress.java to JUnit", 
   "DERBY-4200 client side OutOfMemoryError running derbnetclientmats:jdbcapi/derbyStress", 
   "Merged revision 1141924 from trunk.", 
   "Convert test to JUnit and also run the finalizer periodically if freeMemory() falls below 500K.  The converted tests is no longer called derbyStress. It is now memory.MemoryLeakFixes and runs with the junit-lowmem target or can be run directly with junit.textui.TestRunner with -Xmx16M."
  ], 
  "revision_id": "1142002"
 }, 
 {
  "author": "markt", 
  "date": "2011-07-01T17:35:09.525601Z", 
  "msg": [
   "Build server.xml for the installer by search and replace rather than combining fragments. No ore work to keep the original and the fragments in sync and esy to expand to add additional search/replace as well as insertions etc."
  ], 
  "revision_id": "1142001"
 }
]