[
 {
  "author": "rwesten", 
  "date": "2011-07-08T15:20:31.118903Z", 
  "msg": [
   "STANBOL-257: This includes the necessary Changes to other components to used the new commons.solr bundle. It also adds this module to the commons reactor.", 
   "### SolrYard", 
   "In addition the implementation of the SolrYard was changed to support lazy initialization of the SolrYard. In the short time this solves a race condition with the initialization of the services provided by the commons.solr bundle. As soon as the commons.solr bundle supports the registration of SolrServer as OSGI services this functionality will be adapted to lookup the SolrServer via a ServiceTracker.", 
   "### other", 
   "* The ReferencedSite now checks if a cache is available (Cache.isAvailable()). Previously it reported that localMode is possible if the Cache was present but not available.", 
   "* Added a check to the EntityTaggingEngine that is does not process TextAnnotations that has an empty selected text.", 
   "* Updated the KRES launcher: In addition to the changes necessary to the change of the SolrYard bundle this includes the updated to defaultdata 0.0.3 and the removal of the dbPedia specific configurations (now loaded from the defaultdata bundle)", 
   "* parent POM: Added some missing <scope>provided</score> so that such dependencies are consistent with others (In general, I have no idea why the provided scope is added to all dependencies in the parent).", 
   "* corrected the path used to install configurations within the defaultdata bundle. Previously the default Solr index for dbpedia was processed by the sling-installer framework. Even through it was ignored this was not intended. The change has no influence on any functionality therefore it not necessary to upgrade (or increase the version number). Just committed this to make sure that with the next upgrade to the defaultdata this issue is resolved."
  ], 
  "revision_id": "1144355"
 }, 
 {
  "author": "markt", 
  "date": "2011-07-08T15:10:01.503930Z", 
  "msg": [
   "More protocol alignment (with an eye to aligning with AJP)"
  ], 
  "revision_id": "1144354"
 }, 
 {
  "author": "amc", 
  "date": "2011-07-08T15:08:11.973482Z", 
  "msg": [
   "Unfortunately a dog's breakfast of fixes I needed to get ATS working and prepare for IPv6.", 
   "1) Internal APIs were changed to use sockaddr* consistently.", 
   "2) Use of sockaddr_storage internally was minimized, in most cases an IPv6 structure suffices and is much smaller.", 
   "3) Forward transparency now works when traffic_server is directly invoked, and not just when started through the trafficserver script.", 
   "4) Added the lib directory as an include directory to a number of Makefiles as part of the transition to using lib as the base library directory.", 
   "5) Added InstrusiveDList and IpMap to TS library in preparation for IPv6."
  ], 
  "revision_id": "1144353"
 }, 
 {
  "author": "sergey", 
  "date": "2011-07-08T15:08:02.207928Z", 
  "msg": [
   "one of problems linked to 47286 seems to be found -- some CHPX were not saved"
  ], 
  "revision_id": "1144352"
 }, 
 {
  "author": "jeremias", 
  "date": "2011-07-08T15:00:47.312602Z", 
  "msg": [
   "Removed the lastMediumMap variable and the check to omit the IMM if it doesn't change. I wonder why I came up with that. This can lead, among other things, to problems when an AFP file is split."
  ], 
  "revision_id": "1144351"
 }
]