[
 {
  "author": "mamta", 
  "date": "2011-07-14T22:53:40.026397Z", 
  "msg": [
   "DERBY-5120 Row from SYSDEPENDS gets deleted when a table has update triggers defined on it and an upate is made to the table", 
   "This commit moves recording to trigger action sps's dependency on trigger table from create trigger constant action and alter", 
   "table constant action to SPSDescriptor. This central location in SPSDescriptor for recording the dependency will take care of", 
   "create trigger, alter table and sps regeneration cases. The checkin also required fixing triggerGeneral.sql because now", 
   "that we do not loose the dependency between trigger action sps and trigger table, the change in trigger table always sends", 
   "an invalidation signal to it's triggers which causes those triggers to recompile when they fire next time. For triggerGeneral", 
   "case, the trigger in question ends up being incorrect(because of alter table add column) and thus would cause the test to fail.", 
   "I resolved it by fixing the trigger action.", 
   "Additionally, I have added upgrade test case which checks how the trigger invalidation signal are missed prior to this fix", 
   "thus not catching incorrect triggers. This test has been disabled for 10.5.1.1, 10.5.3.0, 10.6.1.0 and 10.6.2.1 because those", 
   "4 releases do not have DERBY-4835 fix in them. Because of that missing fix, the triggers donot get invalidated as part of", 
   "upgrade for those releases and hence the test added by this jira would fail for those 4 releases. To avoid the failure, I have", 
   "disabled the test for those 4 releases."
  ], 
  "revision_id": "1146915"
 }, 
 {
  "author": "stack", 
  "date": "2011-07-14T22:47:31.177753Z", 
  "msg": [
   "HBASE-4098 developer.xml - adding repo info, how to set up eclipse, common maven commands"
  ], 
  "revision_id": "1146914"
 }, 
 {
  "author": "hboutemy", 
  "date": "2011-07-14T22:46:13.948471Z", 
  "msg": [
   "fixed links interpreted as anchors"
  ], 
  "revision_id": "1146913"
 }, 
 {
  "author": "eli", 
  "date": "2011-07-14T22:27:15.332007Z", 
  "msg": [
   "HADOOP-7305. Eclipse project files are incomplete. Contributed by Niels Basjes"
  ], 
  "revision_id": "1146912"
 }, 
 {
  "author": "sarowe", 
  "date": "2011-07-14T22:21:58.585296Z", 
  "msg": [
   "SOLR-2452: Fix Javadoc 1.5 warnings by explicitly spelling out the package name in {@link}s; this is not a problem under Javadoc 1.6, so trunk doesn't need to be 'fixed'."
  ], 
  "revision_id": "1146911"
 }
]