[
 {
  "author": "kwright", 
  "date": "2011-07-20T22:01:33.430189Z", 
  "msg": [
   "Update web site"
  ], 
  "revision_id": "1148950"
 }, 
 {
  "author": "justin", 
  "date": "2011-07-20T21:52:47.954869Z", 
  "msg": [
   "SLING-1476 - updating benchmarks and switchin implementation to do direct addition to the statistics object"
  ], 
  "revision_id": "1148949"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-07-20T21:51:46.456099Z", 
  "msg": [
   "some files I skipped in the previous commit"
  ], 
  "revision_id": "1148948"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-07-20T21:49:50.625157Z", 
  "msg": [
   "Changes in the Stanbol data and defaultdata bundles:", 
   "* The single defaultdata bundle was replaced by three new bundles to make the Stanbol configuration more flexible. The new bundles are now located under /data. The /defaultdata was removed completely. /data bundles that are included in the Stanbol Launchers are collected in the \"defaultdata\" profile of the /data reactor pom.", 
   "* Some adaptions to the parent pom, opennlp-ner engine, commons.opennlp bundle to reflect this restructuring of the default data bundles.", 
   "* replaced the defaultdata bundles with the three new one in the different Stanbol launchers", 
   "* The shell files previously used to download data files from the internet are replaces by ant files that are called by using the maven-ant-plugin. Therefore the download of the required bundles is now platform independent and done during the normal maven build process.", 
   "* The modules for DBPedia.org and DBLP where removed, because this functionality is now covered by the according indexing tools. The folders are still there. A readme file tells users to use the Indexing tool.", 
   "* Added a site that configures DBPedia.org as referenced site using the remote services and a local cache for retrieved entities.", 
   "* Added a parent pom for data currently only setting the <Bundle-Category> to \"Stanbol Data\"", 
   "open:", 
   "* Add configurations for additional sites", 
   "* Add bundles for OpenNLP models of languages other than english", 
   "The goal is to use the /data bundles as an easy way to add additional functionality (more referenced sites, support for other languages) to stanbol. All such Bundles need only be installed to the Stanbol OSGI environment."
  ], 
  "revision_id": "1148947"
 }, 
 {
  "author": "kwright", 
  "date": "2011-07-20T21:36:13.493334Z", 
  "msg": [
   "Update documentation to include Maven.  Part of CONNECTORS-223."
  ], 
  "revision_id": "1148946"
 }
]