[
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:20.800281Z", 
  "msg": [
   "SQOOP-114. Fix for NPE.", 
   "This is a fix for a case of malformed command line arguments,", 
   "where the tool name is correct, the option is also correct,", 
   "but the value of the option is missing.", 
   "From: Ahmed Radwan <ahmed@cloudera.com>"
  ], 
  "revision_id": "1149990"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:20.434005Z", 
  "msg": [
   "SQOOP-37. Escape table and column names for Hive.", 
   "Hive allows the use of keywords as column and table names as long as they are", 
   "escaped using back-ticks. This change makes Sqoop always escape table and", 
   "column names using back-ticks thereby allowing Sqoop to work with Hive tables", 
   "that use keywords for either the table name or column names.", 
   "(Lars Francke via arvind)", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149989"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:20.133203Z", 
  "msg": [
   "SQOOP-119. TextSplitter creates incorrect bounds.", 
   "The TextSplitter implementation used when creating splits on top", 
   "of String based columns, has a bug in its logic which causes", 
   "the bounds for splits to be created incorrectly. This results", 
   "in the import of duplicate data. This change fixes the TextSplitter", 
   "in order to ensure that the bound checks are created correctly.", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149988"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:19.647760Z", 
  "msg": [
   "SQOOP-97. Remove mysql-connector-j from Sqoop.", 
   "This change removes the MySQL JDBC driver distribution that was", 
   "bundled with Sqoop previously. This is done to make sure that the", 
   "Sqoop distribution is completely Apache 2.0 compliant.", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149987"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:19.338742Z", 
  "msg": [
   "SQOOP-108. Automatically obtain HBase and ZK deps.", 
   "Users currently need to specify hbase.home and zk.home in build.properties.", 
   "This change helps automatically resolve these dependencies by downloading", 
   "release tarballs. Would be best to do this via SQOOP-101 but the hbase and", 
   "zk maven layout currently has some issues that are painful to workaround", 
   "in ivy.", 
   "Reason: Improvement", 
   "Author: Eli Collins via Arvind Prabhakar", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149986"
 }
]