[
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:24.545846Z", 
  "msg": [
   "SQOOP-141. BlobRef accessor returns incorrect data.", 
   "This change fixes the BlobRef implementation to return the appropriate stream", 
   "source or byte array from the BytesWritable instance by taking into", 
   "consideration the actual data length.", 
   "(Peter Hall via arvind)", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1150000"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:24.258662Z", 
  "msg": [
   "SQOOP-126. Support for loading options from file.", 
   "This change allows Sqoop to load options from an options file. An", 
   "options file is specified using --options-file. All options that", 
   "are otherwise specified on the command line should be specified", 
   "in this file in the order they would otherwise appear on the command", 
   "line. Options files can contain empty lines and comments for", 
   "readability. More than one options file may be used for a single", 
   "tool invocation if so preferred. Leading and trailing spaces are", 
   "ignored unless they appear within single or double quotes. Quoted", 
   "options extending into multiple lines are not supported.", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149999"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:23.934953Z", 
  "msg": [
   "SQOOP-138. Fixing intermittent IVY failure.", 
   "This change fixes the problem due to which on certain systems IVY", 
   "is unable to download the hbase artifacts from maven repository.", 
   "It also includes some clean up of documentation and build files", 
   "that relate to the removal of shim layer mechanism.", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149998"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:23.610900Z", 
  "msg": [
   "SQOOP-101. Sqoop build to use IVY for dependencies.", 
   "This change modifies Sqoop build to use IVY for retrieving HBase and", 
   "Zookeeper dependencies. Along with this update, the version number", 
   "for HBase and Hadoop have been incremented to match the CDH3 Beta 3", 
   "versions. Due to this, a couple of tests had to be modified in order", 
   "to accommodate the changed behavior of the Hadoop classes.", 
   "From: Arvind Prabhakar <arvind@cloudera.com>"
  ], 
  "revision_id": "1149997"
 }, 
 {
  "author": "abayer", 
  "date": "2011-07-22T20:04:23.250397Z", 
  "msg": [
   "SQOOP-12. Alternate NULL formats.", 
   "This fix allows the user to optionally specify different null", 
   "representations. It addresses both the import and export use", 
   "cases, in addition to both string and non-string column types.", 
   "From: Ahmed Radwan <ahmed@cloudera.com>"
  ], 
  "revision_id": "1149996"
 }
]