[
 {
  "author": "sebb", 
  "date": "2011-07-25T14:52:27.238695Z", 
  "msg": [
   "Add section header for config to be able to refer to it externally"
  ], 
  "revision_id": "1150730"
 }, 
 {
  "author": "stsp", 
  "date": "2011-07-25T14:47:34.644919Z", 
  "msg": [
   "On the gpg-agent-password-store branch, avoid a potential NULL-derefernce.", 
   "* subversion/libsvn_auth_gpg_agent/gpg_agent.c", 
   "(password_get_gpg_agent): Do not crash if the agent returns an empty", 
   "string as password."
  ], 
  "revision_id": "1150729"
 }, 
 {
  "author": "stsp", 
  "date": "2011-07-25T14:45:59.738385Z", 
  "msg": [
   "On the gpg-agent-password-store branch, improve the pinentry program's prompt.", 
   "Put the name of the authentication realm into the prompt.", 
   "Change the password prompt to match the prompt of the standard", 
   "command line client and allow it to be internationalised.", 
   "Also make the pinentry program ask for the password twice.", 
   "Users must send SIGHUP to the agent to get rid of an invalid password once", 
   "it is in the agent's cache, which also invalidates any other chached", 
   "passphrases. Asking for the password twice makes such mistakes less likely.", 
   "* subversion/libsvn_auth_gpg_agent/gpg_agent.c", 
   "(escape_blanks): New helper functions to escape blanks in GPG-Agent", 
   "protocol messages.", 
   "(password_get_gpg_agent): Pass the auth realm as description to the", 
   "GET_PASSPHRASE command. Use a better password prompt that matches", 
   "the 'svn' client prompt. Pass the --repeat=1 option to GET_PASSPHRASE.", 
   "Escape all arguments that might contain blanks with escape_blanks()."
  ], 
  "revision_id": "1150728"
 }, 
 {
  "author": "kkolinko", 
  "date": "2011-07-25T14:45:37.884357Z", 
  "msg": [
   "Converted the tests to JUnit 4."
  ], 
  "revision_id": "1150727"
 }, 
 {
  "author": "alexdma", 
  "date": "2011-07-25T14:44:30.183855Z", 
  "msg": [
   "STANBOL-285 : Separated unit tests for centralised and distributed caching."
  ], 
  "revision_id": "1150726"
 }
]