[
 {
  "author": "stsp", 
  "date": "2011-07-29T14:48:18.981078Z", 
  "msg": [
   "Update moved-to information on the BASE path of a node which is being moved", 
   "out of, or within, an existing moved subtree. Also, make 'svn commit' deal", 
   "with the add-half of such moves correctly.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(op_delete_txn): If the node was moved-here and we are moving it away,", 
   "we always want to update moved-to in BASE, regardless of whether the node", 
   "itself was the op-root of the move that moved it here. Prior to this", 
   "commit, we only updated moved-to if the node itself was the op-root.", 
   "* subversion/libsvn_client/commit.c", 
   "(svn_client_commit5): If the delete-half of a move is not in the", 
   "commit target list, look up the op-root of the delete and check", 
   "if the op-root is among the commit targets. If it is, the delete-half", 
   "of the move will be committed along with it, and we can allow the commit."
  ], 
  "revision_id": "1152245"
 }, 
 {
  "author": "mukulg", 
  "date": "2011-07-29T14:46:11.364027Z", 
  "msg": [
   "committing an improved PsychoPath XPath JAR again. this has fixes for the \"following\" XPath axis. the Eclipse bug report remains same (i.e, https://bugs.eclipse.org/bugs/show_bug.cgi?id=353373 / whose title has changed)."
  ], 
  "revision_id": "1152244"
 }, 
 {
  "author": "ggregory", 
  "date": "2011-07-29T14:43:15.241385Z", 
  "msg": [
   "Javadoc: Invalid URL reference. Double quote the reference or use the href syntax line 27"
  ], 
  "revision_id": "1152243"
 }, 
 {
  "author": "bodewig", 
  "date": "2011-07-29T14:41:25.229084Z", 
  "msg": [
   "add ZIP64 extended information to the central directory if needed.  COMPRESS-150"
  ], 
  "revision_id": "1152242"
 }, 
 {
  "author": "eevans", 
  "date": "2011-07-29T14:38:37.797492Z", 
  "msg": [
   "honor path to java when JAVA_HOME set", 
   "Patch by Paul Cannon; reviewed by eevans for CASSANDRA-2785"
  ], 
  "revision_id": "1152241"
 }
]