[
 {
  "author": "esammer", 
  "date": "2011-08-12T00:46:11.536867Z", 
  "msg": [
   "- Added a channel driver to move events from source to sink. - Context now provides a Reporter for indicating progress. - Event{Sink,Source} interfaces now throw LifecycleException, InterruptedException, and MessageDeliveryException where appropriate. - Added LogicalNode - handles the guts of tying sources to sinks and managing ChannelDriver lifecycle. - Added MessageDeliveryException - thrown by sources and sinks to indicate the message is dead. - Reporter instances now start with the current time for the last report rather than zero. Creation of the Reporter indicates status of some kind. - Added ConcurrencyUtils with a method that attempts to guarantee a Runnable happens within a given timeout as well as reports progress via the Reporter even N millis. Super buggy right now. - Fixed a bug in EventBuilder where we forgot to set the event body. Oops. - Added the LifecycleAware interface. Classes can participate in generic lifecycle events by implementing this interface. Danger: this will change at least once more soon. - Added LifecycleController which includes methods for waiting on specific lifecycle states within a given timeout on any LifecycleAware instance. - Added LifecycleException. Thrown during LifecycleAware methods to indicate a failure during start / stop. - Added LifecycleState. Indicates what state a LifecycleAware instance is currently in. - Updated AbstractEvent{Sink,Source} to conform to the new Event{Sink,Source} interfaces. - Added a LoggerSink implementation that simply passes each event to the logging system (e.g. log4j). Useful for testing and debugging. - Added NullSink - /dev/null for Flume. Does absolutely nothing with a message. Useful for testing and debugging. - Added SequenceGeneratorSource. A source that generates monotonically incrementing integers. - Added unit tests for Context. - Added unit tests for LogicalNode. - Removed a test of Reporter that was no longer true (that timeStamp started at zero). - Added (flakey) unit tests for ConcurrencyUtils. - Added unit tests for EventBuilder. - Added unit tests for LifecycleController. - Added unit tests for LoggerSink. - Added unit tests for SequenceGeneratorSource."
  ], 
  "revision_id": "1156865"
 }, 
 {
  "author": "esammer", 
  "date": "2011-08-12T00:46:05.160779Z", 
  "msg": [
   "- Initial commit of reorganized core."
  ], 
  "revision_id": "1156864"
 }, 
 {
  "author": "lu4242", 
  "date": "2011-08-12T00:20:04.518680Z", 
  "msg": [
   "MYFACES-3273 Create a better site layout for myfaces project"
  ], 
  "revision_id": "1156863"
 }, 
 {
  "author": "hwright", 
  "date": "2011-08-12T00:08:46.357877Z", 
  "msg": [
   "On the fs-py branch:", 
   "Gut another function and replace with its Python counterpart.", 
   "* subversion/python/svn/fs.py", 
   "(FS.__ensure_revision_exists): Rename to FS._ensure_revision_exists.", 
   "(FS._set_revision_proplist): Update caller.", 
   "* subversion/libsvn_fs_py/fs_fs.c", 
   "(ensure_revision_exists): Call the Python method."
  ], 
  "revision_id": "1156862"
 }, 
 {
  "author": "rgoers", 
  "date": "2011-08-12T00:02:57.444752Z", 
  "msg": [
   "Add support for Flume."
  ], 
  "revision_id": "1156861"
 }
]