[
 {
  "author": "hwright", 
  "date": "2011-08-10T21:26:36.196585Z", 
  "msg": [
   "On the fs-py branch:", 
   "Followup to r1156347: use a bit cleaner syntax to automagically close files.", 
   "* subversion/python/svn/fs.py", 
   "(FS.set_uuid, FS._open_fs): Use the with statement."
  ], 
  "revision_id": "1156375"
 }, 
 {
  "author": "danhaywood", 
  "date": "2011-08-10T21:19:09.955031Z", 
  "msg": [
   "ISIS-109: adding json-viewer for example claims app"
  ], 
  "revision_id": "1156374"
 }, 
 {
  "author": "hboutemy", 
  "date": "2011-08-10T21:17:17.391148Z", 
  "msg": [
   "updated parent pom to recetnly released asf 10"
  ], 
  "revision_id": "1156373"
 }, 
 {
  "author": "veithen", 
  "date": "2011-08-10T21:17:15.012941Z", 
  "msg": [
   "Merged a bunch of changes to the 1.6 branch as requested by the Geronimo project:", 
   "Revision: 1068985", 
   "AXIS2-4952", 
   "Scope dynamic ports to the instance of the service that did the addPort(...).  Add TDD Unit test and flag to revert to previous behavior of sharing dynamic ports across services.", 
   "Revision: 1069659", 
   "Message:", 
   "AXIS2-4938", 
   "Patch submitted by Katherine Sanders.  BindingProvider.getEndpointReference should put reference parameters from WSDL in returned EPR.", 
   "Revision: 1069898", 
   "AXIS2-4948", 
   "Patch contributed by Katherine Sanders.  Wrong WSDL location returned by BindingProvider; was using the local filesystem path instead of the endpoint URL.", 
   "Revision: 1075057", 
   "Prevent index out of bounds exception, or any exception, from attempting to log.  Add TDD/UT for same.", 
   "Revision: 1096530", 
   "On JAX-WS Client, treat local exceptions (e.g. ConnectException) as a SOAPFault, driving the JAX-WS handler handleFault methods and throwing a SOAPFAultException back through the client invocation.  Also provide a property to revert to previous behavior of creating an empty message, driving the JAX-WS handler handleMessage methods, and throwing a WebServiceException back through the client invocation.", 
   "Revision: 1096557", 
   "Two changes in JAX-WS Endpoint implementation (1) Override setEndpointContext method, (2) Add logic to throw an exception if endpoint publishing is disabled by a property (publishing is enabled by default); per JSR-109 5.3.3 dynamically publishing endpoints in a server environment is non portable and should be disabled.  A server runtime can use the property to disabled dynamically publishing JAX-WS endpoints via Endpoint.publish methods.", 
   "Revision: 1103336", 
   "AXIS2-5021: Committed patch provided by Ivan (xuhaihong).", 
   "Revision: 1136177", 
   "AXIS2-5067: Committed patch provided by Ivan (xuhaihong), with minor changes. This implements the saveChanges method and calculates the correct content type for a SOAPMessage."
  ], 
  "revision_id": "1156372"
 }, 
 {
  "author": "danhaywood", 
  "date": "2011-08-10T21:09:39.441110Z", 
  "msg": [
   "ISIS-107: minor changes to site (IDE support guidance)"
  ], 
  "revision_id": "1156371"
 }
]