[
 {
  "author": "esammer", 
  "date": "2011-09-05T21:51:26.665214Z", 
  "msg": [
   "- Massive change set due to changes. See details below.", 
   "- Sources and Sinks now come in EventDriven and Pollable flavors. Both expect the", 
   "user to handle transactions around channel operations, but EventDriven requires", 
   "no specific methods be implemented beyond the LifecycleAware methods. This is to", 
   "facilitate Avro and Thrift style sources while preserving transactional semantics.", 
   "These interfaces may change again. This is just another cut.", 
   "- Sources and Sinks now have runners that know how to drive them. LogicalNode now", 
   "expects a source and sink runner pair rather than a source and sink, directly.", 
   "- Old WAL interfaces have been removed in favor of the new Channel / Transaction", 
   "interfaces. A durable implementation of the latter will be provided.", 
   "- ChannelDriverThread no longer exists and is superceeded by the notion of source", 
   "and sink runners and the channel interface.", 
   "- Retrofitted many existing classes as a result of these changes.", 
   "Overall, I'm not thrilled with these changes and there are still a bunch of issues", 
   "to deal with. This should be considered a turbulant time."
  ], 
  "revision_id": "1165430"
 }, 
 {
  "author": "esammer", 
  "date": "2011-09-05T21:51:06.410819Z", 
  "msg": [
   "- Updated testing log4j conversion pattern to be closer to the production pattern."
  ], 
  "revision_id": "1165429"
 }, 
 {
  "author": "esammer", 
  "date": "2011-09-05T21:51:02.630532Z", 
  "msg": [
   "- Drastically simplified log4j props."
  ], 
  "revision_id": "1165428"
 }, 
 {
  "author": "esammer", 
  "date": "2011-09-05T21:50:59.336585Z", 
  "msg": [
   "- LifecycleSupervisor test no longer depends on LogicalNode and friends (self-contained)."
  ], 
  "revision_id": "1165427"
 }, 
 {
  "author": "esammer", 
  "date": "2011-09-05T21:50:46.571407Z", 
  "msg": [
   "- Added (very) basic in memory channel with a no-op transaction implementation."
  ], 
  "revision_id": "1165426"
 }
]