[
 {
  "author": "jvanzyl", 
  "date": "2002-02-28T22:41:50.000000Z", 
  "msg": [
   "Updating the generated build system to reflect some of the refactoring", 
   "I just did.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "116529"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-28T22:41:02.000000Z", 
  "msg": [
   "Adding executor beans, slowly moving away from the Ant coupling. Texen", 
   "is still a problem because I started with an Ant task for Maven instead", 
   "of using the bean pattern. But I will convert texen to a bean, I didn't", 
   "realize that Costin had the TaskAdapter cooked right into Ant to allow", 
   "beans to be used by Ant provided they contained a setProject() and execute()", 
   "method. Not sure why the setProject() is needed but it allows us to", 
   "have plain beans used by Ant which is what we want so that I can", 
   "use the beans in conjunction with a CLI util, or a GUI (more important for", 
   "the stuff I want to do)."
  ], 
  "revision_id": "116528"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-28T22:37:25.000000Z", 
  "msg": [
   "A package that represents your basic bean that execute()'s something. The", 
   "executors are not fully decoupled from Ant as the base class provides some", 
   "ant features so that the TaskAdapter can be used but the subclasses are", 
   "just beans now and don't have any direct ant references apart from using", 
   "utilties like the directory scanner (which should probably go to the commons", 
   "as it is very useful)."
  ], 
  "revision_id": "116527"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-28T22:29:01.000000Z", 
  "msg": [
   "Move the executor bean to the top-level package. Most of this code can", 
   "go go once the java parser is hooked in. A small visitor could easily", 
   "be made to replace the few elements of a java source file that the", 
   "code transformer actually uses to cross reference."
  ], 
  "revision_id": "116526"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-28T22:27:17.000000Z", 
  "msg": [
   "Moved to the top-level package, got rid of the required Touch", 
   "task which only sets the last modified time for a file in a manner", 
   "the works with 1.1. I don't care about java 1.1."
  ], 
  "revision_id": "116525"
 }
]