[
 {
  "author": "sbailliez", 
  "date": "2002-03-03T13:35:22.000000Z", 
  "msg": [
   "Move default behavior of the visitor to a specific method", 
   "to make it easy for subclasses to change the default behavior", 
   "for all nodes."
  ], 
  "revision_id": "116564"
 }, 
 {
  "author": "brekke", 
  "date": "2002-03-03T05:04:58.000000Z", 
  "msg": [
   "When the build was started and the current working directory was not the root", 
   "of the project, the source file sets that maven was building were incorrect", 
   "since they were attempting to resolve an absolute path.  Removing the", 
   "getAbsolutePath() from the creation of the source set fixed the building", 
   "issues, but a handful of unit tests were assuming that the current working", 
   "directory would always be the root of the project.  So I added a <sysproperty>", 
   "to the junit task with the base directory of the project so the unit tests", 
   "could retrieve it from the system properties.  The documentation targets", 
   "that maven uses still need to have the current working directory be the projects", 
   "root since site.dvsl has this assumption hard coded.", 
   "I fixed up all the failing unit tests to read the base dir from the system", 
   "properties and build paths to their test data.  This could use some refactoring,", 
   "maybe extracting a class for a base test case that maven's unit tests could", 
   "extend.  The site.dvsl could be fixed if the project's basedir could be used", 
   "to build the path to xdocs/project.xml."
  ], 
  "revision_id": "116563"
 }, 
 {
  "author": "kaz", 
  "date": "2002-03-03T04:03:09.000000Z", 
  "msg": [
   "Fixed headings on the developer table (thanks Jeff!)"
  ], 
  "revision_id": "116562"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-03T02:59:10.000000Z", 
  "msg": [
   "Start the little dep resolving tool as a test. We want to look into", 
   "a JAR file find all the class references, sort, collapse dupes and match", 
   "against a known list of package references. A package reference for", 
   "each project. I added them to the gump descriptors and I will update", 
   "the dvsl transformation so that I can process them."
  ], 
  "revision_id": "116561"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-03T02:54:20.000000Z", 
  "msg": [
   "Allow the ClassParserWrapper to take an InputStream so that classes inside", 
   "JAR files can be examined.", 
   "Add property to get the tree map collected by the TreeMapListener."
  ], 
  "revision_id": "116560"
 }
]