[
 {
  "author": "jvanzyl", 
  "date": "2002-03-11T19:53:10.000000Z", 
  "msg": [
   "Exclude the ProjectResolver from the bootstrap build.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "116614"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-11T19:52:47.000000Z", 
  "msg": [
   "Tool that will look at a JAR file and determine what projects the", 
   "JAR is dependent on. Will be used in conjunction with project descriptor", 
   "generation."
  ], 
  "revision_id": "116613"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-11T16:17:07.000000Z", 
  "msg": [
   "Just keeping track of a good reference here until I make an article", 
   "reference page."
  ], 
  "revision_id": "116612"
 }, 
 {
  "author": "kaz", 
  "date": "2002-03-09T15:55:46.000000Z", 
  "msg": [
   "JUnit test results are now converted to an xdoc that can be rendered as", 
   "part of a Maven generated site.  The following changes were made:", 
   "- DVSLFormatter has been modified to allow generic formatting of numbers", 
   "using patterns (just uses a DecimalFormatter).", 
   "- junit.dvsl has been created (based entirely off of the Ant", 
   "junit-noframes.xsl stylesheet).  This generates an xdoc that can later", 
   "be transformed with site.dvsl.", 
   "- Minor changes to jdepend.dvsl to utlize the new DVSLFormatter.", 
   "- Build-test.xml has been modified to consolidate all of the JUnit", 
   "reports using junitreport task, then a dvsl task transforms that", 
   "output to an xdoc.", 
   "- Link has been added to the Maven web page to show the results of the", 
   "unit tests."
  ], 
  "revision_id": "116611"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-08T19:36:18.000000Z", 
  "msg": [
   "First stage in separating each declared project in the gump descriptors", 
   "into a separate project descriptor that is completely functional on", 
   "its own.", 
   "All I want from the gump descriptors now is the description, cvs info,", 
   "and the package. I will determine the direct dependencies by", 
   "analysis and dependency resolver will determine the indirect", 
   "dependencies."
  ], 
  "revision_id": "116610"
 }
]