[
 {
  "author": "brekke", 
  "date": "2002-03-17T20:45:58.000000Z", 
  "msg": [
   "When generating the xdoc for the unit test report for the documention, we", 
   "we're forcing the tests to run.  Removing this dependency and the task", 
   "to generate the xdoc for the unit tests will just process the reports in", 
   "the test-reports directory.  This way the build will still fail with a failing", 
   "test, but the unit test report can still be generated with the rest of the", 
   "documention."
  ], 
  "revision_id": "116679"
 }, 
 {
  "author": "kaz", 
  "date": "2002-03-17T19:21:04.000000Z", 
  "msg": [
   "If the dependencies, mailing lists, or developers do not exist in the", 
   "project descriptor, then indicate this in a more friendly manner on the", 
   "generated web site."
  ], 
  "revision_id": "116678"
 }, 
 {
  "author": "kaz", 
  "date": "2002-03-17T19:18:51.000000Z", 
  "msg": [
   "Maven will now use xdocs/stylesheets/project.xml if xdocs/project.xml", 
   "does not exist.  This was suggested by Jason to help ease the migration", 
   "for Anakia users."
  ], 
  "revision_id": "116677"
 }, 
 {
  "author": "kaz", 
  "date": "2002-03-17T18:22:13.000000Z", 
  "msg": [
   "These changes will allow a user of Maven to create a web site for their", 
   "project even if they don't have an xdocs/project.xml file.  The", 
   "site.dvsl template now checks for the existence of the file and builds", 
   "the site even if it doesn't exist.  The Texen FileUtil tool is used.", 
   "In addition, to prevent the build-docs.xml from crapping out if the", 
   "xdocs directory doesn't exist, it does a mkdir on those directories", 
   "first.  Again, this is to make Maven as easy to use as possible.  Users", 
   "don't even need an xdoc directory and they'll get a web site with their", 
   "project."
  ], 
  "revision_id": "116676"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-17T17:22:04.000000Z", 
  "msg": [
   "Getting the \"dist\" target to work correctly."
  ], 
  "revision_id": "116675"
 }
]