[
 {
  "author": "kaz", 
  "date": "2002-03-17T05:20:54.000000Z", 
  "msg": [
   "This DVSL tool provides functionality similiar to Anakia's $relativePath", 
   "context variable.  DVSL currently does not provide any facilities to", 
   "obtain the relative path of a file with respece to the basedir specified", 
   "as part of the Ant task.  This tool provides the getRelativePath()", 
   "(based on the same method from Anakia).", 
   "Geir is making some changes to DVSL to enable this functionality to be", 
   "used.  Specifically, he is adding the name of the file that is currently", 
   "being processed by the DVSL Ant task into the context.  It was decided", 
   "that $relativePath was too specific to add into the DVSLTask so we opted", 
   "to build this tool and make a more generic change to DVSLTask.", 
   "Also included is the unit test for this class."
  ], 
  "revision_id": "116669"
 }, 
 {
  "author": "kaz", 
  "date": "2002-03-17T03:45:15.000000Z", 
  "msg": [
   "- Added a note about installing junit", 
   "- Updated the docs to reflect the two new elements of the project", 
   "descriptor that Jason added: <siteAddress> and <siteDirectory>."
  ], 
  "revision_id": "116668"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-17T00:42:39.000000Z", 
  "msg": [
   "Gather changes in the whole of the src/ directory and not just", 
   "src/java."
  ], 
  "revision_id": "116667"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-17T00:12:15.000000Z", 
  "msg": [
   "Adding the images needed by the cross referencer to the install and", 
   "and pointer the jxr task at ${maven.home} to find them. This should", 
   "allow any project to generate the xref now.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "116666"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-16T22:42:34.000000Z", 
  "msg": [
   "Images used by the cross ref. Going to make them part of the install", 
   "so that clients generating the docs don't choke looking for the images."
  ], 
  "revision_id": "116665"
 }
]