[
 {
  "author": "genspring", 
  "date": "2011-09-10T15:51:42.483285Z", 
  "msg": [
   "use \"if (name.startsWith(basePath)&& name.endsWith(FILE_PUBLISHER))\" to check the entry in bundle to determine if it's valid publishers."
  ], 
  "revision_id": "1167545"
 }, 
 {
  "author": "mukulg", 
  "date": "2011-09-10T15:45:02.653483Z", 
  "msg": [
   "committing a schema 1.1 change:", 
   "the commit made by Khaled during SVN commit 1166836, introduced a new parameter to method checkFacets (i believe, which was \"ValidationContext context\") in class XSSimpleTypeDecl (i'm not questioning that design change, and it was good i believe). This change broke one my private test case, which does XPath2 \"castable as\" check on user defined simple types (that use constraining facets).", 
   "I'm committing a new PsychoPath XPath jar which has a patch to solve this failure that I observed. For info to committers, the patch which this new jar file has, essentially has a following change,", 
   "ValidationState validationState = new ValidationState();", 
   "validationState.setTypeValidatorHelper(TypeValidatorHelper.getInstance(Constants.SCHEMA_VERSION_1_1)); // this is a new call that I've introduce in this patch, which make this new PsychoPath jar compliant to Khaled's change that I've cited above", 
   "The above code fragment is part of a PsychoPath engine method, that does a similar task as the Xerces method,", 
   "XSTypeHelper.isStrValueValidForASimpleType(..)  // at location \"org.apache.xerces.impl.xs.util\""
  ], 
  "revision_id": "1167544"
 }, 
 {
  "author": "avd", 
  "date": "2011-09-10T15:42:55.126917Z", 
  "msg": [
   "Added PhotArk Android Client Module, Initial Commit"
  ], 
  "revision_id": "1167543"
 }, 
 {
  "author": "danielsh", 
  "date": "2011-09-10T15:32:38.365556Z", 
  "msg": [
   "* subversion/libsvn_client/mergeinfo.c", 
   "(svn_client__elide_mergeinfo_catalog): Silence a const-ness warning by adding a cast."
  ], 
  "revision_id": "1167542"
 }, 
 {
  "author": "yegor", 
  "date": "2011-09-10T15:30:43.368419Z", 
  "msg": [
   "fixed failing xlsf test"
  ], 
  "revision_id": "1167541"
 }
]