[
 {
  "author": "kaz", 
  "date": "2002-04-07T23:45:47.000000Z", 
  "msg": [
   "As I was reworking a lot of the documentation the past few days, I've", 
   "come across some little nuggets of information that might not stick out", 
   "in the docs until an error is encountered.  So, rather than let these", 
   "little nuggets lay buried, I created the start of an FAQ."
  ], 
  "revision_id": "116994"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-07T23:44:08.000000Z", 
  "msg": [
   "Major rework of the Integration document.  All of this work is aimed at", 
   "making the entire process easier for the newcomer.  I've been trying", 
   "very hard to make this site's document feel like its integrated rather", 
   "than a bunch of disparate docs thrown up on a site."
  ], 
  "revision_id": "116993"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-07T23:42:17.000000Z", 
  "msg": [
   "Updated the description of the integration document to reflect the new", 
   "changes in documentation (example project descriptor and example maven", 
   "delegators have been moved into the integration document)."
  ], 
  "revision_id": "116992"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-07T23:39:00.000000Z", 
  "msg": [
   "Lots of changes:", 
   "- Removed the old list of properties that were described in this", 
   "document and used those as the basis of the new properties document.", 
   "- Added documentation regarding the new maven:maven-update target", 
   "- Updated the iutest documentation because all properties are now", 
   "defined in a separate document.", 
   "- Added documentation for the check-source task (Checkstyle stuff).", 
   "- Other changes that I can't remember.  :-)"
  ], 
  "revision_id": "116991"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-07T23:24:37.000000Z", 
  "msg": [
   "Revised the document to clearly indicate what is expected of Maven vs", 
   "what is generated of Maven.  Also added new information with regards to", 
   "the new Checkstyle stuff that was added."
  ], 
  "revision_id": "116990"
 }
]