[
 {
  "author": "struberg", 
  "date": "2011-09-16T20:37:02.399516Z", 
  "msg": [
   "EXTCDI-226 upgrade CODI to use latest OWB-1.1.1"
  ], 
  "revision_id": "1171765"
 }, 
 {
  "author": "igalic", 
  "date": "2011-09-16T20:36:59.338051Z", 
  "msg": [
   "TS-953: consolidate string copy/concat for cop."
  ], 
  "revision_id": "1171764"
 }, 
 {
  "author": "amc", 
  "date": "2011-09-16T20:35:45.612574Z", 
  "msg": [
   "Fixes for DNS fixes for TS-958 - remove self copying."
  ], 
  "revision_id": "1171763"
 }, 
 {
  "author": "lahiru", 
  "date": "2011-09-16T20:29:13.499118Z", 
  "msg": [
   "refactoring gfac-core."
  ], 
  "revision_id": "1171762"
 }, 
 {
  "author": "jwross", 
  "date": "2011-09-16T20:20:16.261559Z", 
  "msg": [
   "ARIES-748: Update subsystems to use Equinox impl of org.osgi.service.resolver.Resolver", 
   "The initial API and implementation of the Equinox org.osgi.service.resolver (RFC 112) is available in the master branches of the rt.equinox.bundles and rt.equinox.framework git repositories. I updated subsystems to make use of it. Previously, a quick and dirty Resolver adaptor wrapped around the existing Felix OBR implementation was used. Note the subsystems impl uses a registered Resolver service, so making use of the Equinox resolver simply meant adding the bundle to the itests project. When Felix releases their implementation of org.osgi.service.resolver, the two will (hopefully) be interchangeable.", 
   "Using the Equinox resolver highlighted some shortcomings in the subsystems implementation, which were fixed and are listed below.", 
   "(1) Updated subsystem-itests to bring in the Equinox resolver.", 
   "(2) Updated SubsystemEnvironment to return all capabilities that match a requirement, even those from the root subsystem (i.e. from the system bundle and any other already installed bundles). Previously, Felix OBR had been automatically providing these via the Resolver adaptor since Felix OBR has a built-in system repository. However, for the RFC 112 resolver, the expectation is the Environment will provide everything.", 
   "(3) Fixed an issue where the resource -> subsystem relationship was not being established for resources in the root subsystem causing an NPE.", 
   "(4) The FelixRequirementAdaptor must strip out the \"mandatory:<*\" clause from the filter or InvalidSyntaxException occurs.", 
   "(5) OsgiIdentityRequirement now includes the filter directive.", 
   "(6) Added namespace translations to FelixResourceAdaptor."
  ], 
  "revision_id": "1171761"
 }
]