[
 {
  "author": "kaz", 
  "date": "2002-04-27T14:44:46.000000Z", 
  "msg": [
   "Combined the Date and Time columns into one so they can be wrapped with", 
   "Date on top of Time.  This helps reduce wasted screen space."
  ], 
  "revision_id": "117254"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-27T14:23:10.000000Z", 
  "msg": [
   "Typo."
  ], 
  "revision_id": "117253"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-27T14:10:47.000000Z", 
  "msg": [
   "- Updated to the latest and greatest stylesheets from our friends over", 
   "at style.tigris.org.  This resulted in the removal and addition of a", 
   "few stylesheets.  They re-organized the stylesheets for greater", 
   "flexibility.", 
   "- Created two local Maven stylesheets that contain the Maven local", 
   "modifications to the style.tigris.org stylesheets.  This enables us to", 
   "update the style.tigris.org stylesheets in a much easier fashion (just", 
   "replace them).  The local Maven stylesheets use the \"cascading\"", 
   "feature of stylesheets to override some settings in the tigris", 
   "stylesheets.", 
   "- Changed the default look for <source> regions.  I never cared for the", 
   "yellow boxes I initially chose when fitting the xdoc to the scarab", 
   "look and feel.  The new look is a very simple box around the source", 
   "(similar to anakia but the boxes is a consistent width).", 
   "- Users can now customize the colors used when Maven generates the web", 
   "site for a project.  These customizations are in the form of", 
   "properties that can be overridden.  The defaults are specified in", 
   "Maven's default.properties file, and users can override these color", 
   "settings in their project's project.properties file.  The build system", 
   "uses Ant's filter mechanism to replace the color selections specified", 
   "via properties in the local Maven stylesheets.  For example, if you", 
   "want to change the blue banner and blue section header to green, you", 
   "would add the following two properties to your project.properties", 
   "file:", 
   "ui.banner.background = #00500f", 
   "ui.section.background = #00500f", 
   "- Lastly, updated all of the documentation to reflect this new feature.", 
   "Also fully documented each color property in the Properties document.", 
   "There are a total of 37 customizable color properties that can be set."
  ], 
  "revision_id": "117252"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-27T13:56:43.000000Z", 
  "msg": [
   "Added a 'maven:docs-quick' target that can be used for testing out", 
   "changes to the color scheme without having to wait for the generation of", 
   "all site documentation (such as checkstyle, changelog, unit test, metric", 
   "reports).  Also updated the documentation to reflect the new target."
  ], 
  "revision_id": "117251"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-27T13:50:32.000000Z", 
  "msg": [
   "Creating the start of the beta4 announcement."
  ], 
  "revision_id": "117250"
 }
]