[
 {
  "author": "kaz", 
  "date": "2002-04-28T17:48:25.000000Z", 
  "msg": [
   "Fixed a problem found by Jeff.  The documentation task would crap out if", 
   "Ant was not invoked in the base directory of the project."
  ], 
  "revision_id": "117259"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-28T17:35:00.000000Z", 
  "msg": [
   "Backing out the changes I made regarding the site.dvsl file directly", 
   "reading project.xml instead of using the Java POM object stuffed into", 
   "the DVSL toolbox.  Ideally, it should use the Java POM object, but", 
   "MavenTool assumes that Ant was invoked in the project's base directory.", 
   "If this is not the case, then it bombs.", 
   "As a result, the patch I submitted regarding this should also be", 
   "disregarded as it contains the same problem.  Having a single interface", 
   "to obtain a reference to the POM is a great idea, but only if that", 
   "interface can actually load the POM in a reliable manner."
  ], 
  "revision_id": "117258"
 }, 
 {
  "author": "dion", 
  "date": "2002-04-28T15:36:58.000000Z", 
  "msg": [
   "Added message so dist doesn't fail silently"
  ], 
  "revision_id": "117257"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-27T16:17:20.000000Z", 
  "msg": [
   "Somewhere along the line, Maven refused to build documentation for", 
   "documentation-only projects (i.e. those without any source directories).", 
   "This change fixes that problem.  Now, projects such as", 
   "jakarta-turbine-site build again."
  ], 
  "revision_id": "117256"
 }, 
 {
  "author": "kaz", 
  "date": "2002-04-27T15:45:20.000000Z", 
  "msg": [
   "Previously, the DVSL templates would gain access to the POM via a DVSL", 
   "statement such as:", 
   "$node.selectSingleNode(\"document('project.xml')/project\")", 
   "This would use DVSL/dom4j to traverse the POM.  This has been replaced", 
   "because the POM may not always be supplied via an XML file.  In the", 
   "future it may come from a database, etc ...", 
   "Thus, the POM is now inserted into the DVSL templates via the toolbox", 
   "using the MavenTool."
  ], 
  "revision_id": "117255"
 }
]