[
 {
  "author": "kaz", 
  "date": "2002-05-04T01:50:11.000000Z", 
  "msg": [
   "Maven generates (among other things): index.xml, dependencies.xml,", 
   "developer-list.xml, and mail-lists.xml using DVSL which takes the", 
   "project descriptor as input (project.xml) and transforms it", 
   "appropriately.", 
   "I'm changing the generation of this content to use Texen instead because", 
   "I need to generate other content besides content that is based on the", 
   "project descriptor.  Since we have a Texen task that already has the POM", 
   "loaded in the context, it was trivial to move the above doc generation", 
   "to use Texen so all of the document generation can be done in a uniform", 
   "manner.", 
   "Also, by using Texen we also remove the dependency that project.xml has", 
   "to exist in the filesystem.  A nice side-effect."
  ], 
  "revision_id": "117304"
 }, 
 {
  "author": "dion", 
  "date": "2002-05-03T22:32:04.000000Z", 
  "msg": [
   "no message"
  ], 
  "revision_id": "117303"
 }, 
 {
  "author": "kaz", 
  "date": "2002-05-03T14:01:17.000000Z", 
  "msg": [
   "Made a little change to imply that multiple remote repos can now be", 
   "used."
  ], 
  "revision_id": "117302"
 }, 
 {
  "author": "dion", 
  "date": "2002-05-03T06:58:37.000000Z", 
  "msg": [
   "Patch from Dan Everton <Dan.Everton@Australia.Boeing.com> that places the Proxy", 
   "Port back into the project verifier, as used by maven:verify-project when downloading", 
   "jar files for the build"
  ], 
  "revision_id": "117301"
 }, 
 {
  "author": "dion", 
  "date": "2002-05-03T06:03:26.000000Z", 
  "msg": [
   "Glenn McAllister's patch for multiple maven jar repositories.", 
   "Currently if you specify a dependancy on a jar, it is downloaded from only", 
   "one place - the URL pointed to by the maven.repo.remote property.  This is", 
   "fine for maven itself, but what about organizations that want a \"local\"", 
   "remote repository of jars in addition to those provided by Maven?", 
   "This patch permits the maven.repo.remote property to be a comma separated", 
   "list of URLs, providing the ability to have multiple \"remote\" repositories", 
   "of pre-built jars."
  ], 
  "revision_id": "117300"
 }
]