[
 {
  "author": "bodewig", 
  "date": "2011-09-30T04:26:02.377250Z", 
  "msg": [
   "Maybe the nags get through if I change the from address"
  ], 
  "revision_id": "1177505"
 }, 
 {
  "author": "bodewig", 
  "date": "2011-09-30T04:24:47.314438Z", 
  "msg": [
   "fix test expressions for 3.5 and 4.0 frameworks"
  ], 
  "revision_id": "1177504"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-09-30T04:21:23.213443Z", 
  "msg": [
   "Several Fixes related to STANBOL-329 (wrong Character encoding)", 
   "Corrected Bugs:", 
   "* FreeMakerViewProcessor: Added DefaultEncoding and OutputEncoding to the default configuration. Both is set to \"urn-8\"", 
   "* The OutputStreamWriter used to write the data generated by FreeMaker to the OutputStream of the HTTP response now uses \"utf-8\" instead of the platform default as charset.", 
   "* JsonLdSerializerProvider: Similar to the FreeMakerViewProcessor this Provider also was not defining \"utf-8\" as charset on the OutputStreamWriter and used therefore the Plattform specific encoding.", 
   "Improvements:", 
   "* All MessageBodyWriter of the \"commons.web.base\", \"enhancer.jersey\" and \"entityhub.jersey\" do no longer use the \"@Produces\" annotation but manually check the MediaType in the isWriteable(..) method. This is a requirement to allow the definition of the charset parameter in the \"Content-Type\" header of the response. Jersey does not support parameters to this header field and would therefore not match Content-Types that include the charset parameter with types defined by the \"@Produces\" header.", 
   "* All **Resource classes of the Entityhub now define the charset parameter in responses. For the Enhancer this changes are still commented. This is mainly to allow testing if the definition of the charset is a requirement. Because of JERSEY-318 the definition of the \"Content-Type\" parameter including the charset parameter must be done by manually setting the this header. The build in methods for setting the MediaType can not be used.", 
   "Still present potential issues:", 
   "* It need to be tested if the setting of the charset parameter for the \"Content-Type\" header of reposes is a requirement. To test the difference the charset parameter is currently used for the Entityhub and not used for the Enhancer.", 
   "* MessageBodyWriter need to get the charset parameter from the \"Content-Type\" header and use it to serialize responses. This is already done for XML and JSON responses, but not for all Clerezza based serializers because the interface of Clerezza does not support the definition of a charset.", 
   "* The changes mentioned here are only applied to the Entityhub, Enhancer and the common.web.* modules. Similar changes would be also needed for the other modules that define web interfaces", 
   "best", 
   "Rupert"
  ], 
  "revision_id": "1177503"
 }, 
 {
  "author": "khopesh", 
  "date": "2011-09-30T04:20:59.475110Z", 
  "msg": [
   "FP redux for SPOOF_COM2OTH SPOOF_COM2COM SPOOF_NET2COM and HELO_DYNAMIC_IPADDR2"
  ], 
  "revision_id": "1177502"
 }, 
 {
  "author": "tedyu", 
  "date": "2011-09-30T04:20:34.485593Z", 
  "msg": [
   "HBASE-4145  Provide metrics for hbase client (Ming Ma)"
  ], 
  "revision_id": "1177501"
 }
]