[
 {
  "author": "dion", 
  "date": "2002-06-10T16:44:34.000000Z", 
  "msg": [
   "Added a real project.xml for testing purposes.", 
   "Changed the tests to use this file.", 
   "Changed Build's set...Descriptor to generate the maven project at that time."
  ], 
  "revision_id": "117824"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-06-10T16:01:04.000000Z", 
  "msg": [
   "Added an experimental, brain storming way in which users could define Ant-like XML files for overriding Maven targets.", 
   "So this is an alternative to the call-back idea. Notice that there's no pair of properties to set for each pre/post condition.", 
   "Just a simple bit of XML then use regular Ant tasks.", 
   "I'd certainly prefer to do plugins this way. It would also avoid having to cut and paste all the various Maven targets into a build file.", 
   "If I don't need callbacks I wouldn't need this at all.", 
   "Or maybe this stuff could be put in the project.xml?"
  ], 
  "revision_id": "117823"
 }, 
 {
  "author": "werken", 
  "date": "2002-06-10T15:43:58.000000Z", 
  "msg": [
   "Hacks to allow ant tasks in a build.xml directly access data", 
   "within the POM.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "117822"
 }, 
 {
  "author": "dion", 
  "date": "2002-06-10T15:18:24.000000Z", 
  "msg": [
   "Tests for the -p or --project option", 
   "Change getOptions from static to non."
  ], 
  "revision_id": "117821"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-06-10T14:17:48.000000Z", 
  "msg": [
   "added an experimental mediator jelly script to show how we could initialize maven once then use jelly to mediate between the POM beans, properties and Ant tasks.", 
   "here we use jexl to access the pom and use pom.getProperties() to get Ant style properties.", 
   "Note if we didn't use '.' as a separator between names in the properties life would be easier, we could", 
   "use ${maven_compile_deprecation} for example.", 
   "this example doesn't show how to do plugins in a better way, though that should be able to be done on the client side, invoking stuff before or after the body of a target."
  ], 
  "revision_id": "117820"
 }
]