[
 {
  "author": "rmuir", 
  "date": "2011-10-04T20:40:03.076646Z", 
  "msg": [
   "SOLR-2303: remove unnecessary (and problematic) log4j jars in contribs"
  ], 
  "revision_id": "1178945"
 }, 
 {
  "author": "carlucci", 
  "date": "2011-10-04T20:20:37.046178Z", 
  "msg": [
   "RAVE-230: implement OpenSocial requestNavigateTo function", 
   "Since we currently only support two OpenSocial views in Rave (HOME and CANVAS), the initial implementation of our requestNavigateTo only supports those two view types.  As new OpenSocial view types are supported in Rave they can easily be supported in the requestNavigateTo function as well.  Also, I modified the canvas-nav.xml gadget to demo/test this feature."
  ], 
  "revision_id": "1178944"
 }, 
 {
  "author": "ate", 
  "date": "2011-10-04T20:17:59.493679Z", 
  "msg": [
   "JS2-1267: Protected anonymous guest user against removal and restrict modifications allowed", 
   "See: http://issues.apache.org/jira/browse/JS2-1267"
  ], 
  "revision_id": "1178943"
 }, 
 {
  "author": "stsp", 
  "date": "2011-10-04T20:17:29.130056Z", 
  "msg": [
   "Factor out code from merge_binary_file(), which handles the trivial case where", 
   "the left side of the merge equals the merge target, into a separate function.", 
   "Prepares for future reuse of this code during text merges.", 
   "See issue #4009, \"Big trivial text files merged MUCH slower than binary\".", 
   "(Because I'm travelling I couldn't run the full test suite on this", 
   "patch before commit. Apologies if this breaks anything.)", 
   "* subversion/libsvn_wc/merge.c", 
   "(merge_binary_file): Factor out the trivial merge case into ...", 
   "(merge_file_trivial): ... this new function. Also cope with the target", 
   "being a dangling symlink (which is one of the issues exposed by test", 
   "failures if the trivial merge is performed in the text merge code path)."
  ], 
  "revision_id": "1178942"
 }, 
 {
  "author": "marvin", 
  "date": "2011-10-04T20:16:02.510943Z", 
  "msg": [
   "Introduce a space saving macro."
  ], 
  "revision_id": "1178941"
 }
]