[
 {
  "author": "rwesten", 
  "date": "2011-10-07T20:21:13.497303Z", 
  "msg": [
   "This fixes STANBOL-342 by replacing the SPARQL query with several graph.filter(..) calls.", 
   "On the test case with ~ 150 Text- and 100 Entityannotation the processing time was reduced from ~20sec to about 500ms"
  ], 
  "revision_id": "1180200"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-10-07T20:18:41.278426Z", 
  "msg": [
   "Further improvements related to keyword linking.", 
   "This changes should complete the initial version of the KeywordLinkingEnigne (function wise). Regarding STANBOL-303 (making EntityFetching -> EntityLinker component) there is still some additional work (line a plug-able label matching) to do.", 
   "Changes in detail:", 
   "Language Processing:", 
   "* Some adaption the the configuration of POS tags", 
   "* The POSTypeChunker now (again) follows tokens with POS tags marked as follow backwards. This is mainly to include with Adjective like \"10th European Day of Languages\"-", 
   "* Tokens as used by the TextAnalyzer now have a boolean property if they contain at least a single Alpha-Numerical char. This makes is more performant to filter tokens that represent punctation and so on.", 
   "* Deactivated language specific Tokenizer for Danish and Swedish", 
   "KeywordExtractionEngine", 
   "* Processing state now also holds the last \"consumed\" item. This is intended to allow backwards search for matching words until the last \"consumed\" word (already linked with an entity).", 
   "* The label matching now also able to search backwards for matching tokens. (e.g. to correctly match the \"10th {event name}\" or the \"European {role name}\" ...", 
   "* Matching now ignores Tokens without any alpha-numerical char", 
   "* Matching now again counts non-processable tokens. This has advantages and disadvantages.  The best solution would be to exclude stop-words however currently there are no stop word lists available.", 
   "other changes", 
   "* reactivate default values for Persons, Organization and Place states for the NamedEntityLinkingEnige so that in the Apache Felix Webconsole they are correctly presented as boolean properties.", 
   "* added the \"http://www.opengis.net/gml/\" to the NamespaceEnum of the Entityhub as this is namespace is used by DBpedia"
  ], 
  "revision_id": "1180199"
 }, 
 {
  "author": "norman", 
  "date": "2011-10-07T20:17:01.971383Z", 
  "msg": [
   "Start on work to make sure event can not get missed on select. See IMAP-342"
  ], 
  "revision_id": "1180198"
 }, 
 {
  "author": "ggregory", 
  "date": "2011-10-07T20:12:48.405654Z", 
  "msg": [
   "[LANG-759] Add Support in SystemUtils for Windows Server 2003 and Windows Server 2008."
  ], 
  "revision_id": "1180197"
 }, 
 {
  "author": "tomaz", 
  "date": "2011-10-07T20:11:08.290651Z", 
  "msg": [
   "Make namespace argument optional in all the xml utility functions."
  ], 
  "revision_id": "1180196"
 }
]