[
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:24.000193Z", 
  "msg": [
   "Allow the regionsLocality maping to be written/loaded from the disk, instead of recalculating it each time.", 
   "Test Plan:", 
   "(i) mvn package", 
   "(ii) deploy and run on the dev cluster", 
   "(a) ensure that the file was created when run for the first time (when it didn't exist).", 
   "(b) stop+start HBase. ensure that the snapshot is loaded from the file,", 
   "and not recomputed. Also check that the modified time is not changed.", 
   "(c) set the timeout value to something small and check that the snapshot", 
   "is recreated.", 
   "(d) delete the file and check that the file is recreated", 
   "Reviewers: kannan, kranganathan, liyintang, bogdan", 
   "Reviewed By: kannan", 
   "CC: nspiegelberg, , aaiyer, kranganathan, kannan, bogdan", 
   "Differential Revision: 306796", 
   "Conflicts:", 
   "src/main/java/org/apache/hadoop/hbase/util/FSUtils.java"
  ], 
  "revision_id": "1181960"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:20.914871Z", 
  "msg": [
   "Fix out of bounds error in MultiPut portion of HBaseRPC's logResponse", 
   "Summary: D288291 introduced an off-by-one error in an array index. Thanks to", 
   "Mikhail for finding this.", 
   "Test Plan: Compiled and ran on dev server.", 
   "Reviewers: mbautin", 
   "Reviewed By: mbautin", 
   "CC: hbase@lists, mbautin", 
   "Differential Revision: 315114", 
   "Blame Revision: D288291"
  ], 
  "revision_id": "1181959"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:18.182081Z", 
  "msg": [
   "Batch CF Updates on table alters", 
   "Summary:", 
   "HBaseAdmin and HMasterInterface provide no way to batch alterations to a table.", 
   "This results in RPC inefficiency, wasteful extra writes to META and, with the", 
   "introduction of online schema change, a much worse problem that all regions have", 
   "to be restarted for each separate change in a single table alter.", 
   "This patch includes a new ColumnOperation, MultiColumnOperation, that performs", 
   "all of the changes requested for each region at the same time, and performs a", 
   "single write to META for each region. It also includes necessary reorganization", 
   "of the existing ColumnOperations to enable this functionality.", 
   "It also exposes new methods to both HBaseAdmin clients and HMasterInterface RPC", 
   "clients so that they can make batch calls in order to make use of this batched", 
   "update feature.", 
   "A few design decisions that could be controversial:", 
   "1. Four method prototypes are exposed for each type of operation (add, modify,", 
   "delete) in HBaseAdmin, plus two for the batched operation. This is in order to", 
   "allow easy per-operation batching and in order to not require the user to", 
   "perform String-to-bytes conversions. It also follows the current conventions in", 
   "HBaseAdmin, which exposes String equivalents for each non-batched operation.", 
   "However, it is a possibility that the confusion of having so many options for", 
   "each operation is not worth the added convenience. I'm up for suggestions here.", 
   "2. Used three lists (one each for add, delete, modify) rather than some kind of", 
   "new \"MultiAlter\" type. This is also for simplicity to the user, but the tradeoff", 
   "is not being able to, say, perform String-to-bytes conversions automatically, or", 
   "to reduce the number of required method prototypes. Once again, certainly", 
   "interested in suggestions!", 
   "Test Plan:", 
   "Ran all unit tests. No failures.", 
   "Basic sanity tests on dev server:", 
   "Prior to Patch, for N changes in a single alter, we see N updates, complete", 
   "with N region restarts:", 
   "hbase(main):003:0> alter 'peeps', {NAME => 'demographics'}, {NAME => 'name',", 
   "VERSIONS => '1'}, {NAME => 'location', METHOD => 'delete'}", 
   "Updating all regions with the new schema...", 
   "0/1 regions updated.", 
   "0/1 regions updated.", 
   "0/0 regions updated.", 
   "Done.", 
   "Updating all regions with the new schema...", 
   "0/1 regions updated.", 
   "0/1 regions updated.", 
   "0/0 regions updated.", 
   "Done.", 
   "Updating all regions with the new schema...", 
   "0/1 regions updated.", 
   "0/1 regions updated.", 
   "0/0 regions updated.", 
   "Done.", 
   "0 row(s) in 9.2600 seconds", 
   "After patch, for N alterations, we have one update:", 
   "hbase(main):009:0> alter 'peeps', {NAME => 'demographics', METHOD => 'delete'},", 
   "{NAME => 'name', VERSIONS => '2'}, {NAME => 'location', VERSIONS => '1'}", 
   "Updating all regions with the new schema...", 
   "0/1 regions updated.", 
   "0/1 regions updated.", 
   "0/0 regions updated.", 
   "Done.", 
   "0 row(s) in 3.0920 seconds", 
   "Reviewers: nspiegelberg, kannan, kranganathan", 
   "Reviewed By: kannan", 
   "CC: hbase@lists, kannan", 
   "Differential Revision: 314294", 
   "Task ID: 678576"
  ], 
  "revision_id": "1181958"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:14.609751Z", 
  "msg": [
   "Table doesn't need to be online to check schema consistency.", 
   "Summary: Changed script so that it doesn't need the table to be online.", 
   "Original table descriptor is then the td of the first row in META for that", 
   "table.", 
   "Test Plan: Tested on dev cluster.", 
   "Reviewers: kannan", 
   "Reviewed By: kannan", 
   "CC: kannan", 
   "Differential Revision: 315010", 
   "Task ID: 689697"
  ], 
  "revision_id": "1181957"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:12.838216Z", 
  "msg": [
   "Fix logging of peak time compactions.", 
   "Summary:", 
   "There was a bug where the peak time logic used to throw warning", 
   "messages for default values.", 
   "Test Plan:", 
   "1) TestStore", 
   "2) Verify TestStore doesn't throw the warning messages.", 
   "Reviewers: kannan", 
   "Reviewed By: kannan", 
   "CC: pritam, hbase@lists, , kannan", 
   "Differential Revision: 314357"
  ], 
  "revision_id": "1181956"
 }
]