[
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:09.576942Z", 
  "msg": [
   "Commiting dgoode's patch: Wormhole Support in HBase89 Thrift", 
   "Summary:Added the single-hop regionserver from 90 to 89 and backported the necessary thrift calls. Regenerated the thrift files. Diff is a commit above D296169 although it can be separated, with the exception of thrift generation which must be redone.", 
   "Added forgotten shutdown, put after master-startup-wait to avoid errors.", 
   "Reviewed By:kranganathan", 
   "Test Plan:Chip will run his wormhole unit tests. I will also attempt to test some of these functionalities from WWW on my dev cluster.", 
   "Per Chip: it works! test passes!", 
   "Revert Plan:OK", 
   "- end platform impact -"
  ], 
  "revision_id": "1181955"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:04.033102Z", 
  "msg": [
   "Fix & improve TestHFilePerformance.", 
   "Summary:", 
   "Due to bug TestHFilePerformance was adding keys not in lexographical order.", 
   "The sanity check would not work because key byte[] array was reused, so", 
   "lastKeyBuffer was usually pointing to the same buffer.", 
   "The bug is fixed in this diff:", 
   "Moreover:", 
   "- better generation of values; instead of simply repeating them, some parts are", 
   "redundant and other generated randomly", 
   "- generate dataset once only and reuse it in different tests", 
   "- exclude generating data from performance meassure", 
   "- remove unused arguments", 
   "Test Plan: Run TestHFilePerformance unit test.", 
   "Reviewers: pkhemani, kranganathan, mbautin", 
   "Reviewed By: pkhemani", 
   "CC: gqchen, hbase@lists, pkhemani, jacek", 
   "Differential Revision: 312035", 
   "Revert Plan: This commit does not affect HBase itself. Only unit test is", 
   "affected.", 
   "Task ID: 687599"
  ], 
  "revision_id": "1181954"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:44:01.395020Z", 
  "msg": [
   "Port online schema changes to 89", 
   "Summary:", 
   "Enables changing the hbase schema without disabling the table.", 
   "The schema update takes place in the following steps:", 
   "1. Update Meta", 
   "2. Close all regions of the table.", 
   "3. Open the regions (preferably on the same region server) so that they have", 
   "the updated schema.", 
   "This is achieved with the help of in memory data structures on the Master. The", 
   "sequence of steps is:", 
   "1. Client issues a addColumn", 
   "2. Master updates the .META. and creates a mapping of all the regions of that", 
   "table that need to be updated.", 
   "3. The master then issues a close to the region servers - a configurable number", 
   "of regions may be closed per region server.", 
   "4. When the master receives a notification that one of the reopening regions", 
   "has opened, it removes this region from the in memory data structure, and closes", 
   "the next set of regions on this region server.", 
   "Test Plan: run unit tests", 
   "Reviewers: kranganathan, kannan, nspiegelberg, bogdan", 
   "Reviewed By: kranganathan", 
   "CC: hbase@lists, gqchen, kranganathan, liyintang, nileema, bogdan, kannan", 
   "Differential Revision: 299930", 
   "Task ID: 668176"
  ], 
  "revision_id": "1181953"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:43:56.329248Z", 
  "msg": [
   "Enable preferred assignment in MiniHBaseCluster for unit tests", 
   "Summary:", 
   "Previously, there were some unit tests failure caused by preferred assignment.", 
   "So this preferred assignment was disabled for MiniHBaseCluster since the diff", 
   "https://phabricator.fb.com/D271660 .", 
   "It is always a good idea to keep the MiniHBaseCluster as the same behavior as a", 
   "real HBase cluster does.", 
   "Also I have fully understood why the unit test would fail before.", 
   "There are 2 reasons contributing to this problem.", 
   "1) When enabling the preferred assignment, the master will hold the region", 
   "assignment for its best locality region server for a period of time (1 mins), if", 
   "its best locality region server has not checked in master.", 
   "But there is a potential bug in the code that it will also hold the region", 
   "assignment EVEN there is no best locality region server for this region.", 
   "This bug only happens when the HBase client tries to create a new table when", 
   "the master is trying to hold regions assignment for its best locality region", 
   "server, which caused the client throws RetryExhausted Exception.", 
   "So fix the bug in this diff.", 
   "2) There are some unit tests which depends on load balancer running.", 
   "So let these unit test function wait for the load balancer running.", 
   "To sum up, this diff is going to enable to preferred assignment in", 
   "MiniHBaseCluster for all unit tests, fix 1 assignment bug and update 2 unit", 
   "tests.", 
   "Test Plan:", 
   "Have run all the unit tests.", 
   "Only 1 failed unit test case is failed, but this unit test has been failed", 
   "recently. Pretty sure that it is not caused by this diff.", 
   "testCloseHRegionRetry(org.apache.hadoop.hbase.regionserver.TestHRegionCloseRetry)", 
   "Also I will test them on the dev cluster later.", 
   "Reviewers: kannan, kranganathan, pritam, gqchen", 
   "Reviewed By: kannan", 
   "CC: , hbase@lists, kannan", 
   "Differential Revision: 312480"
  ], 
  "revision_id": "1181952"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T17:43:52.647094Z", 
  "msg": [
   "Backport thrift multiget/checkmutate to 89", 
   "Summary: added multiget/checkmutate functions to thrift and also added multiget", 
   "support to regionserver and client connection handling backend. It uses a", 
   "Template, which minimizes code changes but is pretty hacky. Suggestions welcome!", 
   "Now with regenerated 0.20 code from a thrift compiler that actually worked!", 
   "Test Plan: Made tiny unit test addition for now; needs very extensive testing", 
   "when used! However, effects on existing, non-multiget applications are", 
   "negligible.", 
   "Reviewers: kranganathan, mbautin", 
   "Reviewed By: kranganathan", 
   "CC: hisham, dhruba, jgray, dgoode, kranganathan", 
   "Differential Revision: 296169", 
   "Task ID: 622045"
  ], 
  "revision_id": "1181951"
 }
]