[
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T02:03:16.110149Z", 
  "msg": [
   "Changing class name of Tester", 
   "Summary:", 
   "Kannan suggested changing the classname to avoid mvn to run it as unit test.", 
   "Test Plan:", 
   "Everything is working properly after the change", 
   "DiffCamp Revision: 156786", 
   "Reviewed By: kannan", 
   "CC: achao, kannan, hbase@lists", 
   "Revert Plan:", 
   "OK"
  ], 
  "revision_id": "1181375"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T02:03:05.310076Z", 
  "msg": [
   "Load test suite", 
   "Summary:", 
   "This test suite enables running load tests against hbase in ways similar to the", 
   "appserver use cases. Multiple column families for different use-cases can be", 
   "tested together.", 
   "Currently provided use-cases are 'ActionLog', 'Snapshot' and 'search'. The", 
   "interface is developed such that it can be easily extended to cover more", 
   "use-cases.", 
   "All parameters including rows, timestamps, number of columns and size of data", 
   "are configurable using a properties file. A filter type can also be specified", 
   "individually for each column family using 'FilterType'. Versioning is also", 
   "tested using configurable parameters.", 
   "The use-cases are in accordance with discussions held with Karthik and", 
   "Prashant. This test is for internal purposes only and will not be committed to", 
   "public trunk.", 
   "Test Plan:", 
   "Have run lots of tests using it and compared the results. Ran it for all", 
   "combination of column families: ActionLog, Snapshot and Search. Did manual", 
   "debugging and results analysis.", 
   "Moreover, this code is itself a test :)", 
   "DiffCamp Revision: 146646", 
   "Reviewed By: kannan", 
   "CC: davidrecordon, achao, kannan, pkhaitan, hbase@lists", 
   "Tasks:", 
   "#289860: Adding to load test framework", 
   "#297166: Functional tests to verify cluster - could re-use this to check", 
   "cluster provisioning for new clusters as well", 
   "Revert Plan:", 
   "OK"
  ], 
  "revision_id": "1181374"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T02:02:57.078313Z", 
  "msg": [
   "Cleanup ZK usage in internal hbase branch", 
   "Summary:", 
   "We need to abort when we get session expiration.", 
   "This is a first cut, need to go back over list of what we wanted to fix.  Not", 
   "meant for commit yet.", 
   "I still need to add fix where we delete the unassigned node after close of", 
   "disabled region.", 
   "Test Plan:", 
   "I think this breaks unit tests.", 
   "DiffCamp Revision: 152879", 
   "Reviewed By: kannan", 
   "Commenters: kranganathan", 
   "CC: jgray, kannan, kranganathan, hbase@lists", 
   "Revert Plan:", 
   "OK"
  ], 
  "revision_id": "1181373"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T02:02:52.894149Z", 
  "msg": [
   "Fixing sequenceid problem in StoreFile", 
   "Summary:", 
   "There was a bug in StoreFile wherein we used to throw an Exception when the", 
   "sequence id was -1. However, the bulk load files did not have a sequence id and", 
   "they had to use the default sequence id of -1. In such cases, any query", 
   "getSequenceID() would result in throwing an Exception.", 
   "This was fixed in public trunk by Stack as part of a bigger change in revision", 
   "991397 for HBASE-2692 on 8/31/10.", 
   "Test Plan:", 
   "The test which was failing previously is running properly after using this", 
   "patch. Also running the entire test suite once again.", 
   "DiffCamp Revision: 156055", 
   "Reviewed By: jgray", 
   "CC: jgray, hbase@lists", 
   "Revert Plan:", 
   "OK"
  ], 
  "revision_id": "1181372"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2011-10-11T02:02:45.851650Z", 
  "msg": [
   "Eliminate duplicates, stale versions. Have determined behaviour and storefile ordering", 
   "Summary:", 
   "Goodbye duplicates, hello consistent ordering.", 
   "A way to order multiple cells having same keys. Every StoreFile will have a", 
   "timestamp associated with it and when any two cells have same keys, they will be", 
   "sorted based on timestamps of the StoreFiles they come from. Therefore, for", 
   "duplicate versions of a cell, the version which came in latest will be returned.", 
   "We are ensuring that only one version will be returned.", 
   "There are two components in this patch. The first one is associated with", 
   "KeyValueHeap and it ensures that duplicate cells are ordered correctly. The", 
   "second one is in ColumnTracker and it ensures that only one version is allowed", 
   "to be returned from StoreScanner.", 
   "For all existing files and/or any files which do not have the 'TIMESTAMP' field", 
   "in meta, their timestamp will be set to zero which means they will be assumed to", 
   "be the 'oldest' file.", 
   "Also changed the return codes in ColumnTracker to be consistent with definition", 
   "of ScanQueryMatcher.ReturnCode.", 
   "Included a fix to sort the list of StoreFiles after compaction.", 
   "This patch addresses the issues raised in HBASE-1485, HBASE-2406, HBASE-2649,", 
   "HBASE-997.", 
   "Discussed design issues with Jonathan and Kannan. Accepted by Jonathan and Ryan", 
   "in public review.", 
   "Test Plan:", 
   "All existing tests are passing and running through this code path.", 
   "Added two tests in TestColumnSeeking which use several combination of columns,", 
   "rows, values and ensure that only the most recent one is returned. This test", 
   "will be useful for testing all kinds of column reseeking, row reseeking, etc.", 
   "Added tests to TestFromClientSide to do client side testing.", 
   "Enabled testDuplicateVersions() which was present in TestFromClientSide.", 
   "Fixed two assert statements in testDuplicateVersions()", 
   "DiffCamp Revision: 155188", 
   "Reviewed By: kannan", 
   "CC: davidrecordon, achao, kannan, pkhaitan, hbase@lists", 
   "Tasks:", 
   "#318553: Fix the ability to query the right column value after a modification", 
   "to a particular timestamp.", 
   "Revert Plan:", 
   "OK"
  ], 
  "revision_id": "1181371"
 }
]