[
 {
  "author": "mamta", 
  "date": "2011-10-12T20:15:50.833037Z", 
  "msg": [
   "DERBY-3823 NullPointerException in stress.multi test", 
   "DERBY-5459 Result set metadata are out of sync on client after underlying table is altered", 
   "Adding a test case showing that in case of a network server, an open resulset's metadata can get changed underneath it but it is not reflected in the metadata. The test creates a table with one of column as varchar(5). It inserts 1000 rows and then opens a reulset on that table with varchar column as one of the columns. The test verifies that the reulset's metadata at this point shows the length of the column as 5. Next, while the resulset is still open, the tests does an ALTER TABLE to increase the varchar column's length to 8. In case of embedded mode, this fails because of the open resulset. In case of network server, because of prefetching of rows, the ALTER TABLE is allowed but when the test gets the resulset's metadata again and checks the length of varchar column, it still shows the length to be 5 rather than 8.", 
   "There are couple other jiras related to network server prefetching, namely, DERBY-3839 and DERBY-4373.", 
   "Once DERBY-5459 is fixed, we should see the change in metadata reflected in resultset's metadata. A fix for DERBY-5459 will cause the following test added here to fail. Right now, the new test accepts the incorrect metadata length obtained through the resultset's metadata after ALTER TABLE has been performed in network server mode."
  ], 
  "revision_id": "1182570"
 }, 
 {
  "author": "jbonofre", 
  "date": "2011-10-12T20:13:32.242324Z", 
  "msg": [
   "[KARAF-930] Add bundles selector support in BundlesMBean allowing the usage of ID, ID range, name, and version to identify bundles"
  ], 
  "revision_id": "1182569"
 }, 
 {
  "author": "struberg", 
  "date": "2011-10-12T20:13:00.395841Z", 
  "msg": [
   "OWB-621 provide additional servlet hook integration for containers < servlet-2.5", 
   "Thanks to Bernd Bohmann (apacheId: bommel) for contributing this feature!"
  ], 
  "revision_id": "1182568"
 }, 
 {
  "author": "raffaeleguidi", 
  "date": "2011-10-12T20:11:54.395059Z", 
  "msg": [
   "removed and added to the ignore list eclipse configuration files"
  ], 
  "revision_id": "1182567"
 }, 
 {
  "author": "julianfoad", 
  "date": "2011-10-12T20:11:28.489703Z", 
  "msg": [
   "On the 'tree-read-api' branch:", 
   "* subversion/libsvn_client/tree.c", 
   "(wc_tree_get_dir): Allocate results in the result pool not the scratch pool.", 
   "Found by: gstein"
  ], 
  "revision_id": "1182566"
 }
]