[
 {
  "author": "glennm", 
  "date": "2002-07-12T19:32:36.000000Z", 
  "msg": [
   "Glenn McAllister - 2002/07/12", 
   "- Added xml declaration to the top of driver.jelly so vim will do syntax", 
   "highlighting for me. :-)", 
   "- If there are no test sources don't try to compile them and don't try to run", 
   "tests.  Do tell the user that there are no test sources to compile and that", 
   "there are no tests to run (gentle reminder that they should have unit tests)."
  ], 
  "revision_id": "118459"
 }, 
 {
  "author": "plynch", 
  "date": "2002-07-12T18:38:42.000000Z", 
  "msg": [
   "o Comma seperated exclusion/inclusion patterns only work for the includes and excludes attributes, not the include and exclude elements of fileset. This fix allows comma seperated excludes/includes to actually work."
  ], 
  "revision_id": "118458"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-12T15:17:55.000000Z", 
  "msg": [
   "o Applying Kuisong Tong's encoding patches. Much appreciated.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "118457"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-12T15:14:18.000000Z", 
  "msg": [
   "o Adding Kuisong Tong as a contributor for his patches that allow the", 
   "encoding to be parameterized.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "118456"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-12T05:52:16.000000Z", 
  "msg": [
   "o Added handling to expand JARs in the plugin directory and add the", 
   "the contents of the directory to the root.maven classloader using", 
   "the forhead instance. This needs to be further refined so that", 
   "a plugin can specify which classloader a specific resources needs", 
   "to be pushed into. For example the clover plugin needs to be added", 
   "to the root classloader in order to work. Right now I have the", 
   "JXR stuff working as a plugin in a JAR.", 
   "This shouldn't affect anyone because it looks for JARs in the plugins", 
   "directory and I doubt anyone else has any ;-)"
  ], 
  "revision_id": "118455"
 }
]