[
 {
  "author": "rmannibucau", 
  "date": "2011-10-17T14:14:27.674303Z", 
  "msg": [
   "registering earlier OWB internal beans since it is needed before beforediscovery event", 
   "TOMEE-89: Fixed lifecycle issue in CDI BeforeBeanDiscovery"
  ], 
  "revision_id": "1185190"
 }, 
 {
  "author": "castagna", 
  "date": "2011-10-17T14:12:50.159010Z", 
  "msg": [], 
  "revision_id": "1185189"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-10-17T14:07:41.522717Z", 
  "msg": [
   "A patch from Paul Foxworthy \"Order not completed when filled from more than one InventoryItem\" https://issues.apache.org/jira/browse/OFBIZ-4386", 
   "There is a nasty bug in IssuanceServices in the situation where the order is filled from more than one InventoryItem. When the order is created, there are OrderItemShipGrpInvRes reservations created for all the inventory items needed to fill the order.", 
   "In the simple method issueOrderItemShipGrpInvResToShipment in IssuanceServices, at line 173 (https://fisheye6.atlassian.com/browse/ofbiz/trunk/applications/product/script/org/ofbiz/shipment/issuance/IssuanceServices.xml?hb=true#to173), there is an assumption that if the OrderShipment already exists, we are some sort of adjustment, and we should adjust the OrderShipment quantity by the difference between the old OrderShipment quantity and the new one. This all works fine in the situation where there is only one InventoryItem needed to fill the order. However, if there are two or more InventoryItems, the simple method is called twice, and an incorrect quantity is calculated.", 
   "The crux of the problem is that OrderShipment doesn't care about InventoryItems, so there will be only one OrderShipment row for a given product. In contrast, ItemIssuance does care about InventoryItems, so there will be more than one if the product is supplied from more than one InventoryItem. The ItemIssuance code doesn't take account of this distinction.", 
   "I have provided two patches. One is a new unit test that exemplifies the bug. If you just apply this patch to trunk, the unit test will fail with an OrderShipment quantity of 4 when it ought to be 6.", 
   "The other patch is my fix for IssuanceServices, which now looks for a relevant ItemIssuance to decide if we are adjusting quantities, or creating a new ItemIssuance (and possibly a new OrderShipment).", 
   "jleroux: only the test part (not backported)"
  ], 
  "revision_id": "1185188"
 }, 
 {
  "author": "kristwaa", 
  "date": "2011-10-17T14:07:35.130520Z", 
  "msg": [
   "DERBY-5468: Assertion failed in AutomaticIndexStatisticsMultiTest.testMTSelectWithDDL (expected:<0> but was:<1>)", 
   "Improves the error reporting such that the cause of the error is reported.", 
   "Patch file: derby-5468-1a-error_reporting.diff"
  ], 
  "revision_id": "1185187"
 }, 
 {
  "author": "olamy", 
  "date": "2011-10-17T14:06:08.209770Z", 
  "msg": [
   "code formatting according to the rule defined for this module about using maven codestyle", 
   "NO other code changes.", 
   "At least using using the last idea EAP fix some auto formatting issues I had previously....."
  ], 
  "revision_id": "1185186"
 }
]