[
 {
  "author": "jvanzyl", 
  "date": "2002-08-01T16:57:06.000000Z", 
  "msg": [
   "o separating the distribution site from the documentation site. if everything", 
   "pans out with ibiblio then all artifacts will go to the central repository", 
   "so nothing to do with distribution will need to be specified in the POM.", 
   "artifacts will go to the central repo and be mirrored. but we will allow", 
   "for projects that don't want to distribute via the central repo. if", 
   "<distributionSite|Directory> are defined then they will be obeyed."
  ], 
  "revision_id": "118614"
 }, 
 {
  "author": "werken", 
  "date": "2002-08-01T15:26:05.000000Z", 
  "msg": [
   "If no <resources> tag exists in project.xml under <build>, then", 
   "return an empty Resources object.", 
   "PR: MAVEN-9"
  ], 
  "revision_id": "118613"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-08-01T05:01:52.000000Z", 
  "msg": [
   "Added support for dependency types. This allows us to use the type of dependency in the maven build to do things like", 
   "* document which dependencies are for unit testing and which dependencies are for compiling. (This can help us avoid circular compile dependencies)", 
   "* allow a reduced list of dependencies for real compile-time dependencies yet allow a larger number of dependencies to be used for unit test cases and sample programs", 
   "There are 2 helper methods now on dependency, isCompileType() and isTestType(). So from Jelly these can be used as", 
   "<if test=\"${dependency.compileType}\">", 
   "...", 
   "etc."
  ], 
  "revision_id": "118612"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-07-31T16:32:06.000000Z", 
  "msg": [
   "patch to use the latest snapshots of digester and jexl"
  ], 
  "revision_id": "118611"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-31T16:24:50.000000Z", 
  "msg": [
   "o adding the use of the xml-commons 'which' utility which reports some", 
   "information about the environment maven is running in. Hopefully this", 
   "should help us debug problems easier as we can easily collect info", 
   "from users as they can cut and paste the output from 'maven -i'", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "118610"
 }
]