[
 {
  "author": "struberg", 
  "date": "2011-10-20T10:49:18.415624Z", 
  "msg": [
   "MFCOMMONS-41 set svn:eol-style native and fix wrong linebreaks"
  ], 
  "revision_id": "1186730"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-10-20T10:45:42.318135Z", 
  "msg": [
   "2nd try to commit all the files ...", 
   "Summary: Fixes STANBOL-354; created three separate bundles out of \"org.apache.commons.solr\"; Adaption to several other modules to reflect this seperation."
  ], 
  "revision_id": "1186729"
 }, 
 {
  "author": "struberg", 
  "date": "2011-10-20T10:41:58.540286Z", 
  "msg": [
   "upgrade to myfaces-parent-11-SNAPSHOT and remove obsolete plugin settings", 
   "Attention: The checkstyle-plugin has been configured but actually", 
   "never was attached to a build phase - so it effectively never got called...", 
   "The checkstyle rules now will come from the myfaces-parent pom."
  ], 
  "revision_id": "1186728"
 }, 
 {
  "author": "jukka", 
  "date": "2011-10-20T10:40:42.871984Z", 
  "msg": [
   "JCR-3117: Stats for the PersistenceManager", 
   "Don't require the full RepositoryContext to PMContext for simpler test cases"
  ], 
  "revision_id": "1186727"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-10-20T10:37:18.438316Z", 
  "msg": [
   "Summary: Fixes STANBOL-354; created three separate bundles out of \"org.apache.commons.solr\"; Adaption to several other modules to reflect this seperation.", 
   "Details:", 
   "Created three separate modules out of the \"org.apache.commons.solr\" artifact.", 
   "* org.apache.commons.solr.core: Includes all the Solr libs and also exports the packages needed by Solrj. In addition it contains the main functionality formally provided by the \"org.apache.commons.solr\" bundle", 
   "* org.apache.commons.solr.install: Provides the Apache Sling Installer plugin that is used", 
   "to install SolrIndexes. This was moved from the \"org.apache.commons.solr\" artifact", 
   "* org.apache.commons.solr.web: Will be the place to work on STANBOL-353", 
   "STANBOL-354:", 
   "The new ManagedSolrServer class wraps a Solr CoreContainer and manages the OSGI service registration of the CoreContainer and all its SolrCores. See JavaDoc for detailed Information.", 
   "This new Class is already used by the DefaultSolrDirectoryManager. Also the EmbeddedSolrServerProvide does already use this new functionality. However in both cases the integration is \"fragile\" because I have tried to keep the current API.", 
   "For a nicer integration one would need to change the design and the API on several places:", 
   "* SolrDirectoryManager: Now that this component handles both the SolrServer AND the creation of the indexes on the FileSyste this component can be extended to also support updates, renaming and deletion of SolrIndexes. In addition also the creation of new SolrIndexes based on default configurations (currently part of the SolrYard) should be moved to this component.", 
   "* SolrDirectory (Read-only): This would allow to configure (via the Apache Felix Webconsole) a Solr directory on the local file system. This Component would than manage a ManagedSolrServer for this directory so that the CoreContainer and the SolrCores would be available to Stanbol in a similar way as the one of the internally managed Solr Server. Currently this functionality is part of the EmbeddedSolrServerProvider and therefore such CoreContainer/SolrCores are not available as OSGI services.", 
   "NOTE: This infrastructure is also used outside of an OSGI Environment (e.g. by the Entityhub Indexing Tools. Therefore this MUST BE also functional by using java.util.ServiceLoder.", 
   "I will create a new Issue for the above points."
  ], 
  "revision_id": "1186726"
 }
]