[
 {
  "author": "jsdelfino", 
  "date": "2011-10-24T08:45:54.165116Z", 
  "msg": [
   "Refactor and simplify edit app, and optimize app resource loading and caching."
  ], 
  "revision_id": "1188045"
 }, 
 {
  "author": "vinodkv", 
  "date": "2011-10-24T08:44:54.953385Z", 
  "msg": [
   "MAPREDUCE-2708. Designed and implemented MR Application Master recovery to make MR AMs resume their progress after restart. Contributed by Sharad Agarwal.", 
   "svn merge -c r1188043 --ignore-ancestry ../../trunk/"
  ], 
  "revision_id": "1188044"
 }, 
 {
  "author": "vinodkv", 
  "date": "2011-10-24T08:41:48.476461Z", 
  "msg": [
   "MAPREDUCE-2708. Designed and implemented MR Application Master recovery to make MR AMs resume their progress after restart. Contributed by Sharad Agarwal."
  ], 
  "revision_id": "1188043"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-10-24T08:39:46.694751Z", 
  "msg": [
   "A patch from Leon \"Append order item overrides the exist one if the last order item is \"canceled\"\" https://issues.apache.org/jira/browse/OFBIZ-4470", 
   "Set the correct nextItemSeq of shopping cart. It the \"next\" item sequence id, not the miximal item sequence id.", 
   "The problem occured after OFBIZ-4485 patch was applied (see the third change: make order item sequence id more compact and truely \"sequential\").", 
   "Also with and  empty order (order without any valid items or all order items cancelled), then the problem will also occur if all the order items have been cancelled and the new order item is appended after that.", 
   "In the code level, if the nextItemSeq is set to the sequence id of last order item but not the true \"next\" one, then in ShoppingCart.makeOrderItems method, the problem will occur if the cart does not contain any exist order items (all cart items's orderItemSeqId are null):"
  ], 
  "revision_id": "1188042"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2011-10-24T08:36:49.318710Z", 
  "msg": [
   "OPENEJB-1330 on trunk the app client id was not used as it should have been"
  ], 
  "revision_id": "1188041"
 }
]