[
 {
  "author": "macdonst", 
  "date": "2011-05-16T01:28:15.000000Z", 
  "msg": [
   "Fixing a number of issues in File API", 
   "Issue #82: The RandomAccessFile class in Android's version of Java does not write non-ASCII characters very well.  I've switched to using a FileOutputStream which seems to work just great.  Tested by myself and folks from Egypt and the Netherlands.", 
   "Issue #87: Fixed a problem where the file errors were being returned as evt.target.result.code.code."
  ], 
  "revision_id": "1191710"
 }, 
 {
  "author": "macdonst", 
  "date": "2011-05-13T17:07:14.000000Z", 
  "msg": [
   "Setting defaults in Media Capture", 
   "Some tests of Media Capture were failing as the CaptureAudio/Image/VideoOptions objects did not have defaults set."
  ], 
  "revision_id": "1191709"
 }, 
 {
  "author": "bcurtis", 
  "date": "2011-05-10T16:44:09.000000Z", 
  "msg": [
   "Need to use EclairClient for 3.x devices too.  This fixes the HTML5 geolocation problem on Android 3.x."
  ], 
  "revision_id": "1191708"
 }, 
 {
  "author": "macdonst", 
  "date": "2011-05-06T16:27:07.000000Z", 
  "msg": [
   "Issue #79: FileWriter.seek() is broken in 0.9.5.", 
   "The FileEntry.createWriter() method passes in a FileEntry object instead of a File object. As a result the FileWriter.length was not being set properly so when you do a writer.seek(writer.length) it would go to 0, so your next write would overwrite your file.", 
   "In order to fix this issue the FileEntry.createWriter() method now makes a call to FileEntry.file() to get the correct file size.  The File object is now passed to the FileWriter constructor."
  ], 
  "revision_id": "1191707"
 }, 
 {
  "author": "macdonst", 
  "date": "2011-05-05T20:18:35.000000Z", 
  "msg": [
   "Android 2.2+ supports W3C Connection API", 
   "For Android version 2.2 or better the navigator.connection object already", 
   "exists. If this case we should immediately fire the onPhoneGapConnectionReady", 
   "event so we don't tie up the 'deviceready' event."
  ], 
  "revision_id": "1191706"
 }
]