[
 {
  "author": "jtyberg", 
  "date": "2011-04-04T19:13:10.000000Z", 
  "msg": [
   "Add capability for plugins to delay onDeviceReady until after they", 
   "have initialized themselves.", 
   "The navigator.device.capture object delays onDeviceReady until its", 
   "capture modes have been set."
  ], 
  "revision_id": "1192225"
 }, 
 {
  "author": "jtyberg", 
  "date": "2011-04-04T19:12:04.000000Z", 
  "msg": [
   "Media capture: eliminate duplicate image capture modes in", 
   "navigator.device.capture.supportedImageModes."
  ], 
  "revision_id": "1192224"
 }, 
 {
  "author": "jtyberg", 
  "date": "2011-04-01T13:18:38.000000Z", 
  "msg": [
   "Add util method to LocalFileSystem to check if path is root file system", 
   "path.  Makes for cleaner JavaScript when removing directories.", 
   "Handle case when object is not passed to Entry constructor."
  ], 
  "revision_id": "1192223"
 }, 
 {
  "author": "jtyberg", 
  "date": "2011-03-23T21:35:01.000000Z", 
  "msg": [
   "Update README.md.", 
   "Remove outdated 'Getting Started' content and add link to Wiki page."
  ], 
  "revision_id": "1192222"
 }, 
 {
  "author": "jtyberg", 
  "date": "2011-03-22T18:33:38.000000Z", 
  "msg": [
   "Add media capture support.", 
   "An implementation of the W3C Media Capture spec:", 
   "http://dev.w3.org/2009/dap/camera/Overview-API", 
   "Capture operations are supported for audio, video, and images.  Each", 
   "capture operation launches the native audio recorder, video recorder,", 
   "or camera application, respectively.", 
   "Each capture operation runs in the background and terminates after", 
   "the user reaches the capture file limit (if specified), or the user", 
   "cancels the operation by exiting the recording application.", 
   "Current deviations from the spec:", 
   "* maximum duration of audio and video clips is not supported", 
   "* retrieval of supported video capture modes (format and dimensions)", 
   "returns ALL supported video modes, not just capture (the BB API does", 
   "not return any video capture types)", 
   "* cannot specify which capture mode to use programmatically (can only", 
   "be controlled by user)", 
   "* no API to retrieve MediaFileData for media files"
  ], 
  "revision_id": "1192221"
 }
]