[
 {
  "author": "mwbrooks", 
  "date": "2010-07-01T21:27:27.000000Z", 
  "msg": [
   "Remove markdown files for the Position properties, since Position.markdown covers them."
  ], 
  "revision_id": "1192405"
 }, 
 {
  "author": "mwbrooks", 
  "date": "2010-07-01T21:22:04.000000Z", 
  "msg": [
   "Update Details section of Coordinates.", 
   "After writing the Position documentation, I realized that the", 
   "details of the Coordinates were incorrect. The Coordinate is not", 
   "directly returned to the user, instead it is attached to the Position", 
   "and then returned to the user."
  ], 
  "revision_id": "1192404"
 }, 
 {
  "author": "mwbrooks", 
  "date": "2010-07-01T21:16:25.000000Z", 
  "msg": [
   "Update Coordinates object based on current content and W3C spec.", 
   "- The documentation has only been tested on the iPhone.", 
   "- Currently, there is iPhone specific code in the examples,", 
   "that conflict with the W3C spec. Once another platform is tested", 
   "the iPhone specific code can be moved to the iPhone documentation", 
   "of the Coordinates object."
  ], 
  "revision_id": "1192403"
 }, 
 {
  "author": "mwbrooks", 
  "date": "2010-07-01T20:32:49.000000Z", 
  "msg": [
   "Update the Coordinates object using the current content and W3C API.", 
   "- Removed the markdown files that documented individual properties.", 
   "This approach was original chosen for organization, but it is", 
   "confusing when documenting properties.", 
   "- Coordinates::accuracy is a controversial property. The iPhone", 
   "returns an object { horizontal: Number, vertical: Number }", 
   "although W3C appears to document it as a single value.", 
   "Since altitude's accuracy is explicitly mentioned, it makes me", 
   "think that accuracy should be a single value that reflects", 
   "the accuracy of both latitude and longitude.", 
   "- Once another platform is tested against this documentation,", 
   "we can update the definition of accuracy."
  ], 
  "revision_id": "1192402"
 }, 
 {
  "author": "mwbrooks", 
  "date": "2010-07-01T06:48:57.000000Z", 
  "msg": [
   "Update the full exmaple of geolocation.watchPosition for clarity."
  ], 
  "revision_id": "1192401"
 }
]