[
 {
  "author": "kaz", 
  "date": "2003-01-19T16:52:28.000000Z", 
  "msg": [
   "Added two more Maven powered sites from \"jawaid hakim\"", 
   "<hjawaid@hotmail.com>."
  ], 
  "revision_id": "119499"
 }, 
 {
  "author": "dion", 
  "date": "2003-01-19T10:50:55.000000Z", 
  "msg": [
   "Fix formatter so that the pattern is used."
  ], 
  "revision_id": "119498"
 }, 
 {
  "author": "dion", 
  "date": "2003-01-19T05:06:13.000000Z", 
  "msg": [
   "Applied patch for multiple menus from Incze Lajos"
  ], 
  "revision_id": "119497"
 }, 
 {
  "author": "kaz", 
  "date": "2003-01-18T21:32:37.000000Z", 
  "msg": [
   "Temporarily commenting out the table in the sample APT doc that is part", 
   "of the touchstone as it produces an xdoc that our site.jsl can't handle.", 
   "It uses an attribute in the <tr> element, this causes Jelly to bork."
  ], 
  "revision_id": "119496"
 }, 
 {
  "author": "kaz", 
  "date": "2003-01-18T20:00:11.000000Z", 
  "msg": [
   "The addition of a sample APT doc to the touchstone build.  This is being", 
   "added to assist the debugging of a tha APT plugin which contains a", 
   "preGoal that is not being run.  Specifically, the APT plugin has this", 
   "snippet of jelly in its plugin.jelly script:", 
   "<preGoal name=\"xdoc:transform\">", 
   "<attainGoal name=\"apt:generate\"/>", 
   "</preGoal>", 
   "This used to force the generation of APT docs whenever any target that", 
   "invoked 'xdoc:transform' was run; however, recently something changed", 
   "and the 'apt:generate' goal is no longer run unless the 'xdoc:transform'", 
   "is run directly (vs indirectly as the result of the 'xdoc' or", 
   "'site:generate' goals).", 
   "By adding the APT doc to the touchstone, this will allow others to", 
   "experience the same problem I am having at the moment.  In addition, by", 
   "adding this document, I also bring to light a JSL issue.  It seems that", 
   "any xdoc with a <tr> element that has an attribute causes the build", 
   "process to choke.  The APT plugin by default generates <tr> elements", 
   "with the 'valign=\"top\"' attribute set.  Granted, these attributes are", 
   "ignored by the current xdoc standard, but it is nonetheless an issue", 
   "with our JSL stylesheet that will need to be corrected."
  ], 
  "revision_id": "119495"
 }
]