[
 {
  "author": "rwesten", 
  "date": "2011-10-31T13:28:49.992505Z", 
  "msg": [
   "Fixes STANBOL-353: Other than in the initial description of the Issue the SolrDispatchFilter was used to implement the requested feature. This includes also a default configuration for the launchers so that the internally managed SolrIndex is published with the prefix \"/solr/default\". There is also a new integration-test that checks for the index with the dbpedia default data (core name: dbpedia_43k).", 
   "Details:", 
   "commons/solr/core:", 
   "* The commons.solr.core bundle now exports additional solr packages. See the pom.xml for details.", 
   "* corrected a Bug that causes concurrent modification exceptions on shutting down a CoreContainer.", 
   "* The deactivate method of EmbeddedSolrServerProvider now correctly shutdowns Solr CoreContainer that are not managed as OSGI services", 
   "commons/solr/web:", 
   "implementation of STANBOL-353 by", 
   "* subclass of SolrDispatchFilter that prevents the initialization and destruction of a CoreContainer on the initialization and deactivation", 
   "* OSGI component that allows to match CoreContainers available as OSGI services (as provided by STANBOL-354) to configured prefixes.", 
   "* ServiceTracker are used to register/unregister such components with the HttpService as the referenced Solr CoreContainer become available/unavailable.", 
   "other changes", 
   "* added a configuration that registers the internally managed Solr Server with the prefix \"/solr/default/\" to the stable, full, full-war and kres launcher.", 
   "* added an integration-test that checks that the default data index is available under /solr/default/dbpedia_43k"
  ], 
  "revision_id": "1195450"
 }, 
 {
  "author": "kristwaa", 
  "date": "2011-10-31T13:27:16.315286Z", 
  "msg": [
   "DERBY-5475 (partial): Formalize use of old Derby distributions in tests", 
   "Added support classes DerbyVersion and DerbyVersionSimple (may be removed later", 
   "if possible). DerbyVersion represents a Derby version number and has methods", 
   "for comparing versions against each other, plus a few other helper methods.", 
   "Added a basic unit test for DerbyVersion.", 
   "Patch file: derby-5475-1b-DerbyVersion.diff"
  ], 
  "revision_id": "1195449"
 }, 
 {
  "author": "mgrigorov", 
  "date": "2011-10-31T13:26:43.825610Z", 
  "msg": [
   "WICKET-4185 ListenerInterfaceRequestHandler should not assume existence of a page"
  ], 
  "revision_id": "1195448"
 }, 
 {
  "author": "mturk", 
  "date": "2011-10-31T13:19:15.869754Z", 
  "msg": [
   "Step 1 in sanitizing useless stack storage. MAX_PATH (260) chars is just wast of space for something that can't be larger then 60 bytes"
  ], 
  "revision_id": "1195447"
 }, 
 {
  "author": "reschke", 
  "date": "2011-10-31T13:18:09.713631Z", 
  "msg": [
   "JCR-3069: add optional consistency checks to test suite", 
   "Start re-enabling previously disabled concurrent tests"
  ], 
  "revision_id": "1195446"
 }
]