[
 {
  "author": "francisdb", 
  "date": "2011-11-09T09:38:54.861045Z", 
  "msg": [
   "EMPIREDB-121 SQL for MS SQL created by Empire-DB uses lcase(), but MS SQL Server doesn't know lcase() but lower()"
  ], 
  "revision_id": "1199675"
 }, 
 {
  "author": "violalu", 
  "date": "2011-11-09T09:37:34.422434Z", 
  "msg": [
   "Change deploympent exception to warning sometimes if application doesn't contain webservices, may end-user gets deployment error coz of web application compile with low level java compiler such as jdk 1.4."
  ], 
  "revision_id": "1199674"
 }, 
 {
  "author": "dag", 
  "date": "2011-11-09T09:35:15.092787Z", 
  "msg": [
   "DERBY-5492 Restrictive file permissions: permissions removed also for owner on NTFS if Acl does not contain explicit entry for owner", 
   "Patch derby-5492-2 which solves this issue plus make one other", 
   "adjustment, see item two below.", 
   "- Construct a new AclEntry for the owner with all rights, and removed", 
   "existing ones (NTFS). This should handle the error seen in Oracle's", 
   "regressions.", 
   "- For Solaris/ZFS and similar file systems which support both Posix", 
   "file attributes view and ACLs, don't touch the ACLs but stick to the", 
   "Posix flags.", 
   "For the latter my rationale is as follows: Principle of least", 
   "surprise: most users never touch the ACLs but use the more familiar", 
   "Posix file masks. It turned out the existing Derby implementation,", 
   "although protecting the file adequately, showed a \"+\" in the ls(1)", 
   "listing indicating that the settings could not be directly mapped", 
   "onto the Posix model. The reason was that we removed more permissions", 
   "than the plain read,write, and execute. Since ZFS internally builds", 
   "on ACLs, the ls(1) listing would should that Derby had been tinkering", 
   "with the non-mappable ACL permissions. I think it is better to stick", 
   "to the Posix permissions by default. If people are using ACL", 
   "functionality they are likely more than average concerned with", 
   "security and can run with default file permissions and take full", 
   "responsibility of the permissions fo created filed."
  ], 
  "revision_id": "1199673"
 }, 
 {
  "author": "francisdb", 
  "date": "2011-11-09T09:31:08.152673Z", 
  "msg": [
   "Added test for chinese characters on mssql"
  ], 
  "revision_id": "1199672"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2011-11-09T09:10:30.003914Z", 
  "msg": [
   "SLING-2275 Consolidate property name for the servlet registration with the respective property name of the SimpleWebDav servlet which uses dav.root"
  ], 
  "revision_id": "1199671"
 }
]