[
 {
  "author": "srowen", 
  "date": "2011-11-12T11:49:12.464426Z", 
  "msg": [
   "Just small style and formatting changes"
  ], 
  "revision_id": "1201250"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-11-12T11:47:39.377198Z", 
  "msg": [
   "I changed the default value of Groovy Eclipse Plugin \"Compiler\" preference for \"Groovy Script Folder\" to now \"enable script folder suppor\"t, but I did not saw in the main Groovy Eclipse plugin page the \"default working directory for running Groovy scripts\" which is \"Project Home\" by default. I changed for \"Script Location\" and the svn properties is now useless.", 
   "I must say I'm still uncomfortable with the Groovy Eclipse Plugin. But I feel it's better and better even in the context of OFBiz where Groovy is only used for scripts."
  ], 
  "revision_id": "1201249"
 }, 
 {
  "author": "srowen", 
  "date": "2011-11-12T11:42:09.224476Z", 
  "msg": [
   "MAHOUT-882 Actually used rescored value in one TopItems method. Also, fix SimilarUser issue along the way from MAHOUT-881"
  ], 
  "revision_id": "1201248"
 }, 
 {
  "author": "jleroux", 
  "date": "2011-11-12T11:33:03.055364Z", 
  "msg": [
   "Reverts 1201229 and reapplies patch from Leon \"add datetimepicker language file for zh-CN, zh-HK, zh-TW, and an en one in order to avoid \"jquery-ui-timepicker-en.js\" not found error\" https://issues.apache.org/jira/browse/OFBIZ-4555", 
   "1. add datetimepicker language file to system: jquery-ui-timepicker-zh-CN.js, jquery-ui-timepicker-zh-HK.js and jquery-ui-timepicker-zh-TW.js.", 
   "2. also add a \"jquery-ui-timepicker-en.js\" file, it's the default datetimepicker language file but not exist now.", 
   "3. run service \"createJsLanguageFileMapping\" to update sLanguageFileMapping.java accordingly.", 
   "jleroux: the js files were wrongly encoded, UTF8-BOM solved the issue"
  ], 
  "revision_id": "1201247"
 }, 
 {
  "author": "ccurrens", 
  "date": "2011-11-12T11:26:31.893821Z", 
  "msg": [
   "updated a few tests.  Many more still broken."
  ], 
  "revision_id": "1201246"
 }
]