[
 {
  "author": "bimargulies", 
  "date": "2011-11-14T19:03:41.080660Z", 
  "msg": [
   "CXF-3912 Archetype for JAX-RS"
  ], 
  "revision_id": "1201825"
 }, 
 {
  "author": "stsp", 
  "date": "2011-11-14T18:59:06.305972Z", 
  "msg": [
   "Fix issue #2873, \"svn diff -c N on a file added in revision N does not", 
   "create patch\".", 
   "When adding a file in rN and trying to diff this file in the range -rN-1:N,", 
   "a client-side existence-check prevented a diff from being generated", 
   "because of a \"file does not exist at rN-1\" error. The client was overly", 
   "cautious here, because the server-side already supports the case where one", 
   "of the diff targets doesn't exist. The only requirement imposed by the server", 
   "is that the _anchor_ of the diff operation must exist. So we can fix issue", 
   "#2873 by choosing an appropriate anchor for the diff operation.", 
   "* subversion/libsvn_ra/ra_loader.c", 
   "(svn_ra_do_diff3): Stop asserting that the diff target is a direct", 
   "child of the anchor. This assertion is present (and possibly useful)", 
   "in the update and merge cases. But during a diff operation, a target", 
   "which exists within a newly added tree might require an anchor that", 
   "is not a direct parent.", 
   "* subversion/libsvn_client/diff.c", 
   "(check_diff_target_exists): New helper function which checks the existence", 
   "of a URL at a given revision and raises an error if it doesn't exist.", 
   "(diff_prepare_repos_repos): Tolerate a missing target at one side of the", 
   "diff. If one side is missing, try to find a common parent to anchor the", 
   "diff operation on, and adjust the diff target paths relative to this anchor.", 
   "This can only fail due to authz restrictions, since one side of the diff", 
   "is guaranteed to exist (in the worst case the common parent is the", 
   "repository root).", 
   "* subversion/tests/cmdline/diff_tests.py", 
   "(diff_targets): Stop expecting an error when diffing a file which was newly", 
   "added in revision N in the range -rN-1:N. Expect to see an 'add' diff for", 
   "the file instead of an error."
  ], 
  "revision_id": "1201824"
 }, 
 {
  "author": "sidney", 
  "date": "2011-11-14T18:51:27.501261Z", 
  "msg": [
   "bug 6699 - Better rule description - DCC"
  ], 
  "revision_id": "1201823"
 }, 
 {
  "author": "joern", 
  "date": "2011-11-14T18:43:56.851739Z", 
  "msg": [
   "OPENNLP-373 Added incubator disclaimer"
  ], 
  "revision_id": "1201822"
 }, 
 {
  "author": "joern", 
  "date": "2011-11-14T18:42:40.356217Z", 
  "msg": [
   "OPENNLP-373 Added incubator disclaimer"
  ], 
  "revision_id": "1201821"
 }
]