[
 {
  "author": "jvanzyl", 
  "date": "2003-03-27T12:20:42.000000Z", 
  "msg": [
   "o The plexus plugin is now a pure dynatag library. To make a plexus runtime", 
   "you doing something like the following. I can probably remove conf and", 
   "confDir but I'm in the middle of testing Tambora. With this I can now take", 
   "a handful of 'configurationProperties' and generate N runtimes by putting", 
   "what's below in a loop. So I'm generating N installations of Tambora and", 
   "currently testing on a single machine with multiple IP interfaces. Next", 
   "will be to generate and distribute across a network for testing.", 
   "<plexus:deploy", 
   "base=\"${maven.build.dir}/runtime\"", 
   "conf=\"plexus.conf\"", 
   "confDir=\"${basedir}/src/model/src/conf\"", 
   "modelPom=\"${basedir}/src/model/project.xml\"", 
   "plexusPomFile=\"${maven.repo.local}/plexus/poms/plexus-0.3.pom\"", 
   "configurationProperties=\"${basedir}/src/model/src/conf/app.properties\"/>", 
   "This will soon be augmented to support N component builds, multiple", 
   "component manifests and general support of third party component", 
   "development in a very easy way."
  ], 
  "revision_id": "120324"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2003-03-27T12:16:48.000000Z", 
  "msg": [
   "o All the properties are no longer needed. The plexus plugin is now entirely", 
   "a dyna tag library that is called from maven.xml files. This is really how", 
   "all plugins should be as it alleviates a whole level of chicanery trying", 
   "to locate goals in plugins. Using only dyna tags removes complexity and", 
   "really makes a plugin a self-contained unit more akin to an object."
  ], 
  "revision_id": "120323"
 }, 
 {
  "author": "evenisse", 
  "date": "2003-03-27T11:23:21.000000Z", 
  "msg": [
   "Bad links correction."
  ], 
  "revision_id": "120322"
 }, 
 {
  "author": "evenisse", 
  "date": "2003-03-27T11:15:09.000000Z", 
  "msg": [
   "Use faqs link instead of user guide link"
  ], 
  "revision_id": "120321"
 }, 
 {
  "author": "bwalding", 
  "date": "2003-03-27T10:27:27.000000Z", 
  "msg": [
   "o Although it is bad form to create class files in your source area, it does make development", 
   "a lot faster (no build / compile cycle for good containers).", 
   "So, *.class files that are under WEB-INF/classes in src/webapp", 
   "will be excluded from the final WAR.", 
   "o This may break builds that rely on this behaviour.", 
   "o Ultimately I'd prefer a two phase war process, build the war in target/war and then", 
   "package it.  Then people could hook in before the packaging to cleanly do whatever they want."
  ], 
  "revision_id": "120320"
 }
]