[
 {
  "author": "mturk", 
  "date": "2011-11-18T19:35:33.503596Z", 
  "msg": [
   "Do not use APP_POOL_ID. Different pools have differenet process id, so headers won't match anyhow. Also add some loging before calling extension"
  ], 
  "revision_id": "1203800"
 }, 
 {
  "author": "mamta", 
  "date": "2011-11-18T19:35:08.872384Z", 
  "msg": [
   "Backporting revision 1203252 from trunk to 10.8 codeline. Commit comments were as follows", 
   "DERBY-5379 testDERBY5120NumRowsInSydependsForTrigger - The number of values assigned is not the same as the number of specified or implied columns.", 
   "DERBY-5484 Upgradetest fails with upgrade from 10.8.2.2 (7 errors, 1 failure) on trunk", 
   "The above 2 jiras are duplicates. The upgrade tests are failing when doing an upgrade from 10.8.2.2 to trunk.", 
   "The tests that are failing were written for DERBY-5120, DERBY-5044. Both these bugs got fixed in 10.8.2.2 and higher.", 
   "The purpose of these tests is to show that when the tests are done with a release with those fixes missing, we will see the incorrect behavior but once the database is upgraded to 10.8.2.2 and higher, the tests will start functioning correctly. The problem is that we do not recognize that if the database is created with 10.8.2.2, then we will not the problem behavior because 10.8.2.2 already has the required fixes in it for DERBY-5120 and DERBY-5044. I have fixed this by making the upgrade test understand that incorrect behavior would be seen only for releases under 10.8.2.2"
  ], 
  "revision_id": "1203799"
 }, 
 {
  "author": "azeez", 
  "date": "2011-11-18T19:34:45.588859Z", 
  "msg": [
   "Mistakenly committed with the WSO2 License header. Changed to ASF license header."
  ], 
  "revision_id": "1203798"
 }, 
 {
  "author": "rubys", 
  "date": "2011-11-18T19:33:57.597913Z", 
  "msg": [
   "Add Assistant Treasurer"
  ], 
  "revision_id": "1203797"
 }, 
 {
  "author": "ggregory", 
  "date": "2011-11-18T19:33:54.003203Z", 
  "msg": [
   "[VFS-390] Use variable argument list in org.apache.commons.vfs2.util.Messages instead of Object[]"
  ], 
  "revision_id": "1203796"
 }
]