[
 {
  "author": "arielch", 
  "date": "2011-11-22T13:55:17.046162Z", 
  "msg": [
   "lingucomponent related fixes for i118627, i118628, i118629", 
   "* 118627 - Hyphenator: building the UNO component breaks due to name", 
   "clash", 
   "The three UNO components have been renamed to use the naming scheme", 
   "compname.uno: spell.uno, hyphen.uno, lnth.uno", 
   "* 118629 - remove hunspell dependency from mythes", 
   "hunspell was only needed for building the mythes example.", 
   "Added a patch to patch the source in AOO builds and disable the example.", 
   "* 118628 - remove hunspell dependency from Hyphenator and Thesaurus UNO", 
   "components", 
   "The dependency has been remove. Now the three components can be built", 
   "independently from each other:", 
   "* mythes has a category A license", 
   "http://www.apache.org/legal/3party.html#category-a", 
   "As a category A license, the library is ENABLED by default and", 
   "is built unconditionally if the optional configure switch", 
   "--with-system-mythes is missing", 
   "As a side effect, building the UNO Thesaurus component is always", 
   "enabled.", 
   "* hunspell has a category B license", 
   "http://www.apache.org/legal/3party.html#category-b", 
   "as such, it is DISABLED by default.", 
   "To enable the library use --enable-hunspell", 
   "To use the library already present in the system instead of building", 
   "it, use --with-system-hunspell", 
   "As a side effect, building the UNO spell checking component is only", 
   "enabled when hunspell is enabled.", 
   "* hyphen has a category B license, as such it is DISABLED by default.", 
   "To enable the library, use --enable-hyphen", 
   "To uses the system library instead of building it, use", 
   "--with-system-hyphen", 
   "As side effect, building the UNO hyphenator component is only enabled", 
   "when hyphen is enabled."
  ], 
  "revision_id": "1204995"
 }, 
 {
  "author": "sebb", 
  "date": "2011-11-22T13:53:22.520076Z", 
  "msg": [
   "Ensure version does not get out of date"
  ], 
  "revision_id": "1204994"
 }, 
 {
  "author": "olamy", 
  "date": "2011-11-22T13:49:45.485799Z", 
  "msg": [
   "[MRM-1561] Update to Archiva as OSGi compliant application", 
   "add maven felix plugin version in the parent."
  ], 
  "revision_id": "1204993"
 }, 
 {
  "author": "kwright", 
  "date": "2011-11-22T13:48:31.311173Z", 
  "msg": [
   "Move logic for reprioritizing documents to a more generic location."
  ], 
  "revision_id": "1204992"
 }, 
 {
  "author": "olegk", 
  "date": "2011-11-22T13:45:52.735685Z", 
  "msg": [
   "HTTPCORE-281: ResponseConnControl protocol interceptor does not correctly populate connection persistence control headers when sending a HTTP/1.1 response message in response to a HTTP/1.0 request message.", 
   "Contributed by William R. Speirs <bill.speirs at gmail.com>"
  ], 
  "revision_id": "1204991"
 }
]