[
 {
  "author": "simonetripodi", 
  "date": "2011-11-23T09:25:16.725011Z", 
  "msg": [
   "documented how to enable line numbers"
  ], 
  "revision_id": "1205335"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-11-23T09:09:34.787079Z", 
  "msg": [
   "missed this files on my last commit."
  ], 
  "revision_id": "1205334"
 }, 
 {
  "author": "mahadev", 
  "date": "2011-11-23T09:05:19.192755Z", 
  "msg": [
   "Fix a link"
  ], 
  "revision_id": "1205333"
 }, 
 {
  "author": "bodewig", 
  "date": "2011-11-23T09:02:01.471912Z", 
  "msg": [
   "try to build mockito"
  ], 
  "revision_id": "1205332"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-11-23T09:01:33.136791Z", 
  "msg": [
   "This commit contains implementations for STANBOL-374, STANBOL-375, STANBOL-377 and STANBOL-380 and fixes STANBOL-381 and STANBOL-385", 
   "I will write a summary of this statement also on the stanbol-dev mailing list.", 
   "DataFileProvider and DataFileTracker", 
   "------------------------------------", 
   "The DataFileProvider allows to load data files needed by Stanbol Components without the need to know how this files are provided ( '/datafiles' folder, via the Classpath, from a Bundle …)", 
   "The DataFileTracker uses the DataFileProvider infrastructure to allow the tracking of files.", 
   "Components can register as DataFileListeners and get notified if a DataFile becomes available/unavailable (STANBOL-347).", 
   "* Tracking is implemented as an own service with a dependency to a DataFileProvider.", 
   "* Tracking is implemented by periodically (default 5sec) checking for registered Datafiles.", 
   "* After a restart of the DataFileTracker service listeners MUST re-register themselves.", 
   "* Added an isAvailable(...) method to the DataFileProvider to avoid opening InputStreams while checking for DataFiles.", 
   "*TODO's*", 
   "The current Apache Felix Webconsole plugin that shows Requested Datafiles as Events needs to be updated, because all requests for DataFiles generated by the DataFileTracker show up as Events in this interface. My suggestion would be to create a new Interface that is based on requested Datafiles identified based on \"name\" and \"bundleSymbolocName\".", 
   "ManagedSolrServer", 
   "-----------------", 
   "Added support for multiple managed Solr server. This Component replaces the SolrDirectoryManager and also includes some functionalities formally part of the EmbeddedSolrServerProvider.", 
   "* Identified by name. If multiple Servers share the same name service rankings are used. This allows to configure fallback servers. Names are shared between Managed- and Referenced- SolrServer instances.", 
   "* The ManagedSolrServer with the highest service ranking is used as default. It is best practice to configure an default instance with service ranking Integer.MAX_VALUE.", 
   "* Full CRUD operation on managed indexes (SolrCores). The state of the managed indexes are saved within the data directory of the Bundle. This allows also to manage indexes with missing data (Solr index archives). (fixes STANBOL-375)", 
   "* The CoreContainer (the managed Solr server) and all SolrCores (Solr indexes) are registered as OSGI services.", 
   "* Support for loading and tracking SolrIndexArchives via the DataFileProvider and DataFileTracker services (fixes STANBOL-380)", 
   "* A boolean switch for the ManagedSolrServer allows to specify of indexes of this server are published via the Stanbol RESTful interface under /solr/{server-name}/{index-name}", 
   "* ManagedSolrServer instances can be specified by providing configurations via the Sling installer framework (e.g. by the launcher or within a bundle). However it is also possible to create them by directly adding a new configuration the the OSGI ConfigurationAdmin service. In addition Users may provide configurations by using the Configuration tab of the Apache Felix Web Console.", 
   "* SolrCore directory names now include the date of the creation as an suffix. If a directory with that name already exists (e.g. because the same index was already updated on the very same day) than an additional \"-{count}\" suffix will be added to the end.", 
   "* The Managed SolrServer stores its configuration within the persistent space of the Bundle provided by the OSGI environment. When using one of the default Stanbol launchers this is within \"{sling.home}/felix/bundle{bundle-id}/data\". The \"{bundle-id}\" of the \"org.apache.stanbol.commons.solr.managed\" bundle can be looked up the the [Bundle tab](http://localhost:8080/system/console/bundles) of the Apache Felix Webconsole. The actual configuration of a ManagedSolrServer is than in \".config/index-config/{service.pid}\". The \"{service.pid}\" can be also looked up via the Apache Felix Web-console in the [Configuration Status tab](http://localhost:8080/system/console/config). Within this folder the Solr index reference files (normal java properties files) with all the information about the current state of the managed indexes are present.", 
   "* Errors that occur during the asynchronous initialization of SolrCores are stored within the IndexingProperties. They can therefore be requested via the API of the ManagedSolrServer but also be looked up within the persistent state of the ManagedSolrServer (see above where such files are located).", 
   "ReferencedSolrServer", 
   "--------------------", 
   "Allows to initialize an Solr server running within the same JVM as Stanbol based on indexes provided by a directory on the local file system. This does not support management capabilities, but the created CoreContainer (the Solr server) and the SolrCores (Solr indexes) are registers as OSGI services. NOTE that indexes and data might still be changesd by using the normal Solr Admin interface.", 
   "* ReferencedSolrServer are identified by a user provided name. Names are shared between Managed- and Referenced- SolrServer instances.", 
   "* A boolean switch for the ManagedSolrServer allows to specify of indexes of this server are published via the Stanbol RESTful interface under /solr/{server-name}/{index-name}", 
   "* ReferencedSolrServer will be typically configured by users by using the Configuration tab of the Apache Felix Web Console. However it is also possible to configure ReferencedSolrServers by directly registering a configuration on the OSGI ConfigurationAdmin service, or by providing a Configuration within a Bundle or the Sling launcher.", 
   "CoreContainer and SolrCore registration", 
   "---------------------------------------", 
   "Both the ManagedSolrServer and the ReferencedSolrServer register CoreContainers and SolrCores as", 
   "OSGI services. For more information about the metadata provided for registered components see the Javadoc of [SolrConstants](http://svn.apache.org/repos/asf/incubator/stanbol/trunk/commons/solr/core/src/main/java/org/apache/stanbol/commons/solr/SolrConstants.java). Note that registered SolrCores also include the properties for the server (CoreContainer) they are registered with.", 
   "SolrServerProvider", 
   "------------------", 
   "The SolrServerProvider is used by Components that want to use a Solr index to obtain SolrServer (client interface of Solr - SolrJ). Stabol supports both remote Solr server (accessed via the RESTful API) and embedded sold servers (running within the same JVM).", 
   "The new RegisteredSolrServerProvider replaces the EmbeddedSolrServerProvider that formally used for embedded SolrServers. The new implementation uses CoreContainer and SolrCore instances registered as OSGI services. (fixes STANBOL-376)", 
   "The following types of links can be used:", 
   "* URLs: http(s)://host:port/path for external SolrServers; file:/path for embedded Solr Servers", 
   "* File paths for embedded SolrServers", 
   "* [{server-name}:]{index-name} for embedded Solr Servers. If the server-name is not specified the", 
   "default server is assumed.", 
   "*NOTES*", 
   "* Solr indexes even referenced by file URLs or file paths need first to be registered/configured as ReferencedSolr! The direct initialization of a SolrServer (as formally implemented by the EmbeddedSolrServer) is no longer supported!", 
   "* The \"[{server-name}:]{index-name}\" syntax is preferred over file URLs and file paths, because is allows to refer to a Solr index by configureable names and is not depended on the actual location of the index on the local file system.", 
   "*Future plan*", 
   "The current updates still keeps the previous interface and only adds support for the new \"[{server-name}:]{index-name}\" syntax. However in a future update the whole SolrServerProvider infrastructure could adopt the Whiteboard pattern (Solr indexes are registered as OSGI services) as already internally used by the new RegisteredSolrServerProvider.", 
   "DBPedia.org default configuration", 
   "---------------------------------", 
   "The artifact Addition \"org.apache.stanbol.data.site.dbpedia.default\" that previously provided the default dbpedia data was removed.", 
   "The new \"org.apache.stanbol.data.site.dbpedia\" artifact uses the new functionality specified by STANBOL-380 to refer to the same default data by adding an additional \"Index-Archive\" with a low priority. Now if users want to upgrade to a bigger DBPedia index they need only to download/create a dbpedia index and copy the \"dbpedia.solrindex.zip\" file to the \"/datafile\" directory. This will automatically replace the default data that ship with Stanbol.", 
   "After the new Index is initialized the \"dbpedia.solrindex.zip\" can be removed from the \"/datafile\" folder.", 
   "To upgrade from one big \"dbpedia.solrindex.zip\" version to an other users need to copy the new \"dbpedia.solrindex.zip\" to the \"/datafiles\" directory and than stop/start the \"org.apache.stanbol.data.site.dbpedia\" bundle. Stopping the bundle will cause the dbpedia index to be removed. Restarting it will trigger the same initialization as by the first start. So if no \"dbpedia.solrindex.zip\" is preset the default data set for dbpedia will be used for the re-initialisation.", 
   "For users that used already the \"http://host:port/solr/default/{index}\" URLs to directly access", 
   "Solr indexes of the Entityhub please not the with this change both the small default data index as well as the full index (as soon as initialized from the user provided dbpedia.solrindex.zip file) will be available under \"http://host:port/solr/default/dbpedia\".", 
   "The previously used index name \"dbpedia_43k\" is no longer used because now indexes are always deployed on the name \"dbpedia\" in that case.", 
   "Entityhub Indexing Utilities", 
   "----------------------------", 
   "The \"Syncronized\" feature introduces by STANBOL-280 is now supported by the Indexing Utilities.", 
   "Within the main configuration file (\"/indexing/config/indexing.properties\") the Key \"Synchronized\" can be used to configure if this feature is used or not. By default this feature is enabled. However for the dbpedia indexing tool it is deactivated by default.", 
   "If the bundle for the indexed dataset is active and \"Synchronized\" is enabled the data for the ReferencedSite will be kept in sync with the \"{name}.solrindex.zip\" files within the \"/datafiles\" folder. So if the solrindex.zip-file is deleted the data of the local indexed are removed. If a new version is copied to the \"/datafiles\" folder the updated data are installed.", 
   "Note the the old file needs first to be deleted and after some seconds (after the deletion was detected) the new file can be copied. Simple replacing the file will not work, because currently the DataFileProvider/DataFileTracker does not detect updates to data files.", 
   "If \"Synchronized\" is disabled one need to stop/reactivate the Bundle to trigger the new data to be loaded.", 
   "Other changes", 
   "-------------", 
   "* Adaptions to the SolrYard, Indexing utilities and the Contenthub to support/use the new functionalities", 
   "* Fix for STANBOL-381", 
   "* Corrected some issues with the @Property annotations for ReferencedSites.", 
   "* Added a default ManagedSolrServer configuration the the Stanbol launchers", 
   "* changed the index location for the ManagedSolrServer to {sling.home}/indexes/{server-name}", 
   "* Updated the java script for the /find example in the RESTful service documentation of the entityhub service endpoints that support /find to work regardless if the user adds the tailing '/' to the URL in the Browser.", 
   "* Increased the start level for the org.apache.stanbol.data.site.dbpedia bundle from 19 to 30. Bundles the include configurations for OSGI components MUST start after the components they provide configurations for.", 
   "* Switched back to SNAPSHOT versions for all /data artifacts as [discussed](fixes STANBOL-385)", 
   "* Corrected a Bug that cause an IllegalArgumentException in the RESTful interface of \"/entityhub/site/{name}\" if the accessUri or queryUrl of the referenced site where an empty string (defaults). Now this URIs are correctly set to NULL if en empty string is provided by the OSGI configuration."
  ], 
  "revision_id": "1205331"
 }
]