[
 {
  "author": "rmannibucau", 
  "date": "2011-11-24T20:18:14.052409Z", 
  "msg": [
   "using putall instead of the properties constructor to init properties since it can't be available getting entires this way", 
   "OPENEJB-1654: System property overrides for MDB ActivationConfig"
  ], 
  "revision_id": "1205970"
 }, 
 {
  "author": "jbellis", 
  "date": "2011-11-24T20:05:37.000522Z", 
  "msg": [
   "fix self-hinting of timed out read repair updates and make hinted handoff less prone to OOMing a coordinator", 
   "patch by jbellis; reviewed by slebresne for CASSANDRA-3440"
  ], 
  "revision_id": "1205969"
 }, 
 {
  "author": "mattiase", 
  "date": "2011-11-24T19:59:06.729026Z", 
  "msg": [
   "We only keep vc-svn.el in our tree for the benefit of Emacs 21 which", 
   "has no vc-mode for Subversion at all, and dsvn.el needs one. Clarify", 
   "that, and add code to make sure it isn't accidentally used with newer", 
   "Emacses - something that has occurred from time to time, causing", 
   "confusion and anger.", 
   "* contrib/client-side/vc-svn.el", 
   "(comment): Clarify the file's purpose.", 
   "(toplevel): Signal an error if used with Emacs 22 or newer, instead of", 
   "failing later in mysterious ways."
  ], 
  "revision_id": "1205968"
 }, 
 {
  "author": "stsp", 
  "date": "2011-11-24T19:55:12.680849Z", 
  "msg": [
   "Sync the moves-scan-log branch with trunk."
  ], 
  "revision_id": "1205967"
 }, 
 {
  "author": "alexdma", 
  "date": "2011-11-24T19:50:39.586371Z", 
  "msg": [
   "More ontology manager optimizations:", 
   "* Ontology collectors are no longer concerned with Clerezza graph keys, these are handled by ClerezzaOntologyProvider (STANBOL-332 STANBOL-384)", 
   "* No more need to obtain ontology objects just for generating import statements for scopes, spaces and sessions (STANBOL-247 STANBOL-332)", 
   "* Reduced calls to guessOntologyIndetifier() to avoid incoherence for nameless ontologies (STANBOL-305)", 
   "* Scope RESTful PUT method can now create scopes with no core ontologies, to be added by subsequent POSTs"
  ], 
  "revision_id": "1205966"
 }
]