[
 {
  "author": "simonetripodi", 
  "date": "2011-11-26T17:28:31.529504Z", 
  "msg": [
   "typo"
  ], 
  "revision_id": "1206505"
 }, 
 {
  "author": "pfg", 
  "date": "2011-11-26T17:23:36.112815Z", 
  "msg": [
   "Drop some obsolete entries from the old documentation. There are surely more that to be removed."
  ], 
  "revision_id": "1206504"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2011-11-26T17:21:46.862553Z", 
  "msg": [
   "[MPIR-236] Crete a new report to show how to include the module in different build systems"
  ], 
  "revision_id": "1206503"
 }, 
 {
  "author": "alexdma", 
  "date": "2011-11-26T17:18:41.963909Z", 
  "msg": [
   "- New REST service replaces Ontology Index resource and provides resolvable URIs for stored ontologies not manaed by any scope or session. (STANBOL-178 STANBOL-196 STANBOL-384)", 
   "- New import statement replacement policy preserves imports on stored/managed ontologies. Currently it flattens the import tree instead of preserving it, but practically it works. (STANBOL-384) (TODO: implement import tree structure preservation and make it a configurable policy, after which STANBOL-384 can be closed)", 
   "- Whenever an imported ontology has an ID that ends with a hash ('#') character, it is stripped from import statements (and from internal graph names), as most browsers and HTTP resolvers would normally remove them automatically. (STANBOL-384)", 
   "- Merging is now supported for all ontologies that do not represent collectors (i.e. a session cannot be merged, but the import tree of an ontology contained therein can). The boolean query parameter \"merge\" is now available for all GET services that export these ontologies. (STANBOL-332)", 
   "- Ontology libraries and child ontologies are no longer concerned with internal Clerezza storage keys. These are now managed internally by the ontology provider (STANBOL-285 STANBOL-332)"
  ], 
  "revision_id": "1206502"
 }, 
 {
  "author": "sebb", 
  "date": "2011-11-26T17:11:40.370748Z", 
  "msg": [
   "private write-once field might as well be final"
  ], 
  "revision_id": "1206501"
 }
]