[
 {
  "author": "rwesten", 
  "date": "2011-11-30T16:49:25.231400Z", 
  "msg": [
   "fixes STANBOL-401:", 
   "* added Integration tests for STANBOL-401", 
   "* added the httpqueryheader", 
   "* fixed a Bug related to removal of headers", 
   "SolrYard", 
   "* Added a 1sec wait if the server is currently not available. This is only a temporary solution that makes is more likely to return null if the Server was initialised in the same request. This tries not to avoid YardExceptions in such cases. In future this will be replaced by splitting up the SolrYard in (1) SolrYardManager: A @Component that takes the configuration and tracks the required SolrServer ... (2) SolrYard: The service implementing Yard. This will be registered/unregistered by the SolrYardManager. Jira issue descibing that will come soon.", 
   "Commons Solr :", 
   "The RegisteredSolrServerTracker now tracks SolrCores instead of CoreContainers even if the CoreContainer is known by the parsed IndexReference. This has the advantage that no SolrServer is returned by the getService() method if the actually tracked core is not (yet) available on the CoreContainer.", 
   "Bug fixes:", 
   "*The GraphWriter (serialising of RDF Graphs) now correctly returns the \"Content-Type\" in cases wildcard types where requested", 
   "* The getServer() Method now always throws an YardException if the SolrServer is not available. NULL should no longer be returned."
  ], 
  "revision_id": "1208510"
 }, 
 {
  "author": "koji", 
  "date": "2011-11-30T16:46:22.160425Z", 
  "msg": [
   "SOLR-2922: Upgrade commons-io and commons-lang to 2.1 and 2.6, respectively."
  ], 
  "revision_id": "1208509"
 }, 
 {
  "author": "stack", 
  "date": "2011-11-30T16:46:06.698572Z", 
  "msg": [
   "HBASE-4352  Apply version of hbase-4015 to branch; reapplication"
  ], 
  "revision_id": "1208508"
 }, 
 {
  "author": "philip", 
  "date": "2011-11-30T16:45:48.194829Z", 
  "msg": [
   "Add another XFAIL move test to op-depth-test.", 
   "* subversion/tests/libsvn_wc/op-depth-test.c", 
   "(move_to_swap): New test.", 
   "(test_funcs): Add new test."
  ], 
  "revision_id": "1208507"
 }, 
 {
  "author": "kbrand", 
  "date": "2011-11-30T16:44:19.868476Z", 
  "msg": [
   "Follow-up on r1207758, further improvements for SSL under LWP 6:", 
   "- do not reset the global user agent in set_client_cert()", 
   "- also set the HTTPS_CA_FILE environment variable,", 
   "for compatibility with Net:SSL"
  ], 
  "revision_id": "1208506"
 }
]