[
 {
  "author": "devinhan", 
  "date": "2011-12-02T18:56:03.662813Z", 
  "msg": [
   "create tag for 0.5-incubating-rc2."
  ], 
  "revision_id": "1209635"
 }, 
 {
  "author": "rfeng", 
  "date": "2011-12-02T18:55:36.740722Z", 
  "msg": [
   "Add ablity to specify endpoint descriptions in node.xml for local domain registry"
  ], 
  "revision_id": "1209634"
 }, 
 {
  "author": "jfthomps", 
  "date": "2011-12-02T18:51:03.041416Z", 
  "msg": [
   "VCL-530", 
   "Database field for computer.RAM is limited to 65535", 
   "VCL-490", 
   "restrict fields when adding computers", 
   "VCL-489", 
   "allow dhcp and hosts info to be downloaded about computers any time instead of just when adding", 
   "VCL-419", 
   "VCL-311 allow private IP address to be set and modified for computers", 
   "VCL-354", 
   "View Computers Table - State Coloring", 
   "VCL-311", 
   "add more fields to edit computer page", 
   "VCL-236", 
   "make Groups first tab on Manage Computers page", 
   "computers.php:", 
   "-added MACADDERR2 global define", 
   "-modified selectComputers - moved select by group tab to first tab; changed \"No. Processors\" to \"No. Cores\"; added checkbox for showing location on Edit Computer Information page", 
   "-modified viewComputers - removed form for adding computers and added 2 buttons - one to go to the page to add a single computer, one to go to the page to add multiple computers; changed \"No. Processors\" to \"No. Cores\"; added Location column", 
   "-modified editOrAddComputer - added ability to add/edit private IP address, private and public addresses, and location; set computer type to default to blade, network to default to 1000, and no. cores to default to 1; added constraints so that only states and provisioning engines that make sense for a certain type are displayed; converted select boxes to dijit ones; made no. cores a dijit number spinner", 
   "-modified confirmEditOrAddComputer - removed redirect to bulkAddComputer since we go directly there now; added private IP address, mac addresses, and location", 
   "-modified submitEditComputer - added mysql escaping to notes field", 
   "-modified confirmDeleteComputer - added private IP address, mac addresses, and location", 
   "-modified bulkAddComputer - added constraints so that only states and provisioning engines that make sense for a certain type are displayed; converted select boxes to dijit ones; made no. cores a dijit number spinner", 
   "-modified confirmAddBulkComputers - moved where type is displayed; changed No. Processors to No. Cores, added location", 
   "-modified submitAddBulkComputers - added location; get id for noimage from database instead of hard coded '4', get id for noimage revisionid from database and insert into table; no longer provide option to generate dhcpd data", 
   "-removed generateDhcpForm", 
   "-removed generateDHCP", 
   "-modified computerUtilities - incorporated code from Clifton Wood to colorize more states; added utility to generate /etc/hosts, dhcpd.conf, and dhcpd.leases data", 
   "-modified processComputerInput - added private IP address, mac addresses, and location; increased allowed max RAM size to over 8TB; added form validation for type and state", 
   "-modified processComputerInput2 - added showlocation", 
   "-modified processBulkComputerInput - added location; set default for cores to 1, default for network to 1000, and default for type to blade; added code to validate that no hostnames will be duplicated", 
   "-modified updateComputer - set private IP address, mac addresses, and location", 
   "-modified addComputer - set private IP address, mac addresses, and location; get id for noimage from database instead of hard coded 4, get revisionid for noimage and set it", 
   "-modified printComputerInfo - added private IP address, mac addresses, and location", 
   "-modified getComputerSelection - include showlocation", 
   "-modified jsonCompGroupingComps, jsonCompGroupingGroups, AJaddCompToGroup, AJremCompFromGroup, AJaddGroupToComp, and AJremGroupFromComp - switched from json-comment-filtered to just json", 
   "-added AJgenerateUtilData", 
   "computers.js:", 
   "-added RPCwrapper", 
   "-modified addRemItem, addRemComp2, and getGroupsButton - use RPCwrapper instead of xhrPost inlined", 
   "-added editComputerSelectType", 
   "-added generateCompData", 
   "-added generateDHCPDdata", 
   "-added generateHostsData", 
   "-added generateCompDataCB", 
   "states.php - added AJgenerateUtilData", 
   "utils.php:", 
   "-modified getComputers - added privateIPaddress, eth0macaddress, eth1macaddress, and location to returned data", 
   "-modified printSelectInput - changed setting \"selected\" from just being \"selected\" to \"selected=selected\" so it would work with dijit.form.Select", 
   "-modified getDojoHTML - added dojo code for these states: editComputer, addComputer, confirmEditComputer, confirmAddComputer, bulkAddComputer, confirmAddBulkComputers, computerUtilities"
  ], 
  "revision_id": "1209633"
 }, 
 {
  "author": "yonik", 
  "date": "2011-12-02T18:48:42.150395Z", 
  "msg": [
   "noggit: refactor JSONWriter, add indenting, change string escaping to avoid illegal javascript chars"
  ], 
  "revision_id": "1209632"
 }, 
 {
  "author": "neels", 
  "date": "2011-12-02T18:39:47.445196Z", 
  "msg": [
   "* subversion/svn/main.c:", 
   "Fully review and semi-automatically re-line-break the 'svn help merge'", 
   "text. Fix another typo. Revamp the 2-URL merge example into an example of", 
   "combining two feature branches (inspired by an actual question on", 
   "FreeNode's #svn IRC channel by 'Xinil' on Nov. 30th). Rephrase a lot to be", 
   "(hopefully) more clear. Tweak some ascii art. There should be no change in", 
   "the actual information though. Unindent to fit in 80 chars width and", 
   "comment on that."
  ], 
  "revision_id": "1209631"
 }
]