[
 {
  "author": "jdcasey", 
  "date": "2011-12-12T15:28:44.652697Z", 
  "msg": [
   "re-adding benson; assured this shouldn't present a problem to do right now"
  ], 
  "revision_id": "1213278"
 }, 
 {
  "author": "rbaxter85", 
  "date": "2011-12-12T15:27:14.897990Z", 
  "msg": [
   "SHINDIG-1669", 
   "Navigating to URLs in the common container has no indication of success or failure"
  ], 
  "revision_id": "1213277"
 }, 
 {
  "author": "reschke", 
  "date": "2011-12-12T15:25:17.984730Z", 
  "msg": [
   "JCR-3175: InputContextImpl: cannot upload file larger than 2GB", 
   "Avoid truncating Content-Length to int by bypassing getIntHeader API"
  ], 
  "revision_id": "1213276"
 }, 
 {
  "author": "stsp", 
  "date": "2011-12-12T15:24:45.467152Z", 
  "msg": [
   "On the moves-scan-log branch, add prompts for \"incoming move vs. local", 
   "move\" tree conflicts to the conflict callback.", 
   "This is definitely not the final revision of the conflict prompt interface", 
   "for these cases. None of the new options actually do anything useful yet.", 
   "* subversion/include/svn_wc.h", 
   "(svn_wc_conflict_description2_t): Remove 'incoming_move'. It was unused", 
   "as of now and is not needed. The only way to get at the incoming move", 
   "is to scan the log. The incoming move cannot be known in advance yet.", 
   "* subversion/svn/conflict-callbacks.c", 
   "(svn_cl__conflict_handler): Add a prompt menu for conflicts involving an", 
   "incoming move.", 
   "* subversion/libsvn_wc/update_editor.c", 
   "(delete_entry): Slightly rework the loop logic which invokes the conflict", 
   "callback in case of incoming delete vs. local delete/move.", 
   "If a move is found scanning the log invoke the conflict callback with", 
   "an updated tree-conflict description that identifies the incoming change", 
   "as a move. Add a couple of no-op cases for possible resolutions received", 
   "from the callback."
  ], 
  "revision_id": "1213275"
 }, 
 {
  "author": "jpotts", 
  "date": "2011-12-12T15:23:31.789420Z", 
  "msg": [
   "Tagging approved 0.5 release by renaming 0.5 RC1 tag."
  ], 
  "revision_id": "1213274"
 }
]