[
 {
  "author": "sebawagner", 
  "date": "2011-12-15T11:16:16.719714Z", 
  "msg": [
   "Fix modified CSS file"
  ], 
  "revision_id": "1214703"
 }, 
 {
  "author": "mgrigorov", 
  "date": "2011-12-15T11:14:20.967211Z", 
  "msg": [
   "WICKET-4273", 
   "Rendering of resources in the header with dependency resolving and support for bundles"
  ], 
  "revision_id": "1214702"
 }, 
 {
  "author": "rwesten", 
  "date": "2011-12-15T11:13:30.730613Z", 
  "msg": [
   "### STANBOL-417: LD Path for Entityhub queries", 
   "This fixes STANBOL-417. LD Path is now supported for all \"/find\" and \"/query\" endpoints of the Entityhub.", 
   "The Documentation is available via the Stanbol HTTP Endpoint (e.g. http://localhost:8080/entityhub/site/dbpedia/find).", 
   "### LD-Path general (STANBOL-408)", 
   "* Remove the Query Backend. The AbstractBackend (super Class of all Entityhub RDFBackend implementations) now allows to add cached Representations.", 
   "* This also allowed to go back to normal Lists for the QueryResultList implementations.", 
   "* Added Extension to FieldQuery that allows use LD Paths", 
   "### Entityhub Web Endpoint (/jersey):", 
   "* improved Documentation (in general)", 
   "* added/improved API tests (HTML forms that allow to test the RESTful APIs)", 
   "* tests for /query is still missing", 
   "* added collapse/expand feature for the inline documentation of \"field query\" and \"LD path\"", 
   "### Managed SolrServer", 
   "* corrected a multi thread related issue in the initialization of managed indexes.", 
   "* Managed SolrServers can refer to multiple solr index archives", 
   "* if a second archives become available before the initialization of the fist one completed, than a side effect of the first initialization prevented the initialization of the second.", 
   "### Entityhub general", 
   "* added support for a sorted iteration (based on result score) over query results with the RDF triple-store based RdfQueryResultList", 
   "* This only ensures the correct iteration order via the Java API. This has no influence on the RDF serializations."
  ], 
  "revision_id": "1214701"
 }, 
 {
  "author": "dejanb", 
  "date": "2011-12-15T11:10:07.597865Z", 
  "msg": [
   "fix for DuplexNetworkTest failure"
  ], 
  "revision_id": "1214700"
 }, 
 {
  "author": "stsp", 
  "date": "2011-12-15T11:08:44.154904Z", 
  "msg": [
   "* CHANGES: List 'svnadmin hotcopy --incremental' for 1.8."
  ], 
  "revision_id": "1214699"
 }
]