[
 {
  "author": "marios", 
  "date": "2011-12-21T18:32:53.579354Z", 
  "msg": [
   "Add storage_volumes to Deltacloud::Instance model (for CIMI::Machine volumes attribute)"
  ], 
  "revision_id": "1221833"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2011-12-21T18:31:55.828093Z", 
  "msg": [
   "Fix calculation of composite path when configured with an absolute path."
  ], 
  "revision_id": "1221832"
 }, 
 {
  "author": "lcorneliussen", 
  "date": "2011-12-21T18:29:10.982308Z", 
  "msg": [
   "[NPANDAY-480] Support Windows Azure Cloud Service Project and Packaging (CCPack)", 
   "o initial working mojos"
  ], 
  "revision_id": "1221831"
 }, 
 {
  "author": "heyongqiang", 
  "date": "2011-12-21T18:21:44.667325Z", 
  "msg": [
   "HIVE-2666 [jira] StackOverflowError when using custom UDF in map join", 
   "(Kevin Wilfong via Yongqiang He)", 
   "Summary:", 
   "Resource files are now added to the class path as soon as they are added via the", 
   "CLI.  This fixes the stack overflow error mentioned in the JIRA by ensuring a", 
   "consistent class loader between serializers and deserializers for the same", 
   "query.", 
   "Note that now serdes which contain a static block to register themselves are now", 
   "registered twice, once when adding the file to the class loader, and once when", 
   "an instance of the class is created.  Previously, registering a serde twice", 
   "resulted in an exception, to avoid this, I have downgraded it to a warning.", 
   "When a custom UDF is used as part of a join which is converted to a map join,", 
   "the XMLEncoder enters an infinite loop when serializing the map reduce task for", 
   "the second time, as part of sending it to be executed.  This results in a stack", 
   "overflow error.", 
   "Test Plan:", 
   "I ran the unit tests to verify nothing was broken.", 
   "I ran several queries which used custom UDFs and involved a join which was", 
   "converted to a map join.  I verified these completed successfully consistently", 
   "Reviewers: JIRA, heyongqiang", 
   "Reviewed By: heyongqiang", 
   "CC: heyongqiang, kevinwilfong", 
   "Differential Revision: 957"
  ], 
  "revision_id": "1221830"
 }, 
 {
  "author": "elecharny", 
  "date": "2011-12-21T18:17:22.041161Z", 
  "msg": [
   "Reverted the last commit which was generating a NPE..."
  ], 
  "revision_id": "1221829"
 }
]