[
 {
  "author": "erodriguez", 
  "date": "2004-12-18T00:12:35.309936Z", 
  "msg": [
   "Documentation on configuring Kerberos clients in Linux."
  ], 
  "revision_id": "122689"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-12-18T00:10:50.724977Z", 
  "msg": [
   "Changes ...", 
   "o added deps needed for eve, core and store", 
   "o implemented decoder as a tree decoder (creates a tlv tree) then encodes it", 
   "back into bytes; inefficient way to figure out start and stop of a PDU but", 
   "it works for now and is ok for small PDUs that kerberos usually has", 
   "o implemented provider in total", 
   "o decoder and encoder really don't do much since reliance of server internals", 
   "are still on BC APIs", 
   "o corrected some constants based on EnvKeys", 
   "o version of all artifacts are now set at the top parent project's pom instead", 
   "of individually in each maven child project pom"
  ], 
  "revision_id": "122688"
 }, 
 {
  "author": "jlaskowski", 
  "date": "2004-12-18T00:07:30.478935Z", 
  "msg": [
   "Apache Tomcat's HTTP/1.1 Connector GBean"
  ], 
  "revision_id": "122687"
 }, 
 {
  "author": "kylem", 
  "date": "2004-12-17T23:51:15.672840Z", 
  "msg": [
   "Add support for using JDK 1.5 generics with Controls.  Controls codegen will take any generic formal type declarations found on control interfaces/extensions and propagate them correctly to derived artifacts.  It's possible to write a control type and associated impl with full type parameterization, including for associated operations and events.   The test suite contains a simple example of a ListControl where the contained element types are parameterized, as well as specific List implementation class to use for managing elements (in controls/org/apache/beehive/controls/test/controls/generic) and associated examples of usage (both programmatic and declarative) of ListControl w/ specific type bindings can be found in controls/test/src/units/org/apache/beehive/controls/test/java/generic."
  ], 
  "revision_id": "122686"
 }, 
 {
  "author": "gozer", 
  "date": "2004-12-17T21:46:34.532664Z", 
  "msg": [
   "whitespace--"
  ], 
  "revision_id": "122685"
 }
]