[
 {
  "author": "nspiegelberg", 
  "date": "2012-01-04T23:46:44.854936Z", 
  "msg": [
   "[master] LoadBalancer reflection needs outer class", 
   "Summary:", 
   "Using reflection to instantiate the load balancer implementation cannot", 
   "be done using ReflectionUtils because implementations of inner classes", 
   "must specify a reference to the outer class as an implicit first", 
   "parameter to all constructors. This change uses the java reflection API", 
   "to properly instantiate the load balancer implementation.", 
   "Test Plan:", 
   "Run on a cluster with non-default configuration:", 
   "<property>", 
   "<name>hbase.loadbalancer.impl</name>", 
   "<value>org.apache.hadoop.hbase.master.RegionManager$AssignmentLoadBalancer</value>", 
   "<description></description>", 
   "</property>", 
   "Reviewers: liyintang, kranganathan", 
   "Reviewed By: kranganathan", 
   "CC: hbase-eng@lists, kranganathan", 
   "Differential Revision: 379822"
  ], 
  "revision_id": "1227398"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2012-01-04T23:46:41.358293Z", 
  "msg": [
   "[master] Tool for computing explicit region placement", 
   "Summary:", 
   "This tool checks the locality of each region on each server and computes", 
   "the placement of regions on servers which maximizes total locality. The", 
   "placement hints are stored as a column in the .META. table. This tool is", 
   "run independently from other processes, but may later be integrated with", 
   "the master.", 
   "Test Plan:", 
   "Run on a cluster, verify that the stored hints reflect the locality of", 
   "regions.", 
   "Reviewers: kranganathan, kannan, liyintang", 
   "Reviewed By: kranganathan", 
   "CC: hbase-eng@lists, liyintang, kranganathan", 
   "Differential Revision: 379089"
  ], 
  "revision_id": "1227397"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2012-01-04T23:46:37.430794Z", 
  "msg": [
   "[master] Refactor LoadBalancer, add AssignmentLoadBalancer", 
   "Summary:", 
   "The existing load balancer only considers the number of regions when", 
   "balancing regions across servers. The addition of explicit region", 
   "placements requires that explicitly placed regions are not moved to", 
   "different servers by the load balancer.", 
   "This change abstracts the load balancer functionality such that multiple", 
   "different load balancer implementations can be run, and adds the", 
   "AssignmentLoadBalancer which moves regions to the favored nodes. The", 
   "default load balancer now ignores any region with an explicit placement.", 
   "Test Plan:", 
   "- verify that regions without hints are balanced as before", 
   "- enter favored node hints into META", 
   "- check that regions are assigned to the favored nodes", 
   "- kill/stop a region server", 
   "- check that the regions on that server move to secondary/tertiary", 
   "- start the offline region server", 
   "- check that primary regions for that server are assigned to it", 
   "Reviewers: kranganathan, kannan, liyintang", 
   "Reviewed By: liyintang", 
   "CC: hbase-eng@lists, kannan, liyintang, kranganathan, cgist, nspiegelberg", 
   "Differential Revision: 376983"
  ], 
  "revision_id": "1227396"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2012-01-04T23:46:34.037619Z", 
  "msg": [
   "[master] Master passes favored nodes to region servers", 
   "Summary:", 
   "Region servers can specify favored nodes when writing files with the", 
   "DFSClient, but they need to know the favored nodes in the first place.", 
   "Since the master already knows the favored nodes from when it scans", 
   "META, it can pass them to the region servers in the REGION_OPEN", 
   "messages. The ThrottledRegionReopener is also used to reopen regions", 
   "when the favored nodes change so that the region server can pick up the", 
   "changes.", 
   "Test Plan:", 
   "Run on a cluster, enter favored nodes into META, observe that all blocks", 
   "for any region are placed on the favored nodes.", 
   "Reviewers: kranganathan, liyintang, kannan", 
   "Reviewed By: kranganathan", 
   "CC: hbase-eng@lists, kranganathan, cgist", 
   "Differential Revision: 379441"
  ], 
  "revision_id": "1227395"
 }, 
 {
  "author": "nspiegelberg", 
  "date": "2012-01-04T23:46:29.407155Z", 
  "msg": [
   "[master] Regions should not have multiple transient preferred assignments", 
   "Summary:", 
   "Transient preferred assignments affect the way regions are load balanced", 
   "across servers, and those assignments should not exist longer than", 
   "necessary. If a server has a transient preferred assignment for a region", 
   "which is not in transition, that assignment will prevent the region from", 
   "receiving other regions without preferred assignments.", 
   "Some unexpected behavior which was observed was a region would have", 
   "multiple transient preferred assignments, only one of which could be", 
   "honored. The unhonored assignment would cause that server to ignore", 
   "assignments of other regions without preferred assignments. If that", 
   "server was the least-loaded, the ignored regions would not be assigned", 
   "to other servers and would remain unassigned until the preferred", 
   "assignment timed out.", 
   "This change causes any attempt to add a transient preferred assignment", 
   "for a region which already has an assignment to be ignored.", 
   "Test Plan:", 
   "On a cluster with a mix of regions with and without preferred", 
   "assignments, observe from log output that duplicate transient preferred", 
   "assignments are prevented and that load balancing does not cause some", 
   "regions to be unassigned for extended durations.", 
   "Reviewers: kranganathan, kannan, nspiegelberg", 
   "Reviewed By: nspiegelberg", 
   "CC: hbase-eng@lists, kranganathan, nspiegelberg, cgist", 
   "Differential Revision: 376980"
  ], 
  "revision_id": "1227394"
 }
]