[
 {
  "author": "danhaywood", 
  "date": "2012-01-06T18:36:17.892646Z", 
  "msg": [
   "ISIS-168: work on the quickstart app, for the archetype"
  ], 
  "revision_id": "1228333"
 }, 
 {
  "author": "mamta", 
  "date": "2012-01-06T18:35:59.383749Z", 
  "msg": [
   "DERBY-4631 Wrong join column returned by right outer join with NATURAL or USING and territory-based collation\\", 
   "Adding a test case with following comments", 
   "/**", 
   "* Test USING clause and NATURAL JOIN for case insensitive and", 
   "* \tcase sensitive collations.", 
   "* As per the SQL spec, \"the join columns in a natural join or in a named", 
   "*    columns join should be added to the select list by coalescing the", 
   "*    column from the left table with the column from the right table. \"", 
   "* DERBY-4631 - Derby does not coalesce as suggested by SQL spec, instead", 
   "* \tit picks up join column's value from the left table when working with", 
   "*    natural left outer join and it picks up the join column's value from", 
   "*    the right table when working with natural right outer join. This works", 
   "*    ok with non-territory based databases. It works ok for natural left", 
   "*    outer join for territory based database but depending on the data", 
   "*    value, it does not always work for natural right outer join in a", 
   "*    territory based database as shown in the test cases below.", 
   "* @throws SQLException", 
   "*/"
  ], 
  "revision_id": "1228332"
 }, 
 {
  "author": "ecn", 
  "date": "2012-01-06T18:34:54.983666Z", 
  "msg": [
   "ACCUMULO-214 merge fix to 1.4 branch"
  ], 
  "revision_id": "1228331"
 }, 
 {
  "author": "ecn", 
  "date": "2012-01-06T18:32:45.437416Z", 
  "msg": [
   "ACCUMULO-230 get a clean merge from 1.4 branch"
  ], 
  "revision_id": "1228330"
 }, 
 {
  "author": "cmueller", 
  "date": "2012-01-06T18:26:53.057830Z", 
  "msg": [
   "CAMEL-4734: Consolidate the database vendors in our unit tests"
  ], 
  "revision_id": "1228329"
 }
]