[
 {
  "author": "sascharodekamp", 
  "date": "2012-01-09T17:59:01.768871Z", 
  "msg": [
   "Update the Jackrabbit branch with the current trunk version to keep the branch up to date"
  ], 
  "revision_id": "1229278"
 }, 
 {
  "author": "kwright", 
  "date": "2012-01-09T17:55:45.594540Z", 
  "msg": [
   "Finish CONNECTORS-356."
  ], 
  "revision_id": "1229277"
 }, 
 {
  "author": "vines", 
  "date": "2012-01-09T17:52:04.591711Z", 
  "msg": [
   "ACCUMULO-292 - Altered pom to allow mvn test to work out of the box- caveat: I may have broke the actual building."
  ], 
  "revision_id": "1229276"
 }, 
 {
  "author": "lahiru", 
  "date": "2012-01-09T17:48:56.179836Z", 
  "msg": [
   "fixing issues comes when executing workflow with description documents create using xbaya."
  ], 
  "revision_id": "1229275"
 }, 
 {
  "author": "alexdma", 
  "date": "2012-01-09T17:44:30.317195Z", 
  "msg": [
   "* OntologyProvider now supports import management policies for exporting ontologies. These include MERGE, PRESERVE and FLATTEN. The PRESERVE option set by default can now set STANBOL-384 as closed.", 
   "* Clerezza-based input sources ca", 
   "* Optimizations for STANBOL-433 :", 
   "** OntologyInpuSource<O,P> now allows to specify the storage mechanism (P - the triples provider) used for creating the source, for instance OWLOntologyManager for OWL API and TcProvider for Clerezza. If it coincides with the one used by the OntologyProvider<S> , there is no need to copy graphs from the source to the provider. As a consequence, the interface OntologyInpuSource now has methods getTriplesProvider() and getStorageKey() - with corresponding protected bind methods.", 
   "** OWLExportable interface now includes method O export(returnType) to export in formats other than OWLOntology. Can save time and memory when handling ontologies with no need for converting them. Method asOWLONtology() is deprecated but still used.", 
   "* OntologyCollector#addOntology() now returns the internal key of the ontology as managed by the OntologyProvider (STANBOL-426)", 
   "* OntoNet REST API now creates input sources by passing over the MIME type from the request header. This should speed up laoding ontologies not in RDF/XML or in some less popular format (STANBOL-422)", 
   "* added more javadoc to OntoNet"
  ], 
  "revision_id": "1229274"
 }
]