[
 {
  "author": "hwright", 
  "date": "2012-01-11T04:02:35.111411Z", 
  "msg": [
   "Fix a potential editor violation when setting properties on a file URL.", 
   "* subversion/libsvn_client/prop_commands.c", 
   "(do_url_propset): Add param for the URL being set, and if a file, use", 
   "its basename to do the setting.", 
   "(propset_on_url): If the target is a file, we need to anchor the edit", 
   "at its parent, since all good editor drives have a directory at the root."
  ], 
  "revision_id": "1229888"
 }, 
 {
  "author": "szetszwo", 
  "date": "2012-01-11T04:02:12.173203Z", 
  "msg": [
   "svn merge -c 1190127 from trunk for HDFS-2479."
  ], 
  "revision_id": "1229887"
 }, 
 {
  "author": "hadrian", 
  "date": "2012-01-11T03:55:04.260620Z", 
  "msg": [
   "CAMEL-4882. Fix compiler issue due to backport not accounting for api change"
  ], 
  "revision_id": "1229886"
 }, 
 {
  "author": "heyongqiang", 
  "date": "2012-01-11T03:44:17.268005Z", 
  "msg": [
   "HIVE-2706 [jira] StackOverflowError when using custom UDF after adding archive", 
   "after adding jars", 
   "(Kevin Wilfong via Yongqiang He)", 
   "Summary:", 
   "https://issues.apache.org/jira/browse/HIVE-2706", 
   "The issue was that the current thread's classloader and the classloader in the", 
   "conf differed due to the prehook updating only the current thread's classloader", 
   "with new jars.  Now, it updates both classloaders, fixing the issue.", 
   "When a custom UDF is used in a query after add an archive, such as a zip file,", 
   "after adding jars, the XMLEncoder enters an infinite loop when serializing the", 
   "map reduce task, as part of sending it to be executed. This results in a stack", 
   "overflow error.", 
   "Test Plan: Verified it fixed the stack overflow error.", 
   "Reviewers: JIRA, heyongqiang, njain", 
   "Reviewed By: heyongqiang", 
   "CC: heyongqiang", 
   "Differential Revision: https://reviews.facebook.net/D1167"
  ], 
  "revision_id": "1229885"
 }, 
 {
  "author": "lhazlewood", 
  "date": "2012-01-11T03:43:35.069945Z", 
  "msg": [
   "SHIRO-205: Filter bracketed config with nested commas now no longer needs to be quoted.  E.g. the following is now a valid chain definition:  foo, bar[a, b], baz[d, e, f]  (it was previously required to be: foo, bar[\"a, b\"], baz[\"d, e, f\"] ).  Backwards compatibility is retained by stripping quoted config if it exists.  Test cases added."
  ], 
  "revision_id": "1229884"
 }
]