[
 {
  "author": "rjung", 
  "date": "2012-01-15T16:24:34.095417Z", 
  "msg": [
   "Fix wrong TC deps version in eclipse path."
  ], 
  "revision_id": "1231703"
 }, 
 {
  "author": "markrmiller", 
  "date": "2012-01-15T16:20:27.756695Z", 
  "msg": [
   "do not accept updates when not connected to zookeeper"
  ], 
  "revision_id": "1231702"
 }, 
 {
  "author": "mikem", 
  "date": "2012-01-15T16:17:01.039376Z", 
  "msg": [
   "DERBY-5564 Code does different things depending if derby.locks.deadlockTrace=tru", 
   "e is set", 
   "backporting change #1230100 from trunk to 10.6 branch.  Automatic merge of", 
   "changes was clean.", 
   "original patch by Brett Bergquist, then modified by Mike Matrigali for submission.", 
   "Changes the code to always return 40XL1 as the SQL state when a lock timeout", 
   "occurs. Previous to this change if deadlock diagnostics were enabled then", 
   "40X02 would be returned. Internally multiple places in the code was not", 
   "expecting the second error code for a lock timeout. Also it was agreed that", 
   "it was confusing for user applications to have to code for both states in", 
   "case they wanted to turn diagnostics on and off.", 
   "Existing test cases were changed to match the new expected behavior.", 
   "The behavior in DDLConstantaction to immediately throw an error on first try", 
   "if a lock timeout is encounted with diagnostics enabled was preserved. The", 
   "error thrown now will be with sql state 40XL1 and not 40X02 as before."
  ], 
  "revision_id": "1231701"
 }, 
 {
  "author": "robinanil", 
  "date": "2012-01-15T16:12:14.301495Z", 
  "msg": [
   "MAHOUT-890 MAHOUT-920 MAHOUT-921 MAHOUT-927 FpGrowth2 Implementation and fixes to existing Mapreduce classes in pfpgrowth"
  ], 
  "revision_id": "1231700"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2012-01-15T16:12:04.886793Z", 
  "msg": [
   "imported legal files from any23core that have to be added in the war that contains dependencies"
  ], 
  "revision_id": "1231699"
 }
]