[
 {
  "author": "pmouawad", 
  "date": "2012-01-23T17:54:35.420168Z", 
  "msg": [
   "Bug 41788 - Log viewer (console window) needed as an option", 
   "Clear content on enable"
  ], 
  "revision_id": "1234923"
 }, 
 {
  "author": "tedyu", 
  "date": "2012-01-23T17:54:23.410024Z", 
  "msg": [
   "HBASE-5231  Backport HBASE-3373 (per-table load balancing) to 0.92"
  ], 
  "revision_id": "1234922"
 }, 
 {
  "author": "ramkrishna", 
  "date": "2012-01-23T17:52:37.741630Z", 
  "msg": [
   "HBASE-5243 LogSyncerThread not getting shutdown waiting for the interrupted flag(Ram)."
  ], 
  "revision_id": "1234921"
 }, 
 {
  "author": "dspicar", 
  "date": "2012-01-23T17:51:19.824479Z", 
  "msg": [
   "CLEREZZA-617: Added documentation to documentation.nt"
  ], 
  "revision_id": "1234920"
 }, 
 {
  "author": "julianfoad", 
  "date": "2012-01-23T17:50:32.977502Z", 
  "msg": [
   "In a reintegrate merge, detect when a revision to be merged is itself the", 
   "result of a merge in the opposite direction (often called a reflective", 
   "merge).  Don't merge any such revision, but do record it as merged.", 
   "The most important result is that the user can reintegrate a branch and then", 
   "carry on using it without needing to do either of the two currently", 
   "recommended work-arounds (the record-only merge known as the 'keep-alive", 
   "dance', or deleting and recreating the branch).  The next time the user runs", 
   "a sync merge on the branch, Subversion will automatically detect the", 
   "reintegration commit on the parent branch and will record that revision as", 
   "having been merged to the branch just like the manual 'keep-alive dance'.", 
   "If a revision under consideration is not simply a reflective merge but", 
   "consists of both a reflective and desired merges, throw an error to let the", 
   "user know that they will need to merge the other changes manually.  (The", 
   "user may have made a mistake.  Resolving this case automatically would", 
   "require merges other than from the specified source to the specified target,", 
   "which is outside the scope of Subversion's automatic merge tracking.)", 
   "Future improvements:", 
   "- For a partially-reflective revision, issue a better diagnostic message", 
   "to let the user know exactly what is and isn't already merged.", 
   "- Examine subtree mergeinfo as well as merge-root mergeinfo. (At present,", 
   "any revision that has reflective mergeinfo at the merge-root will be", 
   "skipped across all sub-trees, but a revision that only shows up as", 
   "reflective if we look at its subtree mergeinfo will not be skipped.)", 
   "- Work also for a reverse merge. (Just need to generalize the range", 
   "arithmetic w.r.t. exclusive and inclusive end-points.)", 
   "- Work also for a single-file merge. (But, ugh, the code is completely", 
   "different.)", 
   "* subversion/libsvn_client/merge.c", 
   "(show_mergeinfo): New (for debugging only).", 
   "(mergeinfo_graph_*): New.", 
   "(fetch_repos_mergeinfo, incoming_mergeinfo_diff, is_reflected_merge,", 
   "find_reflected_rev, remove_reflected_revs): New functions.", 
   "(do_directory_merge): Call remove_reflected_revs().", 
   "* subversion/tests/cmdline/log_tests.py", 
   "(merge_history_repos): Don't try to resolve conflicts in the final merge,", 
   "because the merge now works exactly how it should and produces no", 
   "conflicts.", 
   "* subversion/tests/cmdline/merge_reintegrate_tests.py", 
   "(simple_reintegrate, simple_sync_merge): New functions.", 
   "(reintegrate_keep_alive1, reintegrate_keep_alive2, reintegrate_keep_alive3):", 
   "New tests.", 
   "(test_list): Add the new tests."
  ], 
  "revision_id": "1234919"
 }
]