[
 {
  "author": "marios", 
  "date": "2012-01-23T13:17:23.999699Z", 
  "msg": [
   "Minor fixes - adds empty storage_volumes for mock driver data and supported_collections for rhevm"
  ], 
  "revision_id": "1234778"
 }, 
 {
  "author": "hdu", 
  "date": "2012-01-23T13:14:56.365387Z", 
  "msg": [
   "emulate word boundary matching of old regex engine", 
   "The new ICU regex engine has much improved unicode capabilities.", 
   "The old regex engine had the extensions \\< and \\> for matching word boundaries.", 
   "For the convenience of a smooth upgrade experience these artifacts now get mapped to \\b which is supported by almost all regex engines."
  ], 
  "revision_id": "1234777"
 }, 
 {
  "author": "kahatlen", 
  "date": "2012-01-23T13:14:52.621922Z", 
  "msg": [
   "DERBY-5406: Intermittent failures in CompressTableTest and TruncateTableTest", 
   "Retry compilation if it fails because a conglomerate has disappeared.", 
   "This may happen if DDL, compress, truncate or similar operations happen", 
   "while the statement is being compiled. When trying again, the compilation", 
   "should find the new conglomerate if one exists, or fail with a proper", 
   "error message if the SQL object has been removed.", 
   "This is a workaround for a race condition in the dependency management.", 
   "When binding a statement, the compiler typically builds descriptor", 
   "objects (like a TableDescriptor) from the system tables and then registers", 
   "the statement as a dependent on that descriptor. However, another thread", 
   "may at the same time be invalidating all dependents of that descriptor.", 
   "It is possible that this happens right before the current statement has", 
   "been registered as a dependent, and it will never see the invalidation", 
   "request. Once it actually tries to access the conglomerate associated with", 
   "the descriptor, it will fail with a \"conglomerate does not exist\" error,", 
   "and since the statement did not see the invalidation request, the compiler", 
   "doesn't know that it should retry the compilation.", 
   "This fix also backs out the changes made in revision 1187204, as they", 
   "addressed a subset of the cases handled by this broader fix, and are not", 
   "needed any more."
  ], 
  "revision_id": "1234776"
 }, 
 {
  "author": "danhaywood", 
  "date": "2012-01-23T13:14:39.152066Z", 
  "msg": [
   "[maven-release-plugin] prepare release isis-0.2.0-incubating"
  ], 
  "revision_id": "1234775"
 }, 
 {
  "author": "jbonofre", 
  "date": "2012-01-23T13:08:50.594854Z", 
  "msg": [
   "[SMX4-1023] Add OSGi bundle for velocity-tools 2.0"
  ], 
  "revision_id": "1234774"
 }
]