[
 {
  "author": "markt", 
  "date": "2012-01-24T11:30:36.737336Z", 
  "msg": [
   "Remove deprecated code"
  ], 
  "revision_id": "1235208"
 }, 
 {
  "author": "markt", 
  "date": "2012-01-24T11:28:29.603216Z", 
  "msg": [
   "Add SSO test.", 
   "Patch provided by Brian Burch."
  ], 
  "revision_id": "1235207"
 }, 
 {
  "author": "rwesten", 
  "date": "2012-01-24T11:25:34.316000Z", 
  "msg": [
   "First step for STANBOL-431 as described in my most recent comment [1]", 
   "### Enhancer Jersey", 
   "* Improved the Web UI of the Enhancer to provide information about the used Chain as well as the state of the Engines referenced by the Chain.", 
   "* Adapted the previous EnginesRootResource so that it can be used for /engines, /enhancer and /enhancer/chain/<chain-name>", 
   "* TODO: Some links in the Documentation may not yet be relative to the URL in the Browser", 
   "### metatype.properties", 
   "* Added those for all Stanbol Enhancer Components", 
   "* Added missing properties for most of the Components", 
   "* Changed values to use \"Apache Stanbol Enhancer\" as prefix followed by the <interface> label (e.g. \"Enigne\" for \"EnhancementEgnine\") and than the label for the implementation. By doing that the components are nicely sorted within the Apache Felix Web Console", 
   "### EnhancementChains", 
   "There are the following implementations", 
   "* SingleEngineChain: Helper that allows to wrap a single EnhancementEngine as Chain (in servicesapi.helpers)", 
   "* AllActiveChain: Used by the DefaultChain component this chain provides the same functionality as the WeightedJobManager", 
   "* WeightedChain: Creates a Chain by an unsorted list of engines.", 
   "* GraphChain: Allows to directly configure the ExecutionPlan", 
   "The later three implementations can be found at enhancer/chain", 
   "### EventJobManager", 
   "EnhancementJobManager implementation that supports", 
   "* enhancement Chains", 
   "* asynchronous enhancements (simultaneous, multi threaded execution of multiple enhancement engines for the same content item).", 
   "For details see the specification in the documentation.", 
   "### EnhancementEngines", 
   "* adapped all existing implementations to the changes in the API.", 
   "* also ensured that ASYNC enhance mode is correctly deactivated for all current engines. Previously this was ignored, because the Enhancer infrastructure had no support for it. Now Engines that support ASYNC mode need to handle read/write locks on the ContentItem what is not the case for the current implementations.", 
   "### Launchers", 
   "* added new Modules related to changes", 
   "* configured a \"language\" enhancement Chain that includes \"metaxa\" (optional) and \"langid\". This is accessible under /enhancer/chain/language and can be used to detect the language for an content item without making any further analyzes", 
   "### ContentItem", 
   "The MGraph returned by getMetadata changed to LockableMGraph. Engines that support ASYNC enhancements need now to use read/write locks. In SYNC mode the EnhancementJobManager needs to ensure that the engine is executed with exclusive access (write permissions) to the content item.", 
   "### Other Improvements:", 
   "* Moved Utilities to get the MediaType for the Response based on the parsed Accept header from the Entityhub Jersey to the the commons.web.base module. This utilities are now also used by the Enhancer to extract the Accept header from responses.", 
   "* Added LDPath to the parent POM; LDPath modules are now bundles; Switched to ldpath version 0.9.4-SNAPSHOT", 
   "* reactivated integration-tests for the Stanbol Enhancer see also [2]. Also fixed the two failing tests.", 
   "[1] https://issues.apache.org/jira/browse/STANBOL-431?focusedCommentId=13189687&page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-13189687", 
   "[2] http://markmail.org/thread/4goc6wia7ozq7v3w"
  ], 
  "revision_id": "1235206"
 }, 
 {
  "author": "olegk", 
  "date": "2012-01-24T11:22:05.570643Z", 
  "msg": [
   "TABS -> SPACES"
  ], 
  "revision_id": "1235205"
 }, 
 {
  "author": "olegk", 
  "date": "2012-01-24T11:21:18.647973Z", 
  "msg": [
   "Fixed handling of pipelined requests over a half-closed connection"
  ], 
  "revision_id": "1235204"
 }
]