[
 {
  "author": "marvin", 
  "date": "2012-01-26T03:23:37.136006Z", 
  "msg": [
   "Finish simplifiying CFCPerlClass constructor.", 
   "Break xs_code out of CFCPerlClass_new(), adding it with new routine", 
   "CFCPerlClass_append_xs().  Remove \"client\" as an argument, deriving it instead", 
   "from \"parcel\" and \"class_name\"."
  ], 
  "revision_id": "1236033"
 }, 
 {
  "author": "spamassassin_role", 
  "date": "2012-01-26T03:10:27.192222Z", 
  "msg": [
   "updated scores for revision 1235691 active rules added since last mass-check"
  ], 
  "revision_id": "1236032"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-01-26T02:58:57.835570Z", 
  "msg": [
   "[jira] [HBASE-4218] HFile data block encoding framework and delta encoding", 
   "implementation (Jacek Midgal, Mikhail Bautin)", 
   "Summary:", 
   "Adding a framework that allows to \"encode\" keys in an HFile data block. We", 
   "support two modes of encoding: (1) both on disk and in cache, and (2) in cache", 
   "only. This is distinct from compression that is already being done in HBase,", 
   "e.g. GZ or LZO. When data block encoding is enabled, we store blocks in cache", 
   "in an uncompressed but encoded form. This allows to fit more blocks in cache", 
   "and reduce the number of disk reads.", 
   "The most common example of data block encoding is delta encoding, where we take", 
   "advantage of the fact that HFile keys are sorted and share a lot of common", 
   "prefixes, and only store the delta between each pair of consecutive keys.", 
   "Initial encoding algorithms implemented are DIFF, FAST_DIFF, and PREFIX.", 
   "This is based on the delta encoding patch developed by Jacek Midgal during his", 
   "2011 summer internship at Facebook. The original patch is available here:", 
   "https://reviews.apache.org/r/2308/diff/.", 
   "Test Plan: Unit tests. Distributed load test on a five-node cluster.", 
   "Reviewers: JIRA, tedyu, stack, nspiegelberg, Kannan", 
   "Reviewed By: Kannan", 
   "CC: tedyu, todd, mbautin, stack, Kannan, mcorgan, gqchen", 
   "Differential Revision: https://reviews.facebook.net/D447"
  ], 
  "revision_id": "1236031"
 }, 
 {
  "author": "ctan", 
  "date": "2012-01-26T02:57:44.548052Z", 
  "msg": [
   "[CONTINUUM-2670] added projectGroupId parameter when editing project level build definition from the group build definition page"
  ], 
  "revision_id": "1236030"
 }, 
 {
  "author": "marvin", 
  "date": "2012-01-26T02:52:59.342698Z", 
  "msg": [
   "Run lucytidy.pl on perl/buildlib."
  ], 
  "revision_id": "1236029"
 }
]