[
 {
  "author": "sinaci", 
  "date": "2012-01-26T15:39:59.946010Z", 
  "msg": [
   "deleting refactored packages"
  ], 
  "revision_id": "1236248"
 }, 
 {
  "author": "lu4242", 
  "date": "2012-01-26T15:37:10.924373Z", 
  "msg": [
   "MYFACES-3433 PhaseListenerManager throws NPE if pre-phase action was unsuccessful (Thanks to Martin Koci for provide this patch)"
  ], 
  "revision_id": "1236247"
 }, 
 {
  "author": "sinaci", 
  "date": "2012-01-26T15:37:02.527821Z", 
  "msg": [
   "STANBOL-469:", 
   "- LDPath has been integrated into Contenthub.", 
   "* Several Solr cores can be managed through LDProgramManager of Contenthub.", 
   "* Each LDPath program corresponds to a unique Solr core. LDPath programs (hence Solr cores) are uniquely identified through their names. LDProgramManager and SolrCoreManager provides the required synchronization between Solr cores and LDPath programs.", 
   "* Submitted LDPath programs are saved into separate files and accessed via a simple cache mechanism.", 
   "* CRD operations for LDPath programs are provided through LDProgramManager", 
   "* ClerezzaBackend is implemented as an LDPath backend.", 
   "* LDProgramManager has a special method (executeProgram) to execute the LDPath programs on Clerezza MGraphs.", 
   "* REST services are ready for LDProgramManager functionalities.", 
   "* Contenthub Store and Search parts (all interfaces and REST APIs) are adjusted so that they can operate with LDPath programs.", 
   "STANBOL-470:", 
   "- Search logic has been implemented from scratch.", 
   "* Search engine pattern has been removed for document search.", 
   "* Content items are indexed through Solr cores. Therefore all search on the content items are performed through Solr indexes.", 
   "* Search interface has been splitted into there different interfaces: SolrSearch, RelatedKeywordSearch and FeaturedSearch.", 
   "* SolrSearch is compatible with SolrJ. That is, clients who have already been using SolrJ can easily switch to SolrSearch API of Contenthub. As a result of LDPath integration, additional methods exist in this interface to accept LDPath program names (Solr core names). There is a single implementation of this interface in Contenthub.", 
   "* RelatedKeywordSearch exposes a \"search engine\" pattern, but only to search for related keywords. RelatedKeywordSearchManager is the manager to handle several implementations of this interface (engines).", 
   "* In addition to the search results retrieved from SolrSearch, users can now send their search keywords (query terms) to RelatedKeywordSearchManager to retrieve related keywords from different sources. This can be performed as a separate process from SolrSearch.", 
   "* RelatedKeywordSearch has been implemented by WordnetSearch, OntologyResourceSearch and ReferencedSiteSearch. As their names indicate, they look for related keywords within their resources. (WordnetSearch can be excluded until the license issue is resolved or a new client library is used)", 
   "* FeaturedSearch combines the capabilities of SolrSearch and RelatedKeywordSearch in case a client wants to retrieve all results (content items and related keywords) from Contenthub search.", 
   "* FeaturedSearch provides a similar interface to SolrSearch with additional methods. However, behaviour is different, it is \"featured\" in this implementation.", 
   "* FeaturedSearch provides a special method: tokenizeEntities. This method takes a query string and finds out whether there exists any entities in the query or not. Based on the discovered entities, FeaturedSearch prepares Solr queries in special formats to boost the results related with the entities. However, this method should be improved to cover a massive number of possible cases which can occur during keyword searches.", 
   "* FeaturedSearch provides special methods to ease the faceted search. Web GUI of Contenthub makes use of this interface to enable faceted search."
  ], 
  "revision_id": "1236246"
 }, 
 {
  "author": "lu4242", 
  "date": "2012-01-26T15:37:00.264601Z", 
  "msg": [
   "MYFACES-3433 PhaseListenerManager throws NPE if pre-phase action was unsuccessful (Thanks to Martin Koci for provide this patch)"
  ], 
  "revision_id": "1236245"
 }, 
 {
  "author": "rwesten", 
  "date": "2012-01-26T15:33:13.402012Z", 
  "msg": [
   "fixed relative links"
  ], 
  "revision_id": "1236244"
 }
]