[
 {
  "author": "rwesten", 
  "date": "2012-02-02T13:52:27.129260Z", 
  "msg": [
   "STANBOL-478: Metaxa Engine no adds the extracted plain text as Blob to the ContentItem. All other engines retrieve content from Blobs.", 
   "STANBOL-479: All current (and not deprecated) Engines do now support async processing", 
   "STANBOL-46: Asynchronous enhancements are now finally supported by both the EnhancementJobManager and the EnhancementEngines.", 
   "Other changes:", 
   "* Added two utility methods to the ContentItemHelper that allow to search for Blobs based on mime types and to retrieve the text from a Blob.", 
   "* Metaxa Engine allows now to configure a list of mime types that are ingored. This is basically to avaid processing of plain/text content, but could also be used by users to deactivate other mime types.", 
   "* geonames Engine: changed most of the logging to the level debug. In addition this engine does no use the correct logger"
  ], 
  "revision_id": "1239618"
 }, 
 {
  "author": "stsp", 
  "date": "2012-02-02T13:46:11.346781Z", 
  "msg": [
   "Rename the new --no-diff-properties option to --ignore-properties.", 
   "This allows the option to be re-used by other subcommands in the future.", 
   "Suggested by: hwright", 
   "* subversion/svn/cl.h", 
   "(svn_cl__opt_state_t): Rename no_diff_props to ignore_props.", 
   "* subversion/svn/main.c", 
   "(svn_cl__longopt_t, svn_cl__cmd_table): Rename opt_no_diff_props to", 
   "opt_ignore_props.", 
   "(svn_cl__options): Rename --no-diff-properties to --ignore-properties", 
   "and update a reference to the old name in the help text of 'svn diff'.", 
   "(main): Track renamed fields.", 
   "* subversion/svn/diff-cmd.c", 
   "(svn_cl__diff): Track renamed fields."
  ], 
  "revision_id": "1239617"
 }, 
 {
  "author": "danielsh", 
  "date": "2012-02-02T13:43:43.064485Z", 
  "msg": [
   "Merge the r1221767 group from trunk:", 
   "* r1221767, r1221780", 
   "Fix SVNParentPath listings for parent paths which contain symlinks.", 
   "This was supposed to have been fixed by r1132782, but that solution", 
   "had problems of its own.", 
   "Notes:", 
   "r1221767 is code formatting only, needed to avoid a conflict", 
   "Votes:", 
   "+1: cmpilato, philip, rhuijben"
  ], 
  "revision_id": "1239616"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2012-02-02T13:43:13.682859Z", 
  "msg": [
   "ability to set offline mode from a system property"
  ], 
  "revision_id": "1239615"
 }, 
 {
  "author": "danielsh", 
  "date": "2012-02-02T13:40:20.992165Z", 
  "msg": [
   "* STATUS: Move r1221767 to approved (with cmpilato's +1 over IRC)."
  ], 
  "revision_id": "1239614"
 }
]