[
 {
  "author": "mikem", 
  "date": "2012-02-02T22:42:48.856331Z", 
  "msg": [
   "fixing a comment."
  ], 
  "revision_id": "1239893"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-02-02T22:38:48.450066Z", 
  "msg": [
   "[jira] [HBASE-5259] Normalize the RegionLocation in TableInputFormat by the reverse DNS lookup.", 
   "Summary:", 
   "Assuming the HBase and MapReduce running in the same cluster, the", 
   "TableInputFormat is to override the split function which divides all the", 
   "regions from one particular table into a series of mapper tasks. So each", 
   "mapper task can process a region or one part of a region. Ideally, the", 
   "mapper task should run on the same machine on which the region server", 
   "hosts the corresponding region.  That's the motivation that the", 
   "TableInputFormat sets the RegionLocation so that the MapReduce framework", 
   "can respect the node locality.", 
   "The code simply set the host name of the region server as the", 
   "HRegionLocation.  However, the host name of the region server may have", 
   "different format with the host name of the task tracker (Mapper task).", 
   "The task tracker always gets its hostname by the reverse DNS lookup. And", 
   "the DNS service may return different host name format. For example, the", 
   "host name of the region server is correctly set as a.b.c.d while the", 
   "reverse DNS lookup may return a.b.c.d. (With an additional doc in the", 
   "end).", 
   "So the solution is to set the RegionLocation by the reverse DNS lookup", 
   "as well.  No matter what host name format the DNS system is using, the", 
   "TableInputFormat has the responsibility to keep the consistent host name", 
   "format with the MapReduce framework.", 
   "Test Plan: running all the unit tests", 
   "Reviewers: Kannan, Karthik, mbautin", 
   "Reviewed By: kannan", 
   "CC: JIRA, tedyu, Liyin, Kannan, gqchen", 
   "Differential Revision: https://reviews.facebook.net/D1413"
  ], 
  "revision_id": "1239892"
 }, 
 {
  "author": "pfg", 
  "date": "2012-02-02T22:35:12.191850Z", 
  "msg": [
   "i109428 - FreeBSD porting: graphite support."
  ], 
  "revision_id": "1239891"
 }, 
 {
  "author": "jcorvel", 
  "date": "2012-02-02T22:33:45.975263Z", 
  "msg": [
   "* STATUS: Propose r1227900."
  ], 
  "revision_id": "1239890"
 }, 
 {
  "author": "kwall", 
  "date": "2012-02-02T22:26:50.978596Z", 
  "msg": [
   "QPID-3805: Remove allow-all/deny-all security plugins from Java Broker.", 
   "Remove allow-all/deny-all security plugins as equivilent functionality is offerred by the ACL plugin."
  ], 
  "revision_id": "1239889"
 }
]