[
 {
  "author": "quinlan", 
  "date": "2005-01-04T05:08:54.241195Z", 
  "msg": [
   "updates to random URI/FROM rules"
  ], 
  "revision_id": "124069"
 }, 
 {
  "author": "crossley", 
  "date": "2005-01-04T04:41:41.099482Z", 
  "msg": [
   "Show committers how to determine who are the moderators", 
   "for their project lists."
  ], 
  "revision_id": "124068"
 }, 
 {
  "author": "craigmcc", 
  "date": "2005-01-04T04:27:15.190319Z", 
  "msg": [
   "Initial commit of an example application for Shale, illustrating more", 
   "interesting features than one sees with MailReader.  In particular:", 
   "* Use of application level \"controller\" features to filter out", 
   "direct requests for JSP and JSPF (JSP fragment) resources, since", 
   "they should only be accessed via *.faces URLs.", 
   "See \"src/web/WEB-INF/chain-config.xml\" for configuration of", 
   "this application's additions to the standard Shale processing chain.", 
   "* Use of DialogController for a sophisticated workflow with multiple", 
   "entries and exits:  logon dialog for a portal-type site that supports", 
   "creating new profiles (with or without an email confirmation), plus", 
   "\"remember me\" cookies.", 
   "See the javadocs for package \"org.apache.shale.usecases.logon\" for", 
   "an overview of this functionality, plus an activity diagram describing", 
   "the state transitions.  (The diagram was produced with Poseidon for UML", 
   "Community Edition, version 3.0, and the Poseidon project file is", 
   "also checked in).", 
   "* Use of standard JSF facilities to support a language picker, based on", 
   "the supported locales for the application.  (NOTE - at present switching", 
   "languages does not appear to do anything, but that is because I only", 
   "checked in the default (English) properties file -- if someone would", 
   "like to translate \"src/java/org/apache/shale/usecases/view/Bundle.properties\"", 
   "into other languages, I'd be happy to check it in.", 
   "See \"src/web/locale/select.jsp\" for the JSP page that does this,", 
   "and \"src/java/org/apache/shale/usecases/locale/Select.java\" for", 
   "the corresponding backing bean.", 
   "* Use of <managed-property> elements to configure the properties of a", 
   "newly created managed bean, using either literal values or expressions", 
   "(essentially an example of IoC with setter injection).", 
   "In this example, such properties are used to:", 
   "- Configure the DAO object that is used by the business logic of", 
   "the application, using", 
   "- Configure the functionality of the DialogController instance,", 
   "describing whether email confirmations and remember me cookies", 
   "should be enabled or not.", 
   "See \"src/web/WEB-INF/faces-config.xml\" for configuration of this feature.", 
   "* General purpose \"domains\" object (cached in application scope the first", 
   "time it is accessed) to provide localized lists of SelectItem value/label", 
   "pairs (these provide the content for dropdown lists etc.).", 
   "See \"src/java/org/apache/shale/usecases/util/Domains.java\"", 
   "The Javadocs for this application will be published soon, with a pointer on", 
   "the Wiki, and nightly builds will commence this evening."
  ], 
  "revision_id": "124067"
 }, 
 {
  "author": "crossley", 
  "date": "2005-01-04T04:02:54.143793Z", 
  "msg": [
   "Fix nagoya URL."
  ], 
  "revision_id": "124066"
 }, 
 {
  "author": "craigmcc", 
  "date": "2005-01-04T04:02:09.008159Z", 
  "msg": [
   "Correct matching order for filter tests to be more generally useful."
  ], 
  "revision_id": "124065"
 }
]