[
 {
  "author": "kamrul", 
  "date": "2012-02-07T03:05:22.953562Z", 
  "msg": [
   "OZIE-608 testCoordChangeEndTime and testCoordChangeXCommand are failing(Mohamed)"
  ], 
  "revision_id": "1241338"
 }, 
 {
  "author": "sebb", 
  "date": "2012-02-07T02:55:24.746632Z", 
  "msg": [
   "NET-440 Allow user to provide default value in case SYST command fails."
  ], 
  "revision_id": "1241337"
 }, 
 {
  "author": "elecharny", 
  "date": "2012-02-07T02:53:30.932215Z", 
  "msg": [
   "o Reflected the changes made in the API in the server (about the X-NOT-HUMAN-READABLE)"
  ], 
  "revision_id": "1241336"
 }, 
 {
  "author": "mikem", 
  "date": "2012-02-07T02:53:30.039484Z", 
  "msg": [
   "DERBY-3740 BlobClob4BlobTest.testLockingWithLongRowBlob fails with .AssertionFailedError: FAIL - statement should timeout", 
   "backported change #1240521 from trunk to 10.4 branch", 
   "The 2 tests that were failing intermittently (testLockingWithLongRowBlob", 
   "and testLockingBlob) would both select a target blob known to be returned", 
   "as a stream, and assign it to a variable.  The expectation was that until", 
   "the end of the routine Derby would maintain a read lock on the blob.  The", 
   "problem was that it looks like some JVMs/JITs would recognize that the variable", 
   "was never used and call finalize before the test executed the code to", 
   "get an expected lock timeout on updating the blob in another connection.", 
   "Fixed by adding references to the variable in code executed after the", 
   "expected timeout.  Before the fix test was failing about 1/2 time in my", 
   "environment, after the fix the test ran 100 times without a failure."
  ], 
  "revision_id": "1241335"
 }, 
 {
  "author": "elecharny", 
  "date": "2012-02-07T02:51:24.529852Z", 
  "msg": [
   "o Created a DefaultBinaryAttributeDetector which can be configured with a list of AT and a list of Syntax in case we don't have those informations from the server", 
   "o Modified the X-HOMAN-READABLE extention to X-NOT-HUMAN-READABLE, to use the same extension than OpenLDAP (this will increase the compatibility)", 
   "o Modified the schema accordingly to the previous modification"
  ], 
  "revision_id": "1241334"
 }
]