[
 {
  "author": "danielsh", 
  "date": "2012-02-08T00:30:48.656742Z", 
  "msg": [
   "Improve the testcase for the python binding for", 
   "svn_auth_get_platform_specific_client_providers.", 
   "This test was introduced in r1241530, but it only checked if a list was", 
   "returned. Now also the type of the elements of the list is checked.", 
   "* subversion/bindings/swig/python/tests/client.py", 
   "(test_platform_providers): Improve testcase.", 
   "Patch by: Matthijs Kooijman <matthijs@stdin.nl>"
  ], 
  "revision_id": "1241713"
 }, 
 {
  "author": "acmurthy", 
  "date": "2012-02-08T00:17:33.491504Z", 
  "msg": [
   "Merge -c 1241711 from trunk to branch-0.23 to fix MAPREDUCE-3827. Changed Counters to use ConcurrentSkipListMap for performance. Contributed by Vinod K V."
  ], 
  "revision_id": "1241712"
 }, 
 {
  "author": "acmurthy", 
  "date": "2012-02-08T00:16:54.088495Z", 
  "msg": [
   "MAPREDUCE-3827. Changed Counters to use ConcurrentSkipListMap for performance. Contributed by Vinod K V."
  ], 
  "revision_id": "1241711"
 }, 
 {
  "author": "sarowe", 
  "date": "2012-02-08T00:09:44.889374Z", 
  "msg": [
   "LUCENE-3753: 'ant package' in solr/ triggered a build failure as a result of a build dependency on target 'javadocs-all' in lucene/, because the basedir wasn't being reset by the <subant> calls to the modules to be built to satisfy javadoc links (queryparser, queries, and analyzers-common) - as a result, the first module's compile invocation thought it should put its output in lucene/build/classes/java/, which no longer exists.  The fix: switch javadocs-all to depend on the jar-* targets for the modules in question; these use <ant> instead of <subant>, which doesn't seem to have the same issue."
  ], 
  "revision_id": "1241710"
 }, 
 {
  "author": "stsp", 
  "date": "2012-02-08T00:05:47.771418Z", 
  "msg": [
   "Fix python bindings regression tests failures with Python < 2.7.", 
   "* subversion/bindings/swig/python/tests/client.py", 
   "(testGnomeKeyring): Don't use an annotation (@unittest.skipUnless)", 
   "which only exists in Python 2.7 and later. Just return early from", 
   "the test if gnome-keyring support isn't available.", 
   "It would be nice to actually skip tests but short of porting", 
   "code from our cmdline test suite to the bindings there seems", 
   "to be no good way of achieving this in Python 2.4.", 
   "Suggested by: gstein"
  ], 
  "revision_id": "1241709"
 }
]