[
 {
  "author": "dcreager", 
  "date": "2012-02-09T23:26:32.868558Z", 
  "msg": [
   "AVRO-980. C: avro_schema_from_json_length", 
   "We now explicitly document that the length and error parameters are", 
   "unused in the avro_schema_from_json function.  (The error parameter", 
   "isn't needed, since any errors parsing or interpreting the JSON text are", 
   "available using the avro_strerror() function.)", 
   "This patch also adds the new avro_schema_from_json_length function.", 
   "This function actually uses its length parameter, and we explicitly", 
   "document that the length should *not* include any NUL terminator, if one", 
   "is present.  We also provide the avro_schema_from_json_literal helper", 
   "macro, which automatically calculates the size of a literal JSON string", 
   "at compile time.  (To work, the JSON string must be defined as a char[],", 
   "not a char *.)", 
   "We decided to fix this bug using a new function because there's existing", 
   "code out there that's already assuming that avro_schema_from_json's len", 
   "parameter is unused.  (Or at least, they're assuming different things", 
   "about what kind of value to pass in.)  This solution ensures that", 
   "existing code still works, while providing a new function for the", 
   "(needed) non-NUL-terminated case.  It comes at the expense of a sloppy", 
   "signature for the existing avro_schema_from_json function...but then,", 
   "the signature was already sloppy.  We're at least not adding any *new*", 
   "sloppiness.", 
   "We also now use the new avro_schema_from_json_length function when", 
   "reading an Avro object container file.  This means that we no longer", 
   "need to append a NUL terminator to the schema JSON when reading in the", 
   "container file's header.  (We don't *need to*, but we still do.  One", 
   "change at a time.)", 
   "Contributed by Michael Cooper, modified by dcreager"
  ], 
  "revision_id": "1242603"
 }, 
 {
  "author": "zwoop", 
  "date": "2012-02-09T23:18:17.355632Z", 
  "msg": [
   "Fix some older, broken links."
  ], 
  "revision_id": "1242602"
 }, 
 {
  "author": "zwoop", 
  "date": "2012-02-09T23:15:19.577334Z", 
  "msg": [
   "Simple script to convert Jira release notes"
  ], 
  "revision_id": "1242601"
 }, 
 {
  "author": "jwross", 
  "date": "2012-02-09T23:14:14.505874Z", 
  "msg": [
   "ARIES-825: Update subsystems to latest Subsystem, Resolver, and Repository APIs.", 
   "Initial support for region context bundle."
  ], 
  "revision_id": "1242600"
 }, 
 {
  "author": "ggregory", 
  "date": "2012-02-09T23:10:09.236031Z", 
  "msg": [
   "Replace call to JUnit assert method with custom method to compare longs with a delta. The previous code compared floats."
  ], 
  "revision_id": "1242599"
 }
]