[
 {
  "author": "sylvain", 
  "date": "2005-01-05T17:42:34.999568Z", 
  "msg": [
   "New lazy mode to load components, which heavily speeds up Cocoon initialization time"
  ], 
  "revision_id": "124234"
 }, 
 {
  "author": "psteitz", 
  "date": "2005-01-05T17:36:26.181550Z", 
  "msg": [
   "Restored ant build.", 
   "Top-level script runs targets on subprojects. Jars that other subprojects", 
   "depend on are built first. The top-leve script is NOT maven-generated.", 
   "Subproject-level scripts are maven-generated, with the following changes:", 
   "-- \"parentdir\" and \"xxxjarlocation\" properties are defined, where \"xxx\" is the", 
   "name of any other naming subproject jar that the subproject being built", 
   "depends on. The property value set is", 
   "${parentdir}/xxx/target/xxx-core-0.8.jar\"", 
   "-- pathelements for each \"xxxjarlocation\" are added to the build.classpath", 
   "-- in the copy task for the text files from parentdir, the generated absolute", 
   "path is changed to parentdir", 
   "-- for all but the config build, the src/conf copy is eliminated", 
   "-- the get tasks pointing to ibiblio for naming jars are eliminated"
  ], 
  "revision_id": "124233"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-01-05T17:35:19.338709Z", 
  "msg": [
   "Rewrite the paging infrastructure for the grid.", 
   "Page references in the URL are now based on absolute row number.  The PagerService is used to abstract parsing page data from the URL.  The PagerModel is an API for users to programmatically control the row / page / page size.  Update the pager renderers accordingly.", 
   "Other changes:", 
   "- add tests for the PagerService / PagerModel", 
   "- switch to a .tag file for adding the Portfolio data to the PageContext (instead of an include)", 
   "BB: self", 
   "DRT: NetUI pass", 
   "BVT: NetUI pass"
  ], 
  "revision_id": "124232"
 }, 
 {
  "author": "minfrin", 
  "date": "2005-01-05T17:34:15.687929Z", 
  "msg": [
   "Revert source incompatible change from v1.0.x"
  ], 
  "revision_id": "124231"
 }, 
 {
  "author": "trawick", 
  "date": "2005-01-05T17:29:52.463516Z", 
  "msg": [
   "support extremely large request bodies by representing the", 
   "spool file with multiple file buckets, as with default handler"
  ], 
  "revision_id": "124230"
 }
]