[
 {
  "author": "ihabunek", 
  "date": "2012-02-14T14:52:54.432872Z", 
  "msg": [
   "Updated changes and web for new release."
  ], 
  "revision_id": "1243968"
 }, 
 {
  "author": "ihabunek", 
  "date": "2012-02-14T14:52:04.259035Z", 
  "msg": [
   "Improved README file."
  ], 
  "revision_id": "1243967"
 }, 
 {
  "author": "gnodet", 
  "date": "2012-02-14T14:51:10.016262Z", 
  "msg": [
   "Delete failed release"
  ], 
  "revision_id": "1243966"
 }, 
 {
  "author": "rwesten", 
  "date": "2012-02-14T14:49:20.349415Z", 
  "msg": [
   "## Implementation of STANBOL-481 - Multi ContentPart RESTful API extensions", 
   "* An detailed description of the implementation is provided by comments on this issue.", 
   "* This also includes several Integration tests for the new RESTful API. This tests are also a good starting point for potential users.", 
   "* The REST API documentation of the Stanbol web interface is also updated by this new features.", 
   "This should also provide all the functionality missing for finishing the work on STANBOL-431: Improve Enhancer/ REST endpoint", 
   "## STANBOL-488:", 
   "This adds support for EnhancementProperties managed as ContentPart of the ContentItem. However the usage is only locally within the \"org.apache.stanbol.enhancer.jersey\" bundle because this issue needs further discussion before implementation.", 
   "The implementation of STANBOL-481 is in fact dependent on the presents of the \"EnhancementProperties\" feature, but it can be easily adapted to work with all possible implementations discussed by STANBOL-488", 
   "## STANBOL-414: Refactor EnhancementEngine to support contents with multiple related parts", 
   "This also finishes the work on STANBOL-414 as now both the Java API and the RESTful API do support ContentItems with multiple parts.", 
   "In addition I recommend to mark this issue as resolved as its initial goals are covered by STANBOL-414.", 
   "## Other changes", 
   "* The JsonLdSerializerProvider now ignores parameters when comparing the parsed formatIdentifier. Previously this SerializingProvider ignored requests with media types such as \"application/json; charset=UTF-8\"", 
   "* ContentItemHelper#parseMimeType now correctly trims keys and values of parsed parameters."
  ], 
  "revision_id": "1243965"
 }, 
 {
  "author": "fmui", 
  "date": "2012-02-14T14:48:53.396859Z", 
  "msg": [
   "DotCMIS redirect page"
  ], 
  "revision_id": "1243964"
 }
]