[
 {
  "author": "rmuir", 
  "date": "2012-02-15T20:29:20.222563Z", 
  "msg": [
   "LUCENE-3731: performance improvements and thread safety fixes to UIMA tokenizers"
  ], 
  "revision_id": "1244688"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2012-02-15T20:28:16.219201Z", 
  "msg": [
   "added serializers parent pom"
  ], 
  "revision_id": "1244687"
 }, 
 {
  "author": "ggregory", 
  "date": "2012-02-15T20:27:01.465144Z", 
  "msg": [
   "Fix Javadoc typo."
  ], 
  "revision_id": "1244686"
 }, 
 {
  "author": "jwross", 
  "date": "2012-02-15T20:22:10.517705Z", 
  "msg": [
   "ARIES-825: Update subsystems to latest Subsystem, Resolver, and Repository APIs.", 
   "(1) sort deployed content so that bundles are favored and, consequently, installed before any child subsystems; this allows the child subsystem resolution to detect already installed resources that fulfill requirements where appropriate", 
   "(2) getChildren must return an unmodifiable snapshot", 
   "(3) getConstituents must return an unmodifiable snapshot", 
   "(4) don't uninstall the region context bundle while uninstalling other constituents", 
   "(5) don't fail subsystem install if optional resource is not found", 
   "(6) support for subsystem resources that implement RepositoryContent", 
   "(7) subsystem uri now supports missing symbolic name parameter", 
   "(8) SubsystemFileResource now uses subsystem URI as the location", 
   "(9) subsystem install now fails if Subsystem-ManifestVersion != 1.0", 
   "(10) Created new TargetRegion class as a, possibly temporary, utility for calculating certain install failures.", 
   "(11) Now fails install if subsystem with same location already exists but is not in target region.", 
   "(12) Now fails install if subsystem with same location already exists but does not have same symbolic name, version, and type.", 
   "(13) Removed obsolete DataFile and StaticDataFile classes.", 
   "(14) Added subsystem-type attribute to osgi.identity capability for internal reasons.", 
   "(15) Now fails install if subsystem already exists in target region but has different type."
  ], 
  "revision_id": "1244685"
 }, 
 {
  "author": "fchrist", 
  "date": "2012-02-15T20:20:57.154447Z", 
  "msg": [
   "STANBOL-493 Removed generation of THIRD-PARTY.properties from default build."
  ], 
  "revision_id": "1244684"
 }
]