[
 {
  "author": "crossley", 
  "date": "2005-01-09T06:19:54.604842Z", 
  "msg": [
   "Upgrade to Forrest-0.6"
  ], 
  "revision_id": "124709"
 }, 
 {
  "author": "rich", 
  "date": "2005-01-09T06:08:48.717608Z", 
  "msg": [
   "Miscellaneous fixes:", 
   "- Fixed to merge the string values in inherited 'rolesAllowed' and 'tilesDefinitions' attributes in @Jpf.Controller.", 
   "- Fixed to avoid disabling 'currentPage' and 'previousPage' navigation when these values are only used in the 'validationErrorForward' attribute on @Jpf.Action (and are not used in any other annotations).", 
   "- Removed the warning for Forward/SimpleAction/Catch annotations that refer to nonexistant files when the class being compiled is abstract.", 
   "- Added a warning for *inherited* Forward/SimpleAction/Catch annotations that refer to nonexistant files.", 
   "- Added a warning for @Jpf.Action and @Jpf.ExceptionHandler annotations on abstract methods (which renders them useless, since these annotations are not inherited).", 
   "- Fixed the default behavior for unhandled exceptions to allow PageFlowManagedObjectExceptions (like exceptions related to JSF backing files) to write out an informative response page in dev mode.", 
   "- Fixed to remove an error logged at startup of applications that don't contain a Global.app file.", 
   "- In FlowController, changed getPreviousFormBean, getPreviousActionURI, getCurrentForwardPath, getPreviousForwardPath, getCurrentPageInfo, getPreviousPageInfo, and getPreviousActionInfo to throw IllegalStateException when previous {page,action} info has been disabled due to unuse through annotations, and when alwaysTrackPrevious{Page,Action} was not overridden to return true.", 
   "- Fixed an NPE in PageFlowChecker when compiled page flow classes are on classpath but not on sourcepath.", 
   "DRT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "124708"
 }, 
 {
  "author": "erodriguez", 
  "date": "2005-01-09T06:02:20.864205Z", 
  "msg": [
   "DHCP misc options per RFC 2132."
  ], 
  "revision_id": "124707"
 }, 
 {
  "author": "dolander", 
  "date": "2005-01-09T05:49:22.188868Z", 
  "msg": [
   "Add a DRT for non-HTML tagId with JavaScript lookups."
  ], 
  "revision_id": "124706"
 }, 
 {
  "author": "erodriguez", 
  "date": "2005-01-09T05:49:17.628818Z", 
  "msg": [
   "Modified options in dhcp options package to use new IP address option base classes."
  ], 
  "revision_id": "124705"
 }
]