[
 {
  "author": "rich", 
  "date": "2005-01-13T00:12:14.014395Z", 
  "msg": [
   "Added a first cut at submitting a form bean to an action from a JSF page, without going through an annotated command handler in a JSF backing class.  To use this, simply add a \"submitFormBean\" attribute tag inside a commandButton or a commandHandler, like this:", 
   "<h:commandButton action=\"submit\" value=\"send bean through attribute\">", 
   "<f:attribute name=\"submitFormBean\" value=\"backing.theForm\"/>", 
   "</h:commandButton>", 
   "Note that the value is a *binding expression*, but since it needs to be evaluated when the action is raised (and not just when the page is loaded), we can't let JSF evaluate it -- thus, it's not surrounded by \"#{}\".  In this particular example, we're binding to a property in the backing class, but you can bind to anything that's visible to the JSF components.", 
   "An example of this is under netui/test/webapps/jsf/jsfWeb/submitFormBean.", 
   "Also:", 
   "- Fixed the JSF DRTs to run again.  The app had gotten itself very out of date.", 
   "- Fixed NPEs related to loss of Struts ModuleConfig objects in FlowController after session serialization/deserialization.", 
   "- Fixed an NPE in AutoRegisterActionServlet that occurred when a nonexistant ModuleConfigLocator was registered in netui-config.xml.", 
   "DRT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "125004"
 }, 
 {
  "author": "djd", 
  "date": "2005-01-13T00:02:00.183320Z", 
  "msg": [
   "Fix desc_index and triggerGeneric tests for unix/linux"
  ], 
  "revision_id": "125003"
 }, 
 {
  "author": "cholet", 
  "date": "2005-01-12T23:37:25.096243Z", 
  "msg": [
   "explicitely state that posts from non subscribers are moderated"
  ], 
  "revision_id": "125002"
 }, 
 {
  "author": "dolander", 
  "date": "2005-01-12T23:26:26.448837Z", 
  "msg": [
   "Smashed the test results....Restore them"
  ], 
  "revision_id": "125001"
 }, 
 {
  "author": "trawick", 
  "date": "2005-01-12T23:21:50.589474Z", 
  "msg": [
   "in memory of Greg's Grandma, fix another ungrammatical comment"
  ], 
  "revision_id": "125000"
 }
]