[
 {
  "author": "brett", 
  "date": "2005-01-23T03:32:26.225858Z", 
  "msg": [
   "add note about using jline"
  ], 
  "revision_id": "126184"
 }, 
 {
  "author": "parker", 
  "date": "2005-01-23T03:11:08.656180Z", 
  "msg": [
   "Bug 4075: use each instead of grep/keys to avoid reading large chunks of the autowhitelist into memory"
  ], 
  "revision_id": "126183"
 }, 
 {
  "author": "ddewolf", 
  "date": "2005-01-23T03:09:00.114375Z", 
  "msg": [
   "Adding portlet-spec-1.0.css.  Many thanks to Craig Doremus."
  ], 
  "revision_id": "126182"
 }, 
 {
  "author": "", 
  "date": "2005-01-23T02:59:08.217945Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "126181"
 }, 
 {
  "author": "dolander", 
  "date": "2005-01-23T02:21:58.530776Z", 
  "msg": [
   "Create an abstraction allowing tags to use XmlHttpRequest", 
   "I switched the Tree using runAtClient to using XmlHttpRequest to update the expand/collapse state", 
   "of the tree nodes.  Before it rewrote either the anchors on the page or added hidden fields in", 
   "the form to update the tree state.  This leads to errors in certain situations and also requires", 
   "the tree to be placed on all pages so it's state can be updated when the tree tag is processed.", 
   "Added a NamingService which will create unique names within a Session and allow lookup", 
   "of INameable objects.  Names are stored with WeakReferences so they may be reclaimed without the", 
   "NamingService having any knowledge of the life time of the stored objects.", 
   "Create a chaining interceptor model for handling XmlHttpRequests and allowing tags to", 
   "update state in PageFlows using the NamingService.", 
   "This is a checkpoint checkin.  Most of the old code that handled client side expansion has only", 
   "been commented out.  Tree.runAtClient only runs on Firefox/Mozilla at the moment.", 
   "In addition, the DivPanel is also broken.", 
   "Promise to have it up and running again fully in my next checkin."
  ], 
  "revision_id": "126180"
 }
]