[
 {
  "author": "", 
  "date": "2012-01-30T18:17:37.311051Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 5101", 
   "Author:   gauravj@adobe.com", 
   "Date:     2009-02-27T05:22:45.887116Z", 
   "Log Message:", 
   "-----------", 
   "Update action script files with asdoc version tags.", 
   "QE Notes: None.", 
   "Doc Notes: Please review and update as necessary.", 
   "tests: checkintests", 
   "Modified Paths:", 
   "--------------", 
   "663 paths were modified"
  ], 
  "revision_id": "1262753"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:17:34.037129Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 4638", 
   "Author:   smgilson@adobe.com", 
   "Date:     2009-01-23T14:23:38.683904Z", 
   "Log Message:", 
   "-----------", 
   "Fix invalid ASDoc comment on textFieldClass", 
   "QE Notes: None", 
   "Doc Notes: None", 
   "Bugs: -", 
   "Modified Paths:", 
   "--------------", 
   "/flex/sdk/trunk/frameworks/projects/framework/src/mx/styles/metadata/TextStyles.as"
  ], 
  "revision_id": "1262752"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:17:31.319888Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 4634", 
   "Author:   gosmith@adobe.com", 
   "Date:     2009-01-23T01:38:56.754915Z", 
   "Log Message:", 
   "-----------", 
   "First part of glue code for allowing Halo components to use the new Text Layout Framework, in order to get functionality such as bidirectional text.", 
   "Background:", 
   "TLF is making this possible by implementing a TLFTextField class. It is a Sprite that uses TLF to implement the same properties and methods as the legacy TextField class in the Player. Thanks to the createInFontContext() bottleneck method in UIComponent, it can be used by a properly-written Halo component (such as those in Flex 3) without any modifications to the component.", 
   "Note: Text should render similarly -- but is unlikely to render identically -- when a component uses TLFTextField vs. TextField. The width and height may be different, affecting layout; text could wrap differently; etc. This is a fact-of-life based on the fact that TLF/FTE and TextField are completely different text engines.", 
   "Whether a Halo component uses TLF or not to render text will be determined in Flex 4 by a new style, textFieldClass. (Gumbo components always use TLF.)", 
   "TLFTextField is currently only partially implemented. It does not yet support scrolling, selection, editing, multiple formats, or htmlText. Therefore it can only be used for simple display text, such as a Button label.", 
   "Details:", 
   "The TextStyles.as bucket 'o text styles now includes a non-inheriting textFieldClass style. It can be set to either mx.core.UITextField or mx.core.UITLFTextField. These are the Flex framework's wrapper classes around the lower-level classes flash.text.TextField (in the Player) and its TLF-based workalike, flashx.textLayout.controls.TLFTextField.", 
   "The global selector in defaults.css currently sets it to mx.core.UITextField using a ClassReference directive. For the time being, all Halo components will continue to use the \"real\" TextField.", 
   "The new UITLFTextField is a copy of UITextField, except that it extends TLFTextField instead of TextField. This class has been added to FrameworkClasses.as because no classes in framework.swc have a dependency on it. It will get soft-linked into applcations via the textFieldClass style.", 
   "The TLFTextField class currently lives in a fourth TLF SWC, textLayout_textField.swc. This SWC has been added to various build scripts. The external-library-path for building framework.swc now includes all four TLF SWCs, because UITLFTextField can't be compiled and linked without them. However, since they are external they aren't linked into framework.swc.", 
   "Properly-written Halo UIComponents access their text fields only through the IUITextField interface, and they create text fields like this:", 
   "textField = IUITextField(createInFontContext(UITextField));", 
   "(The reason for using createInFontContext() is to support embedded fonts that are embedded in a different SWF.)", 
   "The createInFontContext() method of UIComponent has been modified to use the textFieldClass style to determine whether to create a UITextField or a UITLFTextField.", 
   "With these changes, you can now write code like", 
   "<mx:Button label=\"OK\"/>", 
   "<mx:Button label=\"OK\" textFieldClass=\"mx.core.UITLFTextField\"/>", 
   "to get two Buttons, the first of which uses UITextField (because this is the value of textFieldClass in the global selector) and the second of which uses UITLFTextField. They look very similar, which is good!", 
   "Currently, both Buttons are being measured by using an offscreen TextField. A subsequent checkin will make components rendering using UITLFTextField measure themselves using an offscreen TLFTextField so that measurement and rendering are consistent.", 
   "QE Notes: None", 
   "Doc Notes: None", 
   "Bugs: None", 
   "Reviewer: Deepa", 
   "Modified Paths:", 
   "--------------", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/build.xml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/styles/metadata/TextStyles.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/build.xml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/defaults.css</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/asdoc/build.xml</path>", 
   "<path kind=\"file\" action=\"A\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/core/UITLFTextField.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/FrameworkClasses.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/core/UIComponent.as</path>"
  ], 
  "revision_id": "1262751"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:17:26.056488Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 8", 
   "Author:   open-source-svn-admin@adobe.com", 
   "Date:     2007-12-15T01:49:31.087529Z", 
   "Log Message:", 
   "-----------", 
   "The beginning of the open-source Flex SDK.", 
   "Populated the flex/sdk/trunk directory with an open-source subset of files from //depot/flex/sdk/...@191097 in the Faramir Perforce server. This changelist is a bit past the 3.0rc0 build.", 
   "The Ant scripts will not successfully build yet. They need to be adapted to the open-source subset.", 
   "Modified Paths:", 
   "--------------", 
   "2532 paths were modified"
  ], 
  "revision_id": "1262750"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:17:08.959098Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 23247", 
   "Author:   cframpto@adobe.com", 
   "Date:     2011-12-20T19:21:13.134833Z", 
   "Log Message:", 
   "-----------", 
   "Remove ADOBE SYSTEMS license and replace with Apache license in headers - frameworks.  A 2nd pass will be needed to get the files not handled up by the scripts.", 
   "Modified Paths:", 
   "--------------", 
   "4959 paths were modified"
  ], 
  "revision_id": "1262749"
 }
]