[
 {
  "author": "", 
  "date": "2012-01-30T18:54:45.952594Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 5297", 
   "Author:   gruehle@adobe.com", 
   "Date:     2009-03-13T16:35:45.870338Z", 
   "Log Message:", 
   "-----------", 
   "More bug fixes for Spark skins for Halo components.", 
   "Bugs:", 
   "SDK-19660 - The focus for a halo CheckBox or RadioButton with a spark skin is not positioned correctly.", 
   "SDK-19603 - Button does not resize to fit icon", 
   "SDK-19560 - FxButton is 1px smaller in height than Button", 
   "SDK-19548 - Halo Button icons aren't vertically centerred correctly", 
   "QA/Doc Notes: A new style is added to Halo button: labelVerticalOffset. This style adjust the vertical position of the label relative to the rest of the Button content. It is only available when compatibility-version is >= 4. ASDoc has been added for this style.", 
   "Modified Paths:", 
   "--------------", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/RadioButtonSkin.mxml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/controls/Button.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/defaults.css</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/halo/defaults.css</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/CheckBoxSkin.mxml</path>"
  ], 
  "revision_id": "1263183"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:54:43.938682Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 5209", 
   "Author:   gruehle@adobe.com", 
   "Date:     2009-03-09T18:47:59.771020Z", 
   "Log Message:", 
   "-----------", 
   "More bug fixes for Spark skins for Halo components.", 
   "SDK-19724 - If you change themeColor at runtime, it does not affect rollOverColor and selectionColor even if you compile with -compatibility-version=3", 
   "SDK-19719 - The top edge of a TabNavigator using a Spark skin doesn't look disabled when the container is disabled.", 
   "SDK-19628 - Disabled TabBar and TabNavigator render differently when using Gumbo skins", 
   "SDK-19627 - disabled Halo TabBar control not rendering correctly when using Gumbo skins", 
   "SDK-19612 - disabled Halo DateChooser should set the alpha on the calendar icon when disabled", 
   "SDK-19585 - Menus compiled with the halo theme in Flex 4 have a different border color than in Flex 3", 
   "SDK-19718 - Spark Alert skin should allow for more space at the bottom (under the button(s))", 
   "SDK-19649 - Default height of Halo RadioButton is different", 
   "SDK-19648 - Default height of a halo CheckBox is different now.", 
   "SDK-19615 - very difficult to tell if a Halo HSlider or VSlider with Gumbo skin is disabled", 
   "SDK-19561 - FxSlider thumb is smaller than Slider thumb", 
   "SDK-17416 - Setting the themeColor at runtime with the StyleManager does not affect rollOverColor.", 
   "QA/Doc Notes: These changes are controlled by the compatibility-version flag:", 
   "* Disabled container appearance:", 
   "- old behavior: disabled containers dimmed the contents, but not the border", 
   "- new behavior: disabled containers dim contents and the border", 
   "* Slider thumb measurement:", 
   "- old behavior: slider thumbs forced measured size to 12x12", 
   "- new behavior: slider thumbs measured size dictated by skin", 
   "Modified Paths:", 
   "--------------", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/BorderSkin.mxml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/defaults.css</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/SliderThumbSkin.mxml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/TextInputBorderSkin.mxml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/controls/sliderClasses/SliderThumb.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/halo/defaults.css</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/TabSkin.mxml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/core/Container.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/styles/StyleProtoChain.as</path>"
  ], 
  "revision_id": "1263182"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:54:41.912531Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 5170", 
   "Author:   gruehle@adobe.com", 
   "Date:     2009-03-05T01:50:32.265259Z", 
   "Log Message:", 
   "-----------", 
   "Round 2 of bug fixes for the Spark skins for Halo components. Thanks to Alex for help with the data grid issues.", 
   "Bugs fixed:", 
   "SDK-19655 - Setting rowCount property on DataGrid causes extra blank row to be displayed", 
   "SDK-19652 - Items in a DataGrid do not line up after scrolling.", 
   "SDK-19605 - disabled Halo ColorPicker with Gumbo skin draws too dark", 
   "SDK-19596 - When you have a single button on an Alert, the left edge looks flatter than the right", 
   "SDK-19585 - Menus compiled with the halo theme in Flex 4 have a different backgroundColor than in Flex 3", 
   "SDK-19665 - Halo List with Gumbo skin doesnt draw the alternating item color all the way to the right edge of the control if VScrollBar is present", 
   "SDK-19651 - odd header rendering issue on Halo DataGrid with Gumbo skin", 
   "QA Notes: The alert layout code was positioning the buttons/text on sub-pixel boundaries if the width or height of the alert was an odd number of pixels. We always snap to pixel boundaries now, but this may cause bitmap compare issues with Alert.", 
   "Modified Paths:", 
   "--------------", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/sparkskins/src/mx/skins/spark/ColorPickerSkin.mxml</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/controls/DataGrid.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/core/ScrollControlBase.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/framework/src/mx/controls/alertClasses/AlertForm.as</path>", 
   "<path kind=\"file\" action=\"M\">/flex/sdk/trunk/frameworks/projects/halo/defaults.css</path>"
  ], 
  "revision_id": "1263181"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:54:39.509279Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 5092", 
   "Author:   gruehle@adobe.com", 
   "Date:     2009-02-26T20:31:11.499539Z", 
   "Log Message:", 
   "-----------", 
   "Spark skins for Halo components. WARNING: The appearance of ALL applications is affected by this checkin. If you want to go back to the old skins, there is a new Halo theme (in frameworks/themes/Halo) that can be used to go back to the Flex 3 appearance.", 
   "This checkin introduces a new swc - sparkskins.swc. This swc contains the spark skins for the Halo components. (these skins depend on FXG, which means they cannot live in frameworks.swc).", 
   "This checkin also introduces a new theme - Halo. This is the Flex 3 theme, packaged for easy consumption.", 
   "Known issues:", 
   "* DMV and AIR components are not reskinned yet", 
   "* Editable ComboBox skin is not final (left edge of button is wrong)", 
   "* PopUpButton/PopUpMenuButton does not differentiate over/down from popUpOver/popUpDown.", 
   "* Indeterminate progress bar is not final", 
   "* ComboBox/Menu drop shadows are incorrect (missing, actually...)", 
   "* Spark styles are mostly functional, but not entirely.", 
   "* Metadata for spark styles has not been added to the Halo components yet", 
   "* Focus drawing is off for many components", 
   "* Setting compatibilityVersion to 3.0.0 is not yet correctly loading the Halo skins (using 2.0.1 works)", 
   "There are some slight differences in appearance between some Halo and Gumbo components:", 
   "* Scroll thumb minimum size is smaller in Halo", 
   "* Height of text input is slightly different", 
   "* Slider data tips look different (this may be changing...)", 
   "* When using the halo theme and changing themeColor, you must also set rollOverColor and selectionColor", 
   "This checkin also fixes many bugs related to text styles in Gumbo components:", 
   "SDK-19476 - ID selectors don't match ids that are for a TextBox in a spark skins", 
   "SDK-18533 - color style doesn't work when set on FxList", 
   "SDK-18455 - Setting 'color' on a global selector does not affect Spark components", 
   "SDK-18343 - Spark components do not inherit some styles from their parent containers", 
   "(and possibly several others)", 
   "Modified Paths:", 
   "--------------", 
   "128 paths were modified"
  ], 
  "revision_id": "1263180"
 }, 
 {
  "author": "", 
  "date": "2012-01-30T18:54:27.701840Z", 
  "msg": [
   "Transferred from the Adobe Open Source Subversion Repository", 
   "Revision: 23247", 
   "Author:   cframpto@adobe.com", 
   "Date:     2011-12-20T19:21:13.134833Z", 
   "Log Message:", 
   "-----------", 
   "Remove ADOBE SYSTEMS license and replace with Apache license in headers - frameworks.  A 2nd pass will be needed to get the files not handled up by the scripts.", 
   "Modified Paths:", 
   "--------------", 
   "4959 paths were modified"
  ], 
  "revision_id": "1263179"
 }
]