[
 {
  "author": "stocco", 
  "date": "2005-01-25T22:51:27.476332Z", 
  "msg": [
   "This content was submitted by Julie Zhuo.  This is an update to the test.dist structure so other functional areas (controls, jws) can add to this structure which is currently only leveraged by netui.", 
   "Netui DRT: pass", 
   "This patch fixes the following:", 
   "-Removed BEEHIVE_TEST_HOME and BEEHIVE_HOME environmental variables", 
   "-Making directory structure change for easy Controls and WSM tests plug in", 
   "-Various updates to sync with the Beehive build change introduced lately", 
   "-Include the new resource needed for the netui validations tests", 
   "-Fixed the README", 
   "-Avoided webapp rebuild when going from netui drt into netui bvt", 
   "Things still need to do,", 
   "1. Need to make use of more resources from the Beehive build rather keep its own and keep it the same style possible as the Beehive build structure. For example, better organize the properties file and import files.", 
   "2. The directory structure in the test package may need to change a bit when we have tests in from Controls/WSM. For example moving the resources (like tomcat-imports.xml) that are shared among the tests to a root level directory for better sharing among tests."
  ], 
  "revision_id": "126439"
 }, 
 {
  "author": "dolander", 
  "date": "2005-01-25T22:40:56.703683Z", 
  "msg": [
   "Cleanup some dead code in the tree", 
   "Error reporting in the DivPanel", 
   "BVT test verifying error reporting."
  ], 
  "revision_id": "126438"
 }, 
 {
  "author": "cutting", 
  "date": "2005-01-25T22:35:05.811535Z", 
  "msg": [
   "Fixed a few website bugs."
  ], 
  "revision_id": "126437"
 }, 
 {
  "author": "brett", 
  "date": "2005-01-25T22:34:35.906174Z", 
  "msg": [
   "upgrade to dom4j 1.5.2", 
   "site.jsl is having some problems - I have cleaned up but more work is needed to get the site going"
  ], 
  "revision_id": "126436"
 }, 
 {
  "author": "kentam", 
  "date": "2005-01-25T22:32:29.045162Z", 
  "msg": [
   "Fix BEEHIVE-187: default control threading is MULTI_THREADED i/o SINGLE_THREADED", 
   "Added additional compile time checking for duplicate property names.", 
   "Tests: all DRTs"
  ], 
  "revision_id": "126435"
 }
]