[
 {
  "author": "craigmcc", 
  "date": "2002-01-09T18:12:53.000000Z", 
  "msg": [
   "Cosmetic changes only (copyright date, spacing, remove commented-out code", 
   "blocks, add braces on conditionals per code conventions) -- no functional", 
   "changes."
  ], 
  "revision_id": "128519"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-01-06T06:01:08.000000Z", 
  "msg": [
   "Add unit tests for BasicDynaBean (and BasicDynaClass), as well as", 
   "fixing a few small implementation bugs."
  ], 
  "revision_id": "128518"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-01-06T00:47:06.000000Z", 
  "msg": [
   "Refine the API contracts for DynaBean and DynaClass.  Specify *all* of the", 
   "exception conditions that might be thrown.", 
   "Add DynaBean.contains() and DynaBean.remove() support for mapped properties.", 
   "These might be considered superfluous, because you can always get the Map", 
   "value and perform the operations directly, but they are convenient.", 
   "In the BasicDynaBean.get(String name) method, attempt to mimic the way Java", 
   "works on primitive properties that have not been assigned any value yet,", 
   "instead of returning null.", 
   "Strip the BasicDynaBean and BasicDynaClass implementations down to the", 
   "bare minimum functionality.  Anything fancier can be built on top of these.", 
   "Next step is to write some unit tests (equivalent to those in", 
   "PropertyUtilsTestCase) to see if these things actually work yet."
  ], 
  "revision_id": "128517"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-01-05T00:31:54.000000Z", 
  "msg": [
   "Conform to the recently agreed (on GENERAL@JAKARTA.APACHE.ORG) convention", 
   "of including the Apache License inside the JAR file, at", 
   "META-INF/LICENSE.txt", 
   "as well as externally in the distribution directory.  This will ensure that", 
   "the license is included, even when we eventually have a CJAN/JJAR type", 
   "mechanism to download just the JAR files you need, instead of binary", 
   "distributions."
  ], 
  "revision_id": "128516"
 }, 
 {
  "author": "sanders", 
  "date": "2002-01-04T21:27:03.000000Z", 
  "msg": [
   "Updates to allow getters and setters on List objects.", 
   "Get code submitted by Arron Bates <arron@keyboardmonkey.com>"
  ], 
  "revision_id": "128515"
 }
]