[
 {
  "author": "craigmcc", 
  "date": "2002-04-06T23:34:29.000000Z", 
  "msg": [
   "Remove the old populate() method that was commented out."
  ], 
  "revision_id": "128559"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-04-06T23:31:04.000000Z", 
  "msg": [
   "Cosmetic changes only."
  ], 
  "revision_id": "128558"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-04-06T23:28:35.000000Z", 
  "msg": [
   "Refactor and fix BeanUtils.populate() so that it will correctly set", 
   "nested properties on DynaBeans.  I did not use the proposed patch (but", 
   "thanks anyway!) for two reasons:", 
   "- It included \"return\" statements inside the loop that would have", 
   "stopped processing all of the properties in the Map", 
   "- It only supported one level of nesting (which was also true of the", 
   "old code for standard JavaBeans).", 
   "Now, you can have an arbitrarily deep set of nested beans, and these nested", 
   "beans can be any combination of DynaBean and standard JavaBean types.", 
   "Added test cases for setting nested properties via BeanUtils.populate(), and", 
   "verified that all previous test cases continue to work.", 
   "PR: Bugzilla #7521", 
   "Submitted by:\tAnil Mandava <amandava at yahoo.com>"
  ], 
  "revision_id": "128557"
 }, 
 {
  "author": "rdonkin", 
  "date": "2002-04-05T14:58:15.000000Z", 
  "msg": [
   "Fixed bug 7740. Klaasjan Brand supplied a patch which was very helpful in locating the problem but a slightly different patch was committed mainly for stylistic reasons. Also added extra tests covering the cause of failure. Also corrected another coding mistake (again mea culpa) in the same passage of code."
  ], 
  "revision_id": "128556"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-30T23:58:45.000000Z", 
  "msg": [
   "Fix 7333 by making BeanUtils explicitly depend on FastHashMap (from the", 
   "commons-collections.jar file) as ConvertUtils and PropertyUtils.  This", 
   "means you will get the ClassNotFoundException immediately on your first", 
   "reference to the BeanUtils class, instead of it potentially getting masked", 
   "or ignored by BeanUtils methods that call ConvertUtils or PropertyUtils.", 
   "PR: 7333", 
   "Submitted by:\tBrian.Ewins at btinternet.com"
  ], 
  "revision_id": "128555"
 }
]