[
 {
  "author": "martinc", 
  "date": "2003-01-11T22:06:23.000000Z", 
  "msg": [
   "Fix line ends.", 
   "PR: 15908", 
   "Submitted by: Dirk Heydtmann"
  ], 
  "revision_id": "128664"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-01-09T03:16:29.000000Z", 
  "msg": [
   "Copy the local \"LICENSE.txt\" file instead of the parent \"../LICENSE\" file.", 
   "Submitted by:\tDavid Morris <David.Morris at plumcreek.com>"
  ], 
  "revision_id": "128663"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-01-05T05:45:41.000000Z", 
  "msg": [
   "Update the beanutils docs to talk about the new RowSetDynaClass", 
   "implementation, and fix a typo in the class JavaDocs."
  ], 
  "revision_id": "128662"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-01-05T05:33:05.000000Z", 
  "msg": [
   "RowSetDynaClass is a way to represent the results of an SQL \"SELECT\" statement", 
   "as a \"disconnected row set\" (in JDBC terminology).  Its function is to copy", 
   "the results of a query (represented as a JDBC ResultSet or RowSet object that", 
   "is passed to its constructor) into an in-memory List of the matching rows.", 
   "Once the RowSetDynaClass instance has been created, the ResultSet/RowSet", 
   "instance (and its corresponding Statement and Connection) can be closed", 
   "and/or returned to the connection pool (if any).", 
   "In this way, RowSetDynaClass differs from ResultSetDynaClass, where the", 
   "DynaBean \"instances\" returned by the Iterator are really just a proxy for the", 
   "values represented in the current row of the ResultSet.", 
   "The typical usage pattern for RowSetDynaClass is in the class comments of", 
   "the Javadoc.", 
   "RowSetDynaClass instances will be Serializable, as long as all of the column", 
   "values are, which makes it a very convenient mechanism for transmitting", 
   "result sets to a remote Java-based client (such as an applet or a web", 
   "services client)."
  ], 
  "revision_id": "128661"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-01-03T20:38:11.000000Z", 
  "msg": [
   "Remove a mistakenly leftover debugging message, and properly nest", 
   "some others."
  ], 
  "revision_id": "128660"
 }
]