[
 {
  "author": "hboutemy", 
  "date": "2012-02-24T22:55:42.323655Z", 
  "msg": [
   "[INFRA-4466] added comment about 3 directories to think about"
  ], 
  "revision_id": "1293468"
 }, 
 {
  "author": "mamta", 
  "date": "2012-02-24T22:52:28.596594Z", 
  "msg": [
   "DERBY-4631 Wrong join column returned by right outer join with NATURAL or USING and territory-based collation", 
   "Test join using global temporary tables"
  ], 
  "revision_id": "1293467"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-02-24T22:47:46.200504Z", 
  "msg": [
   "[master] Bound the number of non preferred assignment for each", 
   "region server", 
   "Summary:", 
   "This is diff is related to task 934952. Master should assign a bounded number", 
   "of non preferred assignment for each region server.", 
   "https://our.intern.facebook.com/intern/tasks/?t=934952", 
   "When the master starts or failover, it will scan the dfs to compute the", 
   "locality mapping. And there 3 time windows for master to assign regions.", 
   "Let's set the timer starting at the time when Master successfully initialized", 
   "everything, no matter this is a fresh start up time or failover time.", 
   "1) In the 1st min, the master will always assign regions to its best locality", 
   "region server. If the best locality region server is not online, then the master", 
   "will hold its corresponding regions.", 
   "2) In later 4 mins, the master will still try to assign regions to its best", 
   "locality region server but not holding region any more. Also start to assign", 
   "these hold regions to any checked-in region server.", 
   "3) Later on, assign region to any checked-in region server. No locality", 
   "assignment any more.", 
   "The problem today was there were lots of region serves stopped in the first", 
   "time window. When the second time window came in, the master had already hold a", 
   "large number unassigned regions.", 
   "And assume region server A was the first RS to checked-in this time window, the", 
   "master was supposed to assign all the best locality regions plus a bounded", 
   "number of unassigned regions together to this region server A.", 
   "Test Plan: Running all the unit and will test the failover case in titan", 
   "migration002 cluster.", 
   "Reviewers: kannan, gqchen, kranganathan", 
   "Reviewed By: kannan", 
   "CC: hbase-eng@lists", 
   "Differential Revision: https://phabricator.fb.com/D412069", 
   "Task ID: 934952"
  ], 
  "revision_id": "1293466"
 }, 
 {
  "author": "sobryan", 
  "date": "2012-02-24T22:47:25.259901Z", 
  "msg": [
   "Reverted version back to the previous release since it was never released."
  ], 
  "revision_id": "1293465"
 }, 
 {
  "author": "scottcarey", 
  "date": "2012-02-24T22:43:32.437856Z", 
  "msg": [
   "AVRO-1037. Problems using Avro 1.6.2 with Hadoop (CDH3 or 1.0)"
  ], 
  "revision_id": "1293464"
 }
]