[
 {
  "author": "vinayakb", 
  "date": "2012-03-04T11:55:45.938051Z", 
  "msg": [
   "Initial integration with algebricks"
  ], 
  "revision_id": "1296783"
 }, 
 {
  "author": "jleroux", 
  "date": "2012-03-04T11:54:13.672278Z", 
  "msg": [
   "A patch from Wai \"widget <image> tag to use css for resizing\" https://issues.apache.org/jira/browse/OFBIZ-4678", 
   "Summary: The purpose of this patch is to address the following:", 
   "1. Provide a standardized set of image width and height specs for page layout in ofbiz. This gives ofbiz a uniform look throughout as it applies to image display.", 
   "2. Preserve the aspect ratio of the image when using these standardized image sizes.", 
   "3. One place to make styling modifications (eg. css file).", 
   "4. Decouple styling from code (eg. java,ftl,xml,html,jsp,etc).", 
   "Regarding including the real image size, the width/height attributes in <img> specifies the boundary of the image when shown on the page. If you need to specify the real size of the image, the server code would have to perform the determination. Afterwards, you can include the actual dimensions of the image in the title attribute of <img>", 
   "Details:", 
   "Manually specifying the image width and height does help with preserving the layout of a page regardless of the image size to be shown. The challenge with this method is that the image shown on the page in question may be distorted if the aspect ratio of the image differed from that of the width and height attributes of <img>. This basically forces the person uploading the image to be more vigilant about image aspect ratios.", 
   "The purpose is to harmonize on the display size of images with a standardized set of width/height constraints in which an image must fit and preserve the aspect ratio of images.", 
   "Currently the source files (eg. ftl, xml) either manually specifies the width or height of a displayed image (ie widget <image> and html <img> tag). The problem with specifying only one constraint is that an image can affect the layout of the page if the user uploads an image where the aspect ratio could be large.", 
   "Some ftl and xml files specify both the width and the height. The problem with this is that if the aspect ratio of the image in question does not match that of the width and height of the <img> tag, the image would be displayed distorted.", 
   "The solution was to create a standardized set of CSS styles that both configure the displayed image size and preserve the image aspect ratio (eg. thumbnail size, medium size and large size). Of course, the developers can further define or modify the styles to suit their need.", 
   "By using CSS, one can change the size of displayed images without having to tamper with the ftl and/or xml files. This helps to reduce potential bugs that come with modifying the ftl and xml files. The existing way of doing things is to go through each ftl or xml file in question and manually modify the width and/or height of the <image> and/or <img> tag.", 
   "The question about the \"border\" around images. If you do not wish to have a border around the image, just remove it from the CSS style. It's that easy No need to change anything else. Ie. configuration to the image is done on the CSS style and not on the <image>, <img> tag.", 
   "NB: The current patch does not apply to all displayed images. I have only made appropriate modifications to widget <image> and html <img> tags that have either specified the width and/or height. There are numerous <image> and <img> tags spread all over the project that do not specify dimensions. I would have to modify them as I encountered them when I could see where and how they are displayed on the screen. Note that these images would not be affect by this patch.", 
   "jleroux: despite my efforts I was not able to check all screens. But I think it's ok"
  ], 
  "revision_id": "1296782"
 }, 
 {
  "author": "cmueller", 
  "date": "2012-03-04T11:31:13.725115Z", 
  "msg": [
   "Improved the unit tests to check that countDownLatch.await(timeout, timeUnit) returns true which means it was NOT triggered by the timeout"
  ], 
  "revision_id": "1296781"
 }, 
 {
  "author": "veithen", 
  "date": "2012-03-04T11:29:09.859740Z", 
  "msg": [
   "Merged r1296062 to the 1.5 branch."
  ], 
  "revision_id": "1296780"
 }, 
 {
  "author": "davsclaus", 
  "date": "2012-03-04T10:51:25.131945Z", 
  "msg": [
   "CAMEL-5047: MDC logging keys has been prefixed with camel. Thanks to Lukasz for the patch."
  ], 
  "revision_id": "1296779"
 }
]