[
 {
  "author": "jacopoc", 
  "date": "2012-03-09T16:34:18.888382Z", 
  "msg": [
   "Enhanced Groovy Event Handler to support the execution of a method (as an event) inside of a groovy source file (script class): the method can be specified in the \"invoke\" attribute.", 
   "Similarly to Groovy services, the Groovy Events Handler sets the base script class containing helper methods; these helper methods have been enhanced in order to be used by groovy method executed as services or events in a transparent way."
  ], 
  "revision_id": "1298908"
 }, 
 {
  "author": "mamta", 
  "date": "2012-03-09T16:24:12.760668Z", 
  "msg": [
   "DERBY-5638 intermittent test failure in test_05_ClobNegative when running full largedata._Suite; LobLimitsTestjava.sql.SQLException: Table/View 'BLOBTBL' already exists in Schema 'APP'.", 
   "The test fixture test_05_ClobNegative which runs into intermittent test failures does not commit/rollback the transaction after doing a series of negative testing. This may be the cause of left over locks which does not allow CleanDatabaseSetup to get the required locks to drop the tables as part of it's cleanup. As part of this change, we are adding a rollback at the end of test_05_ClobNegative method and see if that helps with the intermittent locking issues."
  ], 
  "revision_id": "1298907"
 }, 
 {
  "author": "cbrisson", 
  "date": "2012-03-09T16:23:25.286904Z", 
  "msg": [
   "add velosurf in the sandbox"
  ], 
  "revision_id": "1298906"
 }, 
 {
  "author": "mduerig", 
  "date": "2012-03-09T16:23:15.085643Z", 
  "msg": [
   "Microkernel based prototype of JCR implementation (WIP)", 
   "- typo"
  ], 
  "revision_id": "1298905"
 }, 
 {
  "author": "jacopoc", 
  "date": "2012-03-09T16:17:12.473316Z", 
  "msg": [
   "Updated all the controller entries for Groovy event to consistently use the same way to define the location for the script file. Now the path and filename are always in the \"path\" attribute and the \"invoke\" attribute is reserved for the execution of a method in the file (I am going to add support for this feature in my next commit); if the invoke element is not specified then the whole script is executed."
  ], 
  "revision_id": "1298904"
 }
]