[
 {
  "author": "daijy", 
  "date": "2012-03-16T22:16:45.144771Z", 
  "msg": [
   "PIG-2576: Change in behavior for UDFContext.getUDFContext().getJobConf() in front-end"
  ], 
  "revision_id": "1301793"
 }, 
 {
  "author": "quetwo", 
  "date": "2012-03-16T22:14:25.538985Z", 
  "msg": [
   "Committing additional locales from various contributers"
  ], 
  "revision_id": "1301792"
 }, 
 {
  "author": "bvahdat", 
  "date": "2012-03-16T22:10:55.738640Z", 
  "msg": [
   "CAMEL-1812: Removed the remaining @author tags."
  ], 
  "revision_id": "1301791"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-03-16T22:09:11.956011Z", 
  "msg": [
   "[master] Integrate the favoredNodes into the new assignment manager", 
   "Summary:", 
   "There are several changes in the revision. All these changes has been tested on the dev cluster.", 
   "1) Master only reads the assignment plan (region -> favored node) from META region. It will keep itself updated by the base scanner. The assignment manager and new load balancer will assign regions according to on the assignment plan.", 
   "2) RegionPlacement tool can be run as a separate process or inside of the Master. In V1, the RegionPlacement will run independent.", 
   "2.1) The main job for the RegionPlacement tool is to generate new assignment plan based on the current locality information, region assignment and online region servers.", 
   "2.2) Also the tool can update the META with the ANY assignment plan and update Region Server with its corresponding assignment plan.  The assignment plan could be generated by the tool or manually customized.", 
   "2.3) In addition, the tool can support light-wight assignment verification such as printing the current assignment plan and verify the consistency between the actual region assignment and the assignment plan,  such as the number of regions running on the primary region server.", 
   "In reality, If all the region servers are live, all the user regions are supposed to be assigned to the primary region server only.", 
   "3) Write a unit test to cover most of the use cases.", 
   "3.1) In the normal cases, all user regions will be assigned to the primary region server.", 
   "3.2) The second case is the region placement tool can correctly update the META and Region Server with new assignment plan. Also master can correctly assign these regions based on the new assignment plan from the META region. The number of region movements is expected and all the regions are still running on the primary region server.", 
   "3.3) The last case is if any region servers, including region server hosting META or ROOT, is dead, the number of region movements and the number of regions running are the primary region server are still expected. All the regions from the dead region server will be assigned to the secondary or tertiary.", 
   "Test Plan:", 
   "1) Tested on dev cluster", 
   "2) Testing in the migrate002 cluster", 
   "Reviewers: kannan, kranganathan", 
   "Reviewed By: kranganathan", 
   "Differential Revision: https://phabricator.fb.com/D407485", 
   "Task ID: 713834"
  ], 
  "revision_id": "1301790"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-03-16T22:08:37.901871Z", 
  "msg": [
   "[jira] [HBASE-5581] [89-fb] Creating a table with invalid syntax does not give an error message when it fails", 
   "Summary:", 
   "Creating a table with invalid syntax does not give an error message when it", 
   "fails. In this case, it doesn't actually create the CF requested, but doesn't", 
   "give any indication to the user that it failed. Throw an error in case of", 
   "invalid table creation syntax.", 
   "Fix a typo in the error message when NUMREGIONS <= 1.", 
   "Test Plan:", 
   "Try to create a table with an invalid command as follows -", 
   "create 'test', {NAME => 'test', VERSIONS => 1, BLOCKCACHE => true, NUMREGIONS =>", 
   "20, SPLITALGO => \"HexStringSplit\", COMPRESSION => 'LZO', BLOOMFILTER => 'ROW'}", 
   "This should report an error.", 
   "Verify that the table is created correctly when the column family configuration", 
   "is specified in a separate clause as shown below", 
   "create 'test', {NAME => 'test', VERSIONS => 1, BLOCKCACHE => true, COMPRESSION", 
   "=> 'LZO', BLOOMFILTER => 'ROW'}, {NUMREGIONS => 20, SPLITALGO =>", 
   "\"HexStringSplit\"}", 
   "Reviewers: kannan", 
   "Reviewed By: kannan", 
   "Differential Revision: https://reviews.facebook.net/D2343"
  ], 
  "revision_id": "1301789"
 }
]