[
 {
  "author": "madams", 
  "date": "2012-03-16T17:28:59.107861Z", 
  "msg": [
   "JDO-710, Edit poms so that the maven eclipse plugin doesn't throw on import"
  ], 
  "revision_id": "1301658"
 }, 
 {
  "author": "alexdma", 
  "date": "2012-03-16T17:26:52.181226Z", 
  "msg": [
   "Refactor engine improvements to accommodate the changes of STANBOL-468:", 
   "* Rewrote some refactor engine code to make proper usage of ontology input sources.", 
   "* No more need for creating blank ontology sources just for populating a scope.", 
   "* More appropriate exception handling here and there (EngineException is thrown when it should)", 
   "* Session data are deleted along with session destruction when computeEnhancements() completes (this solution is not optimal because it does not take into account ontologies that are managed but not \"owned\" by a session, but it can do for now. To get the better implementation I must first complete version IRI and ownership support in OntoNet).", 
   "* General cleanup of unnecessary variables.", 
   "Altogether saves about 250 lines of code :)"
  ], 
  "revision_id": "1301657"
 }, 
 {
  "author": "bvahdat", 
  "date": "2012-03-16T17:18:44.044211Z", 
  "msg": [
   "CAMEL-5100: Add option autogenColumns to csv data format in XML DSL."
  ], 
  "revision_id": "1301656"
 }, 
 {
  "author": "jens", 
  "date": "2012-03-16T17:16:29.053480Z", 
  "msg": [
   "mimor corection"
  ], 
  "revision_id": "1301655"
 }, 
 {
  "author": "pranjan", 
  "date": "2012-03-16T17:10:29.513990Z", 
  "msg": [
   "MAHOUT-981, MAHOUT-983. Refactored K-Means Clustering and Dirichlet Clustering to use ClusterClassificationDriver.", 
   "Using cluster.getModel().configure() in ClusterClassificationDriver in order to configure DirichletCluster for MahalanobisDistanceMeasure.", 
   "Added/fixed test cases by:", 
   "Using separate directories in test cases for supplying initial clusters and to store buildClusters to prevent two cluster-*-final files in the same directory.", 
   "Writing IntWritable in test cases instead of LongWritable ( As the ClusterClassificationDriver clusters records with IntWritable keys)."
  ], 
  "revision_id": "1301654"
 }
]