[
 {
  "author": "alexdma", 
  "date": "2012-03-22T14:29:40.323906Z", 
  "msg": [
   "* First primitive support for owl:versionIRI and ownership (STANBOL-524) :", 
   "** scopes and sessions now try to claim ownership of unversioned ontologies by setting their ID as the versionIRI (TODO manage release/destruction of owned resources when scope/session goes down)", 
   "** all IRI->storage-key mappings now use (possibly versioned) OWLOntologyID objects instead of IRI. This is also serialized in the reserved Clerezza graph (for STANBOL-518)", 
   "* Registry support re-introduced for ontology lookups on main OntoNet REST endpoint when requesting a Clerezza-only supported format (JSON-LD, RDF/JSON, N3 etc.) (STANBOL-497)", 
   "* Several new additions to the default ontology network registry incl. SIOC, Provenance, SKOS and DC (STANBOL-410)"
  ], 
  "revision_id": "1303798"
 }, 
 {
  "author": "jdyer", 
  "date": "2012-03-22T14:29:29.449682Z", 
  "msg": [
   "Add CHANGES.txt entry for SOLR-2382"
  ], 
  "revision_id": "1303797"
 }, 
 {
  "author": "joern", 
  "date": "2012-03-22T14:25:15.476935Z", 
  "msg": [
   "OPENNLP-476 Added OSGi bundle and the application for the rest servlet"
  ], 
  "revision_id": "1303796"
 }, 
 {
  "author": "ate", 
  "date": "2012-03-22T14:19:45.496837Z", 
  "msg": [
   "RAVE-517: Create new rave-jcr war module providing a JCR/Jackrabbit service for Rave", 
   "- initial basic setup, which includes:", 
   "- a rave-jcr-service jar module providing the wiring and access to a shared/cross-context javax.jcr.Repository instance", 
   "- a rave-jcr war module which just bundles Jackrabbit and the above rave-jcr-service", 
   "- a rave-demo-portal to provide and showcase the content services and integration features", 
   "- the maven groupId for these, and the parent rave-content-services, have been set to org.apache.rave.sandbox.jcr to provide proper isolation", 
   "- the barest minimal usage of the rave-jcr now can be tested by running the rave-demo-portal (mvn cargo:start) and invoke: http://localhost:8080/portal/jcr/jcr.repository.vendor (output: Apache Software Foundation)", 
   "this is only a temporary usage of course!"
  ], 
  "revision_id": "1303795"
 }, 
 {
  "author": "sergeyb", 
  "date": "2012-03-22T14:16:02.187860Z", 
  "msg": [
   "Moving security-related bundles from cxf-jaxrs to separate features"
  ], 
  "revision_id": "1303794"
 }
]