[
 {
  "author": "sebb", 
  "date": "2012-03-21T18:20:05.721595Z", 
  "msg": [
   "CSV-74 - CSVFormat definitions are difficult to read and maintain"
  ], 
  "revision_id": "1303488"
 }, 
 {
  "author": "jfthomps", 
  "date": "2012-03-21T18:16:12.459893Z", 
  "msg": [
   "VCL-527", 
   "Allow users to reinstall newer revisions", 
   "added changelog.other for logging any change to a reservation that does not have an explicit field for the change"
  ], 
  "revision_id": "1303487"
 }, 
 {
  "author": "benh", 
  "date": "2012-03-21T18:14:53.274142Z", 
  "msg": [
   "Added support to decline an offer (rather than relying on understanding the semantics of 'launchTasks' with an empty task list)."
  ], 
  "revision_id": "1303486"
 }, 
 {
  "author": "todd", 
  "date": "2012-03-21T18:14:09.316103Z", 
  "msg": [
   "HDFS-309. FSEditLog should log progress during replay. Contributed by Sho Shimauchi."
  ], 
  "revision_id": "1303485"
 }, 
 {
  "author": "jfthomps", 
  "date": "2012-03-21T18:13:57.622999Z", 
  "msg": [
   "VCL-527", 
   "Allow users to reinstall newer revisions", 
   "requests.php:", 
   "-modified viewRequests - added state to detailed status for server requests; changed shared reboot/reinstall dialog to be just for reboots; added reinstall dialog", 
   "-modified getViewRequestHTMLitem - added state to detailed status for server requests", 
   "-modified AJsubmitEditRequest - added call to addChangeLogEntryOther when changing admin or login group", 
   "-modified AJrebootRequest - added code to check for request being expired; added call to addChangeLogEntryOther", 
   "-added AJshowReinstallRequest", 
   "-modified AJreinstallRequest - added code to check for request being expired; added code to handle revisionid being passed as something to change", 
   "states.php: added AJshowReinstallRequest", 
   "utils.php: added addChangeLogEntryOther", 
   "code.js: added recenterDijitDialog", 
   "requests.js:", 
   "-modified showSuggestedTimesCB - changed inline recentering of dijit dialogs to call recenterDijitDialog;", 
   "added 'edit' argument to resGone", 
   "-modified editReservationCB - added 'edit' argument to resGone", 
   "-modified resGone - added argument that allows different text to be displayed so function can be called for other reasons than a normal edit;  changed inline recentering of dijit dialogs to call recenterDijitDialog", 
   "-changed functions shared between reboot and reinstall to be only for reboot and added new ones for reinstalls"
  ], 
  "revision_id": "1303484"
 }
]