[
 {
  "author": "ningjiang", 
  "date": "2012-03-25T11:32:28.451823Z", 
  "msg": [
   "CAMEL-5116 CxfDestination should copy the in message header to the out message"
  ], 
  "revision_id": "1305008"
 }, 
 {
  "author": "ningjiang", 
  "date": "2012-03-25T11:30:13.716941Z", 
  "msg": [
   "CAMEL-5115 CxfBeanDestination should copy the in message header to the out message"
  ], 
  "revision_id": "1305007"
 }, 
 {
  "author": "eyang", 
  "date": "2012-03-25T11:19:19.238121Z", 
  "msg": [
   "CHUKWA-638. Fixed timezone offset in test case. (Eric Yang)"
  ], 
  "revision_id": "1305006"
 }, 
 {
  "author": "sebawagner", 
  "date": "2012-03-25T11:19:04.361662Z", 
  "msg": [
   "IN PROGRESS - issue OPENMEETINGS-7: Replace lzCalendar with non CPL implementation", 
   "https://issues.apache.org/jira/browse/OPENMEETINGS-7 - Fixes: Loading and view of user contacts and their events in the calendar UI, include standard buttons and actions for contects, add check to not allow access to not-authorizedd contacts"
  ], 
  "revision_id": "1305005"
 }, 
 {
  "author": "jleroux", 
  "date": "2012-03-25T11:07:57.992827Z", 
  "msg": [
   "A patch from Anne Jessel \"Support validation of resource xml files\" https://issues.apache.org/jira/browse/OFBIZ-4723", 
   "The xsd for the resource xml files is invalid. In addition, the format of the value of the xml:lang attribute in resource xml files is invalid, according to the xml standard.", 
   "The attached patch:", 
   "provides a valid xsd", 
   "updates UtilProperties and the Label Manager to deal with the correct formatting of the xml:lang value, while still working with the old format, following Adrian Crum's recommendation on the mailing list", 
   "includes simple unit tests for UtilProperties to ensure it does work with both formats", 
   "changes the Label Manager to include a reference to the new xsd, and to use the correct format of the xml:lang value, when writing a resource xml file.", 
   "Some minor code cleanups to these files.", 
   "jleroux: the base test suite was successfully run locally once UtilIOTests have been commented out (still an issue with it on Windows)"
  ], 
  "revision_id": "1305004"
 }
]