[
 {
  "author": "mas", 
  "date": "2002-06-18T03:06:45.000000Z", 
  "msg": [
   "Made the makeCollection and makeFullCollection methods final since set tests", 
   "should use makeEmptySet and makeFullSet rather than their collection", 
   "counterparts.", 
   "Added getSet() and getConfirmedSet() methods which wrap the collection and", 
   "confirmed fixtures so that tests don't need to perform the cast to a Set.", 
   "Modified tests that used makeEmptySet and makeFullSet to use the fixture", 
   "getSet() along with resetEmpty() and resetFull().  This allows for more calls", 
   "to verify() to ensure that calls to methods that should not modify a", 
   "collection don't actually modify it."
  ], 
  "revision_id": "130724"
 }, 
 {
  "author": "mas", 
  "date": "2002-06-18T02:58:28.000000Z", 
  "msg": [
   "Added new TestSet class, extending the TestCollection class to test the", 
   "complete Set contract.  This will be used to test Set implementations and set", 
   "views of other collections (e.g. Map.entrySet() and Map.keySet()).", 
   "Submitted by: Paul Jack ( pjack at sfaf dot org )."
  ], 
  "revision_id": "130723"
 }, 
 {
  "author": "mas", 
  "date": "2002-06-18T02:51:12.000000Z", 
  "msg": [
   "Renamed supportsAdd and supportsRemove to isAddSupported and isRemoveSupported.", 
   "Removed commented out tests for equals and hashCode (the collection contract", 
   "does not specify a specific contract on equals and hashCode), and added a", 
   "comment at the top of the class so that no one comes in later and re-adds the", 
   "test cases.", 
   "Removed dependence on HashBag.  If HashBag has a bug, this may adversly affect", 
   "the tests that are using it.  Reimplemented without using HashBag.", 
   "Modified tests that used makeFullCollection and makeCollection to use the", 
   "fixture field \"collection\" along with resetEmpty() and resetFull().  This", 
   "allowed for more calls to verify to ensure that calls to methods that should", 
   "not modify a collection don't actually modify it.", 
   "When removing using the iterator, an equivalent operation cannot really be", 
   "performed on the confirmed collection for verification.  After some", 
   "investigation, changed the existing tests (tested for instances of Set, List", 
   "and Bag) to one that is a bit more generic: A new flag (that test subclasses", 
   "can override) which specifies whether the elements in the collection are", 
   "distinguishable from each other (and such that it might matter which element is", 
   "actually removed from the collection when the iterator's remove method is", 
   "called)."
  ], 
  "revision_id": "130722"
 }, 
 {
  "author": "mas", 
  "date": "2002-06-18T01:14:23.000000Z", 
  "msg": [
   "Enhanced TestCollection to more completely test the Collection contract.  This", 
   "will be used to test straight Collection implementations and for collection", 
   "views of other collections (e.g. Map.values()).", 
   "Submitted by: Paul Jack ( pjack at sfaf dot org ).", 
   "Changed TestBag to extend from TestObject instead of TestCollection since the", 
   "Bag contract conflicts with the Collection contract.  This needs to be", 
   "addressed at some point."
  ], 
  "revision_id": "130721"
 }, 
 {
  "author": "mas", 
  "date": "2002-06-18T01:04:03.000000Z", 
  "msg": [
   "Added framework to modularize collections tests such the testing code used for", 
   "testing collections, maps, etc., can be reused to test collections, maps,", 
   "etc. that are returned from other collections.  For example, the Map interface", 
   "defines entrySet() which is supposed to return a valid Set.  The framework", 
   "added here would allow the Set testing code to be used for testing Sets and the", 
   "set returned from Map's entrySet() method.", 
   "Submitted by: Paul Jack < pjack at sfaf dot org >"
  ], 
  "revision_id": "130720"
 }
]