[
 {
  "author": "kwright", 
  "date": "2012-04-02T13:10:32.027332Z", 
  "msg": [
   "Remove unused branch"
  ], 
  "revision_id": "1308338"
 }, 
 {
  "author": "coheigea", 
  "date": "2012-04-02T13:09:53.014107Z", 
  "msg": [
   "[CXF-4219] - Switch to using EhCache for the SecurityToken caching solution in the cxf-rt-ws-security module"
  ], 
  "revision_id": "1308337"
 }, 
 {
  "author": "jleroux", 
  "date": "2012-04-02T13:09:37.128390Z", 
  "msg": [
   "A patch from Markus M. May \"Allows build.xml in hot-deploy folder to build components in a specific order\" https://issues.apache.org/jira/browse/OFBIZ-4736", 
   "In the current build.xml in the ofbiz-Home-folder, the build target is executed for each subdirectory (framework, application, specialpurpose) with the fileset:", 
   "<filelist dir=\".\" files=\"specialpurpose/build.xml\"/>", 
   "Only for the hot-deploy folder the fileset is quite different:", 
   "<fileset dir=\"${basedir}/hot-deploy\" casesensitive=\"no\">", 
   "<exclude name=\"disabled/**\"/>", 
   "<include name=\"*/build.xml\"/>", 
   "</fileset>", 
   "This is calling the build.xml directly in the hot-deploy components, which is an error, if you do have several dependent components in there, which needs to get build in the right order. I propose to use the following filelist:", 
   "<filelist dir=\".\" files=\"hot-deploy/build.xml\"/>", 
   "jleroux: a check is done, if no build.xml file is present in hot-deploy dir, then the build.xml files - if present - in hot-deploy sub-dirs will be used. So the previous, simpler, behaviour is kept as long as you don't need to build hot-deploy components in a specific order."
  ], 
  "revision_id": "1308336"
 }, 
 {
  "author": "gabriele", 
  "date": "2012-04-02T13:06:44.416824Z", 
  "msg": [
   "added new PGP key 6FE5701E export, since D0383AE5 was corrupted. More details at http://people.apache.org/~gabriele/"
  ], 
  "revision_id": "1308335"
 }, 
 {
  "author": "andy", 
  "date": "2012-04-02T13:04:12.297205Z", 
  "msg": [
   "Don't close the underlying OutputStream that was passed in."
  ], 
  "revision_id": "1308334"
 }
]