[
 {
  "author": "jfthomps", 
  "date": "2012-04-02T19:53:51.141308Z", 
  "msg": [
   "VCL-568", 
   "refresh current reservations page 15 minutes after a reservation becomes available", 
   "requests.php:", 
   "-modified viewRequests - added a hidden element to most reservations that is the next timeout value", 
   "-modified getViewRequestHTMLitem - added timeoutdata", 
   "-modified connectRequest - added call to addConnectTimeout if getReservationConnectTimeout returns null; added hidden element that is the next timeout value; added dijit dialog that says reservation has timed out", 
   "-added AJcheckConnectTimeout", 
   "-added getReservationNextTimeout", 
   "-added getReservationConnectTimeout", 
   "-added addConnectTimeout", 
   "utils.php:", 
   "-modified getComputers - (unrelated to this JIRA) fixed bug introduced when changing how vmprofileid gets set; there needed to be 2 joins to the vmhost table, one for vms and one for vm hosts", 
   "-modified getDojoHTML - added dijit.form.Button and dijit.Dialog to connectRequest state; added dojo css, dojo requires and a timeout call for checkConnectTimeout for connectRequest state; added timeout call for checkTimeouts to viewRequests state", 
   "states.php: added AJcheckConnectTimeout", 
   "requests.js:", 
   "-added checkTimeouts", 
   "-added checkConnectTimeout", 
   "-added checkConnectTimeoutCB"
  ], 
  "revision_id": "1308508"
 }, 
 {
  "author": "bobby", 
  "date": "2012-04-02T19:51:06.495165Z", 
  "msg": [
   "MAPREDUCE-4092.  commitJob Exception does not fail job (Jon Eagles via bobby)"
  ], 
  "revision_id": "1308507"
 }, 
 {
  "author": "veithen", 
  "date": "2012-04-02T19:49:02.642224Z", 
  "msg": [
   "Finalized release notes for 1.2.13 and added an entry to download.html. Also removed the \"commons\" component from the dist URL for this release."
  ], 
  "revision_id": "1308506"
 }, 
 {
  "author": "hwright", 
  "date": "2012-04-02T19:45:56.418460Z", 
  "msg": [
   "* build/run_tests.py", 
   "(_run_c_test): Still print dots, even if we don't have any tests to run."
  ], 
  "revision_id": "1308505"
 }, 
 {
  "author": "sergeyb", 
  "date": "2012-04-02T19:43:14.557346Z", 
  "msg": [
   "More Java docs updates to the oauth2 module"
  ], 
  "revision_id": "1308504"
 }
]