[
 {
  "author": "jfthomps", 
  "date": "2012-04-03T19:52:21.495683Z", 
  "msg": [
   "VCL-418", 
   "simplify adding LDAP authentication", 
   "conf-default.php: added lookupuserbeforeauth and lookupuserfield to config array for ldap connectors; lookupuserbeforeauth is a boolean that, when true, configures VCL to to use the master login to lookup the full DN of the user before doing that ldap_bind that auths the user; lookupuserfield is the ldap attribute under which the supplied user name should be looked up in ldap", 
   "authentication.php:", 
   "-modified printLoginPageWithSkin - get the skin from the affiliation table by calling getAffiliationTheme", 
   "-modified ldapLogin - instead of checking for the use of specific entries in $authMechs, we check for $authMechs[$authtype]['lookupuserbeforeauth'] to determine whether or not the full DN of the user needs to be found before doing the ldap_bind auth", 
   "utils.php:", 
   "-modified initGlobals - set $skin by calling getAffiliationTheme instead of a switch statement based on the affiliation name", 
   "-modified checkAccess - added code to see if the full DN of the user needs to be looked up when responding to an API call and do so if needed", 
   "-added getAffiliationTheme", 
   "-modified main, sendHeaders, printHTMLHeader, and getNavMenu - removed inclusion of $skin from globals since it is no longer used in these functions"
  ], 
  "revision_id": "1309118"
 }, 
 {
  "author": "olamy", 
  "date": "2012-04-03T19:49:17.070452Z", 
  "msg": [
   "[MRM-709] use SelectorUtils from ant."
  ], 
  "revision_id": "1309117"
 }, 
 {
  "author": "szetszwo", 
  "date": "2012-04-03T19:47:42.094824Z", 
  "msg": [
   "svn merge -c 1309114 from trunk for HDFS-3176. Use MD5MD5CRC32FileChecksum.readFields() in JsonUtil ."
  ], 
  "revision_id": "1309116"
 }, 
 {
  "author": "szetszwo", 
  "date": "2012-04-03T19:46:07.599697Z", 
  "msg": [
   "svn merge -c 1309114 from trunk for HDFS-3176. Use MD5MD5CRC32FileChecksum.readFields() in JsonUtil."
  ], 
  "revision_id": "1309115"
 }, 
 {
  "author": "szetszwo", 
  "date": "2012-04-03T19:44:53.478035Z", 
  "msg": [
   "HDFS-3176. Use MD5MD5CRC32FileChecksum.readFields() in JsonUtil .  Contributed by Kihwal Lee"
  ], 
  "revision_id": "1309114"
 }
]