[
 {
  "author": "uschindler", 
  "date": "2012-04-09T15:15:11.624130Z", 
  "msg": [
   "LUCENE-3969: Minor cleanups and code consistency"
  ], 
  "revision_id": "1311278"
 }, 
 {
  "author": "davsclaus", 
  "date": "2012-04-09T15:12:37.153652Z", 
  "msg": [
   "CAMEL-4853: Use threading accordingly to mina documentation."
  ], 
  "revision_id": "1311277"
 }, 
 {
  "author": "simonbr", 
  "date": "2012-04-09T15:12:13.181441Z", 
  "msg": [
   "CMS commit to ooo-site by simonbr"
  ], 
  "revision_id": "1311276"
 }, 
 {
  "author": "rgodfrey", 
  "date": "2012-04-09T15:04:45.464804Z", 
  "msg": [
   "NO-JIRA : [Java Config] Add SASL login functionality to web console"
  ], 
  "revision_id": "1311275"
 }, 
 {
  "author": "jwross", 
  "date": "2012-04-09T15:04:13.971094Z", 
  "msg": [
   "ARIES-825: Update subsystems to latest Subsystem, Resolver, and Repository APIs.", 
   "(1) Fixed issue where default version specified in subsystem URI was not being used.", 
   "(2) Fixed issue where embedded URL within subsystem URI was not being used.", 
   "(3) Fixed issue where feature installations were not failed when Preferred-Provider header was declared.", 
   "(4) Fixed issue with equals and hashCode of SubsystemGraph where symbolic name, version, and type were being used. Either location or ID should be used instead.", 
   "(5) Fixed issue where target region was being computed incorrectly.", 
   "(6) Added support for subsystem service visibility rules by region.", 
   "(7) Fixed issue where getBundleContext() would throw an NPE for features that only had features as parents.", 
   "(8) Child subsystems will now be resolved before the parent's bundles. This puts the events in the expected order as well as insures the child's export policy is applied in order to satisfy any dependencies within the parent.", 
   "(9) Added INSTALLED as a transitional event when uninstalling a subsystem.", 
   "(10) Fixed issue where UNINSTALLING and UNINSTALLED events were not taking place from the INSTALL_FAILED state.", 
   "(11) Updated tests to expect transitional INSTALLED state when uninstalling a subsystem.", 
   "(12) Fixed issue with SubsystemResource.Location.open() where provided location string was not being used as a last resort."
  ], 
  "revision_id": "1311274"
 }
]