[
 {
  "author": "glenn", 
  "date": "2002-05-16T21:25:38.000000Z", 
  "msg": [
   "I have expanded upon the work James House did to generate stack", 
   "traces for abandoned db connections. (Thanks James)", 
   "The patch he provided was refactored and some new features added.", 
   "Three new DBCP parameters were added:", 
   "removeAbandoned - True or false. If true abandoned db connections", 
   "are removed after the removeAbandonedTimout is exceeded if the dbcp", 
   "is nearing exhaustion.", 
   "removeAbandonedTimeout - Time in seconds since a connection was last", 
   "used before it is considered abandoned.", 
   "logAbandoned - True or false.  If true Exception stack traces are", 
   "created so that the source of an abandoned db connection can be logged.", 
   "While reviewing the code I noticed that Statements and ResultSets were", 
   "not being closed when a Connection was closed (recycled).  This behaviour", 
   "differs from the JDBC spec which states that the underlying Statements", 
   "and ResultSets should be closed when a Connection is closed.  This", 
   "patch tracks Statements and ResultSets so that when the Connection", 
   "which created them is closed they are closed also.", 
   "This patch should be backward compatible with any code which uses", 
   "the existing DBCP."
  ], 
  "revision_id": "131884"
 }, 
 {
  "author": "", 
  "date": "2002-05-01T06:27:52.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'jwsdp_10_02'."
  ], 
  "revision_id": "131883"
 }, 
 {
  "author": "rwaldhoff", 
  "date": "2002-05-01T06:27:52.000000Z", 
  "msg": [
   "use Pool.getNumActive and getNumIdle"
  ], 
  "revision_id": "131882"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-04-30T18:06:30.000000Z", 
  "msg": [
   "Make the current number of active and idle connections visible through", 
   "the \"numActive\" and \"numIdle\" properties.", 
   "Submitted by:\tEric Pugh <epugh at upstate.com>"
  ], 
  "revision_id": "131881"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-04-20T18:58:51.000000Z", 
  "msg": [
   "Use DriverManager.getDriver() to create the new Driver instance (as is", 
   "recommended in the JDBC JavaDocs.", 
   "PR: Bugzilla #7728", 
   "Submitted by:\tJames House <james at interobjective.com>"
  ], 
  "revision_id": "131880"
 }
]