[
 {
  "author": "craigmcc", 
  "date": "2002-08-14T00:46:50.000000Z", 
  "msg": [
   "Update version tags for released packages."
  ], 
  "revision_id": "131844"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-08-10T23:50:30.000000Z", 
  "msg": [
   "Based on conversations on COMMONS-DEV this week, here is the initial crack", 
   "at a build.xml file that creates a consolidated commons-combo.jar, and", 
   "associated consolidated JavaDocs, for specified CVS tag builds of all", 
   "commons proper packages (normally, the latest release tag for each package).", 
   "The theory is that, as any Commons packages creates a new release, they would", 
   "also update the CVS tag for that package here, and release an updated", 
   "commons-combo package as well.", 
   "There are a bunch of things left to address -- help is welcome!", 
   "* Need initial releases of betwixt, cli, dbcp, discovery, and", 
   "validator (right now we're just pulling HEAD branch on these).", 
   "* Need final releases of httpclient, lang, and latka (right now", 
   "we're pulling interim release tags on these).", 
   "* When building the commons-combo.jar file, we need to construct", 
   "a consolidated META-INF/MANIFEST.MF file with the correct version", 
   "information for all the included packages.  I'm not sure if this", 
   "can be automated easily or not.", 
   "* Builds of cli and latka are currently commented out -- they both", 
   "give me build failures.", 
   "* For some reason, the consolidated JavaDocs are picking up only some", 
   "of the package.html files describing the included packages.", 
   "* Consolidated JavaDocs need an overview.html page that lists the", 
   "CVS tags (or corresponding version numbers) of each of the packages", 
   "included in this version of the consolidated JAR and Javadocs.", 
   "* We should consider creating a consolidated set of the documentation", 
   "files as well, not just the JavaDocs.  One issue with just copying", 
   "the \"dist/docs\" output of each package is that they often contain", 
   "embedded links to the \"api\" subdirectory for the Javadocs for that", 
   "individual package.  It seems quite wasteful to have two copies of", 
   "the Javadocs just to make sure that those links work.", 
   "* The build.xml file takes pains to make sure that commons packages", 
   "dependent on other commons packages are compiled in the right order,", 
   "and against the version of the dependent packages that will be included", 
   "in commons-combo.jar.  Unfortunately, the mavenized packages still", 
   "compile themselves against the dependency versions declared in their", 
   "project.xml files, even if those are different -- leading to the risk", 
   "of undetected version mismatches."
  ], 
  "revision_id": "131843"
 }, 
 {
  "author": "", 
  "date": "2002-08-10T23:50:30.000000Z", 
  "msg": [
   "New repository initialized by cvs2svn."
  ], 
  "revision_id": "131842"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2005-01-27T18:26:02.747261Z", 
  "msg": [
   "CVS to SVN Migration"
  ], 
  "revision_id": "131841"
 }, 
 {
  "author": "scolebourne", 
  "date": "2005-01-22T00:48:22.000000Z", 
  "msg": [
   "Optimise the remove implementation for performance of common case"
  ], 
  "revision_id": "131840"
 }
]