[
 {
  "author": "craigmcc", 
  "date": "2001-08-04T23:46:29.000000Z", 
  "msg": [
   "Add a new standard Rule implementation that lets you specify a factory", 
   "class that uses the XML attributes of the matched element to create and", 
   "configure the ultimate object that is then pushed onto the stack (at", 
   "element start) and then popped (at element end), similar to", 
   "ObjectCreateRule.", 
   "I extended Robert's original implementation to allow for the case where", 
   "your ObjectCreationFactory class might itself have a zero-args", 
   "constructor, and where you might want to dynamically select the name of", 
   "the factory class in the XML document being parsed.  In addition, I added", 
   "convenience rule registration methods into Digester to match the available", 
   "FactoryCreateRule constructors.", 
   "Submitted by:  Robert Burrell Donkin"
  ], 
  "revision_id": "132254"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-04T23:14:57.000000Z", 
  "msg": [
   "Refactor the collection of registered rules, and the associated policy", 
   "for picking the matching ones, into a Rules interface.  Provide a default", 
   "implementation that supports the previous standard functionality."
  ], 
  "revision_id": "132253"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-04T22:26:37.000000Z", 
  "msg": [
   "Make it possible to set the class loader to be used for instantiating", 
   "application objects.  If you call setClassLoader(), this will override", 
   "the default behavior that is based on the useContextClassLoader property."
  ], 
  "revision_id": "132252"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-04T22:04:15.000000Z", 
  "msg": [
   "Fix the anomaly that I reported a couple of weeks ago.  Rule matching was not", 
   "working with namespace awareness turned off, because the arguments to", 
   "startElement() contained the following values:", 
   "- localName was a zero length string", 
   "- qName is the \"local\" part of the name", 
   "and, because we use localName to match rules, no rules were fired.  Now,", 
   "Digester will use qName in this scenario."
  ], 
  "revision_id": "132251"
 }, 
 {
  "author": "sanders", 
  "date": "2001-07-30T15:23:14.000000Z", 
  "msg": [
   "Patch by robert burrell donkin <robertdonkin@mac.com>", 
   "Changed struts package name to commons"
  ], 
  "revision_id": "132250"
 }
]