[
 {
  "author": "sanders", 
  "date": "2001-09-04T02:36:44.000000Z", 
  "msg": [
   "Update to correctly match on null valued namespaces", 
   "Submitted by: robert burrell donkin (robertdonkin@mac.com>"
  ], 
  "revision_id": "132274"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-09-03T16:29:14.000000Z", 
  "msg": [
   "When RulesBase accepts a new rule, only set the namespace of the added", 
   "rule to an explicitly set value.  Otherwise, accept whatever namespace", 
   "setting is already present in the rule.", 
   "Submitted by:  Robert Burrell Donkin <robertdonkin@mac.com>"
  ], 
  "revision_id": "132273"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-26T22:13:44.000000Z", 
  "msg": [
   "Add notion of a RuleSet that provides a convenient way to package sets of", 
   "related rules, optionally associated with a namespace prefix.", 
   "Add test cases for RuleSet processing, and fix a couple of bugs in rule", 
   "matching.  All unit tests now pass for both namespace-unaware processing", 
   "(the original functionality of Digester) and namespace-aware processing", 
   "(new feature where rules can only match for matching namespace URIs)."
  ], 
  "revision_id": "132272"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-26T05:09:36.000000Z", 
  "msg": [
   "Add a new feature to Digester - the ability to declare that Rule instances", 
   "match *only* elements from a corresponding namespace, without changing the", 
   "functionality observed by applications that do not care about this.", 
   "BACKGROUND:  The original implementation of Digester created matching", 
   "patterns based on the \"qName\" version of element names (i.e. including the", 
   "namespace prefix).  However, to be a \"good XML citizen\", it should be", 
   "possible to create rules that match based on the corresponding namespace", 
   "URI plus the \"localname\" part of the element name.  In that way, XML", 
   "document authors are free to use any prefix they like, as long as they", 
   "declare their namespaces in the usual fashion.", 
   "To declare that Rule instances apply *only* to a particular namespace URI,", 
   "call digester.setRuleNamespaceURI() before calling the corresponding", 
   "addRule() method.  If you call setRuleNamespaceURI(null), rules will match", 
   "regardless of namespace URI -- in other words, the current behavior.", 
   "WARNING 1:  I had to deprecate Rules.match(String) because it is", 
   "insufficient to handle this case.  Any existing implementation of Rules", 
   "should be modified to imlement Rules.match(String,String) instead.", 
   "WARNING 2:  I haven't yet added unit tests to verify that this stuff works", 
   "correctly, but will be doing that soon (plus using this feature in my", 
   "\"workflow\" project)."
  ], 
  "revision_id": "132271"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-25T20:30:16.000000Z", 
  "msg": [
   "In CallMethodRule, skip the method call if the argument text is coming", 
   "from the body text, but there was no body text in the XML file.  This is", 
   "consistent with the recent change to skip the call if the specified", 
   "attribute name was not included.", 
   "Also, for consistency with behavior elsewhere in Digester, trim leading", 
   "and trailing whitespace from the body text before using it as a parameter", 
   "value."
  ], 
  "revision_id": "132270"
 }
]