[
 {
  "author": "craigmcc", 
  "date": "2001-08-20T19:18:42.000000Z", 
  "msg": [
   "Allow multiple CallMethodRule rules to be fired on the same pattern.  The", 
   "problem was that each CallMethodRule was pushing its parameter array onto", 
   "the object stack, which interfered with the ultimate method call on the", 
   "\"top\" data object.  This was fixed by using a separate stack for the the", 
   "parameter arrays.", 
   "As long as you group the CallMethodRule and all its associated", 
   "CallParamRules together when creating rules, you can now have an unlimited", 
   "number of them for a particular matching pattern.", 
   "Submitted by:  Jason van Zyl <jvanzyl@apache.org>"
  ], 
  "revision_id": "132264"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-20T18:28:40.000000Z", 
  "msg": [
   "Add toString() methods to all existing Rule implementations to make", 
   "debugging and logging output messages more comprehensible."
  ], 
  "revision_id": "132263"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-20T18:23:39.000000Z", 
  "msg": [
   "Convenience base class for ObjectCreationFactory implementations (renamed", 
   "from Robert's proposed ObjectCreationImpl for consistency with many of the", 
   "JDK APIs that do similar sorts of things).", 
   "Submitted by:  Robert Burrell Donkin <robertdonkin@mac.com>"
  ], 
  "revision_id": "132262"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-20T16:10:13.000000Z", 
  "msg": [
   "Clean up finish() processing in Rule implementations such that a", 
   "preconfigured Digester can be used to parse more than one document.", 
   "Previously, we were clearing instance variables that were configured in", 
   "the rule constructors - now, only transient state information is cleared.", 
   "Submitted by:  Matt Cleveland <groovesoftware@yahoo.com>"
  ], 
  "revision_id": "132261"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-15T20:35:43.000000Z", 
  "msg": [
   "Make property name matching work correctly when namespace processing is", 
   "off.  The earlier fix only helped on elements.", 
   "Submitted by:  Robert Burrell Donkin <robertdonkin@mac.com>"
  ], 
  "revision_id": "132260"
 }
]