[
 {
  "author": "skitching", 
  "date": "2004-03-28T06:10:01.000000Z", 
  "msg": [
   "This exception now extends the (new) PluginException class"
  ], 
  "revision_id": "132594"
 }, 
 {
  "author": "skitching", 
  "date": "2004-03-28T06:09:13.000000Z", 
  "msg": [
   "User-provided xml attributes are now simly stored in a Properties object", 
   "on the Declaration rather than being assigned to explicit properties of", 
   "a Declaration. This allows an open-ended set of declaration properties", 
   "for the RuleFinder objects to inspect, and removes hard-wired English", 
   "language names for these attributes."
  ], 
  "revision_id": "132593"
 }, 
 {
  "author": "skitching", 
  "date": "2004-03-28T06:01:57.000000Z", 
  "msg": [
   "* Remove ugly static members formerly used to store default xml-attribute", 
   "names for plugin id and class into. This info is now stored on a", 
   "PerDigesterResources object and accessed via methods on the PluginRules", 
   "class.", 
   "* This change does affect the public API/behaviour of the PluginCreateRule", 
   "class. However plugins have never been present in a public Digester", 
   "release, and this feature (setting default xml attr names) is not", 
   "a commonly-used feature.", 
   "* Also minor changes due to change in Declaration class API."
  ], 
  "revision_id": "132592"
 }, 
 {
  "author": "skitching", 
  "date": "2004-03-28T05:51:43.000000Z", 
  "msg": [
   "* store declaration attributes provided by the user as a Properties object", 
   "rather than explicit Object attributes. This allows the set of", 
   "attributes to be open-ended, and removes use of hard-wired English", 
   "attribute names.", 
   "* use new RuleFinder/RuleLoader interfaces to find \"pluggable\" algorithms", 
   "for finding/loading dynamic plugin rules rather than hard-coding the", 
   "algorithms in this class.", 
   "* move rule finding/loading algorithms to separate classes in the", 
   "strategies subpackage."
  ], 
  "revision_id": "132591"
 }, 
 {
  "author": "skitching", 
  "date": "2004-03-28T05:44:13.000000Z", 
  "msg": [
   "Just a minor javadoc enhancement"
  ], 
  "revision_id": "132590"
 }
]