[
 {
  "author": "mbautin", 
  "date": "2012-04-14T02:47:35.223543Z", 
  "msg": [
   "[master] Add the dispersion information about favored nodes into the region verification report", 
   "Summary:", 
   "The motivation is to check and verify regions who shared the same region server won't share the same secondary/tertiary region server.", 
   "It matters when one region server is down, all the regions previously on this dead region server will be dispersed into their secondary and tertiary region servers. The more these secondary/tertiary region server could be distributed, the faster HBase could be recovery. Also it could keep regions balanced across all the region servers.", 
   "For each region server, we defined 2 dispersion related metric: dispersion num and dispersion score.", 
   "Dispersion num:  The number of the unique secondary/tertiary region servers for the regions who shared this RS as the primary region server.", 
   "Dispersion score: Dispersion num / the number regions who shared this RS as the primary region server.", 
   "Thanks Kannan for all the suggestions !", 
   "Test Plan: tested on migrate cluster", 
   "Reviewers: kannan", 
   "Reviewed By: kannan", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D444840", 
   "Task ID: 969202"
  ], 
  "revision_id": "1326048"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-04-14T02:47:13.453197Z", 
  "msg": [
   "[master] An easy interface to customize the region assignment plan", 
   "Summary:", 
   "The diff provides an easy interface to check and customize the region assignment plan from the web ui directly.", 
   "Here is the example:", 
   "http://msgstorectrl341.snc4.facebook.com:60010/assignmentPlan.jsp", 
   "User can easily check the current assignment plan and update any customized favored nodes.", 
   "Test Plan: Tested in migrate 002 cluster", 
   "Reviewers: kannan, kranganathan", 
   "Reviewed By: kannan", 
   "CC: hbase-eng@, hbase-ops@lists", 
   "Differential Revision: https://phabricator.fb.com/D448467", 
   "Task ID: 1018371"
  ], 
  "revision_id": "1326047"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-04-14T02:46:49.557456Z", 
  "msg": [
   "[jira] [HBASE-5763] [89-fb] Fix random failures in TestFSErrorsExposed", 
   "Summary: TestFSErrorsExposed frequently fails due to unclean mini-cluster", 
   "shutdown. Bringing datanodes back up, waiting for some time, and preemptively", 
   "killing all regionservers and the master before shutdown.", 
   "Test Plan: Run TestFSErrorsExposed 100 times", 
   "Reviewers: liyintang, kannan, pritamdamania, amirshim", 
   "Reviewed By: amirshim", 
   "CC: stack", 
   "Differential Revision: https://reviews.facebook.net/D2739"
  ], 
  "revision_id": "1326046"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-04-14T02:46:26.251106Z", 
  "msg": [
   "[jira] [HBASE-5684] [89-fb] Make ProcessBasedLocalHBaseCluster run HDFS and make it more robust", 
   "Summary:", 
   "Currently ProcessBasedLocalHBaseCluster runs on top of raw local filesystem. We", 
   "need it to start a process-based HDFS cluster as well. We also need to make the", 
   "whole thing more stable so we can use it in unit tests.", 
   "Also all logs of local HBase cluster daemons are now tailed to the primary log", 
   "of the unit test with the appropriate prefixes to make debugging easier.", 
   "Test Plan:", 
   "Run the new unit test multiple times (10x or 50x).", 
   "Run all unit tests.", 
   "Reviewers: kannan, liyintang, pkhemani, kranganathan, madhuvaidya, amirshim, tedyu", 
   "Reviewed By: liyintang", 
   "CC: tedyu", 
   "Differential Revision: https://reviews.facebook.net/D2709"
  ], 
  "revision_id": "1326045"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-04-14T02:46:00.977004Z", 
  "msg": [
   "[HBASE-5335] Fix TestShell error introduced by Dynamic Config", 
   "Summary: Error introduced because of an admin.rb conflict when", 
   "cherry-picking from apache89 to internal.", 
   "Test Plan:", 
   "- mvn test -Dtest=TestShell"
  ], 
  "revision_id": "1326044"
 }
]