[
 {
  "author": "lu4242", 
  "date": "2012-04-17T04:11:48.446217Z", 
  "msg": [
   "synch pom files and fix some site bugs"
  ], 
  "revision_id": "1326908"
 }, 
 {
  "author": "edwardyoon", 
  "date": "2012-04-17T04:08:49.440688Z", 
  "msg": [
   "Reverting"
  ], 
  "revision_id": "1326907"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-04-17T04:07:47.704491Z", 
  "msg": [
   "svn merge -r 1326900:1326901 https://svn.apache.org/repos/asf/openejb/branches/openejb-4.0.0", 
   "http://svn.apache.org/viewvc?view=revision&revision=1326901", 
   "------------------------------------------------------------------------", 
   "r1326901 | dblevins | 2012-04-16 20:52:00 -0700 (Mon, 16 Apr 2012) | 12 lines", 
   "Further clean up of TOMEE-137: Arquillian.xml properties overridable as system properties for TomEE adapters", 
   "There was still duplicate code doing overriding via fixed string properties not based on the Configuration resulting in competing/conflicting ways to override and hard to document rules on which would win (tomee.httpPort vs tomee.http.port).  As well code to configure random ports was taking place before Arquillian Configuration object overriding, so 0 or -1 ports could not be specified as system property overrides.  This actually did work, but only because of the \"second try\" code that kicked in just before the container was started.  The end result was that it was a bit twisted and indirect when and how ports were set and using what properties.", 
   "Properties are now overridden from TomEEContainer.setup(Configuration), ports are selected, then the properties are exported.", 
   "If we need fancier code, we can build on that simple localized logic.", 
   "As well properties that only apply to the remote adapter were once again removed from the Embedded configuration object, specifically ajpPort.", 
   "Thanks to jieryn on IRC for pointing out the confusion.", 
   "------------------------------------------------------------------------"
  ], 
  "revision_id": "1326906"
 }, 
 {
  "author": "lu4242", 
  "date": "2012-04-17T04:00:22.992180Z", 
  "msg": [
   "configure automatic assembly generation when perform release, to make possible just grab it from nexus repo like with myfaces core"
  ], 
  "revision_id": "1326905"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-04-17T04:00:05.095372Z", 
  "msg": [
   "allow the camelcase delimiter to be specified"
  ], 
  "revision_id": "1326904"
 }
]