[
 {
  "author": "martinc", 
  "date": "2003-05-16T04:06:02.000000Z", 
  "msg": [
   "Remove dependency on Commons BeanUtils, and document that change.", 
   "Update what's done and what still needs doing."
  ], 
  "revision_id": "133349"
 }, 
 {
  "author": "martinc", 
  "date": "2003-05-12T05:24:52.000000Z", 
  "msg": [
   "Document the fact that the FileItem.write() method is only guaranteed to", 
   "work once for each file item. This restriction is a compromise that allows", 
   "for significant performance gain in the case that an implementation uses a", 
   "disk file for temporary storage, and uses file renaming to implement the", 
   "write() method. The only cost of this restriction is that multiple calls", 
   "to write() for the same file item -- an unlikely requirement in any case", 
   "-- would fail. (Bug #19369, reported by Thierry De Leeuw)", 
   "Also document that the value returned by FileItem.getName() is dependent", 
   "on the browser, or other client, and may or may not include the full path", 
   "to the uploaded file, since RFC 1867 is silent on the issue."
  ], 
  "revision_id": "133348"
 }, 
 {
  "author": "martinc", 
  "date": "2003-05-05T05:47:32.000000Z", 
  "msg": [
   "Add real documentation for the vast majority of uses of FileUpload, and a", 
   "placeholder for the documentation of how to customise it. Also updated the", 
   "To Do list to reflect where we are now."
  ], 
  "revision_id": "133347"
 }, 
 {
  "author": "martinc", 
  "date": "2003-05-03T04:47:38.000000Z", 
  "msg": [
   "Add a unit test for multiple writes beyond the threshold, and fix a bug", 
   "where thresholdReached() was being called for each write beyond the", 
   "threshold, instead of only the first time the threshold is exceeded.", 
   "Reported by Robert Priest. Thanks!"
  ], 
  "revision_id": "133346"
 }, 
 {
  "author": "martinc", 
  "date": "2003-04-29T05:26:22.000000Z", 
  "msg": [
   "Update to extend generic Commons Maven build."
  ], 
  "revision_id": "133345"
 }
]