[
 {
  "author": "martinc", 
  "date": "2004-10-31T05:21:43.000000Z", 
  "msg": [
   "Substantial refactoring and additions:", 
   "* The core package is now independent of servlet / portlet / other", 
   "distinctions, as well as persistence schemes, other than deprecated", 
   "classes and methods retained for backwards compatibility.", 
   "* Servlet specific functionality has been moved to a new 'servlet' package.", 
   "Existing users should migrate to this as soon as possible, since the", 
   "servlet specific functionality in the generic package will be removed in", 
   "the release after FileUpload 1.1.", 
   "* Support for portlets (JSR 168) has been added, in a new 'portlet'", 
   "package. This is not well tested at this point, and feedback would be", 
   "very much appreciated. (This also resolves bug #23620.)", 
   "* The disk-based file item implementation has been moved into a 'disk'", 
   "package, and renamed from Default* to Disk* to reflect what it really is.", 
   "The Default* classes have been retained in the top level package for", 
   "backwards compatibility, but are now deprecated, and will be removed in", 
   "the release after FileUpload 1.1.", 
   "* The isMultipartRequest method is an unfortunate casualty of this", 
   "refactoring. That method should really be moved to ServletFileUpload, but", 
   "since the method is static, it can only exist in either FileUploadBase or", 
   "ServletFileUpload. Backwards compatibility dictates the former for now,", 
   "but the latter is the desired state, which implies some future breakage.", 
   "Fair warning..."
  ], 
  "revision_id": "133399"
 }, 
 {
  "author": "martinc", 
  "date": "2004-10-31T02:03:47.000000Z", 
  "msg": [
   "Bug #26194: Specify the encoding (ISO-8859-1) when converting the boundary", 
   "to a byte array."
  ], 
  "revision_id": "133398"
 }, 
 {
  "author": "martinc", 
  "date": "2004-10-29T04:17:23.000000Z", 
  "msg": [
   "Convert to Sun coding guidelines."
  ], 
  "revision_id": "133397"
 }, 
 {
  "author": "martinc", 
  "date": "2004-10-25T04:18:51.000000Z", 
  "msg": [
   "DeferredFileOutputStream moved to Commons IO."
  ], 
  "revision_id": "133396"
 }, 
 {
  "author": "martinc", 
  "date": "2004-10-17T00:58:35.000000Z", 
  "msg": [
   "Bug #30061 - Workaround for Mac IE5 bug. Thanks to Justin Sampson for the", 
   "patch and tests for this vexing issue."
  ], 
  "revision_id": "133395"
 }
]