[
 {
  "author": "reschke", 
  "date": "2012-05-03T14:35:20.733312Z", 
  "msg": [
   "OAK-66: update test exclusions"
  ], 
  "revision_id": "1333478"
 }, 
 {
  "author": "coheigea", 
  "date": "2012-05-03T14:29:12.935166Z", 
  "msg": [
   "More cleanup"
  ], 
  "revision_id": "1333477"
 }, 
 {
  "author": "arkurth", 
  "date": "2012-05-03T14:25:45.331750Z", 
  "msg": [
   "VCL-503", 
   "Updated OS.pm::execute_new. It wasn't handling the arguments correctly if called as an object method and passed a hash reference.", 
   "Added 'ignore_error' argument. This prevents the subroutine from looping and generating warning messages if the command being executed is known to break the SSH connection.", 
   "VCL-413", 
   "Updated Module.pm::create_mn_os_object to populate the 'noimage' image info in the DataStructure object created for the management node. This prevents errors in case anything attempt to access image info.", 
   "VCL-580", 
   "Changed order of Linux.pm::pre_capture to configure rc-local after configuring the external SSH service. The rc-local code was failing when capturing a base image because the ext_sshd file didn't exist.", 
   "VCL-545", 
   "Updated libvirt.pm::initialize. It wasn't returning false if it failed.", 
   "Fixed problem with copy_vmdk. Under OS's other than Fedora 16, the qemu-img utility can't copy a vmdk split into multiple files. The workaround is to first convert them to raw files, then copy them.", 
   "VCL-30", 
   "Removed check to see if OS module implements is_user_connected in reserved.pm. This is now in OS.pm so all OS's implement it.", 
   "Removed check_connection subroutine from utils.pm. It is no longer called -- replaced by code in OS modules.", 
   "Other", 
   "Updated OS.pm::create_text_file to only enclose the file path in quotes if it contains a space. If the path contains ~ and is enclosed in quotes, the home directory isn't interpreted.", 
   "Moved copy_file subroutine from Linux.pm to OS.pm since it may be used on other OS's."
  ], 
  "revision_id": "1333476"
 }, 
 {
  "author": "andy", 
  "date": "2012-05-03T14:24:08.265364Z", 
  "msg": [
   "Deprecate (short term) operations that don't work well with XSD datetime/duration operations."
  ], 
  "revision_id": "1333475"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2012-05-03T14:23:36.769402Z", 
  "msg": [
   "don't forget NoClassDefFoundError which is not an exception"
  ], 
  "revision_id": "1333474"
 }
]