[
 {
  "author": "rgoers", 
  "date": "2012-05-06T05:35:47.356587Z", 
  "msg": [
   "Add test for log4j 1.2 bug 24159"
  ], 
  "revision_id": "1334558"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-05-06T04:35:51.842055Z", 
  "msg": [
   "[jira] [HBASE-5494] [89-fb] Table-level locks for schema changing operations.", 
   "Author: avf", 
   "Summary:", 
   "Since concurrent modification (e.g., disabling and dropping a table under", 
   "creation) could leave a cluster in an inconsistent state, we need table-level", 
   "locks for schema changing operations.", 
   "A ZooKeeper-based distributed lock has been implemented that", 
   "attempts to create a persistent ZNode (one ZNode per entity being locked, i.e.,", 
   "one per table) if one does not exist. Currently in case a master crashes while", 
   "holding the lock, the lock must be manually removed using the ZooKeeper command", 
   "line (locks being stored in \"/hbase/tableLock/\").", 
   "The locks implemented are not fair or re-entrant. RecoverableZooKeeper is used", 
   "to correctly handle connection loss.", 
   "To test the locks, InjectionHandler and InjectionEvent have been introduced,", 
   "allowing for injection of arbitrary events, in this case adding delays during", 
   "schema changing operations as to induce a race condition.", 
   "Future work involves automatically deleting stale lock ZNodes upon server", 
   "recovery (providing the attempted operations are not resumed), adding metrics", 
   "around locks (e.g., list all locks held).", 
   "Task ID: #766044", 
   "Blame Rev:", 
   "Reviewers: kannan, mbautin, liyintang, JIRA", 
   "CC:", 
   "Test Plan:", 
   "1) Unit tests:", 
   "To verify the locks themselves work, invoke TestZKDistributedLock unit test. To", 
   "verify whether or not locks prevent race conditions in schema modification,", 
   "invoke the TestSchemaModificationLocks unit test.", 
   "2) Stress test:", 
   "This can also be stress tested on a realistic cluster by launching many", 
   "concurrent modifications and verifying that they are serialized, and profile", 
   "the wait times for different locks.", 
   "Revert Plan:"
  ], 
  "revision_id": "1334557"
 }, 
 {
  "author": "arielch", 
  "date": "2012-05-06T04:21:20.514640Z", 
  "msg": [
   "Use relative URL"
  ], 
  "revision_id": "1334556"
 }, 
 {
  "author": "arielch", 
  "date": "2012-05-06T04:21:12.715294Z", 
  "msg": [
   "New files ready for Spanish translation of the site"
  ], 
  "revision_id": "1334555"
 }, 
 {
  "author": "arielch", 
  "date": "2012-05-06T04:20:23.830515Z", 
  "msg": [
   "Add social media in the action list"
  ], 
  "revision_id": "1334554"
 }
]