[
 {
  "author": "sebb", 
  "date": "2012-05-04T21:48:40.497005Z", 
  "msg": [
   "It seems one has to specify each visibility modifier separately"
  ], 
  "revision_id": "1334203"
 }, 
 {
  "author": "robweir", 
  "date": "2012-05-04T21:47:24.897649Z", 
  "msg": [
   "Update branding"
  ], 
  "revision_id": "1334202"
 }, 
 {
  "author": "jleroux", 
  "date": "2012-05-04T21:46:25.840968Z", 
  "msg": [
   "A slightly modified patch from Ankit Jain \"Error on View Facility Inventory Items Details Page\" https://issues.apache.org/jira/browse/OFBIZ-4851", 
   "Error on https://demo-trunk.ofbiz.apache.org:8443/facility/control/ViewFacilityInventoryItemsDetails Page, when you select Report Type - \"By Inventory Item\" or \"By Product\" its throwing error.", 
   "org.ofbiz.widget.screen.ScreenRenderException: Error rendering screen component://common/widget/CommonScreens.xml#GlobalDecorator: java.lang.IllegalArgumentException: Return value from use-when condition eval was not a Boolean: null [null] on the field inventoryItemId of form ListFacilityInventoryItemsDetailsByItem (Return value from use-when condition eval was not a Boolean: null [null] on the field inventoryItemId of form ListFacilityInventoryItemsDetailsByItem)", 
   "jleroux: I supposed it was related to recent changes on scripts language, but was not sure. So I searched for ${bsh:* type=\"Boolean\"/> and found some others of the same kind: in UpdateProductFacilityLocations, FindProject, sprintBacklogListItems forms and more in scrumForms.xml. I tried with UpdateProductFacilityLocations & FindProject but surprisingly did not reproduce the problem. At this stage I gave up...", 
   "Sligth changes from Ankit's patch: I simply used real ' instead of &quot; and reformatted to make things more legible"
  ], 
  "revision_id": "1334201"
 }, 
 {
  "author": "sebb", 
  "date": "2012-05-04T21:44:39.296602Z", 
  "msg": [
   "Javadoc (checkstyle)"
  ], 
  "revision_id": "1334200"
 }, 
 {
  "author": "hsaputra", 
  "date": "2012-05-04T21:44:16.693783Z", 
  "msg": [
   "SHINDIG-1548 Simplify temp var name"
  ], 
  "revision_id": "1334199"
 }
]