[
 {
  "author": "bvahdat", 
  "date": "2012-05-05T10:53:53.592258Z", 
  "msg": [
   "Unblocked revisions 1300914 via svnmerge", 
   "........", 
   "r1300914 | bvahdat | 2012-03-15 12:15:06 +0100 (Do, 15 Mär 2012) | 1 line", 
   "Fixed the failed build because of camel-msv dependencies while using Maven 3.0.4.", 
   "........"
  ], 
  "revision_id": "1334393"
 }, 
 {
  "author": "mturk", 
  "date": "2012-05-05T10:49:41.133163Z", 
  "msg": [
   "Make sure address is correctly resolved"
  ], 
  "revision_id": "1334392"
 }, 
 {
  "author": "aadamchik", 
  "date": "2012-05-05T10:48:40.264644Z", 
  "msg": [
   "CAY-1700 Split long DISJOINT_BY_ID prefetch query on several smaller queries", 
   "testing edge cases", 
   "fixing endless loop on non-positive value in the incrementalfaultlist"
  ], 
  "revision_id": "1334391"
 }, 
 {
  "author": "jalkanen", 
  "date": "2012-05-05T10:41:47.190330Z", 
  "msg": [
   "Set proper SVN tag for source zip build."
  ], 
  "revision_id": "1334390"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-05-05T10:38:21.888955Z", 
  "msg": [
   "[master] [0.89-fb] changes to ProcessServerShutdown to make things more robust", 
   "Summary:", 
   "Various improvements to the ProcessServerShutdown to make it more robust", 
   "(i) Enable scanMetaRegion to return status to know when we fail.", 
   "Currently, if an error occurs during scanMetaRegions, we print a log", 
   "message and silently move on as if everything went well.", 
   "Modifying the logic to enable retry in this case.", 
   "(ii) Changing the logic of when we \"clear\" metaRegions", 
   "- do it one at a time, as soon as we process a metaRegion instead", 
   "of doing it all at once at the end.", 
   "(currently should not change the behavior, since there seem to be", 
   "no exceptions thrown in between setUnassigned).", 
   "(iii) Allow the higher layer to handle master closing. Currently, if we", 
   "detect that the master is closing, we consider the operation \"success\" even", 
   "if it does not finish. This is wrong/weird.", 
   "Going forward, we will mark it \"delayed\".", 
   "The higher layer is going to quit the loop, when it detects that the master", 
   "is closing, so this also wouldn't change any behavior.", 
   "(iv) Block on root to be available, only if we are going scan root (i.e not", 
   "already rescanned)", 
   "Test Plan:", 
   "tbd.  mvn test on mr", 
   "Reviewers: pkhemani, kannan, liyintang", 
   "Reviewed By: pkhemani", 
   "CC: hbase-eng@, pchakka, tao-diffs@lists", 
   "Differential Revision: https://phabricator.fb.com/D455869", 
   "Task ID: 1037511"
  ], 
  "revision_id": "1334389"
 }
]