[
 {
  "author": "suresh", 
  "date": "2012-05-08T19:08:53.565932Z", 
  "msg": [
   "HADOOP-6546. BloomMapFile can return false negatives. Contributed by Clark Jefcoat."
  ], 
  "revision_id": "1335703"
 }, 
 {
  "author": "veithen", 
  "date": "2012-05-08T19:08:42.027805Z", 
  "msg": [
   "Added a more precise specification of the contract for OMDataSource#serialize(XMLStreamWriter)."
  ], 
  "revision_id": "1335702"
 }, 
 {
  "author": "lcorneliussen", 
  "date": "2012-05-08T19:08:14.350431Z", 
  "msg": [
   "[NPANDAY-210, NPANDAY-418, NPANDAY-582] Deprecate includeSources in favor of include/exclude patterns + More", 
   "o now including the sources directly without copying them", 
   "o handling additional source directories", 
   "o make test and compile sources exclude each other if in the same dir"
  ], 
  "revision_id": "1335701"
 }, 
 {
  "author": "markt", 
  "date": "2012-05-08T19:07:09.791543Z", 
  "msg": [
   "It appears that pausing requests for a Context during reload was relying on the mapper not being cleaned up correctly. The Lifecycle refactoring cleaned up the mapper registrations and broke the handling of paused requests. This commit restores that functionality and extends it. The key changes are:", 
   "- Contexts are no longer from the mapper if they are stopped while they are paused", 
   "- The CoyoteAdapter pauses for 1s if a request is mapped to a paused Context and then tries to re-map it. This replaces the reloading handling in the StandardContextValve", 
   "- The reload handling has been removed from the StandardContextValve", 
   "- Editing a watched resource now triggers a reload (that pauses requests received during the reload) rather than a stop/start which will return 404s for requests received while the context is stopping and starting", 
   "As with previous iterations of this feature it is impossible to completely eliminate the chances of a 404 without a fair amount of locking that would slow things down unnecessarily in production."
  ], 
  "revision_id": "1335700"
 }, 
 {
  "author": "robweir", 
  "date": "2012-05-08T19:01:17.914520Z", 
  "msg": [
   "Reassociate GA code"
  ], 
  "revision_id": "1335699"
 }
]