[
 {
  "author": "markt", 
  "date": "2012-05-10T17:44:49.137353Z", 
  "msg": [
   "Fix a problem whereby if the poller was under low but consistent load (>1 request/per second and always less than 1s between requests) timeouts never took place.", 
   "After the change, timeouts will be processed every X seconds where pollerTimeout <= X <= (timoutInterval + pollerTimeout + time taken to process timeouts)", 
   "Note the default values for pollerTimeout and timeoutInterval are 1000ms"
  ], 
  "revision_id": "1336813"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2012-05-10T17:41:19.652398Z", 
  "msg": [
   "TOMEE-189 separate beanmanager of 'common classloader of ear' and the 'web classloader of ear'"
  ], 
  "revision_id": "1336812"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-05-10T17:41:06.352234Z", 
  "msg": [
   "[master] Address the Duplicate assignment case so that we send the messages to the RS", 
   "Author: aaiyer", 
   "Summary:", 
   "Master detects duplicate assignment upon processing ZK node updates.", 
   "Unforutnately, the messages generated by the master for the RS to shutdown", 
   "the region never used to be delivered to the RS because the method was not", 
   "called during the serverReport.", 
   "Instead of logging and error and ignore the message. We will hold them, and", 
   "deliver it to the RS during the next serverReport.", 
   "Test Plan: tbd: run unit tests, test out on dev server/tm002", 
   "Reviewers: kannan, pkhemani", 
   "CC: liyintang, hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D466667"
  ], 
  "revision_id": "1336811"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-05-10T17:40:42.136313Z", 
  "msg": [
   "[89-int] [HBASE-5579] Pull HBASE-5579 : A Delete Version could mask other values", 
   "Author: aaiyer", 
   "Summary:", 
   "Fix issues with using TS=0 as a sentinel value in the ScanDeleteTracker.", 
   "Description:", 
   "Currently, Timestamp 0 is  used by the deleteTracker to indicate that there are no active deletes in the DeleteTracker.", 
   "This is wrong because timestamp 0 is a valid timestamp. Bugs include:", 
   "(ii) KV(ts=0) gets deleted whenever there is any deleteVersion (ts>0).", 
   "(i) deleteColumn(0) gets ignored because the ScanDeleteTracker is indistinguishable from the state where there were no deletes..", 
   "Test Plan:", 
   "pulling in from open source. Testing with MR unit tests.", 
   "some tests failed, reran them locally. Only test that still fails:", 
   "TestRegionStateOnMasterFailure", 
   "Reviewers: kannan, kranganathan", 
   "Reviewed By: kannan", 
   "CC: nzhang, hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D431016"
  ], 
  "revision_id": "1336810"
 }, 
 {
  "author": "mamta", 
  "date": "2012-05-10T17:40:08.626324Z", 
  "msg": [
   "DERBY-5681 When a foreign key constraint on a table is dropped, the associated statistics row for the conglomerate is not removed", 
   "Backporting to 10.7"
  ], 
  "revision_id": "1336809"
 }
]