[
 {
  "author": "vines", 
  "date": "2012-05-15T21:43:29.558157Z", 
  "msg": [
   "Merging ACCUMULO-585"
  ], 
  "revision_id": "1338908"
 }, 
 {
  "author": "mikemccand", 
  "date": "2012-05-15T21:42:50.385533Z", 
  "msg": [
   "add iWork test case"
  ], 
  "revision_id": "1338907"
 }, 
 {
  "author": "vines", 
  "date": "2012-05-15T21:41:36.069658Z", 
  "msg": [
   "ACCUMULO-585 - Not quite complaining loudly, but being helpful (but obstructive)"
  ], 
  "revision_id": "1338906"
 }, 
 {
  "author": "mamta", 
  "date": "2012-05-15T21:38:58.102797Z", 
  "msg": [
   "Backporting 2 jiras to 10.4 with some manual changes as described below", 
   "DERBY-5681 When a foreign key constraint on a table is dropped, the associated statistics row for the conglomerate is not removed", 
   "DERBY-4834 Add helper class for working with index statistics in JUnit tests", 
   "Have backported the changes to 10.4 but in trunk , for this jira, we added some tests which use upgrade statistics procedure but since that procedure doesn't exist in 10.4 and before, the new tests for this jira from trunk couldn't be backported to 10.4 without changes. In 10.4, I added those tests to a new class, namely Derby5681Test.java and these tests donot use update statisitcs procedure. But, because of the absence of update statisitcs procedure and DERBY-5702, we can't quite have a statistics row for a constraint which shares a backing index in 10.4 and before. The test in 10.4 will just have a test to drop constraint(that shares a backing index with another constraint) and show that it doesn't break anything. Once DERBY-5702 is fixed and backported to 10.4 and before, we will have a statistics row for a constraint which shares a backing index and we will be able to show that as a fix of this jira, that statistics row will get dropped when the constraint is dropped."
  ], 
  "revision_id": "1338905"
 }, 
 {
  "author": "julianfoad", 
  "date": "2012-05-15T21:35:49.387802Z", 
  "msg": [
   "* subversion/libsvn_client/merge.c", 
   "(single_file_merge_get_file): Simplify the parameter list by taking a", 
   "path-rev instead of separate URL and REV.", 
   "(do_file_merge): Adjust calls."
  ], 
  "revision_id": "1338904"
 }
]