[
 {
  "author": "rwesten", 
  "date": "2012-05-14T19:43:22.999783Z", 
  "msg": [
   "STANBOL-612: UnitTest helper for the Stanbol Enhancement Structure", 
   "* added tests for TextAnnotations, EntityAnnotations and Enhancements mainly by collection/extending tests already done by unit tests of different engines", 
   "* applied tests to Engines", 
   "* re-enabled testing for the Named Entity Tagging Engine", 
   "* corrected two small issues with the Zemanta Engine (TypedLiteral for labels and missing selection context)", 
   "Missing:", 
   "* I would like to add tests for TopicEnhancements", 
   "Note: The added tests do break the the CELI NER engine (STANBOL-583) as of the latest patch. While I have (locally) already fixed some of the issues (missing selection-context, PlainLiterals for labels, xsd:int for start/end positions) there are still some remaining issues that might be XML entity and/or char encoding related (wrong selected texts, wrong start/end indexes)."
  ], 
  "revision_id": "1338363"
 }, 
 {
  "author": "mpoole", 
  "date": "2012-05-14T19:43:19.658437Z", 
  "msg": [
   "added padding around the logo and removed the size restriction"
  ], 
  "revision_id": "1338362"
 }, 
 {
  "author": "adrianc", 
  "date": "2012-05-14T19:43:18.226997Z", 
  "msg": [
   "Added a utility method to FlexibleMapAccessor.java to test for nested expressions."
  ], 
  "revision_id": "1338361"
 }, 
 {
  "author": "jogep", 
  "date": "2012-05-14T19:42:11.275067Z", 
  "msg": [
   "WW-3815: Dispatching after action phase renders with different stack/TextProvider"
  ], 
  "revision_id": "1338360"
 }, 
 {
  "author": "stsp", 
  "date": "2012-05-14T19:38:21.709277Z", 
  "msg": [
   "Extend an import test to act as a regression test for the fix made in r1205193.", 
   "* subversion/tests/cmdline/import_tests.py", 
   "(import_eol_style): Verify that a mixed-eol style does not result in an", 
   "import error for files which got svn:eol-style=native via auto-props.", 
   "Such files should be normalised during import. This test fails with", 
   "r1205193 backed out."
  ], 
  "revision_id": "1338359"
 }
]