[
 {
  "author": "aconway", 
  "date": "2012-05-16T17:19:48.613005Z", 
  "msg": [
   "QPID-3603: HA don't replicate excluseive, auto-delete, non-timeout queues.", 
   "Such queues don't need to be replicated because they are destroyed when", 
   "as the owning session disconnects, so won't survive a failover.", 
   "This eliminsates managment subscriptio queues from replication."
  ], 
  "revision_id": "1339268"
 }, 
 {
  "author": "cwiklik", 
  "date": "2012-05-16T17:09:57.616125Z", 
  "msg": [
   "UIMA-2388 forgot to commit the change related to preventing uima-as process from self-destructing the jvm via (System.exit())"
  ], 
  "revision_id": "1339267"
 }, 
 {
  "author": "danielsh", 
  "date": "2012-05-16T17:02:23.655344Z", 
  "msg": [
   "Follow-up to r1339262: rename the easter-egg environment variable.", 
   "* Makefile.in", 
   "(INSTALL_EXTRA_TOOLS): s/SVN_TRY_THIS_AT_HOME/SVN_SVNMUCC_IS_SVNSYITF/", 
   "* notes/knobs", 
   "(SVN_TRY_THIS_AT_HOME): Rename to ..", 
   "(SVN_SVNMUCC_IS_SVNSYITF): .. this, and fill in the entry."
  ], 
  "revision_id": "1339266"
 }, 
 {
  "author": "struberg", 
  "date": "2012-05-16T16:55:49.383741Z", 
  "msg": [
   "EXTCDI-285 remove <body> branding feature again", 
   "It turned out that adding a bgcolor and similar causes", 
   "flickering on a few browsers. Thus I removed this", 
   "feature again."
  ], 
  "revision_id": "1339265"
 }, 
 {
  "author": "rajith", 
  "date": "2012-05-16T16:55:08.404866Z", 
  "msg": [
   "QPID-4001 Added the interfaces for review. Kept it in a separate module", 
   "for folks who like to review the code in their editor. Added a", 
   "client-jms module to move the new destination work and house the new jms", 
   "work. This makes reviewing a bit easy and also allows the possiblity of", 
   "the new and old client code to live side by side until we make a", 
   "decision to archive the old client. At some point we need to trim the", 
   "common module to contain code that is truly common to both broker and", 
   "clients."
  ], 
  "revision_id": "1339264"
 }
]