[
 {
  "author": "rmuir", 
  "date": "2012-05-21T21:21:54.018370Z", 
  "msg": [
   "LUCENE-4055: remove .per file, instead use fieldinfo metadata to resolve fieldnames -> posting formats"
  ], 
  "revision_id": "1341208"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2012-05-21T21:14:47.863618Z", 
  "msg": [
   "SLING-2002 Improvements:", 
   "- Local paths in the sitemap must be absolute", 
   "- Consoldite support for referenced pages of the", 
   "form refs.pagename.... with properties path being", 
   "the site link, headers the page headers, and content", 
   "the page content", 
   "- convert {excerpt-include} to link with excerpt", 
   "header using Django template using refs....", 
   "- resolve pagename of refs.pagename... using File::Find", 
   "(first matching file is found; page names in the site", 
   "should thus be unique)", 
   "- add more info to readme.txt"
  ], 
  "revision_id": "1341207"
 }, 
 {
  "author": "aharui", 
  "date": "2012-05-21T21:12:55.480372Z", 
  "msg": [
   "Remove dependency on flex-messaging-common.jar.", 
   "Also update project files to not use relative paths.  Relative paths don't provide enough flexibility in the location of your files.  Added FLEX_HOME variable to project files."
  ], 
  "revision_id": "1341206"
 }, 
 {
  "author": "jmhsieh", 
  "date": "2012-05-21T21:02:31.597331Z", 
  "msg": [
   "HBASE-5757 TableInputFormat should handle as many errors as possible (Jan Lukavsky)"
  ], 
  "revision_id": "1341205"
 }, 
 {
  "author": "mamta", 
  "date": "2012-05-21T21:02:27.727821Z", 
  "msg": [
   "DERBY-4631 Wrong join column returned by right outer join with NATURAL or USING and territory-based collation", 
   "To recap this issue, SQL:2003 says that the join columns in a natural join or in a named columns join should be added to the select list by coalescing the column from the left table with the column from the right table", 
   "Derby has it's on logic to retrieve the join column values. It always picks up join column's value from the left table when we are working with natural left outer join and it picks up the join column's value from the right table when we are working with natural right outer join.", 
   "But this logic does not work for all cases for right outer join. The fix provided in this patch will pick the join column's value based on following logic(this logic mimics the functionality of COALESCE)", 
   "1)if the left table's column value is null then pick up the right table's column's value.", 
   "2)If the left table's column value is non-null, then pick up that value"
  ], 
  "revision_id": "1341204"
 }
]