[
 {
  "author": "mikem", 
  "date": "2012-05-31T18:40:24.265570Z", 
  "msg": [
   "DERBY-5494 Same value returned by successive calls to a sequence generator flanking an unorderly shutdown.", 
   "DERBY-5780 identity column performance has degredated", 
   "backporting change #1344065 from trunk to 10.9 branch.", 
   "The previous patch for DERBY-5494 had the unintended affect of forcing a", 
   "synchronous write for all nested user transactions at abort time.  This", 
   "in turn caused identity column inserts to have one synchronous write per", 
   "insert as the nested user transaction is destroyed for each insert which", 
   "does an abort each time.", 
   "To solve this interfaces were changed so that calling code could set the", 
   "default commit sync behavior when the transaction was committed rather than", 
   "count on the \"type\" of transaction.  Nested user transactions used for identity", 
   "columns have default set to not sync, and the rest of the nested user", 
   "transactions default to syncing.  Behavior of other types of transactions", 
   "should not be affected.  User transactions still sync by default and internal", 
   "and ntt's still default to not sync."
  ], 
  "revision_id": "1344858"
 }, 
 {
  "author": "cwiklik", 
  "date": "2012-05-31T18:36:17.840342Z", 
  "msg": [
   "UIMA-2417 temp rename"
  ], 
  "revision_id": "1344857"
 }, 
 {
  "author": "fchrist", 
  "date": "2012-05-31T18:34:49.673904Z", 
  "msg": [
   "Revert change after last release try - reset to 0.10.0-incubating-SNAPSHOT"
  ], 
  "revision_id": "1344856"
 }, 
 {
  "author": "cwiklik", 
  "date": "2012-05-31T18:32:59.512098Z", 
  "msg": [
   "UIMA-2417 move contents of uima-as project up one level the svn directory tree"
  ], 
  "revision_id": "1344855"
 }, 
 {
  "author": "mikemccand", 
  "date": "2012-05-31T18:32:55.318039Z", 
  "msg": [
   "LUCENE-4077: expose max score and per-group (parent) scores in TopGroups returned by ToParentBlockJoinCollector"
  ], 
  "revision_id": "1344854"
 }
]