[
 {
  "author": "kkolinko", 
  "date": "2012-05-30T01:30:58.664481Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=53322", 
   "Follow JavaBeans specification when converting setter method name into property name for resource injection."
  ], 
  "revision_id": "1344068"
 }, 
 {
  "author": "ningjiang", 
  "date": "2012-05-30T01:29:58.685285Z", 
  "msg": [
   "CXF-4346 Supports to set the messageType from the jms URI"
  ], 
  "revision_id": "1344067"
 }, 
 {
  "author": "kkolinko", 
  "date": "2012-05-30T00:51:22.063364Z", 
  "msg": [
   "Merged revision 1344063 from tomcat/trunk:", 
   "(Followup to r1343721) tabs -> spaces."
  ], 
  "revision_id": "1344066"
 }, 
 {
  "author": "mikem", 
  "date": "2012-05-30T00:47:27.109602Z", 
  "msg": [
   "DERBY-5494 Same value returned by successive calls to a sequence generator flanking an unorderly shutdown.", 
   "DERBY-5780 identity column performance has degredated", 
   "The previous patch for DERBY-5494 had the unintended affect of forcing a", 
   "synchronous write for all nested user transactions at abort time.  This", 
   "in turn caused identity column inserts to have one synchronous write per", 
   "insert as the nested user transaction is destroyed for each insert which", 
   "does an abort each time.", 
   "To solve this interfaces were changed so that calling code could set the", 
   "default commit sync behavior when the transaction was committed rather than", 
   "count on the \"type\" of transaction.  Nested user transactions used for identity", 
   "columns have default set to not sync, and the rest of the nested user transactions", 
   "default to syncing.  Behavior of other types of transactions should not", 
   "be affected.  User transactions still sync by default and internal and ntt's still", 
   "default to not sync."
  ], 
  "revision_id": "1344065"
 }, 
 {
  "author": "rgodfrey", 
  "date": "2012-05-30T00:33:41.903096Z", 
  "msg": [
   "Proton-j: implement isReadable/isWritable"
  ], 
  "revision_id": "1344064"
 }
]