[
 {
  "author": "rmannibucau", 
  "date": "2012-06-01T15:28:56.311166Z", 
  "msg": [
   "managing beforeStop to call preDestroy from the assembler, it currently close all entitymanagers because some providers needs to do it before the classloaders are stopped"
  ], 
  "revision_id": "1345238"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2012-06-01T15:28:48.317957Z", 
  "msg": [
   "Update changelog"
  ], 
  "revision_id": "1345237"
 }, 
 {
  "author": "stefan", 
  "date": "2012-06-01T15:25:42.121549Z", 
  "msg": [
   "OAK-77: Consolidate Utilities", 
   "move JsonBuilder utility class to the oak-core component where it's referenced"
  ], 
  "revision_id": "1345236"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2012-06-01T15:25:23.713258Z", 
  "msg": [
   "FELIX-2411 Update to parent POM 2.1 and fix license files"
  ], 
  "revision_id": "1345235"
 }, 
 {
  "author": "suat", 
  "date": "2012-06-01T15:25:02.410174Z", 
  "msg": [
   "STANBOL-498: File based implementation of Contenthub store.", 
   "For the time being this commit covers the requirements for file system based implementation of the Store interface defined in STANBOL-498.", 
   "Revision management:", 
   "When a content item is stored or deleted its revision is set as the system time at the time of the operation. Revisions regarding the content items are stored in an Apache Derby table.", 
   "Revision management is thought to be used by the indexing part of Contenthub in a way that different semantic implementations would query for the changes in the store as of a specific revision and update the index accordingly in an automatic way. In case there would be large number of changes in the store, store interface provides retrieval of changes in an iterative way by giving the suitable offset and batch size values.", 
   "Serialization / Deserialization:", 
   "For the time being, content items are serialized within a directory as zip files. Currently there are (de)serializers for TripleCollection and Blob parts of content items. Each such part become an entry within the zip file. It is possible register (de)serializers to the environment for specific types of content parts.", 
   "Other:", 
   "This implementation also keeps track of the data to be presented in the HTML interface i.e the recently stored content items and some basic information about them such as enhancement count, mimetype, etc."
  ], 
  "revision_id": "1345234"
 }
]