[
 {
  "author": "sijie", 
  "date": "2012-06-12T15:31:49.160717Z", 
  "msg": [
   "fix typos in bookkeeper 4.1.0 release documents"
  ], 
  "revision_id": "1349393"
 }, 
 {
  "author": "andygumbrecht", 
  "date": "2012-06-12T15:31:10.298998Z", 
  "msg": [
   "Added new 'multipulse' discovery, and a few fixes.", 
   "Fixes:", 
   "ServiceDaemon.java - Must close the server socket even if it does not get a lock.", 
   "ServiceManager.java - Revert 'conf.d' in path. If this is a 'tomee' requirement then it needs to be checked?", 
   "EjbDaemon.java - Ensure streams are closed on failure. Log client induced errors as warning (Should probably add error filtering).", 
   "SocketConnectionFactory.java - Use configured timeout variable. Also added a configurable default socket connection timeout of 150ms (Which is long enough to connect to just about any server on the planet over TCP/IP these days).", 
   "MultiPulse:", 
   "For use where client and server can 'multicast' and a constant heartbeat is not required or wanted.", 
   "The server listens on a defined multicast channel for a client request (A single pulse).", 
   "A client sends a pulse (packet) on the defined channel.", 
   "The server responds with a crafted packet which 'can' contain all known hosts (for multihomed systems use '0.0.0.0' or '[::]' for the ejbd 'discovery' property), or just the defined value.", 
   "The client attempts connections to the server hosts until a valid connection is made, discarding any bad URIs."
  ], 
  "revision_id": "1349392"
 }, 
 {
  "author": "tommaso", 
  "date": "2012-06-12T15:29:39.404716Z", 
  "msg": [
   "[DIRECTMEMORY-89] - adapting solrconfig, reenabling integration test, fixing init() method of SolrOffHeapCache"
  ], 
  "revision_id": "1349391"
 }, 
 {
  "author": "jbonofre", 
  "date": "2012-06-12T15:23:28.087314Z", 
  "msg": [
   "[KARAF-1521] Add a default repository for the add-features-to-repo goal"
  ], 
  "revision_id": "1349390"
 }, 
 {
  "author": "aconway", 
  "date": "2012-06-12T15:22:46.648830Z", 
  "msg": [
   "NO-JIRA: Fix failing unit_test, updated for changes in log format.", 
   "The test had not been updated to account for changes to log format, adding", 
   "[Category] to front of messages."
  ], 
  "revision_id": "1349389"
 }
]