[
 {
  "author": "humbedooh", 
  "date": "2012-06-12T07:17:21.929410Z", 
  "msg": [
   "Backport from trunk: Add a note that VirtualDocumentRoot will override DocumentRoot in the current scope (and thus also in all virtual hosts if defined in the global server scope)"
  ], 
  "revision_id": "1349158"
 }, 
 {
  "author": "andy", 
  "date": "2012-06-12T07:16:17.349896Z", 
  "msg": [
   "Building from maven requires the whole source tree."
  ], 
  "revision_id": "1349157"
 }, 
 {
  "author": "orw", 
  "date": "2012-06-12T07:13:54.197233Z", 
  "msg": [
   "adding zh-CN, zh-TW, nl, fr and de to OOo 3.3 update servce"
  ], 
  "revision_id": "1349156"
 }, 
 {
  "author": "bsullivan", 
  "date": "2012-06-12T07:10:03.551442Z", 
  "msg": [
   "TRINIDAD-2273 Allow scheme for application to control UIViewRoot caching logic", 
   "When UIViewRoot caching is enabled, the cached UIViewRoots can consume considerable memory across all of the users. The proposal is to extend the allowed values of the Servlet Initialization parameter:", 
   "<param-name>org.apache.myfaces.trinidad.CACHE_VIEW_ROOT</param-name>", 
   "to support, in addition to the current \"true\", and \"false\" values, the values of:", 
   "\"strong\" UIViewRoot caching is enabled and always uses strong references to the cached UIViewRoot", 
   "\"soft\" UIViewRoot caching is enabled and always uses soft references to the cached UIViewRoot, allowing the cached UIViewRoots to be purged if under memory pressure", 
   "<classname> The fully qualified classname of an implementation of org.apache.myfaces.trinidad.util.ref.PseudoReferenceFactory returning any desired PseudoReference implementation.", 
   "In addition, the value of \"true\" now uses the value of a PseudoReferenceFactory implementation registered under the service name \"org.apache.myfaces.trinidad.CACHE_VIEW_ROOT\" if one is registered, otherwise, it uses a strong reference, to duplicate the current functionality"
  ], 
  "revision_id": "1349155"
 }, 
 {
  "author": "gnodet", 
  "date": "2012-06-12T07:04:22.524098Z", 
  "msg": [
   "[maven-release-plugin] prepare for next development iteration"
  ], 
  "revision_id": "1349154"
 }
]