[
 {
  "author": "jstrachan", 
  "date": "2002-06-24T11:17:09.000000Z", 
  "msg": [
   "First cut of the http tag library using commons-httpclient to script HTTP operations inside Jelly.", 
   "Its not quite working yet but its close.", 
   "When this library is working properly we should be able to use this to perform HTTP based SOAP scripting and unit testing.", 
   "For example we should be able to do", 
   "<babelfish:translate from=\"en\" to=\"fr\">Hello there my friend</babelfish:translate>", 
   "and for the tag to do all the SOAP and HTTP malarkey inside the tag definition, which could be written in Jelly script itself.", 
   "Similarly we could build macros for testing web applications. Maybe iterating over test data in XML documents to test that web applications perform properly.", 
   "e.g.", 
   "<x:forEach select=\"$tests/testcase\">", 
   "<x:set var=\"url\" select=\"string(url)\"/>", 
   "<test:httpGet url=\"${url}\" expects=\"100\"/>", 
   "etc."
  ], 
  "revision_id": "134999"
 }, 
 {
  "author": "werken", 
  "date": "2002-06-24T04:43:45.000000Z", 
  "msg": [
   "Allowing for descriptions and default targets."
  ], 
  "revision_id": "134998"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-06-23T01:29:34.000000Z", 
  "msg": [
   "Added the first cut of the validate tag library.", 
   "This tag library is used to perform XML validation using a variety of schema languages such as DTDs, XML Schema, RelaxNG, Relax or TREX.", 
   "The tag library uses the JARV API which abstracts away the details of different validation libraries and schemas and uses the MSV library from Sun as the default runtime implementation.", 
   "The RelaxNG demo works fine though DTDs are not currently working yet.", 
   "More work is required to support neat filtering (indeed we need to be able to construct Jelly-SAX-Filters using XMLFilter from SAX)."
  ], 
  "revision_id": "134997"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-06-22T23:56:11.000000Z", 
  "msg": [
   "added a bunch of JMS example jelly scripts that demonstrate the JMS tag library in action"
  ], 
  "revision_id": "134996"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-06-22T23:55:42.000000Z", 
  "msg": [
   "added a bunch of JMS examples to the build as targets"
  ], 
  "revision_id": "134995"
 }
]