[
 {
  "author": "jstrachan", 
  "date": "2002-10-01T16:45:23.000000Z", 
  "msg": [
   "Added patch to <j:file> so that a variable can be specified instead of a file name and the body will be turned into a variable string.", 
   "Its not a brilliantly named tag but the following could generate some XML as a String", 
   "<j:file var=\"foo\">", 
   "<some>", 
   "<x m=\"l\"/>", 
   "</some>", 
   "<j:file>", 
   "I now have a value ${foo}"
  ], 
  "revision_id": "135259"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-01T16:43:56.000000Z", 
  "msg": [
   "Applied Jason Horman's patches to add support in BeanShell for modifying Jelly's context as well as adding a new <script> tag", 
   "<script>", 
   "System.out.println(\"hello there\" + foo):", 
   "</script>", 
   "Also refactored a little bit the use of the JellyInterpreter for BeanShell so that one is associated with the JellyContext rather than having an evil static."
  ], 
  "revision_id": "135258"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-01T16:11:24.000000Z", 
  "msg": [
   "Applied Jason Horman's patches to add support in BeanShell for modifying Jelly's context as well as adding a new <script> tag", 
   "<script>", 
   "System.out.println(\"hello there\" + foo):", 
   "</script>", 
   "Also refactored a little bit the use of the JellyInterpreter for BeanShell so that one is associated with the JellyContext rather than having an evil static."
  ], 
  "revision_id": "135257"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:59:38.000000Z", 
  "msg": [
   "Regenerated the Ant build file to take into account recent changes in dependencies."
  ], 
  "revision_id": "135256"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:52:28.000000Z", 
  "msg": [
   "Added support in JellySwing for simple TableModels which use any pluggable Jelly Expressions for defining the columns.", 
   "This allows any List of objects to be easily rendered in a table in JellySwing without any programming involved. Its hoped this kind of thing could be ported to SWT too!", 
   "A simple example has been added which will display all the variables in the current context in a table.", 
   "This could be improved somewhat, but shows that a List of property names can be displayed in a table, showing the value, type, row index and the name of the variable; all powered by a List of Strings.", 
   "Another good demo could be to render a table of beans (such as some Maven POM objects) in a table.", 
   "Or to use commons-beanutils or commons-sql to get some DynaBeans and render those in a table using expressions."
  ], 
  "revision_id": "135255"
 }
]