[
 {
  "author": "jstrachan", 
  "date": "2002-10-04T11:28:20.000000Z", 
  "msg": [
   "Committed patches submitted by Jason Horman to provide a decent command line interface using commons-cli to Jelly.", 
   "So usage is like this...", 
   "Usage: jelly [scriptFile] [-script scriptFile -o outputFile  -Dsysprop=syspropval]", 
   "Additional command line options are available in jelly scripts by using the", 
   "commandLine.getOptionValue(optionName) method. Args is also still available.", 
   "context.setVariable(\"args\", args);", 
   "context.setVariable(\"commandLine\", cmdLine);", 
   "Also there's a sample target to demonstrate this in action. Type", 
   "maven demo:cmdline", 
   "and you'll see Jason's test script run, using beanshell in a Jelly script to display the options and system properties etc."
  ], 
  "revision_id": "135269"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-03T18:14:44.000000Z", 
  "msg": [
   "Applied patches to merge TagScript, BeanTagScript and DynaTagScript together into a single class.", 
   "This makes the implementation much simpler, it allows tags to dynamically be created by a TagLibrary that may be a bean Tag or a DyanTag.", 
   "It also simplifies the job of keeping the Script implementations all thread safe.", 
   "BeanTagScript was prematurely optimised which wasn't thread safe."
  ], 
  "revision_id": "135268"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-03T07:52:37.000000Z", 
  "msg": [
   "Added a <j:remove var=\"foo\"/> tag to remove variables as well as a <j:scope> tag which creates a new variable scope for its body.", 
   "So the following can be performed...", 
   "<jelly>", 
   "<scope>", 
   "<set var=\"var1\" />", 
   "<useBean var=\"var2\" />", 
   "</scope>", 
   "<!-- var1 and var2 no longer exist -->", 
   "</jelly>", 
   "Many thanks to Jason Horman for the idea."
  ], 
  "revision_id": "135267"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-03T07:05:38.000000Z", 
  "msg": [
   "After Morgan's suggestion, added some javadoc comments about threading"
  ], 
  "revision_id": "135266"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-02T16:55:04.000000Z", 
  "msg": [
   "Added support for the <j:set> tag to set the value of a String variable to its body without XML-encoding the XML as text.", 
   "So that", 
   "<j:set var=\"foo\" encode=\"false\">", 
   "<some>xml</some>", 
   "</j:set>", 
   "Would generate a String \"\t<some>xml</some>\" rather than encoding the < and > characters.", 
   "I've preserved the current behaviour, that the default should be to encode; though maybe we should change the default? It was fear of braking code that stopped me do it."
  ], 
  "revision_id": "135265"
 }
]