[
 {
  "author": "morgand", 
  "date": "2002-10-16T18:45:27.000000Z", 
  "msg": [
   "fixed naughty wildcard import for CLI"
  ], 
  "revision_id": "135304"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-16T18:17:58.000000Z", 
  "msg": [
   "Added a simple little Jelly library which binds beans to tags. It works similarly to Ant with nested properties so provides a simple way to turn XML into beans.", 
   "While on the surface this may seem over the top when Digester and Betwixt (which is layered on top of Digester) do this perfectly well, using Jelly allows more complex directives like", 
   "* including other files", 
   "* using configurable properties or dynamic values in configuration files. So dynamic expressions can be used to hook-up objects or dynamically turn bits of the config on or off based on runtime properrties", 
   "* the same mechanism can be used inside things like workflow, unit testing, JellySwing etc", 
   "This library could be used to hack together an implementation of Ceki's Joran example for log4j", 
   "http://marc.theaimsgroup.com/?l=jakarta-commons-dev&m=103462608122650&w=2", 
   "Though it'd need 1 or to extra little tags to implement the appender ref and to collect the appenders together into a Map etc.", 
   "Hopefully some of the similar code in the define:bean and define:jellybean libraries could maybe be rationalised a little."
  ], 
  "revision_id": "135303"
 }, 
 {
  "author": "morgand", 
  "date": "2002-10-16T16:18:42.000000Z", 
  "msg": [
   "XMLParser.error(SAXParseException) and XMLParser.fatalError(SAXParseException)", 
   "[but not XMLParser.warning(SAXParseException)] will now throw", 
   "a SAXException by default when no error handler is supplied.  As a result,", 
   "invalid Jelly scripts will now fail when validation is enabled by", 
   "Jelly.setValidateXML(boolean)."
  ], 
  "revision_id": "135302"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-16T12:45:53.000000Z", 
  "msg": [
   "Patch so that the internal TagFactory used by TagLibrary objects to create Tag instances now takes the name and XML attributes.", 
   "This makes support for dynamically created tags, like with Ant, a little easier to support as now a TagLibrary can just directly register a TagFactory."
  ], 
  "revision_id": "135301"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-16T12:42:12.000000Z", 
  "msg": [
   "added some extra debugging code so that expressions describe themselves"
  ], 
  "revision_id": "135300"
 }
]