[
 {
  "author": "jstrachan", 
  "date": "2002-11-21T12:41:23.000000Z", 
  "msg": [
   "I've enabled the JellyUnit test case that Peter wrote and added another to both test for a regular nested <filterset> and one using a refid.", 
   "Also added a fix for it too! The short answer is the problem was due to treating <filter> as a new task rather than a nested property of <filterset>", 
   "Again this is due to the complexity of the Ant behaviour. Sometimes Ant tags are meant to be Tasks, sometimes they are meant to be nested properties, and this can get confusing. I think the correct logic right now is that...", 
   "a tag should be considered task if it is the root node in the tree of Ant tags and the name of the tag is a valid Ant task name, otherwise treat it as a nested property or datatype.", 
   "So the root tag can be a <filterset id=\"...\">. Also there are times when a task shouldn't be treated as a task but instead as a nested property. e.g. <filter> and <manifest> are tasks but should be treated as nested properties."
  ], 
  "revision_id": "135389"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-11-20T22:43:42.000000Z", 
  "msg": [
   "added back the xmlns=\"dummy\" that was originally added in dIons original test. I'd forgotten I'd disabled it when trying to figure out the reason for the bug."
  ], 
  "revision_id": "135388"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-11-20T22:20:21.000000Z", 
  "msg": [
   "Patch applied for the bug found by dIon. Also added a few more test cases to fully test this feature to ensure it doesn't break again.", 
   "The bug essentially was that the <applyTemplates> is often invoked from a different XMLOutput, which needs to be associated with the Stylesheet so that as new <template>s fire they use the correct XMLOutput.", 
   "This is required as things like <j:set> use a different XMLOutput to buffer up its body."
  ], 
  "revision_id": "135387"
 }, 
 {
  "author": "dion", 
  "date": "2002-11-20T06:05:19.000000Z", 
  "msg": [
   "Added inline version of test case"
  ], 
  "revision_id": "135386"
 }, 
 {
  "author": "dion", 
  "date": "2002-11-20T05:54:11.000000Z", 
  "msg": [
   "Added test case to show xmloutput context being lost using apply templates"
  ], 
  "revision_id": "135385"
 }
]