[
 {
  "author": "tabish", 
  "date": "2012-06-29T20:26:32.760518Z", 
  "msg": [
   "Adds a method to allow for sending a receipt on disconnect send."
  ], 
  "revision_id": "1355553"
 }, 
 {
  "author": "mamta", 
  "date": "2012-06-29T20:24:20.142349Z", 
  "msg": [
   "DERBY-5750 Sending an empty string as table name to compress table procedure or empty string as index name to update statistics procedure makes the parser throw an exception.", 
   "Committing changes for DERBY-5750 which will provide following functionality", 
   "a)if schema name is provided as an empty string, we will throw SQLState.LANG_SCHEMA_DOES_NOT_EXIST", 
   "b)if table name is provided as an empty string, we will throw SQLState.LANG_TABLE_NOT_FOUND", 
   "c)if index name is provided as an empty string(this is for update and drop statistics procedures), we will throw", 
   "SQLState.LANG_INDEX_NOT_FOUND", 
   "d)if schema name is null, we will use current schema to resolve the table name", 
   "e)if table name is null, we will throw SQLState.LANG_TABLE_NOT_FOUND", 
   "f)if index name is null, we will drop/update statisitcs for all the indexes for the given table.", 
   "I have added few test cases for each of these procedures."
  ], 
  "revision_id": "1355552"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-06-29T20:22:12.613514Z", 
  "msg": [
   "Should work assuming:", 
   "1. Mojarra will pass in ServletContext as it seems it might", 
   "2. We add WebContext to the ServletContext attributes (we currently don't)", 
   "TOMEE-259"
  ], 
  "revision_id": "1355551"
 }, 
 {
  "author": "mahadev", 
  "date": "2012-06-29T20:13:25.062202Z", 
  "msg": [
   "ZOOKEEPER-1466. QuorumCnxManager.shutdown missing synchronization. (Patrick Hunt via mahadev)"
  ], 
  "revision_id": "1355550"
 }, 
 {
  "author": "mahadev", 
  "date": "2012-06-29T20:11:32.618020Z", 
  "msg": [
   "ZOOKEEPER-1466. QuorumCnxManager.shutdown missing synchronization. (Patrick Hunt via mahadev)"
  ], 
  "revision_id": "1355549"
 }
]