[
 {
  "author": "solomax", 
  "date": "2012-07-02T05:10:03.352315Z", 
  "msg": [
   "OPENMEETINGS-339:", 
   "Debug of error occured while converting is improved", 
   "New OmFileHelper class is created and used to get well known OM files/folders, OM classes are updated to use new helper"
  ], 
  "revision_id": "1356068"
 }, 
 {
  "author": "chengjh", 
  "date": "2012-07-02T05:05:57.470893Z", 
  "msg": [
   "Monday,July 02,2012"
  ], 
  "revision_id": "1356067"
 }, 
 {
  "author": "bpendleton", 
  "date": "2012-07-02T04:32:38.043155Z", 
  "msg": [
   "DERBY-5833: Remove unused methods in NetCallableStatement class", 
   "This patch was contributed by Mohamed Nufail (nufail56 at gmail dot com)", 
   "This change removes the following unused methods from the", 
   "NetCallableStatement class:", 
   "- resetNetCallableStatement(NetAgent netAgent, NetConnection netConnection, String sql, Section section)", 
   "- resetNetCallableStatement(NetAgent netAgent, NetConnection netConnection, String sql, Section section, ColumnMetaData parameterMetaData, ColumnMetaData resultSetMetaData)", 
   "I suspect that, of the two remaining overloads of the resetNetCallableStatement", 
   "method, the 3-argument variant could be made private, as it is called only", 
   "by the 6-argument variant. That might be a further improvement we could do", 
   "at some future time. For now, this change simply removes the two variants", 
   "that are wholly unused."
  ], 
  "revision_id": "1356066"
 }, 
 {
  "author": "bpendleton", 
  "date": "2012-07-02T03:49:22.154278Z", 
  "msg": [
   "DERBY-5827: Remove unused methods in NetStatementReply class", 
   "This patch was contributed by Mohamed Nufail (nufail56 at gmail dot com)", 
   "This change removes several unused methods from the NetStatementReply", 
   "class. Code inspection of the NetStatementReply class reveals that", 
   "the following methods are not used at all:", 
   "parseQRYPRCTYP()", 
   "parseSQLCSRHLD()", 
   "parseQRYATTSCR()", 
   "parseQRYATTSET()", 
   "parseQRYATTSNS()", 
   "parseQRYATTUPD()"
  ], 
  "revision_id": "1356065"
 }, 
 {
  "author": "tomaz", 
  "date": "2012-07-02T03:48:27.154411Z", 
  "msg": [
   "Modify AtmosError class __init__ method to inherit from LibcloudError and call", 
   "parent class constructor. Contributed by Russell Keith-Magee, part of GITHUB-67."
  ], 
  "revision_id": "1356064"
 }
]