[
 {
  "author": "marrs", 
  "date": "2012-07-05T12:20:50.282074Z", 
  "msg": [
   "More files, I somehow missed a lot of them."
  ], 
  "revision_id": "1357573"
 }, 
 {
  "author": "andygumbrecht", 
  "date": "2012-07-05T12:18:35.431718Z", 
  "msg": [
   "Make multipulse work on multihomed client and server, out of the box.", 
   "Background:", 
   "If the network interface metrics are configured automatically on multihomed systems then an arbitrary interface is chosen for multicast broadcast. Manually changing the OS metric and/or programmatically defining the MulticastSocket interface will alleviate the issue, but still requires some kind of user intervention and/or configuration. It is virtually impossible to 'guess' which interfaces both client and server will broadcast on so the only solution is to broadcast on all valid interfaces. If both client 'and' server are multihomed then the issue is compounded."
  ], 
  "revision_id": "1357572"
 }, 
 {
  "author": "stsp", 
  "date": "2012-07-05T12:12:23.178377Z", 
  "msg": [
   "* subversion/svn/export-cmd.c", 
   "(svn_cl__export): Don't leak 'err' if an externals error occurred and", 
   "'err' is not SVN_ERR_WC_OBSTRUCTED_UPDATE."
  ], 
  "revision_id": "1357571"
 }, 
 {
  "author": "marrs", 
  "date": "2012-07-05T12:09:30.889385Z", 
  "msg": [
   "Initial version of Bndtools build, not yet complete, in sandbox during development."
  ], 
  "revision_id": "1357570"
 }, 
 {
  "author": "stsp", 
  "date": "2012-07-05T12:09:13.302068Z", 
  "msg": [
   "Don't lose the \"Failure occurred processing one or more externals definitions\"", 
   "error message if an unrelated error occurs. For instance, errors returned", 
   "from the conflict resolver would mask the \"externals error\" message.", 
   "* subversion/svn/switch-cmd.c", 
   "(svn_cl__switch): Don't return the \"externals processing\" error directly,", 
   "but merge it with any other potential errors from later function calls.", 
   "* subversion/svn/update-cmd.c", 
   "(svn_cl__update): As previous."
  ], 
  "revision_id": "1357569"
 }
]