[
 {
  "author": "afuchs", 
  "date": "2012-07-05T20:18:46.503521Z", 
  "msg": [
   "ACCUMULO-652 fixed bug in initial seek to index with filtering turned on, added more test cases, changed predicate objects to be grabbed through accessors, removed Filterer interface on WrappingIterator and added Filterer interface to Filter, removed generic filtering capability from RFile and moved it to GenericFilterer"
  ], 
  "revision_id": "1357868"
 }, 
 {
  "author": "aadamchik", 
  "date": "2012-07-05T20:16:31.924823Z", 
  "msg": [
   "CAY-1718 Remove everything deprecated in 3.1", 
   "in progress - removing XML package"
  ], 
  "revision_id": "1357867"
 }, 
 {
  "author": "stsp", 
  "date": "2012-07-05T20:14:49.649679Z", 
  "msg": [
   "* subversion/svn/file-merge.c: Fix build with APR versions that don't have", 
   "the APR_SIZE_MAX macro."
  ], 
  "revision_id": "1357866"
 }, 
 {
  "author": "aadamchik", 
  "date": "2012-07-05T20:11:59.394377Z", 
  "msg": [
   "tutorials using deprecated API"
  ], 
  "revision_id": "1357865"
 }, 
 {
  "author": "stsp", 
  "date": "2012-07-05T20:09:47.235570Z", 
  "msg": [
   "Add an internal text conflict merge tool to the 'svn' command line client.", 
   "The merge tool's interface was inspired by the UNIX tool sdiff (\"side-by-side", 
   "diff\"), which is used to merge configuration files during upgrades on OpenBSD,", 
   "for example.", 
   "The merge tool can be invoked during interactive conflict resolution using", 
   "the new \"(m) merge\" option. It is currently limited to picking either", 
   "version of each conflicted chunk. It can also postpone resolution of a chunk,", 
   "which will result in conflict markers in the merge result and the inability", 
   "to mark the entire file as \"(r) resolved\".", 
   "The merge tool will be extended later with per-conflict-chunk editing", 
   "capabilities which will make it more flexible than it is now.", 
   "* subversion/svn/cl.h", 
   "(svn_cl__merge_file): Declare.", 
   "* subversion/svn/conflict-callbacks.c", 
   "(svn_cl__conflict_handler): Add the \"(m) merge\" command to the interactive", 
   "conflict resolution prompt, allowing the user to invoke the internal file", 
   "merge tool.", 
   "* subversion/svn/file-merge.c: New file which contains merge tool code."
  ], 
  "revision_id": "1357864"
 }
]