[
 {
  "author": "sergeyb", 
  "date": "2012-07-10T17:07:44.802166Z", 
  "msg": [
   "Merged revisions 1359782,1359784 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r1359782 | sergeyb | 2012-07-10 17:57:30 +0100 (Tue, 10 Jul 2012) | 1 line", 
   "[CXF-4415] Support for basic hierarchical queries", 
   "........", 
   "r1359784 | sergeyb | 2012-07-10 17:58:05 +0100 (Tue, 10 Jul 2012) | 1 line", 
   "[CXF-4415] Missing updates", 
   "........"
  ], 
  "revision_id": "1359788"
 }, 
 {
  "author": "markrmiller", 
  "date": "2012-07-10T17:06:38.143686Z", 
  "msg": [
   "we do not need this pause after the test"
  ], 
  "revision_id": "1359787"
 }, 
 {
  "author": "alexdma", 
  "date": "2012-07-10T17:00:53.720165Z", 
  "msg": [
   "* ONManager now has a configurable parameter CONNECTIVITY_POLICY, with values TIGHT and LOOSE. Currently the default setting is TIGHT (newly implemented) and it will cause all ontologies managed by a custom space to contain an import statement for the whole core space, whenever they are exported to OWL or RDF artifacts. (STANBOL-681)", 
   "* Fixed an IRI sanity issue that caused ontology collectors not to be rebuilt when managed ontology IDs ended with '#' (STANBOL-571)", 
   "* It is now possible to retrieve mappings from stored graphs to *physical* ontology IRIs (if different from the logical IRIs). These are stored as literal values for the \"retrievedFrom\" property, typed as xsd:anyURI (STANBOL-571)", 
   "* All methods that parse ontologies on multiple attempts now try to reset the input stream (or make a BufferedInputStream). If it is not possible and the first attempts fails a new OntologyLoadingException is thrown (STANBOL-680)", 
   "* Query parameters \"coreont\" and \"corereg\" for the PUT method of scope resources are now of type List<String> so multiple values can be parsed and used for adding multiple ontology sourcs at once. Also eliminated parameters \"cusotmont\" and \"customreg\", as ontologies are now added to the custom space using POST methods (STANBOL-682)", 
   "* In the Clerezza ontology provider, the loadInStore(Object, boolean) method now examines import statements *after* registering the importing ontology. This should break any loops that may occur when loading ontology networks that contain cyclic imports. (STANBOL-679)", 
   "* All scopes and sessions now expose their HTML ontology contents in Manchester syntax by default. Also, there are backward links to scopes and managers.", 
   "* It is now possible to create and delte scopes and sessions using the Stanbol HTML interface. For sessions, both the PUT method (client decides session ID) and the POST method (Stanbol decides the session ID) are supported, depending on whether the user supplies an ID or not. (STANBOL-683)"
  ], 
  "revision_id": "1359786"
 }, 
 {
  "author": "lewismc", 
  "date": "2012-07-10T17:00:36.427700Z", 
  "msg": [
   "move reporting into gora-dynamodb and addition of Report3.doc"
  ], 
  "revision_id": "1359785"
 }, 
 {
  "author": "sergeyb", 
  "date": "2012-07-10T16:58:05.090485Z", 
  "msg": [
   "[CXF-4415] Missing updates"
  ], 
  "revision_id": "1359784"
 }
]