[
 {
  "author": "sebb", 
  "date": "2012-07-12T23:43:00.449117Z", 
  "msg": [
   "NET-465 FTPClient setSendBufferSize and setReceiveBufferSize on data socket"
  ], 
  "revision_id": "1361003"
 }, 
 {
  "author": "yusaku", 
  "date": "2012-07-12T23:41:07.572158Z", 
  "msg": [
   "AMBARI-634. Force redirect to the 'upgrade progress' page to prevent any other actions during Hadoop stack upgrade (Contributed by yusaku)"
  ], 
  "revision_id": "1361002"
 }, 
 {
  "author": "vinayakb", 
  "date": "2012-07-12T23:34:47.029943Z", 
  "msg": [
   "Removed builtin flag from FunctionIdentifier in Algebricks"
  ], 
  "revision_id": "1361001"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-07-12T23:16:46.197660Z", 
  "msg": [
   "[jira] [HBASE-6366] [89-fb] Delay eviction on close", 
   "Author: michalgr", 
   "Summary:", 
   "Delay eviction on close.", 
   "Since now evictBlocksByHfileName does not evict blocks immediately. It adds name of the file to list of recently closed files. During next eviction blocks corresponding to files on list are evicted and the list is cleared.", 
   "Test Plan: I prepared unit test. It runs ok.", 
   "Reviewers: liyintang, kranganathan", 
   "Reviewed By: liyintang", 
   "CC: JIRA", 
   "Differential Revision: https://reviews.facebook.net/D4071"
  ], 
  "revision_id": "1361000"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-07-12T23:16:40.778103Z", 
  "msg": [
   "[HBASE-6374] [0.89-fb] Pulling in the multi- framework from 0.92 to integrate the way we handle Puts/Gets and Deletes.", 
   "Author: aaiyer", 
   "Summary:", 
   "Currently, multi Puts are handled more efficiently than Gets or Deletes.", 
   "Multi-Get/Put(s) are split by region/regionserver and the requests are made", 
   "in batches. For multi-Puts these requests were being made in parallel, while", 
   "it was serial for Gets and deletes. This was causing Gets to be slow;", 
   "especially, when there is one slow region/regionserver that slows everything.", 
   "Instead of plainly copying the code from the puts to gets (which was version", 
   "0), we are integrating the codepath for gets/puts and deletes. This is the", 
   "way things work in 0.92 so pulling in stuff from 0.92 instead of", 
   "reimplementing the stuff. (This will also decrease the differences wrt the", 
   "opensourcing, making a possible move in future more easier).", 
   "Note: We are pulling in stuff from 0.92 as opposed to 0.94/trunk because they", 
   "have moved to protocolBuffers and pulling that in will be too risky/big", 
   "change.", 
   "TBDs: 1) deprecate old multi put/delete/get API in HRegionServer. We will need", 
   "them around as long as we intend to support old clients that still need the", 
   "functionality.", 
   "2) integrate mutateRows also into the multi-framework. This is not blocking on", 
   "anything. But not as hi pri to block the diff. Will do this, as a later diff.", 
   "Test Plan:", 
   "test on MR unit test. (these seem to test the end to end", 
   "functionality of multi gets/puts)", 
   "TestRegionStateOnMasterFailure is the only test that fails. It fails even without this change.", 
   "Reviewers: liyintang, kranganathan, kannan, pkhemani", 
   "Reviewed By: liyintang", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D484932"
  ], 
  "revision_id": "1360999"
 }
]