[
 {
  "author": "rmannibucau", 
  "date": "2012-07-19T21:34:14.006771Z", 
  "msg": [
   "OPENEJB-1874 openejb-jsf shouldnt be needed now"
  ], 
  "revision_id": "1363558"
 }, 
 {
  "author": "trawick", 
  "date": "2012-07-19T21:31:52.479338Z", 
  "msg": [
   "mpm_event, mpm_worker: Remain active amidst prevalent child process", 
   "resource shortages.", 
   "This is a somewhat different direction than r168182 (\"transient thread", 
   "creation errors shouldn't take down the whole server\").", 
   "r168182: If APEXIT_CHILDSICK is received and there aren't any", 
   "active children at the time, exit.", 
   "Now:     If APEXIT_CHILDSICK is received and we never successfully", 
   "initialized a child, exit.", 
   "The issue seen with the r168182 handling is that it is rather easy", 
   "to be left with no active child processes (which causes the server", 
   "to exit completely) during a resource shortage that lasts for some", 
   "measurable period of time, as contrasted with a resource shortage", 
   "that results in only a handful of allocation failures.", 
   "Now the server will remain active, though as long as the resource", 
   "shortage exists children may continually fail and the parent will", 
   "try once per second to create a replacement.  The existing logic", 
   "to reduce the spawn rate after such errors will prevent the", 
   "parent from trying to create children more rapidly."
  ], 
  "revision_id": "1363557"
 }, 
 {
  "author": "hossman", 
  "date": "2012-07-19T21:30:14.450498Z", 
  "msg": [
   "SOLR-3642: Correct broken check for multivalued fields in stats.facet (merge r1363555)"
  ], 
  "revision_id": "1363556"
 }, 
 {
  "author": "hossman", 
  "date": "2012-07-19T21:28:11.663933Z", 
  "msg": [
   "SOLR-3642: Correct broken check for multivalued fields in stats.facet"
  ], 
  "revision_id": "1363555"
 }, 
 {
  "author": "struberg", 
  "date": "2012-07-19T21:28:00.566991Z", 
  "msg": [
   "OWB-685 also apply the OwbApplication wrapper in setApplication"
  ], 
  "revision_id": "1363554"
 }
]