[
 {
  "author": "alexdma", 
  "date": "2012-07-19T17:10:05.089184Z", 
  "msg": [
   "* Restoring ontology networks, upon reactivation of Stanbol, was not considering scopes attached to sessions. Should be fixed now, sorry (STANBOL-571). Note that scopes and sessions can be restored regardless of the activation order of the ONManagerImpl and SessionManagerImpl.", 
   "* The new type Origin in the OntoNet API has replaced physical IRIs in ontology input sources. It can be used to wrap physical URLs on the Web (IRI) as well as Graph names (UriRef) in Clerezza. Input sources now use this wrapper type actively (STANBOL-422). This significanly speeds up ontology loading via REST, as well as restoring ontology network structures (though some work still has to be done in that department) (STANBOL-571). Kudos to US death metal band Origin that I had seen live the night before, for inspiring an appropriate class name ;) .", 
   "* RESTful services for exporting ontology and OntoNet artifacts no longer depend on the OSGi settings for default namespaces. Only the Java API does. RESTful services will now always use the request URI for generating artifacts URIs and import targets. Also, the namespace parameters were moved to a single one in the OfflineConfiguration. (STANBOL-649)", 
   "* OntologyInputSource<O> has now returned to be a single-parameter generic, no more need to specify the triple store type (STANBOL-422)", 
   "* Graph names chosen by GraphContentInputSources are now stored persistently in the metalevel graph. This nearly halves the time taken by ontology loading via REST, and should also prevent graph duplications when ontonet is restored (especially for anonymous ontologies). TODO : implement ontology ID lookahead in input sources, so they can choose a more appropriate graph name before actually loading the whole content. (STANBOL-305 STANBOL-422 STANBOL-426)", 
   "* The OWLUtils.guessOntologyIdentifier() methods no longer generate a timestamp-based IDs for anonymous ontologies. This caused trouble with multiple calls to the method for the same ontology, and made it almost impossible to restore ontology network structures. Therefore, the methods now return null IDs, and timestamped IRI generation is deferred to the Clerezza ontology provider for generating the public keys of stored ontologies. (STANBOL-305)", 
   "* The OntologyProvider API now exposes \"public keys\" that identify stored ontologies in the form of OWLOntologyID objects. They may or may not coincide with graph names, but can be used for ontology <-> graph reconciliation. In addition, they are also generated for anonymous ontologies (STANBOL-422 STANBOL-426)", 
   "* HTML REST API now shows the direct handles on stored ontologies (STANBOL-695)", 
   "* The obsolete OntoNet OWL API implementation is gone (STANBOL-696).", 
   "* General API cleanup and javadoc"
  ], 
  "revision_id": "1363428"
 }, 
 {
  "author": "hashutosh", 
  "date": "2012-07-19T17:06:24.376580Z", 
  "msg": [
   "HIVE-3246 : java primitive type for binary datatype should be byte[] (Thejas Nair via Ashutosh Chauhan)"
  ], 
  "revision_id": "1363427"
 }, 
 {
  "author": "giger", 
  "date": "2012-07-19T17:04:47.511266Z", 
  "msg": [
   "update exc-c14n schema @see SANTUARIO-330"
  ], 
  "revision_id": "1363426"
 }, 
 {
  "author": "solomax", 
  "date": "2012-07-19T17:02:26.818382Z", 
  "msg": [
   "OPENMEETINGS-361 is implemented"
  ], 
  "revision_id": "1363425"
 }, 
 {
  "author": "namit", 
  "date": "2012-07-19T17:01:31.450788Z", 
  "msg": [
   "HIVE-3251 Hive doesn't remove scrach directories while killing running MR job", 
   "(Gang Tim Liu via namit)"
  ], 
  "revision_id": "1363424"
 }
]