[
 {
  "author": "rlaidlaw", 
  "date": "2012-07-24T18:21:54.265899Z", 
  "msg": [
   "OODT-471: added namespace definitions to the RSS config files for the File Manager RSS service"
  ], 
  "revision_id": "1365203"
 }, 
 {
  "author": "fapeeler", 
  "date": "2012-07-24T18:19:13.145133Z", 
  "msg": [
   "VCL-570", 
   "-added support for setting static address", 
   "-removed duplicate code on adding user, handled by Linux.pm", 
   "Changed Linux.pm to use host command for finding hostname, ipcalc is not consistent across OS's", 
   "Removed some debug statments to reduce output on connection method hash"
  ], 
  "revision_id": "1365202"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-07-24T18:15:53.506575Z", 
  "msg": [
   "[master] Do not kill inaccessible regionservers at startup", 
   "Author: mbautin", 
   "Summary: Factoring out the part of the master failover diff D2085 for reading a snapshot of the set of live regionservers from ZK. This should solve the problem of rack switch failure on a rack containing the master, when the secondary master comes up, tries to reach regionservers on the inaccessible rack, and decides that they are dead. When the rack switch comes back, the regionservers on that rack get YouAreDeadException. With this change, the regionservers on the inaccessible rack would not be considered dead until their znodes expire.", 
   "Test Plan:", 
   "Unit tests", 
   "Dev cluster", 
   "Reviewers: pkhemani, kranganathan, aaiyer, kannan", 
   "Reviewed By: pkhemani", 
   "Differential Revision: https://reviews.facebook.net/D4263"
  ], 
  "revision_id": "1365201"
 }, 
 {
  "author": "rlaidlaw", 
  "date": "2012-07-24T18:14:37.904981Z", 
  "msg": [
   "OODT-469: removed hard-coded namespaces from RSSProductServlet and enabled configurable namespaces via RSS config"
  ], 
  "revision_id": "1365200"
 }, 
 {
  "author": "nehanarkhede", 
  "date": "2012-07-24T18:13:01.975663Z", 
  "msg": [
   "KAFKA-350 Enable message replication in the presence of failures; patched by Neha Narkhede; reviewed by Jun Rao and Jay Kreps"
  ], 
  "revision_id": "1365199"
 }
]