[
 {
  "author": "rmannibucau", 
  "date": "2012-07-30T14:25:52.665756Z", 
  "msg": [
   "OPENEJB-1879 new OWBInjector API"
  ], 
  "revision_id": "1367103"
 }, 
 {
  "author": "bobby", 
  "date": "2012-07-30T14:20:35.409506Z", 
  "msg": [
   "svn merge -c 1301551,1300642,1332821,1303884 FIXES:MAPREDUCE-4010,HADOOP-8167,HADOOP-8172,HADOOP-8197 Patches to fix OOZIE-761"
  ], 
  "revision_id": "1367102"
 }, 
 {
  "author": "rmuir", 
  "date": "2012-07-30T14:16:34.291352Z", 
  "msg": [
   "LUCENE-3884: Move ElisionFilter out of .fr package"
  ], 
  "revision_id": "1367101"
 }, 
 {
  "author": "alexdma", 
  "date": "2012-07-30T14:12:24.768050Z", 
  "msg": [
   "* OWL 2 Version IRI is now supported and used as a component of the public keys for ontologies. After a few more unit test we can then close STANBOL-524.", 
   "* Public keys of ontologies are now OWLOntologyID objects (STANBOL-426). These are now created for anonymous ontologies as well and can be the physical URL or a Stanbol-generated one (STANBOL-305, STANBOL-518). Methods that use String or IRI as public keys are still available but deprecated, and will be gradually phased out.", 
   "* added OntologyCollector#addOntology(Origin) method, which adds ontology references without extracting the ontology object when possible. This should dramatically speed up component re-activation when large ontologies are being managed by scopes or sessions (STANBOL-571). As a consequence, factory methods and constructors for ontology scopes and core spaces have multiplied their overloads (TODO can we do something to reduce overloaded methods again?).", 
   "* Delegated more work to the OntologyNetworkMultiplexer (formerly OntologyNetworkDescriptor) (STANBOL-571)", 
   "* Better canonicalization support for string forms of ontology public keys (URLencodes-decodes)", 
   "* sanitize() and the new desanitize() methods now URLencode terminating hash characters instead of stripping them.", 
   "* Fixed a bug caused by a previous commit to STANBOL-422, which caused an input stream to be parsed multiple times even after being successful (obviously causing stream errors). The \"Auto\" option for loading ontologies from the HTML client should work now.", 
   "* Added support for empty POST on session resources, which is interpreted as \"detach all scopes\". This way, if another POST contains other form parameters but \"scope\", it will not cause detachment of all scopes, which is too drastic and might appear accidental (STANBOL-247).", 
   "* HTML client can now unload ontologies from scopes and sessions, as well as manage stored ontologies using a dedicated UI (STANBOL-534).", 
   "* More Javadoc. Documentation update is still TODO."
  ], 
  "revision_id": "1367100"
 }, 
 {
  "author": "olamy", 
  "date": "2012-07-30T14:11:32.137373Z", 
  "msg": [
   "add some log to understand why fail on jenkins"
  ], 
  "revision_id": "1367099"
 }
]