[
 {
  "author": "thomasm", 
  "date": "2012-08-09T13:18:57.739820Z", 
  "msg": [
   "OAK-45 Add support for branching and merging - wrapper to simplify testing with MicroKernel implementations that don't support branch and merge"
  ], 
  "revision_id": "1371198"
 }, 
 {
  "author": "danhaywood", 
  "date": "2012-08-09T13:18:18.956889Z", 
  "msg": [
   "ISIS-48, plus some changes to Wicket; simple updates now working", 
   "runtime", 
   "- a mechanism for adding exceptions to a list on IsisTransaction", 
   "- fixed race condition in IsisTransactionManager for startTran", 
   "- removed PersistenceSessionHydrator, methods entirely moved into AdapterManager", 
   "- introduced PojoRecreator interface to allow object store to hook into adapter recreation process", 
   "JDO", 
   "- facet factories", 
   "- moved JdoPropertyUtils from metamodel into JDO's runtime", 
   "- lazy loading, reuse code in the IsisLifecycleListener", 
   "In wicket", 
   "- removing SpecMemento and replacing with ObjectSpecId", 
   "- getting the choices dropdown to correctly setup the value"
  ], 
  "revision_id": "1371197"
 }, 
 {
  "author": "brane", 
  "date": "2012-08-09T13:18:17.681624Z", 
  "msg": [
   "* CHANGES: Add node about \"svn --version --verbose\"."
  ], 
  "revision_id": "1371196"
 }, 
 {
  "author": "pkluegl", 
  "date": "2012-08-09T13:17:57.922236Z", 
  "msg": [
   "UIMA-2329", 
   "- added analysis engine for html documents in utils folder", 
   "- instantiated types for most well-known tags", 
   "- add annotations for content or complete element", 
   "- able to strip html, but still adds annotations of removed tags", 
   "- organized imports"
  ], 
  "revision_id": "1371195"
 }, 
 {
  "author": "brane", 
  "date": "2012-08-09T13:14:54.695189Z", 
  "msg": [
   "Add module version info to \"svn --version --verbose\" output on Windows.", 
   "* subversion/libsvn_subr/sysinfo.c (file_version_number): New.", 
   "(win32_shared_libs): Make static. Display module version when available."
  ], 
  "revision_id": "1371194"
 }
]