[
 {
  "author": "pburba", 
  "date": "2012-08-14T20:51:18.494851Z", 
  "msg": [
   "On the inheritable-props branch: Don't continue to cache iprops for switched", 
   "nodes when they are unswitched.", 
   "* subversion/libsvn_client/switch.c", 
   "(switch_internal): If a switch is \"unswitching\" a previously switched node,", 
   "then don't keep caching inherited properties as if the node is a WC root.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(db_op_set_rev_repos_relpath_iprops): Support clearing as well as setting", 
   "the iprops cache."
  ], 
  "revision_id": "1373083"
 }, 
 {
  "author": "pburba", 
  "date": "2012-08-14T20:50:46.323491Z", 
  "msg": [
   "On the inheritable-props branch: Fix serf implementation of", 
   "svn_ra_get_inherited_props which broke after a recent sync with trunk.", 
   "* subversion/libsvn_ra_serf/inherited_props.c", 
   "(svn_ra_serf__get_inherited_props): Correct comment which referred to the", 
   "wrong report.  Follow the lead of r1334446 or r1336471."
  ], 
  "revision_id": "1373082"
 }, 
 {
  "author": "jim", 
  "date": "2012-08-14T20:50:44.111072Z", 
  "msg": [
   "Merge r1371387 from trunk:", 
   "mod_auth_digest now respects DefaultRuntimeDir", 
   "Submitted by: trawick", 
   "Reviewed/backported by: jim"
  ], 
  "revision_id": "1373081"
 }, 
 {
  "author": "markt", 
  "date": "2012-08-14T20:49:49.224299Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=53623", 
   "Async dispatches require similar handling to RequestDispatcher.include() hence the implementation of async dispatch uses RequestDispatcher.include()", 
   "However, since RequestDispatcher provides no API for differentiating between and INCLUDE and DISPATCH some form of trickery has to be used. The previous implementation worked in most cases but failed in some cases (multiple forwards prior to dispatch, wrapping the request).", 
   "This alternative implementation calls a specific method on the RequestDispatcher implementation (we have to access the implementation class since we can't modify the servlet API) which removes any ambiguity and allows the correct handling in all cases."
  ], 
  "revision_id": "1373080"
 }, 
 {
  "author": "rdonkin", 
  "date": "2012-08-14T20:48:24.861522Z", 
  "msg": [
   "Thanks to PMD for spotting that organisations aren't stored."
  ], 
  "revision_id": "1373079"
 }
]