[
 {
  "author": "tomaz", 
  "date": "2012-08-20T00:37:00.408360Z", 
  "msg": [
   "Update affected test."
  ], 
  "revision_id": "1374883"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-08-20T00:12:51.806518Z", 
  "msg": [
   "OPENEJB-1895 - Refactored @Asynchronous support", 
   "TOMEE-382 - configuration for asynch task pool"
  ], 
  "revision_id": "1374882"
 }, 
 {
  "author": "kinow", 
  "date": "2012-08-19T23:44:40.652799Z", 
  "msg": [
   "Removed the \"stoppable\" behavior from the Generator interface, and also removed", 
   "the wrapped generator from BaseGenerator. Both were moved to a new abstract", 
   "class, LoopGenerator.", 
   "The Generator of [functor] is responsible for executing a procedure for each", 
   "element that is generates. However, there are some implementations of the", 
   "Generator interface in [functor] that require special behavior (stoppable and", 
   "wrapped generator).", 
   "Moving this behaviors to a new class, now one can implement a new generator", 
   "without having to implement stop (Liskov principle).", 
   "The implementations that control the execution flow were moved to the loop", 
   "package. The existing IntegerRange and LongRange were moved to a range package,", 
   "and an utility class Ranges has been created, but hasn't been implemented yet.", 
   "This class will create ranges (that are generators).", 
   "TransformedGenerator has remarks about the suppression of warnings. This is a", 
   "special generator, that wraps a generator, but returns another one. So it", 
   "breaks the interface contract, and we suppress the warnings when we cast the", 
   "wrapped generator. This class has been marked as final, to avoid bogus", 
   "specializations.", 
   "The simplification of the Generator interface may be specially useful when", 
   "separating classes for functor-api and functor-impl.", 
   "Tests were updated accordingly."
  ], 
  "revision_id": "1374881"
 }, 
 {
  "author": "trawick", 
  "date": "2012-08-19T23:41:54.516869Z", 
  "msg": [
   "the rest of r1374877", 
   "minor cleanups", 
   "- don't duplicate prototype for child_main()", 
   "- make a few things static"
  ], 
  "revision_id": "1374880"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-08-19T23:39:47.427817Z", 
  "msg": [
   "removed ConcurrentHashMap of Schedulers, not needed.  BeanContext is already setup to track objects that need to be linked on a per-bean basis."
  ], 
  "revision_id": "1374879"
 }
]