[
 {
  "author": "pnasser", 
  "date": "2012-08-23T06:49:04.575535Z", 
  "msg": [
   "New 3.0.3 Branch to include spatial geometry"
  ], 
  "revision_id": "1376388"
 }, 
 {
  "author": "davsclaus", 
  "date": "2012-08-23T06:48:04.249991Z", 
  "msg": [
   "Added unit test based on user forum issue"
  ], 
  "revision_id": "1376387"
 }, 
 {
  "author": "pnasser", 
  "date": "2012-08-23T06:47:29.350907Z", 
  "msg": [
   "Removing to replace with trunk"
  ], 
  "revision_id": "1376386"
 }, 
 {
  "author": "rwesten", 
  "date": "2012-08-23T06:31:41.583548Z", 
  "msg": [
   "STANBOL-719: The Langdetect engine is now the default Enigne used for Language identification within Stanbol.", 
   "* Several Changes to Integration tests as those need to be adapted to check for the new name and implementing class", 
   "* Changed the preconfigured \"language\" EnhancementChain to use the \"langdetect\" engine", 
   "* The Langdetect eninge is also used in the explicitly configured \"default\" chain instead of the \"langid\" engine", 
   "NOTE that the \"langid\" engine is still present but no longer used by any preconfigured EnhancementChain", 
   "STANBOL-717: Stanbol no longer uses the AllActiveEngines EnhancementChain as default chain but a manually configured WeightedChain.", 
   "* Added the configuration of the default chain to the defaultdata module", 
   "* Added features to the all-active-engines EnhancementChain implementation (DefaultChain component)  to allow configuring the name and the service.ranking", 
   "* Added a configuration for the DefaultChain component to register the EnhancementChain that includes all active EnhancementEngines with the name \"all-active\" and the ranking 0.", 
   "NOTE: As this configuration is also port of the defaultdata module it will only affect Stanbol Launchers that do use this module (all the launchers managed by the Stanbol community). Users that build their own launcher (and do not use this module) will still see the EnhancementChain containing all active EnhancementEngines registered with the name \"default\" and a service ranking of Interger.MIN_VALUE."
  ], 
  "revision_id": "1376385"
 }, 
 {
  "author": "batkinson", 
  "date": "2012-08-23T06:31:41.107970Z", 
  "msg": [
   "Fixed web test testAddMavenToolWithBuildEnvironment for common Windows paths."
  ], 
  "revision_id": "1376384"
 }
]