[
 {
  "author": "pmouawad", 
  "date": "2012-09-02T21:16:06.277915Z", 
  "msg": [
   "Remove wrong synchronized on method (as it would synch on instance while allThreadsInfo is static.", 
   "no need for sync on previousTime."
  ], 
  "revision_id": "1380058"
 }, 
 {
  "author": "pmouawad", 
  "date": "2012-09-02T21:13:34.671043Z", 
  "msg": [
   "Use parseLong instead of creating useless wrapper"
  ], 
  "revision_id": "1380057"
 }, 
 {
  "author": "rdonch", 
  "date": "2012-09-02T21:03:14.633245Z", 
  "msg": [
   "On Windows, don't strip the Content-Type field from .po files during their compilation.", 
   "GNU libintl, by default, converts the l10n strings into the locale encoding, while Subversion requires UTF-8. This conversion can be suppressed by calling bind_textdomain_codeset, but certain old versions of libintl don't have that, so the Unix build system checks for the existence of that function, and if it's not present, strips the Content-Type header from the .po files (which prevents encoding conversion, as well, but makes msgfmt complain).", 
   "When building on Windows, this stripping is done unconditionally, but is completely unnecessary:", 
   "- On Windows, we only support linking with svn-win32-libintl, which is hacked to disable all encoding conversions.", 
   "- Even if someone links with with his own version of libintl, it's a safe bet that it will be new enough to support bind_textdomain_codeset, so we can just call that.", 
   "This patch removes Content-Type stripping on Windows, which gets rid of msgfmt warnings, as well as simplifies the build system.", 
   "* build/generator/build_locale.ezt: Remove the strip-po-charset.py invocation.", 
   "* build/generator/gen_win.py:", 
   "(POFile.__init__): don't store the .spo file name.", 
   "* build/strip-po-charset.py: Delete.", 
   "* subversion/libsvn_subr/nls.c:", 
   "(svn_nls_init): Move the bind_textdomain_codeset call out of the #ifdef WIN32 block, so it's executed on Windows, as well.", 
   "* subversion/svn_private_config.hw: Indicate that bind_textdomain_codeset is available if NLS is enabled.", 
   "Approved by: brane"
  ], 
  "revision_id": "1380056"
 }, 
 {
  "author": "jwills", 
  "date": "2012-09-02T21:00:04.796105Z", 
  "msg": [
   "And the directory, as long as I'm at it"
  ], 
  "revision_id": "1380055"
 }, 
 {
  "author": "hboutemy", 
  "date": "2012-09-02T21:00:00.914900Z", 
  "msg": [
   "[MSITE-652] keep site staging when skipDeploy=true"
  ], 
  "revision_id": "1380054"
 }
]