[
 {
  "author": "rmuir", 
  "date": "2012-09-05T13:16:12.155658Z", 
  "msg": [
   "fix most broken javadocs links, compilation dependencies: link test-framework javadocs to .codecs, remove duplicate package (put all blockterms stuff in .blockterms)"
  ], 
  "revision_id": "1381163"
 }, 
 {
  "author": "mbautin", 
  "date": "2012-09-05T12:50:19.520118Z", 
  "msg": [
   "[0.89-fb] [master] Remove region's last flushed sequence id _after_ closing", 
   "Author: avf", 
   "Summary:", 
   "When we close a region during normal operation, we flush this region's memstore,", 
   "updating last flushed sequence id. This means last flushed sequence id continues", 
   "to be reported along with the rest of HServerInfo.", 
   "This revision removes the last flushed sequence id _after_ the region", 
   "is closed to handle this scenario correctly.", 
   "Test Plan:", 
   "Test on DL cluster: gracefully move a region from one node to another and", 
   "verify that the \"last flushed sequence id that is less\" is no longer printed.", 
   "Revert Plan:", 
   "Reviewers: kannan, aaiyer", 
   "Reviewed By: kannan", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D565614", 
   "Task ID: 1426639"
  ], 
  "revision_id": "1381162"
 }, 
 {
  "author": "gtully", 
  "date": "2012-09-05T12:43:16.552889Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/AMQ-4020 https://issues.apache.org/jira/browse/AMQ-4021 - disable this test till we deal with propagating store exceptions in place of ioexceptions which result in the transport abort and deal with more exact exception reporting from jdbc transaction context, ie from close/commit processing"
  ], 
  "revision_id": "1381161"
 }, 
 {
  "author": "psharples", 
  "date": "2012-09-05T12:40:30.006592Z", 
  "msg": [
   "Fixes for both RAVE-710 and RAVE-711. (based on the work by Daniel Gornstein).  A shared page was rendering (although greyed out) before the user had accepted the share.  (causing some issues)"
  ], 
  "revision_id": "1381160"
 }, 
 {
  "author": "lofwyr", 
  "date": "2012-09-05T12:33:18.185601Z", 
  "msg": [
   "TOBAGO-1163: Add some CSS3 features to tobago-theme-speyside", 
   "- the focused input field should have an inner-shadow"
  ], 
  "revision_id": "1381159"
 }
]