[
 {
  "author": "ggregory", 
  "date": "2012-09-14T20:31:16.595524Z", 
  "msg": [
   "Update for 1.6 and 1.7."
  ], 
  "revision_id": "1384908"
 }, 
 {
  "author": "luc", 
  "date": "2012-09-14T20:17:00.134369Z", 
  "msg": [
   "Use the new differentiation framework in optimization package.", 
   "As a temporary hack for backward compatibility, some optimizers do", 
   "provide \"optimize\" methods which accept the new functions signatures", 
   "(i.e. MultivariateDifferentiableXxxFunction), but they do *not*", 
   "advertise it in their \"implements\" clause. The reason for that is that", 
   "Java forbid implementing a parameterized interface with two different", 
   "parameters. These optimizers already implement the interface with the", 
   "older functions signatures, and this cannot be removed as of 3.1.", 
   "When 4.0 will be started, the old signatures will be removed, and the", 
   "\"implements\" declarations will be updated."
  ], 
  "revision_id": "1384907"
 }, 
 {
  "author": "cmpilato", 
  "date": "2012-09-14T20:16:46.976170Z", 
  "msg": [
   "* subversion/libsvn_ra_serf/util.c", 
   "(expat_response_handler): Fix muscle memory oops in code comment.", 
   "Reported by: stsp"
  ], 
  "revision_id": "1384906"
 }, 
 {
  "author": "luc", 
  "date": "2012-09-14T20:16:05.246845Z", 
  "msg": [
   "Fixed too large memory consumption in DSCompiler.", 
   "Prior to this correction, when at one point in a program a user needed a", 
   "derivative with 1 parameter and order 5, and at another point needed a", 
   "derivative with 30 parameters and order 1, all DSCompilers from 1x1 to", 
   "30x5 were created. As the compilation rules for 30 parameters and 5", 
   "order are huge, this failed with memory heap errors after several", 
   "gigabytes were consumed.", 
   "The fix is to simply build the necessary compilers, and let the array", 
   "contain null references for the compilers never used (these null", 
   "references will be populated later if the user ask for some intermediate", 
   "value that need them, of course)."
  ], 
  "revision_id": "1384905"
 }, 
 {
  "author": "gnodet", 
  "date": "2012-09-14T20:08:50.086183Z", 
  "msg": [
   "[SSHD-45] Support local/remote port forwarding on the client side"
  ], 
  "revision_id": "1384904"
 }
]