[
 {
  "author": "", 
  "date": "2002-02-15T05:46:36.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'jwsdp_10_ea2_01'."
  ], 
  "revision_id": "138869"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-15T05:46:36.000000Z", 
  "msg": [
   "Log to stderr.", 
   "A bit of change in reading the properties - I spent some time trying to", 
   "understand what was the original intention, it was quite tricky. If the", 
   "property is not set, the old code would have defaulted everything to", 
   "true.", 
   "Added a bit of code to display only the last component of the log name,", 
   "logs without log name are hard to trace back to the source, and the full", 
   "name can make things hard to read ( at least that's my experience so", 
   "far ).", 
   "Of course, feel free to change back, I'm just trying to get things", 
   "a bit easier to use 'out of box', config can override anything."
  ], 
  "revision_id": "138868"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-15T05:42:35.000000Z", 
  "msg": [
   "Add a mechanism to use a proxy. The default impl will first look for", 
   "a logger package, and preferably use a specialized factory, which", 
   "can provide better integration with the real logger.", 
   "The introspection is ok, but it's limited and complex.", 
   "Also, switch to SimpleLog by default - which is almost the same as", 
   "using System.err.println(). If common logging requires the user to set", 
   "properties and configurations to get the same behavior as System.err(),", 
   "why would anyone use it ?"
  ], 
  "revision_id": "138867"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-15T03:54:19.000000Z", 
  "msg": [
   "Add the second constructor to be used with Log4jFactory.", 
   "Make it final ( so the indirection can be optimized by jits )"
  ], 
  "revision_id": "138866"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-15T03:53:39.000000Z", 
  "msg": [
   "Added a log4j specific factory. It's cleaner and goes directly", 
   "to the logger impl, without introspection. The factory can be extended", 
   "to take advantage of other log4j features ( it calls getInstance(Class)", 
   "direclty for example ) to integrate better."
  ], 
  "revision_id": "138865"
 }
]