[
 {
  "author": "ilgrosso", 
  "date": "2012-09-25T15:05:53.362682Z", 
  "msg": [
   "[COCOON3-106] Patch applied"
  ], 
  "revision_id": "1389903"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-09-25T15:04:42.253790Z", 
  "msg": [
   "update id and version better in webprofile.properties"
  ], 
  "revision_id": "1389902"
 }, 
 {
  "author": "alexdma", 
  "date": "2012-09-25T15:03:26.102750Z", 
  "msg": [
   "* First implementation of STANBOL-695 introduces handle management for both collector handles (scopes or sessions managing the ontology) and ontology handles (dependencies by owl:imports). Handles cause 409 Conflict HTTP responses and related exceptions to be thrown. Handles/dependency list is implemented in Java API, TODO in RESTful API.", 
   "* Introduced the concept of \"orphan ontology keys\" and related API management and display in the HTML client. Orphan ontologies are those for which a corresponding RDF graph is expected but not found in the store. Once we implement the other way around (adding unregistered graphs as ontologies) we can solve STANBOL-746.", 
   "* More aggressive aliasing management in meta graph (STANBOL-426)", 
   "* Added one extra level of merging for sessions (STANBOL-486)", 
   "* DELETE is now implemented also for the OntoNetRootResource and Clerezza Ontology Providers. It will only delete ontologies with NO handles on them - see STANBOL-695. Further code optimizations and tests will allow us to close STANBOL-534.", 
   "* Fixed STANBOL-753 by replacing freemarker groupId in POM", 
   "* Fixed STANBOL-755 by replacing Collection.emptyList() calls with new LinkedList() which is modifiable. This goes for the abstract and jena adapters"
  ], 
  "revision_id": "1389901"
 }, 
 {
  "author": "jlmonteiro", 
  "date": "2012-09-25T15:02:29.531844Z", 
  "msg": [
   "Adding AL header"
  ], 
  "revision_id": "1389900"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-09-25T15:00:55.929589Z", 
  "msg": [
   "be a little smarter on updating versions in TCK pom.xml"
  ], 
  "revision_id": "1389899"
 }
]