[
 {
  "author": "craigmcc", 
  "date": "2003-04-04T03:13:30.000000Z", 
  "msg": [
   "Include the release notes in the distribution."
  ], 
  "revision_id": "138969"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-04-04T02:49:10.000000Z", 
  "msg": [
   "Update release notes for a proposed 1.0.3 release of Commons Logging."
  ], 
  "revision_id": "138968"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-04-02T01:53:04.000000Z", 
  "msg": [
   "Per discussion on COMMONS-DEV and bug reports 17561 and 17894, deprecate", 
   "the \"proxy log factory\" class o.a.c.l.impl.Log4jFactory (which didn't really", 
   "accomplish any functional purpose), and remove from LogFactoryImpl the", 
   "creation and use of a proxy instance.", 
   "PR:  Bugzilla #17561", 
   "Submitted by:  Felix Janssen <thundur at mayaxatl.org>", 
   "PR:  Bugzilla #17894", 
   "Submitted by:  Nathan Niesen <nathann at objectfx.com>"
  ], 
  "revision_id": "138967"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-04-02T01:29:38.000000Z", 
  "msg": [
   "Remove attempt to configure the root logger if it has not been done so.", 
   "* Out of scope for commons-logging, which promises only to wrap", 
   "USE of the logging implementation, not configuration.", 
   "* Incorrect assumption that not having appenders configured on the", 
   "root logger is an error.", 
   "* Log4J will auto-configure itself if a log4j.xml or log4j.properties", 
   "file is present, so out-of-the-box use with no code is as simple", 
   "as dropping a properties file in the correct place.", 
   "PR:  Bugzilla #13201", 
   "Submitted by: Steven Caswell <stevencaswell at apache.org>"
  ], 
  "revision_id": "138966"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-04-02T00:50:49.000000Z", 
  "msg": [
   "Wrapper:", 
   "- Refactor the setup of class loaders so that it is clearer what is", 
   "going on", 
   "- For the Log4J tests, add the custom Appender implementation to", 
   "whichever class loader Log4J is put in", 
   "- Set and reset the thread context class loader to more accurately", 
   "simulate the environment of a servlet container.", 
   "build.xml:", 
   "- Implement the multi-classloader test scenarios for Log4J, equivalent", 
   "to those for JDK 1.4.", 
   "We now have a robust testing environment to catch any possible regressions", 
   "when modifying the functionality (such as ripping out Log4jFactory, as", 
   "discussed on COMMONS-DEV).", 
   "I don't have time to do the corresponding test scenarios for Avalon LogKit,", 
   "but anyone who wants to do so is welcome to create them."
  ], 
  "revision_id": "138965"
 }
]