[
 {
  "author": "rgoers", 
  "date": "2012-09-25T22:09:49.995924Z", 
  "msg": [
   "Allow status output to be directed to stderr or a file"
  ], 
  "revision_id": "1390188"
 }, 
 {
  "author": "jwross", 
  "date": "2012-09-25T22:06:26.589607Z", 
  "msg": [
   "[ARIES-869]", 
   "Initial implementation of application service dependencies. Supports (1) the computation of service dependencies for applications, (2) installation (resolution) failures if mandatory service dependencies are not discovered, (3) service dependencies provided by content, and (4) service dependencies provided by parent subsystems. Does not currently support service dependencies provided by child subsystems. Currently, this scenario will fail with a resolution exception and the test is diabled. The problem is, during installation of the parent along with its child, the child has not reached the state where service capabilities have been computed before they are needed. The solution will require some thought and, perhaps dangerous, experimentation, so I wanted to get the current changes safely stored before tackling it.", 
   "Service requirements and capabilities are declared via Blueprint XML. Subsystems reuses the functionality already available in Blueprint and Application Modeller, so these dependencies have been added along with Proxy.", 
   "The RI in the OSGi repo will need to be updated with these new dependencies."
  ], 
  "revision_id": "1390187"
 }, 
 {
  "author": "prestonc", 
  "date": "2012-09-25T22:06:05.152411Z", 
  "msg": [
   "Added support for QName functions to have empty sequence as a parameter."
  ], 
  "revision_id": "1390186"
 }, 
 {
  "author": "prestonc", 
  "date": "2012-09-25T21:58:25.483917Z", 
  "msg": [
   "Added derived string types to the cast function. Missed one file."
  ], 
  "revision_id": "1390185"
 }, 
 {
  "author": "prestonc", 
  "date": "2012-09-25T21:57:43.249247Z", 
  "msg": [
   "Added the derived string types to the serializer."
  ], 
  "revision_id": "1390184"
 }
]