[
 {
  "author": "costin", 
  "date": "2003-02-26T22:17:32.000000Z", 
  "msg": [
   "Few more changes ( to the new APIs ).", 
   "Eliminate the side-effects - the descriptor reader will return a list.", 
   "Improve the MbeansSource - it can read jboss or mlet style xml files", 
   "and create the mbeans. It no longer needs the type to be specified.", 
   "Also added a method to allow support for lifecycle methods on the", 
   "mbeans.", 
   "Most JMX applications include a lifecycle mechanism - and the method names", 
   "and behavior is pretty common. If an mbean is used in such environment -", 
   "the init/start/stop/destroy will be called automatically. The intention", 
   "is to allow for such mbeans to work if used outside such a container, and", 
   "to support this behavior in tomcat standalone."
  ], 
  "revision_id": "139159"
 }, 
 {
  "author": "costin", 
  "date": "2003-02-20T05:56:00.000000Z", 
  "msg": [
   "Added serial IDs, to avoid versioning and update problems.", 
   "Using the serialized form of the metadata is at least 2 times faster", 
   "than re-parsing the XML, and we store the metadata statically in the", 
   "jar anyway."
  ], 
  "revision_id": "139158"
 }, 
 {
  "author": "costin", 
  "date": "2003-02-20T05:54:22.000000Z", 
  "msg": [
   "A method to register components by ObjectName, and few extra checks.", 
   "The main function of the Registry is to find and create a model mbean", 
   "for a regular java object ( bean ), using the XML model or introspection", 
   "or other \"magic\"."
  ], 
  "revision_id": "139157"
 }, 
 {
  "author": "costin", 
  "date": "2003-02-20T05:52:00.000000Z", 
  "msg": [
   "Some work on the base notification.", 
   "The goal is to make it recyclable and support \"notes\" ( i.e. int-based array accessors", 
   "to attributes - like \"handles\" or descriptors), that would make the jmx notification", 
   "a good replacement for the current callbacks in coyote and jk ( and anything else ).", 
   "This is not yet complete - we also need an mbean to act as an \"Id manager\" and", 
   "maintain the int ids."
  ], 
  "revision_id": "139156"
 }, 
 {
  "author": "costin", 
  "date": "2003-02-20T05:48:34.000000Z", 
  "msg": [
   "A bit of refactoring for duplicated code.", 
   "Check for static methods", 
   "Let getFoo() or setFoo() with wrong number of params pass through, and", 
   "be considered for operations.", 
   "Finally, add support for non-void operations."
  ], 
  "revision_id": "139155"
 }
]