[
 {
  "author": "costin", 
  "date": "2003-04-07T07:15:26.000000Z", 
  "msg": [
   "Based on ModJkMX, a small proxy to support simple remote mbeans.", 
   "The communication uses manifest format - very easy to parse, standard and", 
   "\"good enough\" for this purpose."
  ], 
  "revision_id": "139184"
 }, 
 {
  "author": "costin", 
  "date": "2003-04-07T07:12:02.000000Z", 
  "msg": [
   "Few changes:", 
   "- added callbacks to the source on attribute change", 
   "- if the resource has a setModelMBean method, it'll be called with the current model.", 
   "This can be used by the resource to send notifications ( since BaseModelMBean has", 
   "all the support for registration and sending ) or to find the Registry without using", 
   "evil static methods", 
   "- various fixes to avoid depending on an actual resource", 
   "- save the object name - it'll be needed to pass up to the source", 
   "- constructor that takes the source", 
   "- split setModeledType in 2 - one part will set the metadata, the other", 
   "will create the resource ( need to use BaseModelMBean in standard MLET", 
   "files or other config files that expect regular mbeans )"
  ], 
  "revision_id": "139183"
 }, 
 {
  "author": "costin", 
  "date": "2003-04-07T06:55:21.000000Z", 
  "msg": [
   "Refactoring - moved the duplicated conversion code to Registry,", 
   "where we can support all standard types we need to support ( and maybe", 
   "a plugin mechansim )"
  ], 
  "revision_id": "139182"
 }, 
 {
  "author": "costin", 
  "date": "2003-04-07T06:54:29.000000Z", 
  "msg": [
   "A bit of refactoring, started to add support for id/refid and other", 
   "actions."
  ], 
  "revision_id": "139181"
 }, 
 {
  "author": "costin", 
  "date": "2003-04-07T06:53:11.000000Z", 
  "msg": [
   "Few more fixes, and initial code to add support for persistence.", 
   "Removed some of the experiments on syntax and unimplemented features.", 
   "For classloader control it'll probably use regular mbeans.", 
   "The persistence will be implemented using the DOM tree - each mbean", 
   "name will be associated with the DOM Node. Updates will be propagated", 
   "from BaseModelMbean to the source - and they'll change the corresponding", 
   "<attribute> nodes. Then Save will just write the DOM - so all comments", 
   "and structure will be preserved."
  ], 
  "revision_id": "139180"
 }
]