[
 {
  "author": "dfs", 
  "date": "2003-08-26T05:43:56.000000Z", 
  "msg": [
   "fasselin@ca.ibm.com reported failure of SMTP on OS/390 which has EBCDIC as the", 
   "native character set.  I changed the connection hooks (_connectAction_())", 
   "for the FTP, SMTP, POP3, and NNTP classes to force use of an 8-bit", 
   "US-ASCII superset (ISO-8859-1) for protocol communication.  This was", 
   "necessary because InputStreamReader and OutputStreamWriter use the default", 
   "client-side character set encoding.  I don't know if this should be", 
   "user-configurable or if the encodings should be fixed.  Regardless,", 
   "all JVMs are required to support US-ASCII and ISO-8859-1, so there", 
   "shouldn't be a problem with using a fixed encoding.", 
   "PR: 22656"
  ], 
  "revision_id": "139399"
 }, 
 {
  "author": "dfs", 
  "date": "2003-08-25T22:29:49.000000Z", 
  "msg": [
   "Changed listing pattern in UnixFTPEntryParser to account for missing", 
   "space between user and group fields.", 
   "\"Matthieu Recouly\" <matthieu.recouly@laposte.net> reported that", 
   "some FTP servers will list files in this format (referencing", 
   "http://www.javaworld.com/javaworld/jw-04-2003/jw-0404-ftp-p2.html)", 
   "I added test cases for this listing format to UnixFTPEntryParserTest.java", 
   "and EnterpriseUnixFTPEntryParserTest.java.  EnterpriseUnixFTPEntryParser", 
   "already handles the format, but didn't have a test for it.  Reported", 
   "change in changes.xml."
  ], 
  "revision_id": "139398"
 }, 
 {
  "author": "brudav", 
  "date": "2003-08-10T09:23:32.000000Z", 
  "msg": [
   "Added option negotiation notification interface."
  ], 
  "revision_id": "139397"
 }, 
 {
  "author": "dfs", 
  "date": "2003-08-05T20:06:38.000000Z", 
  "msg": [
   "Fixed testParseFieldsOnFile() so that year is properly accounted for.", 
   "The way the test was originally written (revision 1.1) it would only work", 
   "August 2002 - July 2003 which rev 1.2 fixed by not checking the year", 
   "component."
  ], 
  "revision_id": "139396"
 }, 
 {
  "author": "brekke", 
  "date": "2003-08-05T18:56:42.000000Z", 
  "msg": [
   "The testBadListing/testGoodListing need not be overridden since the data", 
   "and parser are what varies.  The changes to the array of listings reflected a", 
   "full listing parse using the legacy interface.  Unfortunately the test cases", 
   "weren't setup to support a full listing parse, but just a collection of", 
   "bad entries and good entries.  I put the headers and trailer entries into", 
   "the bad listing as they should fail to parse.", 
   "Then I created a new test method to excersise the parseFileList() method.", 
   "This may want to move into its own set of test cases similar to the entry", 
   "parser tests."
  ], 
  "revision_id": "139395"
 }
]