[
 {
  "author": "heshan", 
  "date": "2012-10-05T15:46:27.213394Z", 
  "msg": [
   "Removing mysql dependency as it is not license compatible."
  ], 
  "revision_id": "1394603"
 }, 
 {
  "author": "olamy", 
  "date": "2012-10-05T15:46:18.455727Z", 
  "msg": [
   "change phase for enunciate for be able to use with tomcat7:run"
  ], 
  "revision_id": "1394602"
 }, 
 {
  "author": "jukka", 
  "date": "2012-10-05T15:45:35.317497Z", 
  "msg": [
   "OAK-170: Child node state builder", 
   "Rename NodeState.getBuilder() to .builder() and NodeBuilder.getChildBuilder() to .child() for brevity of downstream code.", 
   "This also breaks the name pattern that suggests that these methods are simple getters."
  ], 
  "revision_id": "1394601"
 }, 
 {
  "author": "alexdma", 
  "date": "2012-10-05T15:42:33.951307Z", 
  "msg": [
   "Now adding the content of the generic dir for STANBOL-672. Notes:", 
   "- Also a major reorganization of the API and implementations took place, in accordance with the rest of Stanbol. Only the ontology export adapters are missing (see STANBOL-710)", 
   "- Backwards compatibility has problems. For some obscure reason, service references were not satisfied for components that exposed both the old and the new service interface, but they do if I move them to a package other than o.a.s.ontologymanger.ontonet.api.* - this is weird. As I try to figure out why, I am moving the backwards compatible API to an \"obsolete\" package", 
   "- to improve backwards compatibility, I also need to override interface methods so that they return objects of the obsolete types. But they these overridden methods will have to be implemented, which is a major pain, so I will first make sure the above issue is solved.", 
   "- reasoners.web still references the obsolete service interfaces, in order to verify compatibility", 
   "- RESTful endpoint renaming is still TODO."
  ], 
  "revision_id": "1394600"
 }, 
 {
  "author": "coheigea", 
  "date": "2012-10-05T15:42:25.355961Z", 
  "msg": [
   "[CXF-4545] - Additional fixes for 2.4.x"
  ], 
  "revision_id": "1394599"
 }
]