[
 {
  "author": "dfs", 
  "date": "2004-01-08T21:28:26.000000Z", 
  "msg": [
   "Added entries for recent changes (scohen removal of JDK 1.1", 
   "incompatibilities for v1.1.1, scohen's addition of", 
   "FTPFileEntryParserFactory and entry parser autodetection, scohen/dfs", 
   "deprecation of FTPFileListParser, DefaultFTPFileListParser and", 
   "dependent methods)."
  ], 
  "revision_id": "139439"
 }, 
 {
  "author": "dfs", 
  "date": "2004-01-06T22:24:24.000000Z", 
  "msg": [
   "Removed parseFileList.  We decided we don't need it and there are", 
   "better ways of handling the case(s) where it might have been useful."
  ], 
  "revision_id": "139438"
 }, 
 {
  "author": "dfs", 
  "date": "2004-01-06T19:53:58.000000Z", 
  "msg": [
   "Deprecated FTPFileListParser and copied its parserFileList method to", 
   "the FTPFileEntryParser interface.  This is not an irreversible change,", 
   "but is consistent with what we've been discussing on the mailing list.", 
   "We can always back it out if need be.  I also deleted all of the code", 
   "for DefaultFTPFileListParser and changed the class to extend", 
   "UnixFTPEntryParser.  This change is in accordance with Jeffrey Brekke's", 
   "suggestion that we not maintain multiple implementations of the same thing.", 
   "DefaultFTPFileListParser is deprecated and will be phased out by version 2.0."
  ], 
  "revision_id": "139437"
 }, 
 {
  "author": "dfs", 
  "date": "2004-01-06T19:02:02.000000Z", 
  "msg": [
   "Added caching of the FTPFileEntryParser created in listFiles(String,", 
   "String) to avoid creating a new object every tyime the method is", 
   "called.  This may be regarded as premature optimization, given the", 
   "alleged efficiency of the latest JVMs in creating heap objects and", 
   "collecting garbage.  It is just that file listing is such a common", 
   "operation that it makes sense to avoid repeatedly creating small", 
   "objects when creating one will do.."
  ], 
  "revision_id": "139436"
 }, 
 {
  "author": "dfs", 
  "date": "2004-01-06T18:52:56.000000Z", 
  "msg": [
   "Added caching of system name so that calls to getSystemName() don't", 
   "travel across the wire when autodetecting the FTPFileEntryParser to", 
   "use every time listFiles is called."
  ], 
  "revision_id": "139435"
 }
]