[
 {
  "author": "rwesten", 
  "date": "2012-10-10T12:43:36.492398Z", 
  "msg": [
   "implements STANBOL-766, fixes STANBOL-767"
  ], 
  "revision_id": "1396568"
 }, 
 {
  "author": "ate", 
  "date": "2012-10-10T12:43:21.208200Z", 
  "msg": [
   "RAVE-694: rave-web-hmvc", 
   "- major cleanup and wrapup", 
   "- removed Spring MVC HandlerMethod customization/extensions: runtime state and context management reimplemented and separated out from Spring customizations", 
   "- simplified HandlerMapping handling by collapsing Routed and Nested handling into one (Nested supported Routed already anyway)", 
   "- Changed Nested- prefix to PageFragment- to better reflect and align with both the configuration model and the practical use-cases", 
   "- completed support for PageFragment method handler invocations (.e.g like POSTing of a PageFragement controlled form)", 
   "- HandlerMethodContext expanded with full resolution and lookup of other / related /sibling contexts and providing reverse url path productions for them", 
   "- Added Route.referenceId to support lookup of a specific route based HandlerMethodContext, e.g. like for a dynamically mapped JCR repository based binary resources service", 
   "- full support for HandlerMethodContext reverse path lookup through hmvc:path JSP tag (and thus also Freemarker)"
  ], 
  "revision_id": "1396567"
 }, 
 {
  "author": "chrisdollin", 
  "date": "2012-10-10T12:40:36.423149Z", 
  "msg": [
   "Stripped out repair and foreign libs, added pom, suppressed jdbc."
  ], 
  "revision_id": "1396566"
 }, 
 {
  "author": "mikemccand", 
  "date": "2012-10-10T12:39:43.925698Z", 
  "msg": [
   "fix false test failure"
  ], 
  "revision_id": "1396565"
 }, 
 {
  "author": "hwright", 
  "date": "2012-10-10T12:39:31.259997Z", 
  "msg": [
   "Only define a private function on platforms where we actually use it.", 
   "All the other callers are protected by similar define guards.", 
   "* subversion/libsvn_subr/path.c", 
   "(get_path_encoding): Only define on !WIN32 && !DARWIN."
  ], 
  "revision_id": "1396564"
 }
]