[
 {
  "author": "pnasser", 
  "date": "2012-10-30T04:37:16.747233Z", 
  "msg": [
   "small change to index.html"
  ], 
  "revision_id": "1403613"
 }, 
 {
  "author": "amaniatis", 
  "date": "2012-10-30T04:25:48.191240Z", 
  "msg": [
   "Add all the historic Confluence generated documentation and javadoc documentation to our new Apache CMS. This was pulled from the live site in the last few hours, so at this time all new changes from Confluence will not be picked up. We should set Confluence to read-only at this point for the DOC12, DOC20 and DOC30 spaces.", 
   "Note that the DOC space was not migrated since it is destined to become docbook documentation for the 3.1 release."
  ], 
  "revision_id": "1403612"
 }, 
 {
  "author": "mamta", 
  "date": "2012-10-30T04:03:45.153365Z", 
  "msg": [
   "DERBY-5232 (Put a stern README file in log and seg0 directories to warn users of corrpution they will cause if they touch files there)", 
   "This will create 3 readme(README_DONT_TOUCH_FILES.txt) files at database creation time, One at the database level, one in the \"log\" directory and another in the \"seg0\" directory.", 
   "a)Content of the readme file at the database level are as follows", 
   "# *************************************************************************", 
   "# *** Do not touch files in this directory! ***", 
   "# *** FILES IN THIS DIRECTORY AND SUB-DIRECTORIES CONSTITUES DERBY ***", 
   "# *** DATABASE WHICH INCLUDES THE DATA(USER AND SYSTEM) AND THE ***", 
   "# *** NECESSARY FILES FOR DATABASE RECOVERY. ***", 
   "# *** EDITING, ADDITING OR DELETING ANY OF THESE FILES MAY CAUSE DATA ***", 
   "# *** CORRUPTION AND LEAVE THE DATABASE IN NON-RECOVERABLE STATE. ***", 
   "# *************************************************************************", 
   "b)Content of the readme file at \"seg0\" directory are as follows", 
   "# *************************************************************************", 
   "# *** Do not touch files in this directory! ***", 
   "# *** FILES IN THIS DIRECTORY ARE USED BY THE DERBY DATABASE TO STORE ***", 
   "# *** USER AND SYSTEM DATA. EDITING, ADDING, OR DELETING FILES IN THIS ***", 
   "# *** DIRECTORY WILL CORRUPT THE ASSOCIATED DERBY DATABASE, AND WILL ***", 
   "# *** NOT BE RECOVERABLE. ***", 
   "# *************************************************************************", 
   "c)Content of the readme file at \"log\" directory are as follows", 
   "# *************************************************************************", 
   "# *** Do not touch files in this directory! ***", 
   "# *** FILES IN THIS DIRECTORY ARE USED BY THE DERBY DATABASE RECOVERY ***", 
   "# *** SYSTEM. EDITING, ADDING OR DELETING FILES IN THIS DIRECTORY WILL ***", 
   "# *** CAUSE THE DERBY RECOVERY SYSTEM TO FAIL LEADING TO UNRECOVERABLE ***", 
   "# *** CORRUPT DATABASES. ***", 
   "# *************************************************************************"
  ], 
  "revision_id": "1403611"
 }, 
 {
  "author": "sarowe", 
  "date": "2012-10-30T03:45:02.560951Z", 
  "msg": [
   "SOLR-1972: Maven configuration: add metrics-core dependency to solr-core POM"
  ], 
  "revision_id": "1403610"
 }, 
 {
  "author": "spamassassin_role", 
  "date": "2012-10-30T03:34:12.506137Z", 
  "msg": [
   "updated scores for revision 1403196 active rules added since last mass-check"
  ], 
  "revision_id": "1403609"
 }
]