[
 {
  "author": "tobrien", 
  "date": "2003-05-15T05:47:51.000000Z", 
  "msg": [
   "Submitted by: Phil S.", 
   "Reviewed by: Tim O."
  ], 
  "revision_id": "140829"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-15T05:39:01.000000Z", 
  "msg": [
   "The following changes were made to the Univariate implementation.  The public", 
   "interface of Univariate was extracted in an interface of the same name.", 
   "Univariate, an interface, is now implemented by UnivariateImpl which contains", 
   "all code originally present in the original Univariate implementation.", 
   "* StoredUnivariate is an interface which extends Univariate and adds", 
   "measures not available in the superinterface such as mode, kurtosis, and skew", 
   "* StoredUnivariateImpl provides an implementation which uses the", 
   "ExpandableDoubleArray for internal storage.  Calculations are performed", 
   "on demand *each* time a particular measure is required no state is", 
   "maintained by this implementation.", 
   "* Univariate provided methods addValue(int), addValue(float), addValue(long).", 
   "There functions were removed as no cast is required - all of these", 
   "assignments are widening conversions - no cast required", 
   "* Removed the name property from Univariate - property not relevant to", 
   "univariate statistics"
  ], 
  "revision_id": "140828"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-15T05:19:57.000000Z", 
  "msg": [
   "Added an expandable double array, this class simply contains a double[] and takes care of automatic expansion of an internal array when necessary.  Class added with accompanying unit test"
  ], 
  "revision_id": "140827"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-13T19:08:14.000000Z", 
  "msg": [
   "1. Make RealMatrixImpl implement Serializable", 
   "2. Make all currently unimplemented methods throw UnsupportedOperationException", 
   "3. Add solve() method to RealMatrix interface, representing vector", 
   "solution to AX = B, where B is the parameter and A is *this.", 
   "Phil", 
   "Obtained from: Phil S.", 
   "Submitted by: Phil S.", 
   "Reviewed by: Tim O."
  ], 
  "revision_id": "140826"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-12T20:32:26.000000Z", 
  "msg": [
   "Added myself to STATUS and PROPOSAL"
  ], 
  "revision_id": "140825"
 }
]