[
 {
  "author": "tobrien", 
  "date": "2003-05-22T15:31:38.000000Z", 
  "msg": [
   "RandomDataTest.testNextGaussian() was using Univarite.getN().  Added", 
   "an explicit cast from int to double.  Test now succeeds."
  ], 
  "revision_id": "140854"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-22T15:19:32.000000Z", 
  "msg": [
   "The EmpiricalDistributionImpl that submitted yesterday assumed the \"old\"", 
   "Univariate interface, in which getN() returned a double.  The attached patch", 
   "inserts the necessary casts to avoid the rounding/truncation errors that were", 
   "causing the EmpiricalDistribution and ValueServer unit tests to fail.", 
   "The patch also adds a RandomData member variable so that getNext() does not", 
   "instantiate a new RandomData instance for each activation", 
   "PR: Bugzilla #20149", 
   "Obtained from: Issue Patch", 
   "Submitted by: Phil Steitz", 
   "Reviewed by: Tim O'Brien"
  ], 
  "revision_id": "140853"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T18:24:46.000000Z", 
  "msg": [
   "Added task to bring javadoc into compliance with standard.  Javadoc", 
   "generate currently throws 35 errors."
  ], 
  "revision_id": "140852"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T17:59:20.000000Z", 
  "msg": [
   "Added Product and Mean to Univariate and all implementations, this patch", 
   "contains contributions from Mark Diggory.", 
   "* This patch introduces Product and GeometricMean into the Univariate", 
   "implementation.", 
   "* Discarding the contribution of a discarded element in a rolling", 
   "UnivariateImpl requires that the product be calculated explicitly each", 
   "time a value is discarded.  This is necessary because not all values will", 
   "have non-zero values.", 
   "* Errors in rolling logic for ListUimpl, and UnivariateImpl were corrected,", 
   "and more test cases were added to the JUnit tests for the Univariate", 
   "implementations.  More rigorous test cases are needed for the entire", 
   "suite of Univariate implementations"
  ], 
  "revision_id": "140851"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T15:11:54.000000Z", 
  "msg": [
   "xdoc tasks.xml was updated to reflect tasks pertaining to the next planned", 
   "release.  There tasks were lifted from Phil S. earlier message to", 
   "commons-dev@"
  ], 
  "revision_id": "140850"
 }
]