[
 {
  "author": "tobrien", 
  "date": "2003-05-26T17:29:36.000000Z", 
  "msg": [
   "Adds the one sample, t-test statistic to TestStatistic and implementations.", 
   "Also add unit tests. - BW", 
   "PR: Issue #20231", 
   "Obtained from: Bugzilla", 
   "Submitted by: Brent Worden", 
   "Reviewed by: Tim O'Brien"
  ], 
  "revision_id": "140859"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-26T02:11:50.000000Z", 
  "msg": [
   "An implementation of ordinary least squares regression with one independent", 
   "variable. The implementation uses running sums and does not require the data", 
   "to be stored in memory.  Since I could not conceive of any significantly", 
   "different implementation strategies that did not amount to just improving", 
   "efficiency or numerical accuracy of what I am submitting, I did not abstract", 
   "the interface.", 
   "The test cases validate the computations against NIST reference data and", 
   "verified computations. The slope, intercept, their standard errors and", 
   "r-square estimates are accurate to within 10E-12 against the reference data", 
   "set.  MSE and other ANOVA stats are good at least to within 10E-8. -- Phil S.", 
   "PR: Issue #20224", 
   "Obtained from: Bugzilla", 
   "Submitted by: Phil Steitz", 
   "Reviewed by: Tim O'Brien"
  ], 
  "revision_id": "140858"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-23T17:33:18.000000Z", 
  "msg": [
   "From Phil Steitz patch submission for Issue #20175", 
   "The attached patch includes the following improvements to Univariate and", 
   "UnivariateImpl:", 
   "* Improved efficiency of min, max and product maintenance when windowSize is", 
   "limited by incorporating suggestion posted to commons-dev by Brend Worden", 
   "(added author credit).  Thanks, Brent!", 
   "* Added javadoc specifying NaN contracts for all statistics, definitions for", 
   "geometric and arithmetic means.", 
   "* Made some slight modifications to UnivariateImpl to make it consistent with", 
   "NaN contracts", 
   "* All interface documentation moved to Univariate. The interface specification", 
   "includes the NaN semantics and a first attempt at clealy defining exactly", 
   "what \"rolling\" means and how this effects what statistics are defined when.", 
   "* Added test cases to verify that min, max, product are correctly maintained", 
   "when \"rolling\" and to verify that NaN contracts are satisfied."
  ], 
  "revision_id": "140857"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-23T16:28:16.000000Z", 
  "msg": [
   "Readded the linkcheck and tasklist reports"
  ], 
  "revision_id": "140856"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-22T16:55:22.000000Z", 
  "msg": [
   "Added mdiggory patch for developer resources"
  ], 
  "revision_id": "140855"
 }
]