[
 {
  "author": "chirino", 
  "date": "2012-11-14T19:19:21.515768Z", 
  "msg": [
   "Fixing amqp impl bugs."
  ], 
  "revision_id": "1409308"
 }, 
 {
  "author": "davidb", 
  "date": "2012-11-14T19:18:12.229437Z", 
  "msg": [
   "Move the updated JMX implementation from sandbox/jmx-next back to jmx.", 
   "The code being moved implements the Enterprise OSGi R5 JMX specification. This Aries subproject is the Reference Implementation of the OSGi JMX 1.1 specification and as such passes all the OSGi CT tests for JMX 1.1. It was originally copied (with history) from the Aries jmx codebase to the sandbox to allow development to happen in parallel with maintenance to the previous JMX implementation.", 
   "Changes to the main jmx codebase which were made in the mean time were also ported over:", 
   "r1363903 cumminsh [ARIES-862] Adding version ranges for jmx imports", 
   "r1365595 gnodet   [ARIES-884] ClassCastException in JMX when installing some bundles", 
   "r1366650 cumminsh [ARIES-862] Ensuring uber-bundles have correct package versions for transitive dependencies by making them not transitive :)"
  ], 
  "revision_id": "1409307"
 }, 
 {
  "author": "cmpilato", 
  "date": "2012-11-14T19:17:43.985301Z", 
  "msg": [
   "Commit (again) a bit of logic abstraction.  The abstraction is only", 
   "used from one call site at the moment (making it a somewhat less", 
   "valuable abstraction).  But I hope to use it elsewhere, too, if I can", 
   "ever figure out why the various lists used herein keep getting", 
   "corrupted when I try to do so.", 
   "* subversion/libsvn_ra_serf/update.c", 
   "(report_context_t): Add 'closed_root' flag.", 
   "(maybe_close_dir_chain): New helper function with logic cored out of...", 
   "(finish_report): ...here.  Also, use the new report_context_t", 
   "'closed_root' flag instead of the similarly named local variable."
  ], 
  "revision_id": "1409306"
 }, 
 {
  "author": "elecharny", 
  "date": "2012-11-14T19:17:22.386300Z", 
  "msg": [
   "Deleting the javadocs directory"
  ], 
  "revision_id": "1409305"
 }, 
 {
  "author": "elecharny", 
  "date": "2012-11-14T19:15:46.708093Z", 
  "msg": [
   "Added the Javadocs directory"
  ], 
  "revision_id": "1409304"
 }
]