[
 {
  "author": "aconway", 
  "date": "2012-11-14T16:04:28.996851Z", 
  "msg": [
   "QPID-4401: Revert: HA bindings for QMF exchanges not replicated.", 
   "This reverts r1403946: There was a problem with this, for example if I bind a", 
   "queue Q to receive broker events. On the backup, Q will receive double events:", 
   "from the replicating subscription to the primary and events generated locally in", 
   "the backup broker. That can cause the backup to generate \"invalid position\"", 
   "errors and shut down."
  ], 
  "revision_id": "1409243"
 }, 
 {
  "author": "aconway", 
  "date": "2012-11-14T16:04:14.971760Z", 
  "msg": [
   "NO-JIRA: avoid un-necessary warnings in ha_tests.py test_qmf_replication."
  ], 
  "revision_id": "1409242"
 }, 
 {
  "author": "aconway", 
  "date": "2012-11-14T16:04:04.841026Z", 
  "msg": [
   "QPID-4428: HA add UUID tag to avoid using an out of date queue/exchange.", 
   "Imagine a cluster with primary A and backups B and C. A queue Q is created on A", 
   "and replicated to B, C. Now A dies and B takes over as primary. Before C can", 
   "connect to B, a client destroys Q and creates a new queue with the same name.", 
   "When B connects it sees Q and incorrectly assumes it is the same Q that it has", 
   "already replicated. Now C has an inconsistent replica of Q.", 
   "The fix is to tag queues/exchanges with a UUID so a backup can tell if a queue", 
   "is not the same as the one it has already replicated, even if the names are the", 
   "same.  This all also applies to exchanges.", 
   "- Minor imrovements to printing UUIDs in a FieldTable.", 
   "- Fix comparison of void Variants, added operator !="
  ], 
  "revision_id": "1409241"
 }, 
 {
  "author": "chaase3", 
  "date": "2012-11-14T15:59:13.852124Z", 
  "msg": [
   "DERBY-5993  The Reference Manual shows an embedded url in its example for the client-side-only retrieveMessageText attribute.", 
   "Merged patch DERBY-5993.diff to 10.8 doc branch from trunk revision 1409223."
  ], 
  "revision_id": "1409240"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2012-11-14T15:59:03.904815Z", 
  "msg": [
   "OPENEJB-1934 respect cdi (beans.xml) for arquillian-openejb-embedded-4 when using webarchive"
  ], 
  "revision_id": "1409239"
 }
]