[
 {
  "author": "luc", 
  "date": "2012-11-20T17:22:04.614166Z", 
  "msg": [
   "Ensure all differentiated method have a reference DerivativeStructure.", 
   "Some methods that must be differentiated rely only on fields to compute", 
   "their return value and do not have double arguments. When", 
   "differentiated, they must build DerivativeStructure instances on their", 
   "own. However, building DerivativeStructure instances requires knowing", 
   "the number of free parameters and the derivation order, which are", 
   "usually passed as arguments.", 
   "Previously, methods that had differentiated arguments retrieved the", 
   "number of free parameters and the derivation order from their arguments,", 
   "and other methods retrieved these values from the fields they used. This", 
   "did not work if the fields have not been initialized yet and only the", 
   "primitive double field was available. So now we make sure that all", 
   "differentiated methods get at least one differentiated argument, even if", 
   "the primitive method did not have any double arguments. We set up a", 
   "custom additional arguments if needed. This indeed simplifies handling,", 
   "as we are sure we always use the arguments."
  ], 
  "revision_id": "1411753"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2012-11-20T17:20:20.127886Z", 
  "msg": [
   "use staging repository in the POM to test Wagon 2.3, this is wrong but until the Jenkins/Nexus setup is figured out this will keep the build working"
  ], 
  "revision_id": "1411752"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2012-11-20T17:18:22.976432Z", 
  "msg": [
   "Centered table in the page."
  ], 
  "revision_id": "1411751"
 }, 
 {
  "author": "astitcher", 
  "date": "2012-11-20T17:16:11.607159Z", 
  "msg": [
   "QPID-4447: C++ Client can hang during connect if heartbeat disconnect fires"
  ], 
  "revision_id": "1411750"
 }, 
 {
  "author": "tgraves", 
  "date": "2012-11-20T17:05:54.502530Z", 
  "msg": [
   "add fingerprint for tgraves"
  ], 
  "revision_id": "1411749"
 }
]