[
 {
  "author": "rhuijben", 
  "date": "2012-11-21T11:27:13.250413Z", 
  "msg": [
   "Following up on r1412034, switch the entire svnlook diff handling to using a", 
   "single output stream. This avoids required flushes when switching between", 
   "output methods.", 
   "Switching all the time introduced all kinds of hidden errors. This removes", 
   "all these corner cases in one step.", 
   "* subversion/svnlook/main.c", 
   "(display_prop_diffs): Add stream and encoding arguments and use these.", 
   "(print_diff_tree): Add stream and encoding arguments and switch to using the", 
   "stream apis for all output. Remove the now unnecessary flushes. Move flush", 
   "comment to caller.", 
   "(do_diff): Flush once and then pass a stream + encoding to the diff handling."
  ], 
  "revision_id": "1412063"
 }, 
 {
  "author": "peter_firmstone", 
  "date": "2012-11-21T11:26:46.443981Z", 
  "msg": [
   "Alter Reggie to throw IOException if port selected by ServerSocketFactory doesn't match requested port, or if default port not available - Changes reverted, it would be desirable to have the port required by BaseQATest communicated to Reggie, which currently gets the unicast socket port from configuration.  BaseQATest falls over when port 4160 is already in use."
  ], 
  "revision_id": "1412062"
 }, 
 {
  "author": "ivank", 
  "date": "2012-11-21T11:24:30.413824Z", 
  "msg": [
   "BOOKKEEPER-466: ZooKeeper test utility sets the port number as the tickTime (ivank)"
  ], 
  "revision_id": "1412061"
 }, 
 {
  "author": "peter_firmstone", 
  "date": "2012-11-21T11:23:37.282392Z", 
  "msg": [
   "Alter Reggie to throw IOException if port selected by ServerSocketFactory doesn't match requested port, or if default port not available - Changes reverted, it would be desirable to have the port required by BaseQATest communicated to Reggie, which currently gets the unicast socket port from configuration.  BaseQATest falls over when port 4160 is already in use."
  ], 
  "revision_id": "1412060"
 }, 
 {
  "author": "elecharny", 
  "date": "2012-11-21T11:14:53.391811Z", 
  "msg": [
   "o The Selector is now visible in NioSession : we need it to be able to wake it up when the OP_WRITE flag is set on a SelectionKey", 
   "o Small improvements when computing the workers name, when we have only one Selector present", 
   "o Removed some 'final'", 
   "o Passed the NioSession in the Registration constructor", 
   "o The SelectionKey is now stored into the NioSession instance : we ned it to be able to register the OP_WRITE event on the SelectionKey when sending a message", 
   "o Added a NioTcpServer constructor to pass only one SelectorLoopPool, when we want to use only one Selector to process all the events", 
   "o Added some methods in the NioRcpSession class", 
   "o Removed the \"public abstract\" qualifier in some interface", 
   "o Replaced imports * by explicit imports", 
   "o Some Javadoc additions"
  ], 
  "revision_id": "1412059"
 }
]