[
 {
  "author": "markrmiller", 
  "date": "2012-11-21T16:39:01.718421Z", 
  "msg": [
   "raise test timeout"
  ], 
  "revision_id": "1412183"
 }, 
 {
  "author": "markrmiller", 
  "date": "2012-11-21T16:36:14.108380Z", 
  "msg": [
   "raise test timeout"
  ], 
  "revision_id": "1412182"
 }, 
 {
  "author": "cframpton", 
  "date": "2012-11-21T16:35:24.758757Z", 
  "msg": [
   "The localized textLayout.properties don't belong here.  Higher layers like Flex provide localized versions by using the TLF hook, GlobalSettings.resourceStringFunction to provide a function to that is called to get the localized string.  This hook is set in RichEditableText.initClass().", 
   "The GlobalSettings.resourceStringFunction function takes two parameters, a resource id and an optional array of parameters to substitute into the string.  The string is of form \"Content {0} more content {1}\". The parameters are read from the optional array and substituted for the bracketed substrings.  TLF provides a default implementation with default strings in English.  Clients may replace this function with their own implementation for localization."
  ], 
  "revision_id": "1412181"
 }, 
 {
  "author": "tabish", 
  "date": "2012-11-21T16:32:07.773995Z", 
  "msg": [
   "Fix StompSslAuthtest failure caused by https://issues.apache.org/jira/browse/AMQ-4180"
  ], 
  "revision_id": "1412180"
 }, 
 {
  "author": "jwross", 
  "date": "2012-11-21T16:31:10.962740Z", 
  "msg": [
   "[ARIES-967] NPE in org.apache.aries.subsystem.core.internal.BundleEventHook.event() at server shutdown.", 
   "Updated the bundle event hook to handle the case where it receives an uninstalled event for a bundle that is not in its", 
   "internal data structure because the hook was not registered when the bundle was installed.", 
   "Also fixed another issue where region context bundles of subsystems that failed to install at certain points were not", 
   "being uninstalled.", 
   "Added some new tests highlighting unmanaged bundle behavior."
  ], 
  "revision_id": "1412179"
 }
]