[
 {
  "author": "gordonsmith", 
  "date": "2012-11-30T23:09:49.750482Z", 
  "msg": [
   "Falcon: Added simple MXML feature tests for <Boolean>, <int>, <uint>, <Number>, <String>, <Class> and generic instance tags such as <Sprite>. They are not yet part of 'ant tsets'.", 
   "These tests currently create an MXML file, compile it to a SWF with MXMLC, and check that it compiles cleanly. Soon I'll make the SWF run in Flash Player and check that the runtime asserts don't fire, so that we know that codegen is correct.", 
   "Such \"feature tests\" are intended to test one specific feature of MXML all the way through compilation and execution. By contrast, \"unit tests\" test only a particular class or subsystem, such as testing the MXML lexer to create MXML tokens, or testing how the MXML parser creates particular kinds of MXML nodes. Furthermore, \"functional tests\" test real-world situations involving multiple features working together. There are three distinct directories for these various kinds of Falcon tests.", 
   "Feature tests do not need to be as exhaustive as the unit tests. For example, suppose we have a complete set of parser tests for the <int> tag and know that ultimately an MXMLLiteralNode gets created with an appropriate int value in each case. Then we do not need to have feature tests for things like integer tags with whitspace around the integer text, or hex integer text, or empty int tags, etc. We can just do a few feature tests that make sure that MXMLLiteralNodes with int values codegen integer values in the VM."
  ], 
  "revision_id": "1415883"
 }, 
 {
  "author": "rkanter", 
  "date": "2012-11-30T23:09:35.187774Z", 
  "msg": [
   "OOZIE-1103 Create example using AltKerberosAuthenticationHandler (rkanter)"
  ], 
  "revision_id": "1415882"
 }, 
 {
  "author": "pent", 
  "date": "2012-11-30T22:57:59.396943Z", 
  "msg": [
   "Generated new iOS baselines and tuned some tests to work for iOS setting."
  ], 
  "revision_id": "1415881"
 }, 
 {
  "author": "suresh", 
  "date": "2012-11-30T22:55:49.530098Z", 
  "msg": [
   "HDFS-4252. Merge 1415879 from branch-1 to branch-1.1"
  ], 
  "revision_id": "1415880"
 }, 
 {
  "author": "suresh", 
  "date": "2012-11-30T22:50:39.640981Z", 
  "msg": [
   "HDFS-4252. Improve confusing log message that prints exception when editlog read is completed. Contributed by Jing Zhao."
  ], 
  "revision_id": "1415879"
 }
]