[
 {
  "author": "gordonsmith", 
  "date": "2012-12-08T01:26:30.451822Z", 
  "msg": [
   "Falcon: Made it easy to inspect the ABC produced by any compilation unit.", 
   "I've added a toString() method to ABCBytesRequestResult that produces an ABC dump using ABCDumpVisitor. You can set a breakpoint in a compilation unit's handleABCBytesRequest() (for example, in MXMLCompilationUnit if you are compiling MXML) and just look at the ABCBytesRequestResult in the debugger to see the dump. This is similar to how you can see entire ASTs and scopes in the debugger."
  ], 
  "revision_id": "1418588"
 }, 
 {
  "author": "lu4242", 
  "date": "2012-12-08T01:25:53.611996Z", 
  "msg": [
   "small refactor, more some inner classes out of restoreState method."
  ], 
  "revision_id": "1418587"
 }, 
 {
  "author": "lu4242", 
  "date": "2012-12-08T01:25:35.372212Z", 
  "msg": [
   "small refactor, more some inner classes out of restoreState method."
  ], 
  "revision_id": "1418586"
 }, 
 {
  "author": "julianfoad", 
  "date": "2012-12-08T01:13:44.148097Z", 
  "msg": [
   "Teach the update-move code to handle the props of a locally moved file,", 
   "where until now it was only handling the text.  Add a test for this.", 
   "[When I committed this I thought it was still not right and I included a", 
   "comment saying that it should be putting the new props into the DB via the", 
   "work queue.  However, that was wrong, as it is running inside a DB txn and", 
   "it is already creating any conflict description file on disk via the work", 
   "queue.]", 
   "* subversion/libsvn_wc/wc_db_update_move.c", 
   "(file_version_t): Add a 'props' member.", 
   "(update_working_file): Handle the props as well. Process the conflict", 
   "'skel' in common for both the text and the props.", 
   "(tc_editor_alter_file, update_moved_away_file): Get and pass on the props.", 
   "* subversion/tests/libsvn_wc/op-depth-test.c", 
   "(NOT_MOVED): New macro.", 
   "(update_prop_mod_into_moved): New test.", 
   "(test_funcs): Add it."
  ], 
  "revision_id": "1418585"
 }, 
 {
  "author": "tebeka", 
  "date": "2012-12-08T01:05:15.797618Z", 
  "msg": [
   "AVRO-1217. Python: set_meta on DataFileWriter does not do anything"
  ], 
  "revision_id": "1418584"
 }
]