[
 {
  "author": "breser", 
  "date": "2012-12-14T19:23:48.576482Z", 
  "msg": [
   "Remove .swig_checked from release builds.", 
   "It gets created as part of the process to generate the C files from SWIG so", 
   "that bindings can be built without SWIG being present.  There is no reason", 
   "for it to remain in the tarball.", 
   "* autogen.sh: Remove .swig_checked when in release mode."
  ], 
  "revision_id": "1422053"
 }, 
 {
  "author": "liyin", 
  "date": "2012-12-14T19:22:46.199139Z", 
  "msg": [
   "[Master] Additional assignment plan for secondary and tertiary for existing table", 
   "Author: adela", 
   "Summary:", 
   "Created additional assignment plan for placing the secondary and tertiary. The plan works as following:", 
   "For each primaryRegion we get the region server. We are trying to pick the servers for secondary and teriary randomly (very similar to placeSecondaryAndTertiaryRS, but we check if this region is already sharing the server for the primary, if so we skip this server. If we have skipped all servers on a rack we go to another rack until our condition is satisfied). In case we reached the last rack we will place the regions there.", 
   "Also added printing baseline and projected dispersion when running --diff", 
   "Test Plan: tested on shadow clusterr]", 
   "Reviewers: liyintang, kannan", 
   "Reviewed By: liyintang", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D650484", 
   "Task ID: 1943777"
  ], 
  "revision_id": "1422052"
 }, 
 {
  "author": "liyin", 
  "date": "2012-12-14T19:22:03.958580Z", 
  "msg": [
   "[HBASE-7348] Add some statistics from DFSClient to RegionServerMetrics", 
   "Author: liyintang", 
   "Summary: DFSClient actually collected a number of useful statistics such as bytesLocalRead, bytesLocalRackRead and so on. So this diff is going to merge these metrics into the RegionServerMetrics.", 
   "Test Plan: Going to test it on the titan shadow cluster in order to investigate the non-local read.", 
   "Reviewers: hkuang, kannan, adela, sdong", 
   "Reviewed By: sdong", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D657336"
  ], 
  "revision_id": "1422051"
 }, 
 {
  "author": "ecn", 
  "date": "2012-12-14T19:19:05.336518Z", 
  "msg": [
   "ACCUMULO-907 fix combiners over iterators that mutate their top key"
  ], 
  "revision_id": "1422050"
 }, 
 {
  "author": "kgiusti", 
  "date": "2012-12-14T19:18:25.343745Z", 
  "msg": [
   "PROTON-161: add testcases"
  ], 
  "revision_id": "1422049"
 }
]