[
 {
  "author": "sf", 
  "date": "2012-12-30T01:23:51.489709Z", 
  "msg": [
   "Add tests for strict HTTP mode"
  ], 
  "revision_id": "1426878"
 }, 
 {
  "author": "sf", 
  "date": "2012-12-30T01:23:24.535607Z", 
  "msg": [
   "Add an option to enforce stricter HTTP conformance", 
   "This is a first stab, the checks will likely have to be revised.", 
   "For now, we check", 
   "* if the request line contains control characters", 
   "* if the request uri has fragment or username/password", 
   "* that the request method is standard or registered with RegisterHttpMethod", 
   "* that the request protocol is of the form HTTP/[1-9]+.[0-9]+,", 
   "or missing for 0.9", 
   "* if there is garbage in the request line after the protocol", 
   "* if any request header contains control characters", 
   "* if any request header has an empty name", 
   "* for the host name in the URL or Host header:", 
   "- if an IPv4 dotted decimal address: Reject octal or hex values, require", 
   "exactly four parts", 
   "- if a DNS host name: Reject non-alphanumeric characters besides '.' and", 
   "'-'. As a side effect, this rejects multiple Host headers.", 
   "* if any response header contains control characters", 
   "* if any response header has an empty name", 
   "* that the Location response header (if present) has a valid scheme and is", 
   "absolute", 
   "If we have a host name both from the URL and the Host header, we replace the", 
   "Host header with the value from the URL to enforce RFC conformance.", 
   "There is a log-only mode, but the loglevels of the logged messages need some", 
   "thought/work. Currently, the  checks for incoming data log for 'core' and the", 
   "checks for outgoing data log for 'http'. Maybe we need a way to configure the", 
   "loglevels separately from the core/http loglevels."
  ], 
  "revision_id": "1426877"
 }, 
 {
  "author": "sebawagner", 
  "date": "2012-12-30T01:20:36.126921Z", 
  "msg": [
   "OPENMEETINGS-228 committing changes from Artyom Horuzhenko"
  ], 
  "revision_id": "1426876"
 }, 
 {
  "author": "pescetti", 
  "date": "2012-12-30T00:58:23.990176Z", 
  "msg": [
   "Use a mailto link. Patch-By: Jon Peli Oleaga"
  ], 
  "revision_id": "1426875"
 }, 
 {
  "author": "rgardler", 
  "date": "2012-12-30T00:51:10.339240Z", 
  "msg": [
   "fixing a sloppy untested commit"
  ], 
  "revision_id": "1426874"
 }
]