[
 {
  "author": "jleroux", 
  "date": "2012-12-29T22:08:19.895835Z", 
  "msg": [
   "I wanted to have the server hour on the webtools job list, not a bid deal, hé?", 
   "As ever, turns it's always more complicated than thought.", 
   "For instance jQuery, even with $.datepicker.formatDate, is not able to format a date + time correctly :/", 
   "So I added a new js script: date.format-1.2.3.js. It's only 4kb, I tried to compress it online, did not work, gave up.", 
   "This is pretty basic, enough for the needs and can be easily extended when more is needed", 
   "5 mins later:", 
   "Yikes, this was pretty stupid. I completly forgot about what I thought 2 weeks ago: it's from the server I need the date-time, so I need a json service.", 
   "Then, today, I completly forgot about it, and thought again: OK, it will consume less ressources w/out a service, if  I only use javascript. A senior moment  I guess :/", 
   "I will rewrite that later, to have the real server hour...", 
   "However, the mechanism I quickly built can still be pretty useful in some cases..."
  ], 
  "revision_id": "1426848"
 }, 
 {
  "author": "dblevins", 
  "date": "2012-12-29T21:41:42.452338Z", 
  "msg": [
   "Testcases with appropriate @Ignore for", 
   "TOMEE-686 - JAX-RS @Context injection for EJB interceptors", 
   "TOMEE-685 - JAX-RS @Context ServletConfig broken for EJBs in WARs", 
   "TOMEE-684 - JAX-RS @Context ServletRequest broken for EJBs in WARs"
  ], 
  "revision_id": "1426847"
 }, 
 {
  "author": "andy", 
  "date": "2012-12-29T21:40:29.272474Z", 
  "msg": [
   "Clean up the naming of parser registries to distinguish RDF syntax processing and SPARQL syntax processing."
  ], 
  "revision_id": "1426846"
 }, 
 {
  "author": "rhuijben", 
  "date": "2012-12-29T21:40:11.131153Z", 
  "msg": [
   "* subversion/libsvn_client/cat.c", 
   "(svn_client__get_normalized_stream): Handle a file as modified for more", 
   "changes than just text changes. (Handles props and tree changes)"
  ], 
  "revision_id": "1426845"
 }, 
 {
  "author": "hboutemy", 
  "date": "2012-12-29T21:37:07.739344Z", 
  "msg": [
   "restored jdk 1.5 compatibility"
  ], 
  "revision_id": "1426844"
 }
]