[
 {
  "author": "mfranklin", 
  "date": "2012-12-28T19:49:31.827727Z", 
  "msg": [
   "Fixed build issue with integration tests under mongo profile"
  ], 
  "revision_id": "1426613"
 }, 
 {
  "author": "liyin", 
  "date": "2012-12-28T19:19:20.129854Z", 
  "msg": [
   "[HBASE-7276] Keep track of the num of rows being read and updated in RegionServer", 
   "Author: liyintang", 
   "Summary:", 
   "There was some confusions before whether RS shall maintain the num of read/write rpc call ops or the num of rows being read/updated. After some discussions with Adela, we felt like there is useless to maintain the rpc call ops since region server had already kept track of the multiput, next and get ops anyway.", 
   "So this diff is to keep track of the num of rows being read and updated in RS. In addition, I have removed the per-region level read/write cnt since it is not cose-effective. (Expensive to maintain it but not much value gained)", 
   "Test Plan: going to test it on the dev cluster and shadow cluster", 
   "Reviewers: adela", 
   "Reviewed By: adela", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D667725"
  ], 
  "revision_id": "1426612"
 }, 
 {
  "author": "tedyu", 
  "date": "2012-12-28T19:19:06.066271Z", 
  "msg": [
   "HBASE-7428 There are multiple HConstants for configuring Zookeeper timeout (Nick Dimiduk)"
  ], 
  "revision_id": "1426611"
 }, 
 {
  "author": "liyin", 
  "date": "2012-12-28T19:18:46.680058Z", 
  "msg": [
   "[HBASE-7444] Change the default user name in the HBase unit test", 
   "Author: liyintang", 
   "Summary: After moving to baboon,  a large set of HBase unit tests are failed due to the previous hbase user name format.", 
   "Test Plan: tested on previous failed unit tests such as org.apache.hadoop.hbase.TestGlobalMemStoreSize", 
   "Reviewers: adela, pritam", 
   "Reviewed By: adela", 
   "CC: hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D667427", 
   "Task ID: 1984003"
  ], 
  "revision_id": "1426610"
 }, 
 {
  "author": "ieugen", 
  "date": "2012-12-28T19:02:47.230890Z", 
  "msg": [
   "MAILET-46 Small website fixes"
  ], 
  "revision_id": "1426609"
 }
]