[
 {
  "author": "rdonkin", 
  "date": "2003-10-12T09:11:53.000000Z", 
  "msg": [
   "Fixed types in apache licenses"
  ], 
  "revision_id": "142829"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-10-10T03:55:51.000000Z", 
  "msg": [
   "Add a simple servlet that lets you dispatch incoming requests to an", 
   "appropriate chain.  Three sample mapping commands (by path info,", 
   "extension matching, or a named request parameter) were checked in earlier."
  ], 
  "revision_id": "142828"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-10-05T03:02:34.000000Z", 
  "msg": [
   "Add a trio of useful Command implementations suitable for use as the", 
   "\"default\" command to be executed by CommandProcessor.  They support", 
   "mapping of an incoming request to a particular command based on the", 
   "extra path information (PathInfoMapper), a specified request parameter", 
   "value (RequsetParameterMapper), or the servlet path information", 
   "(ServletPathMapper) from the incoming request."
  ], 
  "revision_id": "142827"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-10-04T22:54:10.000000Z", 
  "msg": [
   "Merge configuration from class loader resources (as well as webapp", 
   "resources) from ChainListener2 into ChainListener.", 
   "Correct ChainListener so that it doesn't complain about JAR files in", 
   "/WEB-INF/lib that do not have a META-INF/chain-config.xml resource.", 
   "Unify the behavior and configuration parameter names for ChainListener", 
   "and ChainServlet so that they behave similarly (except that ChainListener", 
   "will also scan JAR files).", 
   "ChainServlet uses *servlet* init parameters, while ChainListener uses", 
   "*context* init parameters, so they can both be used in the same webapp", 
   "if desired (for example, multiple instances of ChainServlet could be", 
   "used to initialize different catalogs.", 
   "TODO:  Unit tests to verify correct behavior.", 
   "TODO:  Subclass of ChainServlet that dispatches requests to a named command", 
   "in the default catalog, for stand alone testing and/or a \"poor man's", 
   "MVC controller\" environments."
  ], 
  "revision_id": "142826"
 }, 
 {
  "author": "husted", 
  "date": "2003-10-01T17:04:02.000000Z", 
  "msg": [
   "ContextListener that loads resoruces from classpath on demand."
  ], 
  "revision_id": "142825"
 }
]