[
 {
  "author": "craigmcc", 
  "date": "2004-10-17T22:39:00.000000Z", 
  "msg": [
   "Add a unit test for CatalogFactoryBase.", 
   "Hmm ... having to explictly reference CatalogFactoryBase to call getInstance()", 
   "seems a little odd ... maybe we should make CatalogFactory itself a concrete", 
   "class instead of an interface (analogous to LogFactory in [logging])."
  ], 
  "revision_id": "142899"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-17T01:53:53.000000Z", 
  "msg": [
   "Add a clear() method to CatalogFactory() so that, for example, a web", 
   "application can clean up allocated catalogs when it shuts down.", 
   "Commit a new CatalogFactoryBase concrete implementation of CatalogFactory,", 
   "originally contribted by Sean Schofield, with the following tweaks:", 
   "* Use Java2 collections classes (including necessary synchronization)", 
   "instead of Hashtable.", 
   "* Make the private string constant used to name the default Catalog", 
   "instance less susceptible to being stepped on by applications.", 
   "* Support the getNames() and clear() methods that were added to", 
   "the CatalogFactory interface.", 
   "* Factor out the common logic used to look up the relevant class", 
   "loader (also making it more robust by using the class loader that", 
   "loaded this class if there is no thread context class loader)", 
   "and the logic to retrieve the appropriate Map of Catalogs related", 
   "to a particular ClassLoader.", 
   "Hint hint ... we still need unit tests for this class :-)."
  ], 
  "revision_id": "142898"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-17T01:23:01.000000Z", 
  "msg": [
   "Per discussion on the Commons Developer list, remove the getInstance() method", 
   "that doesn't really belong here.  Also, add a getNames() method to iterate", 
   "over the names of all known catalogs, similar to how Catalog can iterate over", 
   "the names of all known commands.", 
   "Finally, change line endings from DOS to UNIX (which will probably make the", 
   "diff report unreadable, but only this time) since I'm committing on a Unix", 
   "system."
  ], 
  "revision_id": "142897"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-02T19:20:55.000000Z", 
  "msg": [
   "Commit the proposed CatalogFactory interface, from Sean Schofield.  This is", 
   "primarily for discussion at this point; I'm not (quite) ready to consider it", 
   "to be part of the final API for [chain]."
  ], 
  "revision_id": "142896"
 }, 
 {
  "author": "mrdon", 
  "date": "2004-09-29T19:18:54.000000Z", 
  "msg": [
   "Updating Pluto url"
  ], 
  "revision_id": "142895"
 }
]