[
 {
  "author": "jleroux", 
  "date": "2013-01-05T12:40:13.066523Z", 
  "msg": [
   "A sightly modified patch from Raghavendra Prakash for \"In version 10.04 - After clicking on lookup, display login page again\" https://issues.apache.org/jira/browse/OFBIZ-4937", 
   "Step 1: Login - https://localhost:8443/catalog/control/main; Login with credentials", 
   "Step 2: Now, select Category lookup; Lookup popup appears; Just get rid of the popup", 
   "Step 3: Next, select 'Party' menu item from application tab; You will see the login page again.", 
   "Cause: externalKey becomes stale.", 
   "I have fixed the issue with a small work around:", 
   "externalLoginKeysWR - contains the userLogin for externalLoginKey from app-level tabs", 
   "Logic behind: The userlogin could not be found for the external key after the lookup request handled", 
   "by OFBiz. The external key with app level tabs become stale once the lookup request is handled, and userlogin", 
   "was removed for app level tabs' external keys. As a work around, this fastmap still maitains association with that", 
   "external key. When the userlogin could not be found with external key, it would be searched in this fastmap.", 
   "This is accomplished in checkExternalLoginKey and getExternalLoginKey methods", 
   "jleroux; After testing, I cleaned Raghavendra's contribution. It's maybe not the best way, but it works."
  ], 
  "revision_id": "1429273"
 }, 
 {
  "author": "davsclaus", 
  "date": "2013-01-05T12:33:22.254198Z", 
  "msg": [
   "CAMEL-5889: Added all the tokenize langauges to Scala DSL."
  ], 
  "revision_id": "1429272"
 }, 
 {
  "author": "davsclaus", 
  "date": "2013-01-05T12:32:16.435184Z", 
  "msg": [
   "CAMEL-5889: Added all the tokenize langauges to Scala DSL."
  ], 
  "revision_id": "1429271"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2013-01-05T12:09:54.489931Z", 
  "msg": [
   "TOMEE-703 if no cache don't add StatementCache interceptor + managing specified interceptors instead of removing them setting statmentcache one"
  ], 
  "revision_id": "1429270"
 }, 
 {
  "author": "veithen", 
  "date": "2013-01-05T12:07:48.922748Z", 
  "msg": [
   "Commtting change missing in the previous revision."
  ], 
  "revision_id": "1429269"
 }
]