[
 {
  "author": "craigmcc", 
  "date": "2004-10-21T05:14:45.000000Z", 
  "msg": [
   "Adjust the example chain configuration file to reflect the default", 
   "behavior of expecting a <catalog> outermost element, which will register", 
   "the included chains and commands into the default catalog for this app.", 
   "PR:  Bugzilla #31807", 
   "Submitted by:  Sean Schofield <sean.schofield AT gmail.com>"
  ], 
  "revision_id": "142904"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-18T18:47:12.000000Z", 
  "msg": [
   "Add forgotten new class."
  ], 
  "revision_id": "142903"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-18T01:48:52.000000Z", 
  "msg": [
   "Update ChainListener and ChainServlet (and the subordinate servlet related", 
   "processing commands) to make the presence of the attribute init parameter", 
   "(org.apache.commons.chain.CONFIG_ATTR) select the previous behavior", 
   "where a Catalog is registered as an application scope parameter.  Absence", 
   "of this init parameter will trigger the new-style behavior where config", 
   "files are assumed to contain <catalog> elements, which will cause the catalogs", 
   "to be registered with the CatalogFactory for this application."
  ], 
  "revision_id": "142902"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-18T01:09:06.000000Z", 
  "msg": [
   "Update tests to reflect the modified APIs and logic."
  ], 
  "revision_id": "142901"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-18T01:07:42.000000Z", 
  "msg": [
   "Make CatalogFactory an abstract class instead of an interface, and make", 
   "the getInstance() and clear() methods static on this class.  This is", 
   "necessary both to avoid applications having to reference CatalogFactoryBase,", 
   "but also to ensure that the clear() method actually releases all references", 
   "to the relevant class loader -- in the original scheme, we would still have", 
   "been leaving garbage lying around.", 
   "Refine ConfigRuleSet so that multiple <factory> elements with the same", 
   "catalog name will cause the nested chain and command definitions to be", 
   "merged, instead of replacing the entire catalog with only the contents", 
   "of the last <factory> element.", 
   "FIXME: Modify ConfigureListener and ConfigureServlet to use the new", 
   "mechanisms that expect a <factory> element -- but find a backwards", 
   "compatible way to continue supporting existing use cases."
  ], 
  "revision_id": "142900"
 }
]