[
 {
  "author": "jstrachan", 
  "date": "2002-05-28T23:01:08.000000Z", 
  "msg": [
   "Got all the unit test cases working at last. The betwixt build is now fully Maven-ized!", 
   "The Maven test case now works, we can round trip Maven project beans properly now. We have 2 plugin strategies", 
   "* PluralStemmer (for detecting plural property descriptors from a singular property from the adder method)", 
   "* NameMapper (for turning bean type names into XML elements)", 
   "along with default implementations that match Maven / Turbine results.", 
   "We still need to test the round tripping more with all fields of the Maven / Turbine XML schemas to check there are no bugs left, but its certainly looking pretty close."
  ], 
  "revision_id": "143244"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-05-28T14:17:23.000000Z", 
  "msg": [
   "Patched code so that betwixt can now parse Maven project files, provided the XMLIntrospector is configured with the Maven/Turbine configuration.", 
   "It'd be nice to provide this configuration in some static helper method to do this automatically; just need to think of a good name. e.g. createTurbineStyleIntrospector() ?", 
   "The only thing missing right now is to be able to plugin a type name to element name plugin strategy, so that we can default all type-based elements in Maven/Turbine to lower case.", 
   "Right now the output of the Maven project appears as <Project> similarly its <Developer> and <Dependency> etc."
  ], 
  "revision_id": "143243"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-05-28T13:38:26.000000Z", 
  "msg": [
   "Added support for a pluggable Strategy for matching plural properties with singular adder methods.", 
   "The default implementation seems to work for Maven's immediate requirements (or at least I've not found a case where it doesn't work ;-).", 
   "It should be easy to plugin more comprehensive / complex strategies later on.", 
   "Right now betwixt is close to being able to round trip Maven's Project object model; just need configurable extra wrapping elements around collections for Turbine/Maven style XML documents."
  ], 
  "revision_id": "143242"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-05-28T12:02:42.000000Z", 
  "msg": [
   "James started a proper test for the maven project descriptor so I'm removing", 
   "these and will help him with his efforts."
  ], 
  "revision_id": "143241"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-05-28T11:49:30.000000Z", 
  "msg": [
   "Removed the old build files now that we have the maven build up and running.", 
   "Also added a new JUnit test that tests parsing Maven project.xml documents using Betwixt.", 
   "Also patched the BeanReader to properly handle the use of explicit named paths when registering beans. Though we still need support for name mapping strategy (such as start with lowercase and use-dashes rather than mixed case) as well as a strategy for the plural stemmer for detecting addFoo() and getFoos() methods"
  ], 
  "revision_id": "143240"
 }
]