[
 {
  "author": "stsp", 
  "date": "2013-01-17T14:47:20.799967Z", 
  "msg": [
   "* subversion/tests/cmdline/update_tests.py", 
   "(break_moved_dir_edited_leaf_del): Adjust test expectations. After reverting", 
   "the deleted A/B/E, E itself and its child beta are no longer deleted."
  ], 
  "revision_id": "1434698"
 }, 
 {
  "author": "kwright", 
  "date": "2013-01-17T14:47:11.856098Z", 
  "msg": [
   "Add mime-type determination based on extension."
  ], 
  "revision_id": "1434697"
 }, 
 {
  "author": "kturner", 
  "date": "2013-01-17T14:45:57.559687Z", 
  "msg": [
   "ACCUMULO-962 fixed issue where rfile would read more data than it was supposed to.  Added unit test that reproduced the bug."
  ], 
  "revision_id": "1434696"
 }, 
 {
  "author": "stsp", 
  "date": "2013-01-17T14:43:11.286591Z", 
  "msg": [
   "Revert r1434690, which accidentally changed the wrong test."
  ], 
  "revision_id": "1434695"
 }, 
 {
  "author": "andygumbrecht", 
  "date": "2013-01-17T14:42:30.165492Z", 
  "msg": [
   "Fix thread pool misuse / misunderstandings.", 
   "A bounded thread pool starts with 'threadCore' core threads and should grow to the limit defined by 'threads' during extra load.", 
   "If a pool thread is idle for more than the define timeout it will be discarded, shrinking the pool until the core size is reached.", 
   "The pool can accept runnables up to the number defined by 'queue' + 'threadCore' before the pool will actually grow (this is where the misunderstanding often occurs), so the 'queue' should ideally be bounded to 1 less than 'threadsCore', but certainly less than 'threads', else the pool will never actually grow!", 
   "If the 'queue' and 'threads' are full then an attempt should be made in the rejection handler to add the runnable to the queue for a defined period.", 
   "Failure to add to the queue in this period (ie. a pool thread has not become available) should either result in a logged rejection or make a final attempt to run the runnable in the current thread (the calling thread).", 
   "Ehcache > 2.6.3", 
   "Transaction logging."
  ], 
  "revision_id": "1434694"
 }
]