[
 {
  "author": "roxspring", 
  "date": "2003-10-22T23:27:58.000000Z", 
  "msg": [
   "CommandLine instances can now be queried to find the Options present"
  ], 
  "revision_id": "143484"
 }, 
 {
  "author": "roxspring", 
  "date": "2003-10-22T17:01:06.000000Z", 
  "msg": [
   "Added PrintWriter attribute to HelpFormatter and removed the remaining", 
   "argment from the print(..) method.", 
   "A bonus ofthis is that none of the cli2 tests print to System.out any more"
  ], 
  "revision_id": "143483"
 }, 
 {
  "author": "roxspring", 
  "date": "2003-10-22T16:32:14.000000Z", 
  "msg": [
   "Option order is now preserved in groups.", 
   "Options in groups are now stored as a List rather than Set.", 
   "All appendUsage(..) and helpLines(..) methods can now take a null", 
   "Comparator to use the original order.", 
   "Comparators.DEFAULT has been removed as its no longer needed and", 
   "all references are now initialised to null.", 
   "Therefore option order is now preserved by default"
  ], 
  "revision_id": "143482"
 }, 
 {
  "author": "jkeyes", 
  "date": "2003-10-22T15:53:17.000000Z", 
  "msg": [
   "- renamed StringValidator to EnumValidator"
  ], 
  "revision_id": "143481"
 }, 
 {
  "author": "roxspring", 
  "date": "2003-10-21T20:23:21.000000Z", 
  "msg": [
   "Removed tabs and formatted inline with checkstyle settings", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "143480"
 }
]