[
 {
  "author": "bayard", 
  "date": "2002-06-06T22:50:14.000000Z", 
  "msg": [
   "Had introduced an error into the multiple values. Fixed."
  ], 
  "revision_id": "143454"
 }, 
 {
  "author": "bayard", 
  "date": "2002-06-06T22:49:36.000000Z", 
  "msg": [
   "Made it the long licence and not the short one."
  ], 
  "revision_id": "143453"
 }, 
 {
  "author": "bayard", 
  "date": "2002-06-06T22:32:37.000000Z", 
  "msg": [
   "Added the concept of a type to an Option so it will do auto-conversion for", 
   "the user. Also added a pattern builder a la perl so we don't have to do", 
   "the whole object tree thing. This does mean people won't do descriptions as", 
   "much though, which could be a bad thing.", 
   "These additions are not expected to be perfect, I'd like to redesign a", 
   "touch to use an OptionType class instead of just having the Class", 
   "'constants' in PatternOptionBuilder, I'd like the OptionType concept to", 
   "be pluggable, both in the pattern concept and in the main Option code and", 
   "I'd like to have a plug-in that handles Globbing of files from ORO.", 
   "It also needs to switch to use ConvertUtils from Commons.Beans to handle", 
   "conversions in TypeHandler and needs to add support for converting to", 
   "Dates.", 
   "Obtained from: GenerationJava com.generationjava.util.MapCArgs."
  ], 
  "revision_id": "143452"
 }, 
 {
  "author": "bayard", 
  "date": "2002-06-06T22:09:25.000000Z", 
  "msg": [
   "JUnitTest for the PatternOptionBuilder. Also indirectly tests the OptionType", 
   "concept."
  ], 
  "revision_id": "143451"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-06-06T09:37:26.000000Z", 
  "msg": [
   "Applied John Keyes patches to tidy up the source code and remove some sourcecheck errors.", 
   "Also turned off a few non-essential style checking properties such as brace formatting.", 
   "Also removed the redundant AllTest.java which is no longer required.", 
   "Patched project.xml to properly find all the unit test cases"
  ], 
  "revision_id": "143450"
 }
]