[
 {
  "author": "andy", 
  "date": "2013-02-05T13:15:28.858362Z", 
  "msg": [
   "Change log4j setup"
  ], 
  "revision_id": "1442573"
 }, 
 {
  "author": "jwross", 
  "date": "2013-02-05T13:12:26.520628Z", 
  "msg": [
   "Fix resolution failure due to unprocessed bundle events.", 
   "A previous fix introduced asynchronous event processing in the bundle event hook during certain, short time intervals,", 
   "namely while the root subsystem is initializing. This fix prevents potential deadlocks. However, it also introduced an", 
   "issue where subsystem installations can fail due to resolution errors stemming from unprocessed bundle events when a", 
   "client performs an installation in response to a synchronous subsystem service event. A resolution failure occurs because", 
   "there is a bundle providing the required capability but subsystems is unaware it exists due to the unprocessed bundle", 
   "event.", 
   "This fix mitigates the issue by insuring all pending events have been processed before the root subsystem transitions to", 
   "the STARTING state. It is not currently possible, and perhaps unnecessary, to ensure pending events have been processed", 
   "before transitioning to the INSTALLED state without a major refactoring. To avoid these potential resolution failures,", 
   "clients should not attempt to install subsystems until the root subsystem has achieved at least the STARTING, and", 
   "ideally ACTIVE, states."
  ], 
  "revision_id": "1442572"
 }, 
 {
  "author": "rhuijben", 
  "date": "2013-02-05T13:04:35.937684Z", 
  "msg": [
   "* subversion/libsvn_client/merge.c", 
   "(do_merge): Calculate the resulting set of modified paths once, instead of", 
   "for every loop invocation. We don't reset these lists, so the result is", 
   "unaffected. The answer to the old question why we didn't do this for files", 
   "is that we don't really test reintegrate on files thorougly."
  ], 
  "revision_id": "1442571"
 }, 
 {
  "author": "rwesten", 
  "date": "2013-02-05T12:58:09.189589Z", 
  "msg": [
   "fix for STANBOL-909"
  ], 
  "revision_id": "1442570"
 }, 
 {
  "author": "philharveyonline", 
  "date": "2013-02-05T12:49:54.065297Z", 
  "msg": [
   "PROTON-191: fixed api-reconciliation pom now cmake buid file is usually one level higher"
  ], 
  "revision_id": "1442569"
 }
]