[
 {
  "author": "quintonm", 
  "date": "2003-03-10T00:35:18.000000Z", 
  "msg": [
   "Moved package declaration to the first line of the file.", 
   "Updated javadocs for setPath()"
  ], 
  "revision_id": "144249"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-10T00:27:33.000000Z", 
  "msg": [
   "Moved package declaration to the first line of the file.", 
   "Default constructor has been removed.  It was there previously to call init().", 
   "init() is now called within the other methods to avoid declaring", 
   "MessagingException on the constructor.", 
   "The init() method can only be called once.  Calling it more than once will", 
   "result in an IllegalStateException.", 
   "When attaching an instance of EmailAttachment:", 
   "- FileDataSource will be used instead of URLDataSource if there is no URL.", 
   "- A MessagingException will be thrown if the file does not exist.  It should", 
   "have worked this way before but testing showed that a bad filename for the", 
   "attachment did not cause the exception to be thrown.", 
   "- The path (setPath()) does not have to be an absolute path anymore.  Relative", 
   "paths are now accepted.", 
   "- If you do not set the name for the attachment, it will default to the filename.", 
   "emailBody and main (mime parts) are now private.  Protected methods have been", 
   "added to allow access from subclasses.  Calling either one of these methods will", 
   "cause init() to be called if it has not been already."
  ], 
  "revision_id": "144248"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-09T23:42:16.000000Z", 
  "msg": [
   "Moved package declaration to the first line of the file"
  ], 
  "revision_id": "144247"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-09T22:38:56.000000Z", 
  "msg": [
   "Added the ability to set the sent date"
  ], 
  "revision_id": "144246"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-09T20:14:49.000000Z", 
  "msg": [
   "If the body of the email is not set in a subclass, the content", 
   "will be set to an empty string.  This allows emails without a body", 
   "to be sent."
  ], 
  "revision_id": "144245"
 }
]