[
 {
  "author": "elecharny", 
  "date": "2013-02-06T18:23:30.851049Z", 
  "msg": [
   "Changed the links as some pages have changed"
  ], 
  "revision_id": "1443113"
 }, 
 {
  "author": "rhuijben", 
  "date": "2013-02-06T18:22:19.196446Z", 
  "msg": [
   "Resolve long standing open parts of issues #3150 'tree conflicts with", 
   "directories as victims' and issue #2282 by making the merge of a directory", 
   "delete validate if the delete target matches what the merge expects.", 
   "This was one of the major reasons to refactor the diff interface more than", 
   "absolutely necessary.", 
   "These issues might be completed by this patch, but the descriptions are", 
   "to vague to call them closed at this time.", 
   "* subversion/libsvn_client/merge.c", 
   "(dir_delete_baton_t): Add struct.", 
   "(mark_dir_edited,", 
   "mark_file_edited): If handling a parent-delete, just note the edited state", 
   "in the delete baton instead of notifying.", 
   "(merge_file_opened): If handling a parent-delete and we already detected an", 
   "edit: skip further processing on this node.", 
   "(merge_file_deleted): Store comparision in parent delete baton when", 
   "available. Just call the wc delete if we don't use a single feature of the", 
   "libsvn_client wrapper.", 
   "(merge_dir_opened): Remove the global skip of descendants of deletes, but", 
   "still apply it if we find a reason to skip the current node. Continue or", 
   "start comparison mode on non force-delete deletes.", 
   "(verify_touched_by_del_check): New function.", 
   "(merge_dir_deleted): Compare properties to see if we are different than", 
   "expected to be deleted. Store result in baton.", 
   "For the root: If no differences were collected, verify if we walked", 
   "all existing descendants (including not-ignored local files) and only", 
   "if so delete the directory. Otherwise mark tree conflict.", 
   "* subversion/tests/cmdline/merge_tree_conflict_tests.py", 
   "(tree_conflicts_on_merge_local_ci_5_2): Remove XFail.", 
   "Update expected status.", 
   "* subversion/tests/cmdline/tree_conflict_tests.py", 
   "(merge_dir_del_onto_not_same): Remove XFail."
  ], 
  "revision_id": "1443112"
 }, 
 {
  "author": "chirino", 
  "date": "2013-02-06T18:21:54.994962Z", 
  "msg": [
   "Upgrade leveldbjni versions."
  ], 
  "revision_id": "1443111"
 }, 
 {
  "author": "sarowe", 
  "date": "2013-02-06T18:21:04.238066Z", 
  "msg": [
   "LUCENE-4758: 'ant jar', 'ant compile' and 'ant compile-test' should recurse (merged trunk r1443094)"
  ], 
  "revision_id": "1443110"
 }, 
 {
  "author": "rhillegas", 
  "date": "2013-02-06T18:21:04.214093Z", 
  "msg": [
   "DERBY-5949: Add a -noverify switch to the java commands in the toursdb targets in order to shortcircuit the VerifyError which chokes the Derby build on Open JDK 8."
  ], 
  "revision_id": "1443109"
 }
]