[
 {
  "author": "jfthomps", 
  "date": "2013-02-06T20:57:55.572098Z", 
  "msg": [
   "Reordered functions so they are grouped together based on what they do. This will cascade to them also being grouped together in the generated documentation. No changes were made to the functions other than reordering them."
  ], 
  "revision_id": "1443208"
 }, 
 {
  "author": "jim", 
  "date": "2013-02-06T20:49:31.388477Z", 
  "msg": [
   "in 2.4.x"
  ], 
  "revision_id": "1443207"
 }, 
 {
  "author": "jim", 
  "date": "2013-02-06T20:49:18.080879Z", 
  "msg": [
   "This is in there"
  ], 
  "revision_id": "1443206"
 }, 
 {
  "author": "jfthomps", 
  "date": "2013-02-06T20:47:10.691509Z", 
  "msg": [
   "xmlrpcWrappers.php:", 
   "many updates, mostly addition of parameter checking - specific details for each function will be listed in an email message to the private@ list", 
   "-added option to supply name of reservation to XMLRPCdeployServer", 
   "-XMLRPCremoveUserGroup and XMLRPCdeleteUserGroup did the same thing; made XMLRPCdeleteUserGroup just call XMLRPCremoveUserGroup - kept both so that scripts would not have to change because one was dropped", 
   "-did some updates to headers to provide better documentation generation", 
   "-changed some whitespace formatting", 
   "-modified XMLRPCgetRequestIds - added OS, isserver, state, and if it is a server, servername to returned data-modified XMLRPCgetUserGroupAttributes - added overlapResCount to returned data; modified error return code to not be duplicated with an different error", 
   "-modified XMLRPCremoveUserGroup - added ability to delete federated groups if user has access; added check for group being in use before deleting it and return error if it is in use", 
   "-modified XMLRPCeditUserGroup - added ability to modify federated groups if user has access; do not attempt to update name and affiliation if they are not changed (resulted in an duplicate group name error)", 
   "-modified XMLRPCgetUserGroupMembers - added ability to modify federated groups if user has access", 
   "privileges.php:", 
   "-additional parameter checking", 
   "-modified viewNodes - added serverProfileAdmin to $privs array used to determine which resource groups can be added at the node", 
   "-modified AJsubmitAddChildNode - moved updateUserOrGroupPrivs to inside if conditional (no need to call it if no changes)", 
   "-modified getNodeCascadePrivileges - located problem where blocking cascaded privileges does not continue to child nodes; added fix and commented it out until can properly prepare users for change", 
   "utils.php:", 
   "-modified getResourceGroups - optional argument of $id to limit returned data to just a specified resource group", 
   "-modified getUserGroupID - added optional argument of $noadd that causes the function to return NULL instead of adding the group if it does not already exist", 
   "-modified getTypes - removed conditional that checks for 'block' and 'cascade' with resource groups - type here is computer, image, etc.", 
   "groups.php:", 
   "-modified addGroup - moved conditional for editgroupid to inside 'user' section"
  ], 
  "revision_id": "1443205"
 }, 
 {
  "author": "stefan2", 
  "date": "2013-02-06T20:44:23.067747Z", 
  "msg": [
   "On the fsfs-format7 branch:  make block-read effective by caching", 
   "txdelta windows (can still be disabled explicitly).", 
   "* subversion/libsvn_fs_fs/caching.c", 
   "(read_config): cache txdelta window data by default"
  ], 
  "revision_id": "1443204"
 }
]