[
 {
  "author": "ecn", 
  "date": "2013-02-13T17:58:47.949247Z", 
  "msg": [
   "ACCUMULO-1036 try to stabilize MAC-based tests"
  ], 
  "revision_id": "1445773"
 }, 
 {
  "author": "ceposta", 
  "date": "2013-02-13T17:58:30.888638Z", 
  "msg": [
   "Added a test that shows using virtual topics in a network of brokers to resolve some of the pain that comes up with durable subscriptions across a network. This test demonstrates the use of Virtual Topics and ConditionalNetworkBridgeFilterFactory with replayWhenNoConsumers=true"
  ], 
  "revision_id": "1445772"
 }, 
 {
  "author": "jmhsieh", 
  "date": "2013-02-13T17:56:12.058360Z", 
  "msg": [
   "HBASE-6353: Snapshots shell (Matteo Bertozzi)"
  ], 
  "revision_id": "1445771"
 }, 
 {
  "author": "jmhsieh", 
  "date": "2013-02-13T17:55:00.443236Z", 
  "msg": [
   "HBASE-6571 Generic multi-thread/cross-process error handling framework (Jesse Yates)", 
   "The idea for a generic inter-process error-handling framework came", 
   "from working on HBASE-6055 (snapshots). Distributed snapshots require tight", 
   "time constraints in taking a snapshot to minimize offline time in face of", 
   "errors. However, we often need to coordinate errors between processes and", 
   "the current Abortable framework is not sufficiently flexible to handle the", 
   "multitude of situations that can occur when coordinating between all region", 
   "servers, the master and zookeeper. Using this framework error handling for", 
   "snapshots was a simple matter, amounting to maybe 200 LOC.", 
   "This seems to be a generally useful framework and can be used to easily add", 
   "inter-process error handling in HBase. The most obvious immediate usage is", 
   "as part of HBASE-5487 when coordinating multiple sub-tasks."
  ], 
  "revision_id": "1445770"
 }, 
 {
  "author": "jmhsieh", 
  "date": "2013-02-13T17:53:26.170894Z", 
  "msg": [
   "HBASE-6765 'Take a snapshot' interface (Jesse Yates)", 
   "Add interfaces taking a snapshot. This is in hopes of cutting down on the overhead involved in reviewing snapshots."
  ], 
  "revision_id": "1445769"
 }
]