[
 {
  "author": "jyates", 
  "date": "2013-02-21T19:21:46.856902Z", 
  "msg": [
   "HBASE-7725: Add ability to create custom compaction request - ADDENDUM: fix javadocs"
  ], 
  "revision_id": "1448778"
 }, 
 {
  "author": "philip", 
  "date": "2013-02-21T19:14:45.344769Z", 
  "msg": [
   "* subversion/libsvn_wc/wc_db.c (handle_move_back): Remove accidental SVN_DBG."
  ], 
  "revision_id": "1448777"
 }, 
 {
  "author": "jfthomps", 
  "date": "2013-02-21T19:12:36.909707Z", 
  "msg": [
   "a few more minor bug fixes for 2.3.2", 
   "privileges.js: modified submitAddUserGroup - separated out usergrpchk0:0 from loop because it is handled differently - fixes problem where adding a new user group with the cascade box checked does not actually result in the user group getting cascaded added", 
   "computers.php: \"modified\" submitCompStateChange - only added a comment to highlight an extreme corner case where using the computer utilities to delete computers, where a computer has been selected with one hostname, and another computer has been selected that had the same hostname but was undeleted such that -DELETED-<compid> was added to the hostname, will result in a an SQL error because of a unique key violation", 
   "conf-default.php: added a comment explaining $xmlrpcBlockAPIUsers", 
   "xmlrpcWrappers.php:", 
   "-corrected header description of XMLRPCgetImages to include that description and usage are also returned now", 
   "-modified XMLRPCaddNode - is_null check for checking returned data from getNodeInfo was using $tmp instead of $nodeInfo", 
   "-modified XMLRPCaddUserGroupPriv - fixed problem where checking for privileges of a user group at a node where it had none was using the group name as an array key that did not exist in $np", 
   "-removed \\n from end of items in header of XMLRPCgetUserGroups - was causing doxygen to display a warning", 
   "-modified XMLRPCeditUserGroup - query that got info about the user group was missing a comma after ownerid"
  ], 
  "revision_id": "1448776"
 }, 
 {
  "author": "philip", 
  "date": "2013-02-21T19:12:25.461806Z", 
  "msg": [
   "Add another XFail test for issue 4111 to show NODES problem.", 
   "* subversion/tests/libsvn_wc/op-depth-test.c", 
   "(update_child_under_add): New test.", 
   "(test_funcs): Add new test.", 
   "* subversion/tests/cmdline/update_tests.py", 
   "(update_child_below_add): Tweak comment."
  ], 
  "revision_id": "1448775"
 }, 
 {
  "author": "hossman", 
  "date": "2013-02-21T19:11:04.810567Z", 
  "msg": [
   "SOLR-824: remove last vestige of 'none' as a lockType (merge r1448773)"
  ], 
  "revision_id": "1448774"
 }
]