[
 {
  "author": "yusaku", 
  "date": "2013-02-26T22:48:35.371224Z", 
  "msg": [
   "AMBARI-1501. Nagios alerts do not update automatically. (yusaku)"
  ], 
  "revision_id": "1450503"
 }, 
 {
  "author": "yusaku", 
  "date": "2013-02-26T22:46:54.846334Z", 
  "msg": [
   "AMBARI-1503. Ajax call sometimes adds multiple question marks in the query causing bad requests. (yusaku)"
  ], 
  "revision_id": "1450502"
 }, 
 {
  "author": "rhuijben", 
  "date": "2013-02-26T22:45:48.412291Z", 
  "msg": [
   "* subversion/libsvn_client/copy.c", 
   "(wc_to_repos_copy): Following up on r1450341, make sure we don't use a longer", 
   "living pool as a scratch pool where the result pool just lives for the", 
   "session. This should reduce the number of concurrent open ra sessions, but", 
   "at the same time also avoid the segfault caused before the previous patch."
  ], 
  "revision_id": "1450501"
 }, 
 {
  "author": "olamy", 
  "date": "2013-02-26T22:43:46.593256Z", 
  "msg": [
   "restore download cgi"
  ], 
  "revision_id": "1450500"
 }, 
 {
  "author": "mamta", 
  "date": "2013-02-26T22:43:26.453480Z", 
  "msg": [
   "DERBY-6066(Client should use a prepared statement rather than regular statement for Connection.getTransactionIsolation)", 
   "This commit has the client user a PreparedStatement rather than a Statement to get the current isolation level.", 
   "Additionally, we found while working on this issue, that the calls to get isolation level were not always getting sent to the server side. The research on this found following", 
   "The get transaction isolation call will be sent to the server on the wire in at least following 2 cases", 
   "1)When a newer client is working with the older versions of servers(ie server that do not have support for isolation level caching) - Server version 10.3 and earlier do not support isolation level caching and hence when a newer client(10.4 and higher) is talking to a 10.3 and earlier server, there will be no information available about the current isolation level on the client side and client will ask for the isolation level from the server by sending \"VALUES CURRENT ISOLATION\" over the wire.", 
   "For server versions 10.4 and above, there is a possibility that the current isolation level was already piggybacked to the client as part of some other client server communication and hence the current isolation level is already available to the client and there is no need to send \"VALUES CURRENT ISOLATION\" over the wire to the server.", 
   "2)Additionally, as per DERBY-4314 and write up on piggybacking at http://wiki.apache.org/db-derby/Derby3192Writeup, there might be cases, where even though server has support for isolation level caching, server has not had a chance to send the isolation level piggybacked to the client as part of some other communication between client and server and hence the client will actually need to send \"VALUES CURRENT ISOLATION\" to the server to get the current isolation level."
  ], 
  "revision_id": "1450499"
 }
]