[
 {
  "author": "smor", 
  "date": "2002-07-13T00:49:45.000000Z", 
  "msg": [
   "I added an AskTag, in an InteractionTagLibrary, so that Jelly", 
   "scripts can retrieve variables from the user.", 
   "The AskTag is used as :", 
   "<ask question=\"Your question\"", 
   "answer=\"interaction.ask.answer\"", 
   "default=\"Default answer\"/>", 
   "You can then <echo>${interaction.ask.answer}</echo>.", 
   "If there is no input, it will be \"Default answer\".", 
   "This is useful to set variables dynamically from the user."
  ], 
  "revision_id": "145079"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-10T21:46:18.000000Z", 
  "msg": [
   "o Reverting my changes. I think the whole dynamic tag thing needs some", 
   "reworking. You can't access anything do any sort of communication", 
   "between the dynamic tags and the plugin jelly script in maven unless", 
   "the exporting/inheritence is turned on and there doesn't appear to", 
   "be an easy way to do this (not impossible, i just don't feel like", 
   "doing it at the moment). I turned on inheritence/exporting by", 
   "default and now I'm getting all sorts of argument type mismatches", 
   "so I guess something similiar needs to be done that was done", 
   "to make the Ant tags work."
  ], 
  "revision_id": "145078"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-10T19:57:55.000000Z", 
  "msg": [
   "o Making the newly created context available in the dynamic tag.", 
   "James, if this is evil let me know. But in other jelly scripts I have", 
   "access to the context which is very convenient. In this particular case", 
   "I am trying to access the maven POM inside a dynamic tag lib and I couldn't", 
   "without this change."
  ], 
  "revision_id": "145077"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-07-10T18:53:50.000000Z", 
  "msg": [
   "o Adding a convenience method so we can easily tell if the scanner", 
   "picked up any files."
  ], 
  "revision_id": "145076"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-07-10T17:20:16.000000Z", 
  "msg": [
   "Fixed the build so that the jelly scripts now appear to work - so Jelly can now be run from the command line like Ant and Maven - provided that the JELLY_HOME is set"
  ], 
  "revision_id": "145075"
 }
]