[
 {
  "author": "lofwyr", 
  "date": "2013-03-05T13:02:09.472577Z", 
  "msg": [
   "adding schema"
  ], 
  "revision_id": "1452783"
 }, 
 {
  "author": "rohini", 
  "date": "2013-03-05T12:59:57.651023Z", 
  "msg": [
   "PIG-3081: Pig progress stays at 0% for the first job in hadoop 23 (rohini)"
  ], 
  "revision_id": "1452782"
 }, 
 {
  "author": "stsp", 
  "date": "2013-03-05T12:58:47.374298Z", 
  "msg": [
   "* STATUS: Nominate r1452780."
  ], 
  "revision_id": "1452781"
 }, 
 {
  "author": "stsp", 
  "date": "2013-03-05T12:57:00.095477Z", 
  "msg": [
   "Address issue #4331, \"working copy permissions change on commit for files", 
   "with keywords\" by preventing the accidental removal of existing permission", 
   "bits set on files which undergo translation.", 
   "This is not a perfect answer to the proposition given in the issue that", 
   "\"Committing a file should not change its permissions in the WC.\"", 
   "Committed files may still get a new owner/group/other write bit set if", 
   "the umask allows this and the file's properties indicate that the file must", 
   "be set read-write (see svn_wc__sync_flags_with_props() which might tweak", 
   "permission bits of the translated file). But I think this is acceptable.", 
   "I'm not sure if never changing the permission bits of committed files is", 
   "a realistic requirement. Changing this would require additional effort", 
   "and might break other scenarios.", 
   "* subversion/libsvn_subr/subst.c", 
   "(svn_subst_copy_and_translate4): Copy file permissions from the source file", 
   "to the temporary file which stores the translated result. The temporary", 
   "file might have stricter permissions than the source, due to the way", 
   "our APIs for creating temporary files work. Removing permission bits from", 
   "files during translation is an unwanted side effect and should be avoided."
  ], 
  "revision_id": "1452780"
 }, 
 {
  "author": "jure", 
  "date": "2013-03-05T12:54:36.666700Z", 
  "msg": [
   "#355, test cases for ticket wiki syntax, patch t355_r1452271_trac_test_ticket_wikisyntax.diff applied (from Olemis)"
  ], 
  "revision_id": "1452779"
 }
]