[
 {
  "author": "jstrachan", 
  "date": "2002-09-26T18:35:23.000000Z", 
  "msg": [
   "Patch for bug scarab#12888"
  ], 
  "revision_id": "145259"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-26T18:07:37.000000Z", 
  "msg": [
   "Some JellySwing changes.", 
   "Firstly added support for <borderLayout> and <borderAlign align=\"center\"> style of tags to use the Swing BorderLayout.", 
   "Added support for <vbox> and <hbox> to create Swing Box panels (which have their own inbuilt BoxLayout)", 
   "Also added colfill=\"true\" and rowfill=\"true\" options on <td> so that columns can stretch", 
   "Finally I've improved the JellyRunner so that its a little dialog, with a history field and a button so that reevaluating the same script can be much easier. Just hit save in your editor and hit the button and the Jelly script executes immediately - no more waiting for a JVM to start."
  ], 
  "revision_id": "145258"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-26T12:28:21.000000Z", 
  "msg": [
   "Added support in the <x:transform> tag so that output can be SAX events. This allows more efficient SAX based XSLT pipelines.", 
   "So if users don't want to parse the output of the XSLT, they can just pipe it out as SAX events.", 
   "Also added a test case of this."
  ], 
  "revision_id": "145257"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-25T18:36:59.000000Z", 
  "msg": [
   "Added Otto's groovy demo that shows how Jelly can be used as a templating system.", 
   "To run it type", 
   "maven demo:embed", 
   "What would be interesting would be to write the demo in JellySwing rather than Java :-)"
  ], 
  "revision_id": "145256"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-25T17:54:57.000000Z", 
  "msg": [
   "Patch to demonstrate the use of dialogs in JellySwing.", 
   "The new demo", 
   "maven demo:swing", 
   "now has an about dialog box as well as a Jelly script runner. This lets you leave the Swing UI running and then you can fire off any Jelly script you wish using a file dialog.", 
   "While the program is running you can keep re-evaluating Jelly scripts.", 
   "This makes a large benefit for edit-compile-run cycles. So as you edit Jelly scripts you can just click run to run them. No need to wait for the JVM and Maven to startup"
  ], 
  "revision_id": "145255"
 }
]