[
 {
  "author": "jstrachan", 
  "date": "2002-09-25T16:26:16.000000Z", 
  "msg": [
   "Added support for LayoutManagers to JellySwing. This is vital to providing form like JellySwing front ends.", 
   "This patch includes numerous patches kindly supplied by a new contributor, Paul Libbrecht. There is also support for a new Colour converter to more easily work with colors.", 
   "There are 2 primary layouts supported right now.", 
   "The first is a HTML style <tableLayout> <tr> <td> style approach which all HTML or XHTML developers will be accustomed to.", 
   "It allows you to create Swing forms like this...", 
   "<panel>", 
   "<tableFormat>", 
   "<tr>", 
   "<td colspan=\"2\">", 
   "<label text=\"hello\"/>", 
   "</td>", 
   "<td align=\"center\" valign=\"bottom\">", 
   "...", 
   "<textField text=\"whatever\"/>", 
   "</td>", 
   "The second layouts are provided by Paul and implement full support for GridBagLayouts and their constraints with added support for inheritence of settings from parent/child constraints.", 
   "<gridBagLayout>", 
   "<gbc x=\"0\" y=\"1\" weightx=\"12\">", 
   "<panel>", 
   "etc.", 
   "The demo that can be run via", 
   "maven demo:swing", 
   "Uses by default the tableLayout approach. Then if you click on the Demo menu you can run a sample using the <gridBagLayout> approach."
  ], 
  "revision_id": "145254"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-25T08:37:51.000000Z", 
  "msg": [
   "Applied Robert Leftwich's excellent patches to add full support for <x:transform> for executing XSLT on some XML.", 
   "The XML or the XSLT can come from the tags body just like the <x:transform> tag in JSTL.", 
   "Ultimately this tag can be used to implement sophisticated XSLT pipelining such as...", 
   "<x:transform xslt=\"a.xsl\">", 
   "<x:transform xslt=\"b.xsl\">", 
   "<foo>", 
   "<bar name=\"${some.expression}\"/>", 
   "</foo>", 
   "</x:transform>", 
   "</x:transform>", 
   "which can then be used in association with servlet engines, SOAP services or just generating static content.", 
   "It'd be nice to optimize the implementation at some point so that it can work totally on SAX in the above example. But this is an awesome start.", 
   "Also do check out the groovy unit test cases such as the Schematron examples. It'd be nice to maybe generate a native Jelly implementaiton of Schematron..."
  ], 
  "revision_id": "145253"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-25T06:41:12.000000Z", 
  "msg": [
   "tidied up the cvsignore file..."
  ], 
  "revision_id": "145252"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-24T17:30:33.000000Z", 
  "msg": [
   "Added support for <border> tags via an abstract base class that we can use to implement all the various different kinds of borders.", 
   "Right now I've implemented the <titledBorder> but the others should be fairly simple also, implemented along a similar pattern."
  ], 
  "revision_id": "145251"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-24T16:49:40.000000Z", 
  "msg": [
   "Minor refactor to add the String -> File converter to the standard Jelly libraries rather than leaving it in the Ant tag library."
  ], 
  "revision_id": "145250"
 }
]