[
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:52:28.000000Z", 
  "msg": [
   "Added support in JellySwing for simple TableModels which use any pluggable Jelly Expressions for defining the columns.", 
   "This allows any List of objects to be easily rendered in a table in JellySwing without any programming involved. Its hoped this kind of thing could be ported to SWT too!", 
   "A simple example has been added which will display all the variables in the current context in a table.", 
   "This could be improved somewhat, but shows that a List of property names can be displayed in a table, showing the value, type, row index and the name of the variable; all powered by a List of Strings.", 
   "Another good demo could be to render a table of beans (such as some Maven POM objects) in a table.", 
   "Or to use commons-beanutils or commons-sql to get some DynaBeans and render those in a table using expressions."
  ], 
  "revision_id": "145279"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:46:59.000000Z", 
  "msg": [
   "Removed some unnecessary debugging code and patched to make use of the new getAttributeType() method of DynaTag so that a DynaTag can work with native Expression objects and perform its own coercion."
  ], 
  "revision_id": "145278"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:40:16.000000Z", 
  "msg": [
   "Improved the reusability of the <useBean> tag so that it can be subclassed and default to a regular implementation class. This makes derivations of UseBeanTag easier to write.", 
   "Also added a simple <useList> tag which simplifies the creation and use of Lists. For example to create a new List from some arbitarary collection/enumeration/array/iterator you can do things like", 
   "<useList var=\"mylist\" values=\"${foo.iterator()}\"/>", 
   "${mylist[2]}", 
   "etc."
  ], 
  "revision_id": "145277"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:38:16.000000Z", 
  "msg": [
   "Minor patch so that DynaTag objects can declare the types of their dynamic properties to facilitate better expression type coercion.", 
   "For example a DynaTag might have an attribute which is of type Expression which the DynaTag wishes to evaluate however it wishes without it just being turned into an Object.", 
   "So this method allows DynaTag objects to return, for example, that an attribute is of type Expression.class allowing them to coerce the Expression themselves."
  ], 
  "revision_id": "145276"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-30T17:36:16.000000Z", 
  "msg": [
   "Added some extra debugging code so that the toString() correctly reports the expression text"
  ], 
  "revision_id": "145275"
 }
]