[
 {
  "author": "dpsenner", 
  "date": "2013-03-27T07:25:11.269909Z", 
  "msg": [
   "LOG4NET-370 fix the RemoteSyslogAppender to properly handle log messages that contain newlines", 
   "This patch is based on the work of Jarrod Alexander. Please note that this patch also fixes", 
   "indentation issues and thus contains some portions of refactoring. Finally it is worth to note", 
   "that the patch primarily focuses on making the syslog messages RFC3164 (http://www.ietf.org/rfc/rfc3164.txt) compliant. The signifant parts of the RFC are:", 
   "4.1.3 MSG Part of a syslog Packet", 
   "The MSG part will fill the remainder of the syslog packet. This will", 
   "usually contain some additional information of the process that", 
   "generated the message, and then the text of the message. There is no", 
   "ending delimiter to this part. The MSG part of the syslog packet", 
   "MUST contain visible (printing) characters. The code set", 
   "traditionally and most often used has also been seven-bit ASCII in an", 
   "eight-bit field like that used in the PRI and HEADER parts. In this", 
   "code set, the only allowable characters are the ABNF VCHAR values", 
   "(%d33-126) and spaces (SP value %d32). However, no indication of the", 
   "code set used within the MSG is required, nor is it expected. Other", 
   "code sets MAY be used as long as the characters used in the MSG are", 
   "exclusively visible characters and spaces similar to those described", 
   "above. The selection of a code set used in the MSG part SHOULD be", 
   "made with thoughts of the intended receiver. A message containing", 
   "characters in a code set that cannot be viewed or understood by a", 
   "recipient will yield no information of value to an operator or", 
   "administrator looking at it."
  ], 
  "revision_id": "1461433"
 }, 
 {
  "author": "shinichiro", 
  "date": "2013-03-27T07:19:34.914713Z", 
  "msg": [
   "Japanese translation. Part of CONNECTORS-626."
  ], 
  "revision_id": "1461432"
 }, 
 {
  "author": "hboutemy", 
  "date": "2013-03-27T07:07:39.332679Z", 
  "msg": [
   "[MSITE-683] add support for Maven 3.1/Eclipse Aether in addition to Maven 3.0/Sonatype Aether (through maven-reporting-exec 1.1)"
  ], 
  "revision_id": "1461431"
 }, 
 {
  "author": "mturk", 
  "date": "2013-03-27T07:05:04.404184Z", 
  "msg": [
   "Regen configure"
  ], 
  "revision_id": "1461430"
 }, 
 {
  "author": "hboutemy", 
  "date": "2013-03-27T07:04:35.181087Z", 
  "msg": [
   "[MSHARED-280] add support for Maven 3.1/Eclipse Aether in addition to Maven 3.0/Sonatype Aether"
  ], 
  "revision_id": "1461429"
 }
]