[
 {
  "author": "tobrien", 
  "date": "2003-05-21T17:59:20.000000Z", 
  "msg": [
   "Added Product and Mean to Univariate and all implementations, this patch", 
   "contains contributions from Mark Diggory.", 
   "* This patch introduces Product and GeometricMean into the Univariate", 
   "implementation.", 
   "* Discarding the contribution of a discarded element in a rolling", 
   "UnivariateImpl requires that the product be calculated explicitly each", 
   "time a value is discarded.  This is necessary because not all values will", 
   "have non-zero values.", 
   "* Errors in rolling logic for ListUimpl, and UnivariateImpl were corrected,", 
   "and more test cases were added to the JUnit tests for the Univariate", 
   "implementations.  More rigorous test cases are needed for the entire", 
   "suite of Univariate implementations"
  ], 
  "revision_id": "146394"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T15:11:54.000000Z", 
  "msg": [
   "xdoc tasks.xml was updated to reflect tasks pertaining to the next planned", 
   "release.  There tasks were lifted from Phil S. earlier message to", 
   "commons-dev@"
  ], 
  "revision_id": "146393"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T15:10:51.000000Z", 
  "msg": [
   "project.properties changes.  1. The build will not fail on a failed", 
   "unit test, 2. The date/time and version are included in the xdoc", 
   "transformation, 3. JUnit is now forker, and 4. We use checkstyle.properties", 
   "to customize the behavior of Checkstyle."
  ], 
  "revision_id": "146392"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T14:21:15.000000Z", 
  "msg": [
   "Commited patch for issue 20112 from Phil Steitz.", 
   "EmpiricalDistribution -- represents an empirical probability distribution and", 
   "supports generation of data values that are \"like\" values in an input file", 
   "without making any assumptions about the functional form of the probability", 
   "distribution that the data come from.   This is useful in simulation", 
   "applications where historical data about component performance are", 
   "available but do not follow standard distributions (or any application that", 
   "requires random data generation from an empirical distribution). Also", 
   "generates data for grouped frequency histograms based on the input file.", 
   "ValueServer -- a wrapper for RandomData and EmpiricalDistribution that", 
   "generates values in each of the following modes:", 
   "* DIGEST_MODE -- uses an empirical distribution", 
   "* REPLAY_MODE -- replays data from an input file", 
   "* UNIFORM_MODE -- generates uniformly distributed random values", 
   "* EXPONENTIAL_MODE -- generates exponentially distributed random", 
   "values", 
   "* GAUSSIAN_MODE -- generates Gaussian distributed random values", 
   "* CONSTANT_MODE -- returns the same value every time."
  ], 
  "revision_id": "146391"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-05-21T06:46:26.000000Z", 
  "msg": [
   "Updated class javadoc for ContractableDoubleArray"
  ], 
  "revision_id": "146390"
 }
]