[
 {
  "author": "robbie", 
  "date": "2013-03-31T21:51:49.608982Z", 
  "msg": [
   "QPID-4462: simply return the PlainSaslServer directly instead of looking up it, bypassing the lack of previous registration", 
   "Fix suggested by Alex Rudyy"
  ], 
  "revision_id": "1463063"
 }, 
 {
  "author": "robbie", 
  "date": "2013-03-31T21:47:30.706932Z", 
  "msg": [
   "QPID-4390, QPID-4681: change attribute name to \"modelVersion\" to better refelect its purpose"
  ], 
  "revision_id": "1463062"
 }, 
 {
  "author": "robbie", 
  "date": "2013-03-31T21:46:12.781368Z", 
  "msg": [
   "QPID-4594, QPID-4682: changes from review of new 'management mode' functionality", 
   "- Tweak the command line options for the management mode ports to group the options and make it clear they are only for management mode, and remove a naming clash with old options that had different behaviour.", 
   "- Make the virtualhosts load during management mode, enabling them to normally be managed as well.", 
   "- Add a new command line option to quiesce the virtualhosts during mangement mode if required."
  ], 
  "revision_id": "1463061"
 }, 
 {
  "author": "robbie", 
  "date": "2013-03-31T21:45:08.191975Z", 
  "msg": [
   "QPID-4657, QPID-4683: review changes for new port configuration functionality", 
   "- Fix ability to select SSL for a port", 
   "- Add ability to set SSL Client Auth attributes for a port", 
   "- Enforce that you have SSL keystores/trustures in place when creating new ports that will fail to work without them", 
   "- Update names and placeholder text in UI to convey what happens when you dont fill out an optional attribute.", 
   "- Remove the default AMQP port value in form, makes the user specify port and avoid near definite clash.", 
   "- Removed requirement to specify Transport since it is actually optional.", 
   "- Ensure the port state is set accurately for newly added ports", 
   "- Fix the ability to override the management ports in ManagementMode", 
   "- Allow editing the management ports in Management Mode without having to override them first."
  ], 
  "revision_id": "1463060"
 }, 
 {
  "author": "samindaw", 
  "date": "2013-03-31T21:38:48.436896Z", 
  "msg": [
   "updating ec2 host descriptor mapping in rest mappings"
  ], 
  "revision_id": "1463059"
 }
]