[
 {
  "author": "mdiggory", 
  "date": "2003-06-16T20:58:53.000000Z", 
  "msg": [
   "Correction of Javadoc errors that end up propigating into UnivarImpl and other implementations."
  ], 
  "revision_id": "146454"
 }, 
 {
  "author": "mdiggory", 
  "date": "2003-06-16T20:42:24.000000Z", 
  "msg": [
   "This house-cleaning improves UnivariateImpl, in a number of ways.", 
   "1.) insertValue is abolished and its contents are now in addValue", 
   "2.) UnivariateImpl now extends AbstractStoredUnivariate to deligate to", 
   "those methods directly for calculating statistics when storage is active, all methods", 
   "deligate to AbstractStoreUniv when the DoubleArray is no longer null. This also means", 
   "that a majority of the StoreUnivariate interface is now implemented in Univariate to provide", 
   "deligates when storage is active, and to throw runtime exceptions when its not (this at least until", 
   "we establish rolling implementations for those methods). We should consider consolidating the", 
   "StoreUnivariate interface into the Univariate interface", 
   "3.) Calculations in addValue have been reorganized, only calculations for", 
   "the storageless solution are now present in this class. otherwise the value is", 
   "added/Rolling to the Double array when appropriate.", 
   "I'm satisfied that it passes all Unit tests."
  ], 
  "revision_id": "146453"
 }, 
 {
  "author": "tobrien", 
  "date": "2003-06-16T20:13:43.000000Z", 
  "msg": [
   "Added the graceful handling of invalid and NaN domain values.  Created test", 
   "cases to verify the graceful handling.", 
   "Issue #: 20774", 
   "Submitted By: Brent Worden", 
   "Reviewed By: Tim O'Brien"
  ], 
  "revision_id": "146452"
 }, 
 {
  "author": "mdiggory", 
  "date": "2003-06-16T14:29:30.000000Z", 
  "msg": [
   "PR: http://nagoya.apache.org/bugzilla/show_bug.cgi?id=20782", 
   "Submitted by:\tHotFusionMan@Yahoo.com", 
   "I added this, but there are changes I'd like to make in the near future. Only the \"running\" aspects of the variance calc should be in the insertValue function, all other calculation should be in the getVariance function."
  ], 
  "revision_id": "146451"
 }, 
 {
  "author": "mdiggory", 
  "date": "2003-06-15T17:01:39.000000Z", 
  "msg": [
   "PR: http://nagoya.apache.org/bugzilla/show_bug.cgi?id=20783", 
   "Submitted by:\tphil@steitz.com"
  ], 
  "revision_id": "146450"
 }
]