[
 {
  "author": "acmurthy", 
  "date": "2013-04-06T05:30:56.499135Z", 
  "msg": [
   "MAPREDUCE-5129. Allow tags to JobHistory for deeper analytics. Contributed by Billie Rinaldi."
  ], 
  "revision_id": "1465188"
 }, 
 {
  "author": "kmarsden", 
  "date": "2013-04-06T05:18:59.279468Z", 
  "msg": [
   "DERBY-6150 Add automatic cleanup of connections opened with openDefaultConnection()"
  ], 
  "revision_id": "1465187"
 }, 
 {
  "author": "larsh", 
  "date": "2013-04-06T05:16:20.558028Z", 
  "msg": [
   "HBASE-7961 truncate on disabled table should throw TableNotEnabledException. (rajeshbabu)"
  ], 
  "revision_id": "1465186"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-04-06T04:54:14.896904Z", 
  "msg": [
   "A slightly modified patch from Sumit Pandit for \"Enforce user to reset his password in a pre-defined regular interval of time.\" https://issues.apache.org/jira/browse/OFBIZ-5009", 
   "Reference requirement for the feature: http://markmail.org/message/sihxekwk6655t5gh#query:+page:1+mid:bcw2vva2hjxhsodq+state:results", 
   "For a user account in system, we can set password age for an additional security.", 
   "Proposed system will start suggesting to user to reset his password few days before password expiration. Then Once password expired, system will enforce him to reset his password before processing further.", 
   "Following will be control points and would be part of system configuration-", 
   "* *Control Points -*", 
   "** Admin can enable/disable the reset password functionality.", 
   "*** -It will control by a flag in propriety file where admin can enable/disable it by setting true/false.", 
   "** Number of days in which password will expired.", 
   "*** - It will defined in propriety file so that admin can control it.", 
   "** Number of days before when password expiration alert display at user's screen.", 
   "*** - It will defined in propriety file so that admin can control it.", 
   "* *How should it processed -*", 
   "** After user logged-in, display password expiration notification message to user if his password will expire in comming days.", 
   "** After user logged-in, display change password screen, when password is expired. i.e. The difference in days since last time password updated is exceed to number of days specified in system policies. Enforce user to reset his password.", 
   "* *What will be the out-put -*", 
   "** Password is about to expire : : alert message after login.", 
   "** Password is expired : Password-Expired-Alert : alert message with reset password screen.", 
   "Following is implementation plan -", 
   "security.properties : Provide configuration for following control points :", 
   "Enabling / Disabling of the functionality.", 
   "Maximum number of days within user has to change the password.", 
   "Number of days back to password expire date, when user start getting password expiration alerts.", 
   "Data model", 
   "Entity name : UserLoginPasswordHistory : Existing entity.", 
   "Business logic", 
   "Create UserLoginPasswordHistory record when a new user is created (if configured).", 
   "Expire and then Create UserLoginPasswordHistory record when user update existing password.", 
   "Everytime, when user login check for password expiration. If password expired then display change password screen to user. And if password not yet expired but it is close to expire display alert message to user about its expiration.", 
   "jleroux: I just changed", 
   "from", 
   "if (reqToChangePwdInDays != 0) {", 
   "tp", 
   "if (reqToChangePwdInDays > 0) {"
  ], 
  "revision_id": "1465185"
 }, 
 {
  "author": "atm", 
  "date": "2013-04-06T04:11:18.308888Z", 
  "msg": [
   "HDFS-1804. Add a new block-volume device choosing policy that looks at free space. Contributed by Aaron T. Myers."
  ], 
  "revision_id": "1465184"
 }
]