[
 {
  "author": "chug", 
  "date": "2013-04-05T20:14:04.170188Z", 
  "msg": [
   "QPID-4721: .NET Binding WinSdk does not build hello_world and hello_xml", 
   "Add the files to the CMakeLists.txt file."
  ], 
  "revision_id": "1465113"
 }, 
 {
  "author": "cmpilato", 
  "date": "2013-04-05T20:14:01.495360Z", 
  "msg": [
   "Allow credentials cleanup even when the 'no-auth-cache' option is set.", 
   "If someone doesn't want to fiddle with their auth cache, they", 
   "shouldn't call this function.  Also, don't send credentials through", 
   "the cleanup callback which are not ultimately managed by Subversion", 
   "(because they live in a third-party security provider).", 
   "* subversion/libsvn_subr/simple_providers.c", 
   "(svn_auth__simple_cleanup_walk): Allow cleanup even when", 
   "'no-auth-cache' flag is set.  Don't allow cleanup of credentials", 
   "which are housed in third-party providers.  Finally, stop passing", 
   "a cred kind value as a provider.  Strictly speaking, we don't even", 
   "have a name for our proprietary Subversion caching provider, but", 
   "there's at least some degree of precedent for using the \"simple\"", 
   "password type string, so run with that for now."
  ], 
  "revision_id": "1465112"
 }, 
 {
  "author": "tabish", 
  "date": "2013-04-05T20:11:34.199341Z", 
  "msg": [
   "Code fixups"
  ], 
  "revision_id": "1465111"
 }, 
 {
  "author": "mikem", 
  "date": "2013-04-05T20:11:17.722906Z", 
  "msg": [
   "DERBY-6131 select from view with \"upper\" and \"in\" list throws a ClassCastException", 
   "backporting change #1464594 from trunk to 10.10 branch.", 
   "Prior to this fix the following query on a view would throw a ClassCastException    select name from myView where upper(name) in ('AA', 'BB');", 
   "This query got in code that was trying to \"push\" predicates down, and", 
   "that code is only currently build to push constants and column references.", 
   "In this case it was mistakenly trying to push down the \"upper\" call, and", 
   "when it tried to cast it as a column reference it got the error.  The fix", 
   "was to check the type of the node and not push in this case."
  ], 
  "revision_id": "1465110"
 }, 
 {
  "author": "tabish", 
  "date": "2013-04-05T20:09:49.295703Z", 
  "msg": [
   "source generator for local TX to impl toString more cleanly."
  ], 
  "revision_id": "1465109"
 }
]