[
 {
  "author": "prickett", 
  "date": "2002-03-26T10:30:04.000000Z", 
  "msg": [
   "A time zone schema complete with diagrams of the overall data structure", 
   "of the xml schema. This was contributed by Mike George. Thanks Mike.", 
   "This will be the basis for our implemetation of time zones in periodicity."
  ], 
  "revision_id": "146854"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-26T10:15:14.000000Z", 
  "msg": [
   "Removed dependency on core from the war task. This was causing the core task", 
   "to get called twice during the war task and wasting time.", 
   "Fixed war file to depend on our own copy of DefaultTop navigation.", 
   "Added the rest of the label constants to the TestTemplateLabels file", 
   "Added summary parameters to the evt_do_jrl.vm template."
  ], 
  "revision_id": "146853"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-26T04:07:30.000000Z", 
  "msg": [
   "Added a VelocityScreen to populate the contents of the VelocityContext from", 
   "turbine.", 
   "Added a constants file that defines the labels for the test templates."
  ], 
  "revision_id": "146852"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-26T04:03:19.000000Z", 
  "msg": [
   "Created a periodicity specific Top Navigation template that did not refer", 
   "to the default logo or UI object. This was causing errors when rendering the", 
   "screen.", 
   "The original file was pulled from the tdk and I guess it had more features than we really need at this point. This file will most likely be replaced with the", 
   "original file from the tdk when we have more time to figure out how to get it", 
   "to work."
  ], 
  "revision_id": "146851"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-26T03:57:57.000000Z", 
  "msg": [
   "Capitalized the first letter of the template name because I ran into a bug", 
   "in TurbineVelocityService where the service did not recognize the templates", 
   "without a Capital letter and hence an exact match of the screen name.", 
   "I am not sure if this is something that has been fixed or if anyone else has", 
   "even seen this with the TurbineVelocityService."
  ], 
  "revision_id": "146850"
 }
]