[
 {
  "author": "prickett", 
  "date": "2002-04-03T04:38:24.000000Z", 
  "msg": [
   "Contributed by Mike George - Thanks Mike for your hard work!!!", 
   "Correction to the time zone schema to handle an unexpected case", 
   "New test to test that you can set/get valid encoding parameter values", 
   "Addition to the ParamTests to run the ValidEncodingParamTest."
  ], 
  "revision_id": "146859"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-28T09:31:45.000000Z", 
  "msg": [
   "Fixed it so that \"\" or empty strings are interpreted as null values", 
   "by the Actions that process the event information."
  ], 
  "revision_id": "146858"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-28T08:49:14.000000Z", 
  "msg": [
   "Added code to save the event to a database via a web browser witha a set of", 
   "Turbine actions.", 
   "Added a dependency on the servlet jar file."
  ], 
  "revision_id": "146857"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-27T06:08:06.000000Z", 
  "msg": [
   "Added Recur ID Minute Param to the Velocity context in Evt_do_jrl.java", 
   "Removed HTML Header and Body tags from the Event_detail.vm template as they", 
   "are not needed when using Turbine.", 
   "Added a form element to enclose the input tags so that the input elements", 
   "would be rendered by the web browser.", 
   "Added a submit button to save the event information on the Event_detail.vm", 
   "template", 
   "Fixed the start minute value so that it would not render a value", 
   "if no value was present.", 
   "Fixed the url value so that it would not render a value if no value was present.", 
   "Fixed the start time time zone id parameter so that it would reflect the", 
   "value set in the Velocity Context", 
   "Fixed the start time time zone id parameter so that it would not render a value", 
   "if none was present."
  ], 
  "revision_id": "146856"
 }, 
 {
  "author": "prickett", 
  "date": "2002-03-27T05:13:58.000000Z", 
  "msg": [
   "Added methods to the screens to add the parameter values to the", 
   "Velocity context used by Turbine.", 
   "Added a new file to hold the parameter values."
  ], 
  "revision_id": "146855"
 }
]