[
 {
  "author": "prickett", 
  "date": "2002-10-25T19:19:55.000000Z", 
  "msg": [
   "Changed the multiplicity of most of the elements to match what I", 
   "originally envisioned. I did not know that not specifying a multiplicity", 
   "defaulted to a multiplicity of one (still not 100% on the default), but anyway", 
   "it works."
  ], 
  "revision_id": "146929"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-25T05:44:26.000000Z", 
  "msg": [
   "Added a databases XML schema file to describe the databases.xml file format."
  ], 
  "revision_id": "146928"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-25T04:29:42.000000Z", 
  "msg": [
   "Changed the representation of driver schemes from", 
   "<scheme>jdbc:database</scheme>", 
   "<protocol>", 
   "<scheme>jdbc:database</scheme>", 
   "</protocol>", 
   "A scheme should no longer be put directly in <driver> element. It must", 
   "be nested in a protocol element inside the driver element.", 
   "Added a SAX content handler to parse driver information out of the", 
   "databases.xml file."
  ], 
  "revision_id": "146927"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-24T20:10:03.000000Z", 
  "msg": [
   "Changed the following tests to inherit from TestWithMavenLogging and added", 
   "log messages to record the actual exceptions that occured without failing the", 
   "test. (We expect exceptions from these tests, We just want to know exactly", 
   "which ones occured.)", 
   "DatabaseMDNameTypeNullTest", 
   "DatabaseMDTypeNullTest", 
   "DriverMDContextNameNullTest", 
   "DriverMDContextNullTest", 
   "DriverMDNameNullTest", 
   "DriverServiceConfigEmptyTest", 
   "DriverServiceConfigNullTest", 
   "DriverServiceDbFileNonExistTest", 
   "DriverServiceDbFileNotFile"
  ], 
  "revision_id": "146926"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-24T19:29:30.000000Z", 
  "msg": [
   "Changed the DatabaseMDNameNullTest to inherit rom TestWithMavenLogging", 
   "Changed the key from maven test report directory key to maven base", 
   "directory key because maven does not pass the test reports directory", 
   "information into the system properties. I hard coded the relative path", 
   "to the test directory using java constants.", 
   "Added a tearDown method to TestWithMavenLogging", 
   "Changed the setLogger method to allow for a null logger."
  ], 
  "revision_id": "146925"
 }
]