[
 {
  "author": "prickett", 
  "date": "2002-10-28T09:23:36.000000Z", 
  "msg": [
   "Added javadocs for addProtocols, setProtocols, removeProtocol,", 
   "removeProtocols, removeAllProtocols, getProtocols, getUrlScheme", 
   "Added a supportsProtocol methodto the jdbc driver and changed getUrlScheme", 
   "to use it when returning a protocol.", 
   "Changed DriverMDNullValueTests to take no arguments", 
   "Removed the old tests that were commented out from the", 
   "Driver Meta Data Test Suite and replaced them with the new tests", 
   "Added DriverMDSetGetTests to the test suite."
  ], 
  "revision_id": "146934"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-27T22:27:18.000000Z", 
  "msg": [
   "Added a test case to test the expected response of the Driver Meta Data", 
   "Implementation to null inputs.", 
   "Removed the Driver Meta Data Context and Name Null Test Case", 
   "Removed the Driver Meta Data Context Null Test Case", 
   "Removed the Driver Meta Data Get Context Test Case", 
   "Removed the Driver Meta Data Get Name Test Case", 
   "Removed the Driver Meta Data Name Null Test Case", 
   "Fixed a possible problem handling null protocol maps.", 
   "Moved the definition of Default Protocol Name to Driver Meta Data instead", 
   "of in its implementation."
  ], 
  "revision_id": "146933"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-27T12:22:39.000000Z", 
  "msg": [
   "Removed shortDescription, description, webUrl from DriverContentHandler", 
   "and replaced them with a driverMeta variable which is a DriverMetaDataImpl", 
   "object.", 
   "Changed DriverContentHandler to add driver protocols via a new method on the", 
   "DriverMetaDataImpl object. This replaces the addProtocol() method in", 
   "DriverContentHandler.", 
   "Changed DriverContentHandler to add Drivers to the service via a new", 
   "method on the service DriverMetaDataService interface. This replaces the", 
   "addDriverToDriverService method", 
   "Changed getVelocityContext() to java.util.Map getDriverMap() in", 
   "DriverMetaDataImpl", 
   "Added the following methods to DriverMetaDataImpl", 
   "getShortDescription", 
   "getDescription", 
   "getWebUrl", 
   "getClassName", 
   "setDescription", 
   "addProtocol", 
   "addProtocols", 
   "setProtocols", 
   "removeProtocols", 
   "removeProtocol", 
   "removeAllProtocols", 
   "getProtocols", 
   "getUrlScheme", 
   "setDriverMap", 
   "Added a couple of routines to build descriptive exception error messages."
  ], 
  "revision_id": "146932"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-26T00:29:37.000000Z", 
  "msg": [
   "Added a driverMeta variable to the driver content handler", 
   "Added a DEFAULT_PROTOCOL_NAME to the DriverMetaDataImpl", 
   "Added a short description variable to the DriverMetaDataImpl", 
   "Added a web url variable to the DriverMetaDataImpl", 
   "Added a driver class name variable to the the DriverMetaDataImpl", 
   "Added a map to hold all the protocols in DriverMetaDataImpl,", 
   "it is keyed on name.", 
   "Removed the second constructor that took everything as an argument and replaced", 
   "it with a constructor that takes only a string.", 
   "Added an addProtocol method to the DriverMetaDataImpl class"
  ], 
  "revision_id": "146931"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-25T22:29:34.000000Z", 
  "msg": [
   "Added a protocol name variable to DriverContentHandler", 
   "Added a java.util.Map to hold the driver protocols", 
   "Added a first cut of functionality to addProtocol()", 
   "Added a first cut of functionality to addDriverToDriverService()", 
   "Removed the original constructor from DriverMetaDataImpl and replaced it", 
   "with a new stubbed out version.", 
   "Changed the getMetaData(String) method in DriverMetaDataService to be public", 
   "Added a stubbed out addDriver(DriverMetaData) to PeriodicityDriverService", 
   "PeriodicityDriverService getMetaData just return null for now", 
   "Commented out all code in the DriverMetaData Test Suite and hardcoded pass."
  ], 
  "revision_id": "146930"
 }
]