[
 {
  "author": "prickett", 
  "date": "2002-10-22T05:23:06.000000Z", 
  "msg": [
   "Added a static test suite method to all the test files."
  ], 
  "revision_id": "146914"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-22T02:56:25.000000Z", 
  "msg": [
   "Changed DB_NAME to DRIVER_NAME in DriverMDGetNameTest.java and", 
   "DriverMDGetContextTest.java.", 
   "Added a test to test the getName method in the Database Meta Data", 
   "Implementation.", 
   "Added a test to test the getType method in the Database Meta Data", 
   "Implementation.", 
   "Added a test to test a null name field in the Database Meta Data", 
   "Implementation.", 
   "Added a test to test a null type field in the Database Meta Data", 
   "Implementation.", 
   "Added a test to test a null type and a null name field in the Database Meta", 
   "Data Implementation.", 
   "Added a test to test a null context and a null name field in the Database", 
   "Meta Data Implementation."
  ], 
  "revision_id": "146913"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-22T01:01:14.000000Z", 
  "msg": [
   "Added unit test suite inormation to the project.xml file", 
   "Added a unit test to test for a null context in the DriverMetaDataImpl class", 
   "Added a unit test to test for a null name in the DriverMetaDataImpl class", 
   "Added a unit test to test getName in the DriverMetaDataImpl class", 
   "Added a unit test to test getVelocityContext in the DriverMetaDataImpl class"
  ], 
  "revision_id": "146912"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-21T14:06:16.000000Z", 
  "msg": [
   "Added an explanation of who develops and maintains the HSQL database", 
   "Added a description, short description, and a web url for the following JDBC", 
   "Drivers", 
   "MySQL JDBC", 
   "PostgreSQL JDBC", 
   "Oracle Thin Driver", 
   "Axion JDBC Driver", 
   "HSQLDB Driver", 
   "Interclient JDBC Driver", 
   "Added a description, short description, and a web url for the following", 
   "databases", 
   "HSQL DB", 
   "Interbase"
  ], 
  "revision_id": "146911"
 }, 
 {
  "author": "prickett", 
  "date": "2002-10-21T09:21:31.000000Z", 
  "msg": [
   "Added a short description, description, and a web url for the following", 
   "databases", 
   "MySQL", 
   "PostgreSQL", 
   "Microsoft", 
   "Oracle", 
   "Axion", 
   "Cloudscape", 
   "DB2", 
   "DB2 400"
  ], 
  "revision_id": "146910"
 }
]