[
 {
  "author": "bikas", 
  "date": "2013-04-23T03:12:54.770765Z", 
  "msg": [
   "Merge -c r1470797 from trunk to branch-2 for YARN-549. YarnClient.submitApplication should wait for application to be accepted by the RM (Zhijie Shen via bikas)"
  ], 
  "revision_id": "1470798"
 }, 
 {
  "author": "bikas", 
  "date": "2013-04-23T03:06:41.607004Z", 
  "msg": [
   "YARN-549. YarnClient.submitApplication should wait for application to be accepted by the RM (Zhijie Shen via bikas)"
  ], 
  "revision_id": "1470797"
 }, 
 {
  "author": "spamassassin_role", 
  "date": "2013-04-23T03:00:27.109520Z", 
  "msg": [
   "updated scores for revision 1470411 active rules added since last mass-check"
  ], 
  "revision_id": "1470796"
 }, 
 {
  "author": "liyin", 
  "date": "2013-04-23T02:50:12.096101Z", 
  "msg": [
   "[HBASE-8307] Fixing the test in Histogram metrics.", 
   "Author: manukranthk", 
   "Summary: testAboveMaxValue looks exactly like the same as the testBelowMaxValuetest but needs to put values above the max value.", 
   "Test Plan: Tested on shadow.", 
   "Reviewers: rshroff, gauravm", 
   "Reviewed By: rshroff", 
   "Differential Revision: https://phabricator.fb.com/D780992"
  ], 
  "revision_id": "1470795"
 }, 
 {
  "author": "liyin", 
  "date": "2013-04-23T02:50:04.197129Z", 
  "msg": [
   "[HBASE-8371] Removes the dependency on thrift for RegionException", 
   "Author: rshroff", 
   "Summary:", 
   "RegionException was derived from IOError to capture the backoff timeout,", 
   "information required by the thrift clients to reduce the load on the", 
   "overloaded region servers. The exception was derived from IOError to", 
   "make it compatible with thrift. When this change was ported to neptune,", 
   "it created a new dependency on the thrift package.", 
   "HBase uses version 0.80 while many of the customers either use the", 
   "internal thrift or 0.90. This incompatibility is causing problems on the", 
   "app server which I think is using internal thrift.", 
   "Hence, we decided to get rid of this dependency on the server side by", 
   "deriving the RegionException again from IOException and storing the", 
   "backOffTime as a class member variable as it was done earlier.", 
   "On the thrift server side, when it gets an exception which is an", 
   "instance of RegionException, it will fetch the timeBackoff value and", 
   "pass it on to the client appropriately.", 
   "Test Plan:", 
   "I will test this on SEARCHHBASE004-FRC1 as they have a c++", 
   "thrift client communicating with HBase", 
   "Reviewers: liyintang, aaiyer, avf, adela", 
   "Reviewed By: adela", 
   "CC: hbase-eng@, nathan, davejwatson", 
   "Differential Revision: https://phabricator.fb.com/D779316"
  ], 
  "revision_id": "1470794"
 }
]