[
 {
  "author": "jstrachan", 
  "date": "2002-09-13T09:44:52.000000Z", 
  "msg": [
   "Updated the documentation page to describe a bit more accurately what commons-sql is and how to use it."
  ], 
  "revision_id": "147444"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-12T17:56:50.000000Z", 
  "msg": [
   "* Working test cases that demonstrate the use of the SqlBuilder classes showing them working on both Axion and HsqlDb.", 
   "* Added a fully working simple database access API using a DynaBean to map to a row in a table.", 
   "* From the DyanSql you configure the Database, give it a DataSource and you can add/update/remove rows via DyanBeans", 
   "DynaBean author = dynaSql.newInstance( \"author\" );", 
   "author.set(\"name\", \"James\");", 
   "dynaSql.insert(author);", 
   "etc.", 
   "* Added a helper class, DDLExecutor which will create databases or drop databases using the relational model and a specific SqlBuilder implementation.", 
   "* There's now a simple JdbcSupport helper class which contains some common methods for closing down statements & result sets and working with DataSource instances to pool JDBC connections.", 
   "* for testing purposes mostly, there's a DataSourceWrapper that allows regular JDBC Connections to be used inside a DataSource without any pooling."
  ], 
  "revision_id": "147443"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-12T15:03:59.000000Z", 
  "msg": [
   "Patched SqlBuilder so that its base its very SQL92-like and then just extended for enhancements and non standard database extensions.", 
   "Also added SqlBuilder implementations for Axion, HsqlDb and DB2"
  ], 
  "revision_id": "147442"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-11T23:00:29.000000Z", 
  "msg": [
   "Added the JDBC code to execute the insert/update/delete operations from a given DynaBean. Just need the JUnit test cases now to test this stuff..."
  ], 
  "revision_id": "147441"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-09-11T22:39:41.000000Z", 
  "msg": [
   "Reorganized the dependencies and added the new dependencies for the dynabeans demo..."
  ], 
  "revision_id": "147440"
 }
]