[
 {
  "author": "jstrachan", 
  "date": "2002-10-28T16:13:51.000000Z", 
  "msg": [
   "applied J. Russell Smyth 's patches", 
   "Added support for isDecimalType, to support the builder classes", 
   "determining this for building sql representation of a column (see above)", 
   "renamed getSQLTypeCode to getJdbcTypeCode - this is more accurate (and I", 
   "had it in my code before Stevens change ;-)", 
   "Changed the TypeCode methods to use int not Integer"
  ], 
  "revision_id": "147469"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-28T16:13:28.000000Z", 
  "msg": [
   "applied J. Russell Smyth 's patches", 
   "removed nullable and isNullable attributes added by Steven Caswell - see", 
   "previous message - in short, these are not DB attributes, but JDBC", 
   "attributes, unreliable, db dependent, and are handled by the already", 
   "existing \"required\" attribute.", 
   "removed charOctetLength - this is db implementation details that should", 
   "never be reflected in the db independent model. (I will be sending", 
   "another suggestion on how to handle this later)", 
   "changed scale,precisionRadix, and ordinalPosition  from Integer to int -", 
   "no good reason to keep this as an Integer, and makes their use more", 
   "cumbersome.", 
   "typeCode is an int and is expected to be a java.sql.Types value.", 
   "Though have preserved the String type property.", 
   "removed getIsTextType - dosnt belong here. It is already in TypeMap", 
   "where it does belong.", 
   "removed getTypeString - this is not the right place to create SQL code -", 
   "it could vary by platform. Explained more fully in previous message.", 
   "removed getSQLTypeCode - dosnt belong here, it is in TypeMap already."
  ], 
  "revision_id": "147468"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-23T10:17:16.000000Z", 
  "msg": [
   "Patched the code so that the unit tests work again. The new method that Steven added, 'addColumns' to the Table class was breaking the betwixt introspector and so all the unit test cases were failing."
  ], 
  "revision_id": "147467"
 }, 
 {
  "author": "jstrachan", 
  "date": "2002-10-23T10:10:55.000000Z", 
  "msg": [
   "added back the old constructor so at least the unit tests still compile again.", 
   "though unfortunately the unit tests are all broken these days..."
  ], 
  "revision_id": "147466"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-10-23T00:32:19.000000Z", 
  "msg": [
   "o Adding the checkstyle format used for commons-sql."
  ], 
  "revision_id": "147465"
 }
]