[
 {
  "author": "bayard", 
  "date": "2002-02-21T06:16:32.000000Z", 
  "msg": [
   "Made the class more paranoid by enforcing the Comparable interfaces", 
   "contract that for objects o1 and o2, o1.compareTo(o2) and", 
   "o2.compareTo(o1) must be inverses of each other, although the", 
   "abs() of the value returned need not be the same it seems.", 
   "Reviewed by:\tMichael A. Smith"
  ], 
  "revision_id": "147684"
 }, 
 {
  "author": "bayard", 
  "date": "2002-02-21T06:02:56.000000Z", 
  "msg": [
   "Changed at Michael Smith's warning to have the same behaviour if an", 
   "object passed in is not a Comparable. The behaviour is that it will", 
   "fire off an IllegalArgumentException. The Message in this is different,", 
   "but I'm hoping that is not a biggy in the contract for same behaviour.", 
   "I also made it so it considers either one being null to be an", 
   "IllegalArgumentException. Up for debate.", 
   "Reviewed by:Michael A. Smith"
  ], 
  "revision_id": "147683"
 }, 
 {
  "author": "bayard", 
  "date": "2002-02-21T05:04:01.000000Z", 
  "msg": [
   "Added initial set of comparators, plus a package.html explaining", 
   "the package very tersely.", 
   "Comparable: This is very useful when you want to code generically.", 
   "It lets you not worry about whether the object is Comparable or not,", 
   "instead you just blindly use a Comparator and Collections.sort.", 
   "NumericString: Sorts words alphabetically, but any numbers in those words", 
   "are sorted numerically. So 10 1st Street will sort before 10 2nd Street and", 
   "after 2 1st Street.", 
   "PackageName: Sorts java package names into a standard way.", 
   "Reverse: Very useful. Flips any other comparator around. Great way to", 
   "implement those lists where the user clicks the sort button again", 
   "to reverse sort it.", 
   "Soundex: Sort on the soundex. No idea if this has any use tbh.", 
   "Url: Sorts urls. Reorders the importance of hosts, protocols, paths and", 
   "ports from the standard string based sorting."
  ], 
  "revision_id": "147682"
 }, 
 {
  "author": "dlr", 
  "date": "2002-02-20T20:57:46.000000Z", 
  "msg": [
   "Working towards RC 2 or final release."
  ], 
  "revision_id": "147681"
 }, 
 {
  "author": "", 
  "date": "2002-02-20T20:56:52.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'UTIL_1_0_RC1'."
  ], 
  "revision_id": "147680"
 }
]