[
 {
  "author": "craigmcc", 
  "date": "2001-08-22T01:38:12.000000Z", 
  "msg": [
   "Add unit tests for CORE step implementations:  duplicate, exit, goto, pop,", 
   "string, suspend, and swap.", 
   "TODO:  tests for get, put, and remove (via name/scope and xpath, in", 
   "various scopes)."
  ], 
  "revision_id": "148164"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-22T01:06:09.000000Z", 
  "msg": [
   "Add convenience constructors that let you construct fully configured Step", 
   "implementations with a \"new\" operator, which will make unit tests much", 
   "more concise.  In all cases, there is a zero-args constructor so that you", 
   "can build activities and steps from XML input with Digester (or other", 
   "similar technologies)."
  ], 
  "revision_id": "148163"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-22T01:04:37.000000Z", 
  "msg": [
   "When execute() is called at a point at which \"nextStep\" is null, assume", 
   "that we need to start at the beginning of the Activity.  Otherwise, if you", 
   "do the following sequence:", 
   "Context context = ...", 
   "Activity activity = new BaseActivity();", 
   "context.setActivity(activity);", 
   "and *then* add some steps to the activity, they never get executed.", 
   "As a side effect, this change allows you to rerun an Activity if you wish."
  ], 
  "revision_id": "148162"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-22T01:01:49.000000Z", 
  "msg": [
   "Add an \"id\" property to activites."
  ], 
  "revision_id": "148161"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-20T05:25:19.000000Z", 
  "msg": [
   "Add \"xpath\" properties to GetStep and PutStep as alternatives to the", 
   "name/scope based bean access methods.  NOTE:  According to the JPath", 
   "documentation, you cannot currently use xpath expressions in PutStep to", 
   "create a new bean -- only to modify a bean property of an existing bean.", 
   "Add a test bean that will be used in unit tests of the \"core\" Step", 
   "implementations."
  ], 
  "revision_id": "148160"
 }
]