[
 {
  "author": "craigmcc", 
  "date": "2001-08-27T01:01:39.000000Z", 
  "msg": [
   "Add RuleSet implementations for the basic library (contains the <activity>", 
   "element recognizer) plus the three Step libraries defined so far (Core,", 
   "Io, and Web)."
  ], 
  "revision_id": "148174"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-26T03:38:11.000000Z", 
  "msg": [
   "Add three new core Step implementations:", 
   "- InvokeStep calls an arbitrary method with an arbitrary set of", 
   "parameters.  If the called method returns a value, it is pushed", 
   "onto the evaluation stack.", 
   "- AndStep evaluates the bean or property values of all associated", 
   "Descriptors and branches to a specified Step if ALL of them return", 
   "true (for boolean values) or non-null (for any other class)", 
   "- OrStep evaluates the bean or property values of all associated", 
   "Descriptors and branches to the specified Step if ANY of them", 
   "return true (for boolean values) or non-null (for any other class).", 
   "Degenerate cases of AndStep or OrStep with a single descriptor act like an", 
   "\"if\" statement that tests the value of that bean or property.", 
   "NOTE:  Because it is supported by a Descriptor with no configured", 
   "properties, you can transparently consume objects from the evaluation", 
   "stack when processing descriptor lists for these Steps (and the other", 
   "Steps that now support descriptor lists, indicated by the fact that they", 
   "implement the Descriptors interface).", 
   "FIXME:  Think about a better way to deal with exceptions thrown by an", 
   "invoked method.  Right now, it unconditionally throws a StepException,", 
   "which aborts execution of the corresponding Activity."
  ], 
  "revision_id": "148173"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-26T00:17:55.000000Z", 
  "msg": [
   "Extend a Descriptor to include an optional Java class representing the", 
   "type of object expected to be described by this descriptor.  This will be", 
   "useful when setting up parameter lists for method invocation, where the", 
   "actual object need only be assignment-compatible with the type expected by", 
   "the method."
  ], 
  "revision_id": "148172"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-26T00:06:51.000000Z", 
  "msg": [
   "Generalize the GET, PUT, REMOVE, and DISPLAY steps to take an arbitrary", 
   "number of bean descriptors, instead of just a single one.  The same", 
   "descriptor technology will be useful in many other Step implementations", 
   "later as well."
  ], 
  "revision_id": "148171"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-23T03:52:18.000000Z", 
  "msg": [
   "Adapt to JPath -> JXPath name and location change."
  ], 
  "revision_id": "148170"
 }
]