[
 {
  "author": "craigmcc", 
  "date": "2001-09-20T02:17:29.000000Z", 
  "msg": [
   "Demonstration web application that uses the workflow engine and the", 
   "ActivityServlet to execute a very simple three-page wizard application.", 
   "The activity definition for this is in file \"/WEB-INF/wizard.xml\" inside", 
   "the web app.", 
   "To execute, set the \"deploy.home\" build property to wherever your servlet", 
   "2.2 / JSP 1.1 (or later) container wants deployed webapp directories to", 
   "be, and execute \"ant deploy.wizard\".  Then, restart your servlet container", 
   "and execute a URL like this (assuming port 8080):", 
   "http://localhost:8080/wizard-demo/", 
   "It is expected that a web application framework incorporating workflow", 
   "would (among other things) encapsulate the creation of the navigation", 
   "links so that page designers do not need to worry about such details."
  ], 
  "revision_id": "148184"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-09-20T02:13:55.000000Z", 
  "msg": [
   "Update the ActivityServlet class, which illustrates one way to incorporate", 
   "workflow technology into a web application, without relying on any", 
   "application framework.  Includes an illustration of using the context", 
   "event listeners to generate debugging information, without affecting the", 
   "underlying workflow implementation classes.", 
   "Add new <web:populate> step implementation that populates the properties", 
   "of a JavaBean from request parameters, in a manner similar to what", 
   "<jsp:setProperty name=\"foo\" property=\"*\"/>", 
   "does in JSP pages.", 
   "Add toString() implementations for interesting Step implementations to", 
   "assist in debugging."
  ], 
  "revision_id": "148183"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-09-19T15:26:16.000000Z", 
  "msg": [
   "Add new Step implementations to load a specified Class object (from either", 
   "the current class loader or the thread context class loader) and to call", 
   "an arbitrary constructor on a Class object.  Added unit test for these", 
   "two new Steps."
  ], 
  "revision_id": "148182"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-09-12T01:13:24.000000Z", 
  "msg": [
   "Adapt to the incompatible API change in JXPath (changing", 
   "org.apache.commons.jxpath.tree.MapDynamicPropertyHandler to", 
   "org.apache.commons.jxpath.MapDynamicPropertyHandler).  Fortunately, it", 
   "appears to only be an import statement change."
  ], 
  "revision_id": "148181"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-09-04T02:56:51.000000Z", 
  "msg": [
   "Add an example servlet demonstrating one way to integrate workflow", 
   "processing into a web application.  The theory of operation is that you", 
   "will create a servlet definition (using this servlet class), and one or", 
   "more servlet mappings, for each workflow Activity that is supported by", 
   "your web application."
  ], 
  "revision_id": "148180"
 }
]