[
 {
  "author": "craigmcc", 
  "date": "2001-08-20T04:14:19.000000Z", 
  "msg": [
   "The problem with JPath integration was that JPath needed to be told that", 
   "BaseScope was a \"dynamic class\".  Now, a bean named \"foo\" in local scope", 
   "can be accessed by XPath expression \"local/foo\", while (assuming the web", 
   "integration layer provided by WebContext) a session attribute would be", 
   "accessed as \"local/session/foo\".", 
   "The next step will be to update the core \"get\" and \"put\" step", 
   "implementations to support XPath syntax as well."
  ], 
  "revision_id": "148159"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-19T23:53:10.000000Z", 
  "msg": [
   "Add integration with JPath (another jakarta-commons-sandbox project) for", 
   "XPath-like navigation of the set of beans made visible through the Scopes", 
   "associated with a Context.", 
   "FIXME - It still doesn't work yet, as illustrated by problems in", 
   "BaseContextTestCase.  Apparently, a Scope is not being treated like a Map", 
   "by the JPath evaluation methods, even though it works for HashMap and", 
   "other Map implementations (for example, the testJPathFunctionality test", 
   "succeeds when Employee.getAddresses() returns a HashMap but fails when it", 
   "returns a Scope).", 
   "Once this works, we'll be able to do XPath-like expressions to get and set", 
   "properties in any scope."
  ], 
  "revision_id": "148158"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-19T21:25:18.000000Z", 
  "msg": [
   "When adding additional scopes, register them in LOCAL_SCOPE under the same", 
   "name.  This allows for a single unified namespace to be presented to", 
   "expression languages that can get and put corresponding values."
  ], 
  "revision_id": "148157"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-18T21:06:50.000000Z", 
  "msg": [
   "Add event and listener support to the execute() method of BaseContext.", 
   "This allows applications to do things like recording Step execution, or", 
   "debugging of the Steps associated with an Activity."
  ], 
  "revision_id": "148156"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-18T20:30:52.000000Z", 
  "msg": [
   "Add basic test for executing an Activity."
  ], 
  "revision_id": "148155"
 }
]