[
 {
  "author": "joyce", 
  "date": "2013-05-16T03:01:37.553485Z", 
  "msg": [
   "Resolves CLIMATE-29. Updates display of drop down in selectRCMED.", 
   "- The observation selection drop down now defaults to a prompt for the", 
   "user to make selection. This should hopefully guide the user to the", 
   "correct action by default.", 
   "- The default value for the parameter selection drop down is now", 
   "defaulted to a prompt for the user to make selection (if there are", 
   "multiple possible values) or the only available option."
  ], 
  "revision_id": "1483173"
 }, 
 {
  "author": "joyce", 
  "date": "2013-05-16T03:01:35.117182Z", 
  "msg": [
   "Resolves CLIMATE-28. Update selection drop down box display.", 
   "- In selectObservation, when there are multiple options for a given", 
   "parameter select box the default selection value is set to \"Please", 
   "select an option\". This should alert the user to the presence of", 
   "multiple options."
  ], 
  "revision_id": "1483172"
 }, 
 {
  "author": "joyce", 
  "date": "2013-05-16T03:01:32.401424Z", 
  "msg": [
   "Resolves CLIMATE-27. Filter out invalid options in selectObservation.", 
   "- When displaying the parsed variables from a file the user has", 
   "uploaded, values that are found to be the lat, lon, or time values are", 
   "no longer displayed as valid options for evaluation."
  ], 
  "revision_id": "1483171"
 }, 
 {
  "author": "joyce", 
  "date": "2013-05-16T03:01:30.003406Z", 
  "msg": [
   "Resolves CLIMATE-26. Display queued dataset count to the user.", 
   "- Adds display of the number of datasets the user has added so far to", 
   "the dataset selection views."
  ], 
  "revision_id": "1483170"
 }, 
 {
  "author": "joyce", 
  "date": "2013-05-16T03:01:27.407204Z", 
  "msg": [
   "Resolves CLIMATE-25. Fixes modal close with escape when lacking focus.", 
   "- Adding \"tabindex='-1'\" to the modal's primary div tag fixes the issue.", 
   "Additional information can be found at [1]", 
   "[1] https://github.com/twitter/bootstrap/issues/4663"
  ], 
  "revision_id": "1483169"
 }
]