[
 {
  "author": "markt", 
  "date": "2013-05-30T13:53:31.200082Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=54999", 
   "Fix JSESSIONIDSSO not recreated when a logout and login occur in the same request.", 
   "Patch provided by Keith Mashinter"
  ], 
  "revision_id": "1487863"
 }, 
 {
  "author": "markt", 
  "date": "2013-05-30T13:49:40.298627Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=54999", 
   "Fix JSESSIONIDSSO not recreated when a logout and login occur in the same request.", 
   "Patch provided by Keith Mashinter"
  ], 
  "revision_id": "1487862"
 }, 
 {
  "author": "matevz", 
  "date": "2013-05-30T13:46:40.380369Z", 
  "msg": [
   "Ref. #533 - breadcrumb was broken on tablets/phones"
  ], 
  "revision_id": "1487861"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-05-30T13:39:26.124849Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 1487854  \"", 
   "------------------------------------------------------------------------", 
   "r1487854 | jleroux | 2013-05-30 15:21:28 +0200 (jeu., 30 mai 2013) | 25 lines", 
   "A slightly modified patch from Parimal Gain for \"Find Order functions - Not working when junk values entered for product Id\" https://issues.apache.org/jira/browse/OFBIZ-5201", 
   "Problem specification and step -", 
   "1) Go to Order Manager app > Find Orders", 
   "2) Enter valid product id for which order exists", 
   "3) Relevant orders with entered product value would be shown in search results", 
   "4) Enter invalid product id - JUNK value", 
   "5) Error behvaior:All orders on the system would be highlighted", 
   "6) Actual behavior: No order should be shown as search results, as no order exists with this JUNK product id on system", 
   "Observation -", 
   "When looked into code level found that system apply check for two condition -", 
   "1) If passes productId starts or ends with % or * then add that in condition list as it is and it returns all order that contains the word for product Ids.", 
   "2) If the above condition is failed the check if the product corresponding to product id is present or not.", 
   "3) If exists then check for variants (if its virtual)all this.", 
   "4) If product not exists then the action is missing i.e. no condition is added and it returns all order available.", 
   "Recommendation -", 
   "There are two ways to solve the issue -", 
   "1) If product corresponding to passes productId is not present then return message to user that order is not present.", 
   "2) If the thought process for current behavior is show all record if product not available then user should get a message as well that \"Order is not available for your search product but we have all these order in system\" to convey the correct message to user.", 
   "jleroux: The 1st solution is used. I simply added in label that no productId entered would return all the orders, also in French", 
   "------------------------------------------------------------------------", 
   "?\\026"
  ], 
  "revision_id": "1487860"
 }, 
 {
  "author": "markt", 
  "date": "2013-05-30T13:33:51.145565Z", 
  "msg": [
   "Remove this unnecessary test. The root cause of the APR/WebSocket problem was not repeating an incomplete write with exactly the same buffer."
  ], 
  "revision_id": "1487859"
 }
]