[
 {
  "author": "dkulp", 
  "date": "2013-06-04T21:30:56.002351Z", 
  "msg": [
   "One of these commits, I'll actually fix something without breaking something else......"
  ], 
  "revision_id": "1489628"
 }, 
 {
  "author": "joyce", 
  "date": "2013-06-04T21:30:26.989337Z", 
  "msg": [
   "Resolves CLIMATE-82 - checkParameters does bad comparisons", 
   "- All comparisons in checkParameters for the lat/lon values first", 
   "converts the operands to floats with parseFloat() to ensure that the", 
   "comparisons done aren't string comparisons."
  ], 
  "revision_id": "1489627"
 }, 
 {
  "author": "joyce", 
  "date": "2013-06-04T21:29:07.800837Z", 
  "msg": [
   "Resolves CLIMATE-79 - Fix race condition when drawing map overlays.", 
   "- Adds isValid flag to regionSelectParams service. This flag is used as", 
   "a lightweight lock so that users of the service know if the data is or", 
   "isn't valid at the time they wish to use it.", 
   "- Updates overlay draw code to only attempt to rendering the user", 
   "selected region if the regionSelectParams isValid flag is true.", 
   "- In ParameterSelectCtrl the $watch on datasets also calculates the new", 
   "user select-able region and sets the values in regionSelectParams.", 
   "This sets the isValid flag to false at the start of the function, sets", 
   "it to true at the end of calculations, and then broadcasts a", 
   "'redrawOverlay' event so the user region is redrawn."
  ], 
  "revision_id": "1489626"
 }, 
 {
  "author": "joyce", 
  "date": "2013-06-04T21:28:51.662599Z", 
  "msg": [
   "Resolves CLIMATE-81 - Don't trigger map redraws with region params.", 
   "- Removes the watch on region parameter changes in WorldMapCtrl. This", 
   "prevents the overlay from being drawn every time the user types a", 
   "letter in the input boxes.", 
   "- Minor code changes."
  ], 
  "revision_id": "1489625"
 }, 
 {
  "author": "joyce", 
  "date": "2013-06-04T21:28:27.644182Z", 
  "msg": [
   "Resolves CLIMATE-80 - Trigger map redraw after user adjusts values.", 
   "- Adds a $broadcast of the 'redrawOverlays' event after checking the", 
   "parameters that the user has (possibly) changed in", 
   "ParameterSelectCtrl."
  ], 
  "revision_id": "1489624"
 }
]