[
 {
  "author": "ekoneil", 
  "date": "2005-01-29T22:55:22.173533Z", 
  "msg": [
   "Data grid features.", 
   "Implement a generalized, overridable message / formatting provider in the data grid.  The default message bundle is:", 
   "org/apache/beehive/netui/databinding/datagrid/util/data-grid-default.properties", 
   "This can be overridden using the \"resourceBundlePath\" attribute on the <netui-data:dataGrid> tag.  Individual properties can further be overridden by:", 
   "<netui-data:dataGrid>", 
   "<netui;attribute facet=\"resource\" name=\"key\" value=\"value\"/>", 
   "where the value of \"key\" is a resource bundle key.", 
   "Clients of the DataGridModel can request a plain or formatted message from the DataGridModel, which delegates these calls into the DataGridResourceProvider.", 
   "This change also fixes two BVT breaks introduced in the last checkin by fixing keys referencing deleted messages in the RepeaterComponent.", 
   "BB: self", 
   "DRT: NetUI / datagrid pass"
  ], 
  "revision_id": "149079"
 }, 
 {
  "author": "sylvain", 
  "date": "2005-01-29T22:26:58.761540Z", 
  "msg": [
   "Fixing namespace detection using attributes"
  ], 
  "revision_id": "149078"
 }, 
 {
  "author": "sylvain", 
  "date": "2005-01-29T22:17:27.016819Z", 
  "msg": [
   "fix bug #33178 - handling of environment context when returning from a pass-through mounted sitemap"
  ], 
  "revision_id": "149077"
 }, 
 {
  "author": "sylvain", 
  "date": "2005-01-29T22:09:46.059329Z", 
  "msg": [
   "fix fb:struct binding: a non-existent path was not created properly"
  ], 
  "revision_id": "149076"
 }, 
 {
  "author": "dolander", 
  "date": "2005-01-29T22:04:50.768898Z", 
  "msg": [
   "This is a \"mostly\" working version of the expandOnClient feature in the Tree.", 
   "I've tested in both IE and Firefox.  There is one remaining issue, I'm not", 
   "cascading the inheritable state correctly from the tree.", 
   "Created a ServletTreeRenderer which is called in the XmlHttpRequest to render the", 
   "new nodes that are the children of the node being expanded.", 
   "Added a TreeRenderState property to the ITreeRootElement so the ServletTreeRender", 
   "can get the state that was set on the Tree tag."
  ], 
  "revision_id": "149075"
 }
]