[
 {
  "author": "pamarcelot", 
  "date": "2013-06-10T13:21:10.718320Z", 
  "msg": [
   "Updated the connection wrapper to the latest way to use the Apache Directory LDAP API in the case of a Start TLS connection."
  ], 
  "revision_id": "1491443"
 }, 
 {
  "author": "chetanm", 
  "date": "2013-06-10T13:18:05.580878Z", 
  "msg": [
   "OAK-854 - Use weight based caching limit instead of size based limits", 
   "Adding support for using a Weigher which determines object weight through its size. The size determination logic uses emperical data to determine the size. Following changes done", 
   "- Exposed a config for cache size. Defaults to 256 MB", 
   "- The cache size is then distributed between three caches Node, Children and Document in 20%, 10%, 70% respectively", 
   "- Enabled stats collection by default. Later would make it configurable"
  ], 
  "revision_id": "1491442"
 }, 
 {
  "author": "mcpierce", 
  "date": "2013-06-10T12:50:10.632699Z", 
  "msg": [
   "PROTON-324: Refactor Perl support for working with arrays and Data objects", 
   "Renamed the TypeHelper class to Mapping to be more like the Ruby", 
   "language. Deleted the previous qpid::proton::Array class since it", 
   "tightly coupled the developer's code to Proton where it should not do", 
   "so.", 
   "Provides three new methods:", 
   "qpid::proton::put_array_into - put an array into a Data object", 
   "qpid::proton::get_array_from - gets an array out of a Data object", 
   "qpid::proton::get_list_from  - gets a list out of a Data object"
  ], 
  "revision_id": "1491441"
 }, 
 {
  "author": "prabhugs", 
  "date": "2013-06-10T12:49:22.867553Z", 
  "msg": [
   "Correct the error code value for SVN_ERR_REPOS_CORRUPTED.", 
   "Fix the verify-keep-going test case to compare actual stdout and expected stdout.", 
   "* subversion/include/svn_error_codes.h", 
   "Set the correct error code value.", 
   "* subversion/tests/cmdline/svnadmin_tests.py", 
   "(verify-keep-going): Fix the error code value. Also compare actual stdout", 
   "and expected stdout in addition to stderr comparison."
  ], 
  "revision_id": "1491440"
 }, 
 {
  "author": "stsp", 
  "date": "2013-06-10T12:46:56.314944Z", 
  "msg": [
   "* STATUS: Nominate r1491432 for 1.8.0."
  ], 
  "revision_id": "1491439"
 }
]