[
 {
  "author": "nick", 
  "date": "2013-06-13T18:18:34.263769Z", 
  "msg": [
   "Republish the site"
  ], 
  "revision_id": "1492798"
 }, 
 {
  "author": "liyin", 
  "date": "2013-06-13T18:18:20.714568Z", 
  "msg": [
   "[master] Implements a secondary compressed cache (L2 cache)", 
   "Author: avf", 
   "Summary:", 
   "This revision implements compressed and encoded second-level cache with off-heap", 
   "(and optionally on-heap) storage and a bucket-allocator based on HBASE-7404.", 
   "BucketCache from HBASE-7404 is extensively modified to:", 
   "* Only handle byte arrays (i.e., no more serialization/deserialization within)", 
   "* Remove persistence support for the time being", 
   "* Keep an  index of hfilename to blocks for efficient eviction on close", 
   "A new interface (L2Cache) is introduced in order to separate it from the current", 
   "implementation. The L2 cache is then integrated into the classes that handle", 
   "reading from and writing to HFiles to allow cache-on-write as well as", 
   "cache-on-read. Metrics for the L2 cache are integrated into RegionServerMetrics", 
   "much in the same fashion as metrics for the existing (L2) BlockCache.", 
   "Additionally, CacheConfig class is re-refactored to configure the L2 cache,", 
   "replace multile constructors with a Builder, as well as replace static methods", 
   "for instantiating the caches with abstract factories (with singleton", 
   "implementations for both the existing LruBlockCache and the newly introduced", 
   "BucketCache based L2 cache)", 
   "Test Plan:", 
   "1) Additional unit tests", 
   "2) Stress test on a single devserver", 
   "3) Test on a single-node in shadow cluster", 
   "4) Test on a whole shadow cluster", 
   "Revert Plan:", 
   "Reviewers: liyintang, aaiyer, rshroff, manukranthk, adela", 
   "Reviewed By: liyintang", 
   "CC: gqchen, hbase-eng@", 
   "Differential Revision: https://phabricator.fb.com/D837264", 
   "Task ID: 2325295"
  ], 
  "revision_id": "1492797"
 }, 
 {
  "author": "nick", 
  "date": "2013-06-13T18:18:19.000040Z", 
  "msg": [
   "Fix the javadoc, correct the indenting, and add the new test file from bug #54849"
  ], 
  "revision_id": "1492796"
 }, 
 {
  "author": "nick", 
  "date": "2013-06-13T18:17:16.599557Z", 
  "msg": [
   "Update the @author part, update how patches are submitted, and add a pragmatic code style section based on what we have tended to follow of late"
  ], 
  "revision_id": "1492795"
 }, 
 {
  "author": "nick", 
  "date": "2013-06-13T18:13:24.626378Z", 
  "msg": [
   "Fix whitespace, and remove the @author part as it is no longer Apache best practice"
  ], 
  "revision_id": "1492794"
 }
]