[
 {
  "author": "astitcher", 
  "date": "2013-06-17T19:45:48.139112Z", 
  "msg": [
   "QPID-4926: Get Unix sasl/ssl test working"
  ], 
  "revision_id": "1493903"
 }, 
 {
  "author": "tn", 
  "date": "2013-06-17T19:40:34.624846Z", 
  "msg": [
   "[COLLECTIONS-455] Remove todos: keep decorated object protected."
  ], 
  "revision_id": "1493902"
 }, 
 {
  "author": "ghuber", 
  "date": "2013-06-17T19:38:59.934949Z", 
  "msg": [
   "Check for invalid length of device type.  Log so we can update the list??"
  ], 
  "revision_id": "1493901"
 }, 
 {
  "author": "arkurth", 
  "date": "2013-06-17T19:37:20.741094Z", 
  "msg": [
   "VCL-16", 
   "Updated vcld so that cluster child reservations wait until the parent has started. Moved call to update the request state from vcld to State.pm::initialize. This allows the cluster parent to wait until all child reservations on other management nodes have started before updating the state. Added code to State.pm so that parent reservation waits for all child reservations to have a computerloadlog 'begin' entry before updating the request state.", 
   "Updated State.pm::DESTROY so that only the parent reservation deletes computerloadlog 'begin' entries. This is needed in case a child completes before the parent detects that all children have started.", 
   "Added utils.pm::sleep_uninterrupted.  This is called from the main vcld loop. The normal sleep function is interrupted due to a signal whenever a forked reservation process exits.  This subroutine makes sure the requested amount of time has elapsed.", 
   "VCL-697", 
   "Fixed problem in update_request_state which prevented the state from being updated from pending/<something> to failed. Added condition so request states are changed to failed or maintenance regardless of previous state.", 
   "Other", 
   "Removed unused subroutines from State.pm: predictor, update_request_state_new, update_computer_state_new, insert_computerloadlog, update_log_ending_new"
  ], 
  "revision_id": "1493900"
 }, 
 {
  "author": "kturner", 
  "date": "2013-06-17T19:36:52.407192Z", 
  "msg": [
   "ACCUMULO-1518 Patch from David M. Lyle that allows opening rfiles w/ multiple dots in name."
  ], 
  "revision_id": "1493899"
 }
]