[
 {
  "author": "han", 
  "date": "2013-06-16T14:02:30.338758Z", 
  "msg": [
   "javadoc: describe sub block in BlockTree term dict"
  ], 
  "revision_id": "1493513"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-06-16T14:01:56.833027Z", 
  "msg": [
   "A slightly modified patch from Ankit Jain from a previous work by Nandani Aggarwal for \"No method to remove a promo code from the shopping cart\" https://issues.apache.org/jira/browse/OFBIZ-4291", 
   "When working with promotions and promo codes in the shopping cart, it seems not possible to remove _one_ specific promo code from the cart neither through the ShoppingCart and its helpers and services, nor through the ProductPromoWorker.", 
   "ShoppingCart has the method", 
   "{{addProductPromoCode(String productPromoCodeId, LocalDispatcher dispatcher)}}", 
   "but no method to remove the added PromoCode. Is there any other worker, service or event that can be called to do this? And if not, is there a specifc reason (maybe relating to promotions application rules) for not implementing this?", 
   "Current provided method of dealing with removal of promotions is a so called brute force approach where removing all and adding not to be removed promotions again.", 
   "jleroux:", 
   "* in ecommerce no needs to be authentified to be abble to remove a promo code", 
   "* I also added a French label"
  ], 
  "revision_id": "1493512"
 }, 
 {
  "author": "acmurthy", 
  "date": "2013-06-16T14:00:58.765982Z", 
  "msg": [
   "Merge -c 1493509 from trunk to branch-2.1-beta to fix YARN-787. Removed minimum resource from RegisterApplicationMasterResponse. Contributed by Alejandro Abdelnur."
  ], 
  "revision_id": "1493511"
 }, 
 {
  "author": "acmurthy", 
  "date": "2013-06-16T14:00:36.594093Z", 
  "msg": [
   "Merge -c 1493509 from trunk to branch-2 to fix YARN-787. Removed minimum resource from RegisterApplicationMasterResponse. Contributed by Alejandro Abdelnur."
  ], 
  "revision_id": "1493510"
 }, 
 {
  "author": "acmurthy", 
  "date": "2013-06-16T13:59:41.547426Z", 
  "msg": [
   "YARN-787. Removed minimum resource from RegisterApplicationMasterResponse. Contributed by Alejandro Abdelnur."
  ], 
  "revision_id": "1493509"
 }
]