[
 {
  "author": "doogie", 
  "date": "2013-06-28T19:08:39.513455Z", 
  "msg": [
   "FEATURE: Allow constant numbers to be directly added to a query, instead", 
   "of having to deal with some kind of map/generic value.  This makes it", 
   "simpler to use full-text-search queries thru the entity", 
   "engine(postgresql and oracle)."
  ], 
  "revision_id": "1497893"
 }, 
 {
  "author": "doogie", 
  "date": "2013-06-28T19:08:32.993409Z", 
  "msg": [
   "FEATURE: Add extension points to the controller login workflow; this", 
   "allows other components to automatically insert themselves, without", 
   "having to modify any existing files.  This can be used for integrating", 
   "with Jasig CAS, or with OpenID."
  ], 
  "revision_id": "1497892"
 }, 
 {
  "author": "doogie", 
  "date": "2013-06-28T19:08:24.801067Z", 
  "msg": [
   "FEATURE: Allow for externalLoginKey parameter generation to be turned", 
   "off; the use for this feature will become apparent shortly."
  ], 
  "revision_id": "1497891"
 }, 
 {
  "author": "doogie", 
  "date": "2013-06-28T19:08:16.448872Z", 
  "msg": [
   "FIX: java.sql.Timestamp extends java.util.Date, and both have converters", 
   "registered.  In some cases, however, the Date convertor would be used", 
   "instead of the more correct Timestamp convertor.  This fix implements a", 
   "most-specific type algorithm to find the better convertor."
  ], 
  "revision_id": "1497890"
 }, 
 {
  "author": "doogie", 
  "date": "2013-06-28T19:08:09.950997Z", 
  "msg": [
   "FIX: If using <extend-entity> to change the type of a pre-existing", 
   "field, then we need to be certain to remove the existing defined field", 
   "from the list of available fields.  Otherwise, you'll end up with the", 
   "same field being queried in SELECT, and the same field being updated in", 
   "INSERT or UPDATE.", 
   "This issue was discovered when changing the type of a pre-existing", 
   "field(so that the length of the field could be increased)."
  ], 
  "revision_id": "1497889"
 }
]