[
 {
  "author": "joyce", 
  "date": "2013-07-09T21:21:09.348309Z", 
  "msg": [
   "CLIMATE-184 progress - Initial testing for PreviewMap.js"
  ], 
  "revision_id": "1501563"
 }, 
 {
  "author": "joyce", 
  "date": "2013-07-09T21:21:06.920067Z", 
  "msg": [
   "CLIMATE-184 progress - Add ASF header to PreviewMap.js"
  ], 
  "revision_id": "1501562"
 }, 
 {
  "author": "joyce", 
  "date": "2013-07-09T21:21:04.584404Z", 
  "msg": [
   "CLIMATE-184 progress - Add $observe on template id", 
   "- Any attribute that contains {{}} interpolation will be set to null in", 
   "the attrs parameter during the link function since the first $digest", 
   "since the compilation has yet to run to evaluate it! We can't run a", 
   "$digest in the middle of compilation, so using an $observe (or $watch)", 
   "is the best way to get the values. Before we were basically just lucky", 
   "that it wasn't breaking when we ran it."
  ], 
  "revision_id": "1501561"
 }, 
 {
  "author": "joyce", 
  "date": "2013-07-09T21:21:02.086183Z", 
  "msg": [
   "CLIMATE-184 progress - Draw region overlay on preview map", 
   "- Add drawing of region area as overlay on the preview map. This works", 
   "well for small datasets. On the large datasets this just ends up", 
   "showing a giant colored blob that doesn't necessarily help the user", 
   "understand the extent of the dataset. I think for global datasets it", 
   "would be better to just display an image of a globe (or something", 
   "similar). If the dataset is just really large then we'll just have to", 
   "keep \"trying our best\" to display the map in a reasonable manner.", 
   "Unfortunately making the map larger doesn't seem to be an option at", 
   "the moment (as it looks horrible)."
  ], 
  "revision_id": "1501560"
 }, 
 {
  "author": "joyce", 
  "date": "2013-07-09T21:20:59.755845Z", 
  "msg": [
   "CLIMATE-184 progress - Center preview maps on dataset bounds", 
   "- Use map.fitBounds to center the map on the dataset bounds. This", 
   "doesn't necessarily mean that the entire dataset will be visible in", 
   "the preview map. The map has to be fairly small to fit in the UI so", 
   "large datasets will have their overlap be the entire preview area", 
   "since the map cannot zoom out far enough. This may need to be changed", 
   "later."
  ], 
  "revision_id": "1501559"
 }
]