[
 {
  "author": "larsgeorge", 
  "date": "2013-07-13T15:19:03.560429Z", 
  "msg": [
   "HBASE-8938 Thrift2 does not close scanner instance (Hamed Madani)"
  ], 
  "revision_id": "1502798"
 }, 
 {
  "author": "larsgeorge", 
  "date": "2013-07-13T15:19:03.496168Z", 
  "msg": [
   "HBASE-8938 Thrift2 does not close scanner instance (Hamed Madani)"
  ], 
  "revision_id": "1502797"
 }, 
 {
  "author": "ggregory", 
  "date": "2013-07-13T15:07:14.171860Z", 
  "msg": [
   "[LOG4J2-306] Update JSON Jackson library to 2.2.2 from 2.2.1."
  ], 
  "revision_id": "1502796"
 }, 
 {
  "author": "bpendleton", 
  "date": "2013-07-13T15:02:42.462059Z", 
  "msg": [
   "DERBY-6216: XPLAIN feature does not work, gives XCL16: ResultSet not open", 
   "This change adjusts the implementation of the explain-only mode feature,", 
   "which is enabled via syscs_util.syscs_set_xplain_mode(1).", 
   "Prior to this change, the implementation short-circuited the open() method", 
   "of the ResultSet classes, causing the execution engine to terminate", 
   "immediately because the result sets were not open.", 
   "This change takes an alternate approach, suggested by Knut Anders: the open()", 
   "is allowed to proceed normally, but we short-circuit the getNextRow()", 
   "method of the ResultSet classes. This way, the result sets all appear to be", 
   "normal result sets, open and ready for business, but they do no work and", 
   "always produce an empty result.", 
   "Then, at the end of the execution, the statistics are gathered. They show", 
   "that no work was done, but they contain information about the overall \"shape\"", 
   "of the query plan (which result sets were constructed, and what the overall", 
   "result set tree looks like).", 
   "We also discovered that we were completely missing regression tests for the", 
   "explain-only feature, so this change adds a handful of regression tests,", 
   "including an IJ-based test, a simple embedded query, and a test that verifies", 
   "that explain-only mode can be turned on and off between executions of a", 
   "prepared query.", 
   "More testing would clearly be beneficial, but this should at least give us", 
   "a feature that basically works."
  ], 
  "revision_id": "1502795"
 }, 
 {
  "author": "stsp", 
  "date": "2013-07-13T15:00:36.618708Z", 
  "msg": [
   "* tools/dev/unix-build/Makefile.svn: In my custom build script, upgrade to", 
   "httpd 2.2.25. This makes authz test 17 fail over DAV. To be investigated..."
  ], 
  "revision_id": "1502794"
 }
]