[
 {
  "author": "danielsh", 
  "date": "2013-08-02T10:05:26.981728Z", 
  "msg": [
   "* tools/dist/backport.pl", 
   "(warning_summary): Rename a variable for clarity.  No functional change.", 
   "(handle_entry): Tweak informational output in conflicts mode."
  ], 
  "revision_id": "1509598"
 }, 
 {
  "author": "cziegeler", 
  "date": "2013-08-02T10:00:34.402598Z", 
  "msg": [
   "SLING-2991 :  Use only a single session in jcr resource listener"
  ], 
  "revision_id": "1509597"
 }, 
 {
  "author": "fmui", 
  "date": "2013-08-02T09:58:46.336426Z", 
  "msg": [
   "TypeDefinitionFactory enhancements"
  ], 
  "revision_id": "1509596"
 }, 
 {
  "author": "danielsh", 
  "date": "2013-08-02T09:52:59.008600Z", 
  "msg": [
   "* docs/community-guide/releasing.part.html", 
   "(#release-stabilization): Document the syntax implemented in r1509590."
  ], 
  "revision_id": "1509595"
 }, 
 {
  "author": "stephenc", 
  "date": "2013-08-02T09:52:11.982454Z", 
  "msg": [
   "After a lengthy discussion on the users@maven list and some", 
   "side discussions on members@apache, I think the following changes", 
   "are more in line with what we should be seeking as responsibilities", 
   "of the PMC.", 
   "* Forks are not bad... letting changes stack up in the fork is bad", 
   "but more from a 'it will be hard to review' point of view...", 
   "similarly using a fork to get external contributions complicates", 
   "the tracablity", 
   "* We are not obligated to promote other ASF projects... but there", 
   "should be a symmetry in how that lack of obligation plays out", 
   "* I identified some more responsibilities of the PMC (if I have missed", 
   "any, please add)", 
   "* There is a special case where the PMC Chair can wear the dictators", 
   "hat... but that is only in the case of unresolvable consensus", 
   "and the lack of consensus is causing damage to the project", 
   "and the board is well aware of the issue and expects the chair", 
   "to put on the dictators hat (with the board watching on)", 
   "As always, this is a Commit Then Review community... so these", 
   "changes are being committed for review."
  ], 
  "revision_id": "1509594"
 }
]