[
 {
  "author": "brock", 
  "date": "2013-09-10T19:21:19.929325Z", 
  "msg": [
   "HIVE-4619 - Hive 0.11.0 is not working with pre-cdh3u6 and hadoop-0.23 (Navis via Brock Noland)"
  ], 
  "revision_id": "1521593"
 }, 
 {
  "author": "rfscholte", 
  "date": "2013-09-10T19:19:42.225921Z", 
  "msg": [
   "m-install-p 2.5"
  ], 
  "revision_id": "1521592"
 }, 
 {
  "author": "joes", 
  "date": "2013-09-10T19:17:32.724974Z", 
  "msg": [
   "trivial change to trigger site build"
  ], 
  "revision_id": "1521591"
 }, 
 {
  "author": "tgraves", 
  "date": "2013-09-10T19:10:19.284057Z", 
  "msg": [
   "MAPREDUCE-5020. Compile failure with JDK8 (Trevor Robinson via tgraves)"
  ], 
  "revision_id": "1521590"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-09-10T19:08:29.598203Z", 
  "msg": [
   "For \"Order Report Issue\" https://issues.apache.org/jira/browse/OFBIZ-5297", 
   "The quickInitDataWarehouse BI button used these dates (set in BI main screen)", 
   "<set field=\"fromDate\" value=\"2008-01-01 00:00:00.0\" type=\"Timestamp\"/>", 
   "<set field=\"thruDate\" value=\"2010-01-01 00:00:00.0\" type=\"Timestamp\"/>", 
   "This generated 1000+ records. I set 10 years ahead (from sept. 2013) in a new bi.properties file used by the BI main screen. So it generates only 3000+ records (and others related in BI DB) which is still reasonable. A message, placed at the top of the Order Reports page, informs users that for 4 Birt reports s/he needs 1st to run the data warehouse init using the BI button. Also this message clarifies the range, to be certain that in 10 years people will still easily know what to change...", 
   "I have also replaced a lot of labels and added English and French translations (by-product: some labels cleaning in CommonUiLabels.xml)", 
   "I did not do the same for the accounting paymentReport and ViewFacilityInventoryHistoryReport facility Birt reports which only need translation.", 
   "I noticed that there are no ways to get to ViewFacilityInventoryHistoryReport from UI though!"
  ], 
  "revision_id": "1521589"
 }
]