[
 {
  "author": "jsc", 
  "date": "2013-09-20T09:01:45.099729Z", 
  "msg": [
   "#123283# check places where registry is check for office installation"
  ], 
  "revision_id": "1524953"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-09-20T08:56:46.977939Z", 
  "msg": [
   "No functional changes, better titles for Manufacturing help in English"
  ], 
  "revision_id": "1524952"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-09-20T08:53:50.402673Z", 
  "msg": [
   "No functional changes, better title for Manufacturing help in English"
  ], 
  "revision_id": "1524951"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-09-20T08:52:08.970501Z", 
  "msg": [
   "For \"If you clear the last packed item from from a shipment with two items and then complete the pack, you get the exception below\" https://issues.apache.org/jira/browse/OFBIZ-5308", 
   "If you clear the last packed item from from a shipment with two items and then complete the pack, you get the exception below:", 
   "Exception thrown while creating the \"newEntity\" ....ShipmentPackageContent ... Key ... is not present in table shipment_package", 
   "This is happening because org.ofbiz.shipment.packing.PackingSession.clearLine() around line 600 is decrementing packageSeq from 1 to zero.  This causes createPackages() to not generate any ShipmentPackages because of the for statement on packageSeq and therefore the subsequent exception.", 
   "I fixed this by just commenting out the block starting with \"if(line.packageSeq ==\".  I did not submit a patch because I do not fully understand the logic and do not have time now to learn it now.", 
   "Hopefully the author will be better equipped to deal with it properly.", 
   "Skip", 
   "jleroux: the path's author (https://issues.apache.org/jira/browse/OFBIZ-2163) Karim Rahimpur  did not answer. But by analogy with clearAllLines I decided that packageSeq should not be less than 1!"
  ], 
  "revision_id": "1524950"
 }, 
 {
  "author": "anoopsamjohn", 
  "date": "2013-09-20T08:51:37.723751Z", 
  "msg": [
   "HBASE-9244 Add CP hooks around StoreFileReader creation"
  ], 
  "revision_id": "1524949"
 }
]