[
 {
  "author": "chaase3", 
  "date": "2013-10-02T14:11:54.062028Z", 
  "msg": [
   "DERBY-6353  Update syntax description in Getting Started, use in Reference Manual too", 
   "Merged patch DERBY-6353-2.diff to 10.10 doc branch from trunk revision 1528473."
  ], 
  "revision_id": "1528483"
 }, 
 {
  "author": "rvesse", 
  "date": "2013-10-02T14:11:31.121526Z", 
  "msg": [
   "Fix a couple of possible deadlock conditions that can occur when using PipedRDFIterator", 
   "In the case where the producer thread dies before the consumer thread and the consumer thread is scheduled by the JVM onto", 
   "the same thread as the producer ran on the iterator would previously fail to detect and block indefinitely.  This case is now", 
   "detected and the consumer will error out after draining the queue.", 
   "In the case where the producer thread never produces any output or fails to call finish() the consumer would block idefinitely.", 
   "There is now a limit on polling attempts after which the producer is assumed dead and the consumer errors out.", 
   "In the case where one consumer closed the iterator while another consumer was blocking in hasNext() the blocked consumer would", 
   "never check if the iterator had been closed and would block indefinitely.  The consumer will now check for this situation and", 
   "error out appropriately."
  ], 
  "revision_id": "1528482"
 }, 
 {
  "author": "kwright", 
  "date": "2013-10-02T14:10:48.080321Z", 
  "msg": [
   "Add a native SharePoint authority.  Right now it just behaves like an Active Directory authority, but that will change."
  ], 
  "revision_id": "1528481"
 }, 
 {
  "author": "mikemccand", 
  "date": "2013-10-02T14:10:19.224607Z", 
  "msg": [
   "LUCENE-5249: expect ivy-versions.properies in lucene source artifacts"
  ], 
  "revision_id": "1528480"
 }, 
 {
  "author": "mikemccand", 
  "date": "2013-10-02T14:09:56.577836Z", 
  "msg": [
   "LUCENE-5249: expect ivy-versions.properies in lucene source artifacts"
  ], 
  "revision_id": "1528479"
 }
]