[
 {
  "author": "markt", 
  "date": "2013-10-08T08:10:38.018512Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=55633 for APR.", 
   "If the socket was registered for read and write and only one occurred, the registration for the other event was lost. Ensure that the socket is re-registered with the Poller when necessary."
  ], 
  "revision_id": "1530183"
 }, 
 {
  "author": "markt", 
  "date": "2013-10-08T08:09:31.921625Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=55633 for NIO.", 
   "The Comet code that ensured that multiple threads didn't process the same socket when the selector indicated that a socket was ready for read and write pre-dated r1001698 where syncs where added to the SocketProcessor to achieve the same aim for Servlet 3.0 asyncs processing.", 
   "The Comet code was re-used to handle upgraded connections.", 
   "The upgrade code did not handle the case where a socket was registered for read and write but only a write event occurred. In this case the read registration was lost. This is the root cause of the lack of responsiveness observed in bug 55633.", 
   "With the changes in r1001698, a simpler solution can be used for both", 
   "Comet and HTTP upgrade. The new approach unregisters the socket operations the selector has reported ready for and then triggers a read and/or write as appropriate. For Comet the syncs will ensure that read and write aren't processed in parallel. For HTTP upgrade such parallel processing is permitted."
  ], 
  "revision_id": "1530182"
 }, 
 {
  "author": "clement", 
  "date": "2013-10-08T07:58:19.136219Z", 
  "msg": [
   "Let the getRequiredHandlerList method throw ConfigurationException."
  ], 
  "revision_id": "1530181"
 }, 
 {
  "author": "remm", 
  "date": "2013-10-08T07:56:57.417162Z", 
  "msg": [
   "Version number."
  ], 
  "revision_id": "1530180"
 }, 
 {
  "author": "remm", 
  "date": "2013-10-08T07:55:58.004765Z", 
  "msg": [
   "New storeconfig tag."
  ], 
  "revision_id": "1530179"
 }
]