[
 {
  "author": "hashutosh", 
  "date": "2013-10-10T15:55:01.092970Z", 
  "msg": [
   "HIVE-4846 : Implement Vectorized Limit Operator (Sarvesh Sakalanaga via Ashutosh Chauhan)"
  ], 
  "revision_id": "1531033"
 }, 
 {
  "author": "jlowe", 
  "date": "2013-10-10T15:50:33.211735Z", 
  "msg": [
   "YARN-155. TestAppManager intermittently fails with jdk7. Contributed by Thomas Graves"
  ], 
  "revision_id": "1531032"
 }, 
 {
  "author": "chaase3", 
  "date": "2013-10-10T15:48:07.566492Z", 
  "msg": [
   "DERBY-6120  Clarify that $ is the separator character which should be used for", 
   "the external names of static nested classes", 
   "Merged patch DERBY-6120.diff to 10.10 doc branch from trunk revision 1531025."
  ], 
  "revision_id": "1531031"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-10-10T15:43:42.424144Z", 
  "msg": [
   "A patch from Christian Carlow for \"Shipment cancellation doesn't revert inventory accounting quantity total\" https://issues.apache.org/jira/browse/OFBIZ-5314", 
   "When order items are issued to a shipment, the accounting_quantity_total", 
   "for the corresponding inventory records are updated but afterwards when", 
   "the shipment is cancelled, the accounting_quantity_total is not reverted", 
   "back to the original values.  Is this a bug or is there a reason the", 
   "quantity is not reverted?", 
   "The problem is that when I try to create another shipment and issue the", 
   "same quantity, I receive the following error:", 
   "The following error occurs when I try to issue the same previously", 
   "cancelled quantity to a newly created shipment:", 
   "Error:<br/> ERROR: Could not complete the Issue OrderItemShipGrpInvRes", 
   "to Shipment", 
   "[file:/dev/apache-ofbiz-11.04.02/applications/product/script/org/ofbiz/shipment/issuance/IssuanceServices.xml#issueOrderItemShipGrpInvResToShipment]", 
   "process [problem removing the orderItemShipGrpInvRes value: The current", 
   "transaction is marked for rollback, not beginning a new transaction and", 
   "aborting current operation; the rollbackOnly was caused by: Error in", 
   "simple-method [Create an accounting transactions for a sales shipment", 
   "issuance (D: INVENTORY_ACCOUNT, C: COGS_ACCOUNT)", 
   "[file:/home/stan/dev/apache-ofbiz-11.04.02/applications/accounting/script/org/ofbiz/accounting/ledger/GeneralLedgerServices.xml#createAcctgTransForSalesShipmentIssuance]]:", 
   "; {Could not find enough accounting inventory for product DOUGH;", 
   "remaining quantity: 1}] <br/> <br/>", 
   "The service is looking for inventory_item records with an", 
   "accounting_quantity_total > 0 but finds none because the quantity was", 
   "decremented to 0 from the cancelled shipment issuance."
  ], 
  "revision_id": "1531030"
 }, 
 {
  "author": "jlowe", 
  "date": "2013-10-10T15:43:05.958511Z", 
  "msg": [
   "svn merge -c 1511464 FIXES: MAPREDUCE-5425. Junit in TestJobHistoryServer failing in jdk 7. Contributed by Robert Parker"
  ], 
  "revision_id": "1531029"
 }
]