[
 {
  "author": "bdelacretaz", 
  "date": "2013-10-28T12:40:47.127954Z", 
  "msg": [
   "SLING-2788 - Oak-compatible test"
  ], 
  "revision_id": "1536333"
 }, 
 {
  "author": "astitcher", 
  "date": "2013-10-28T12:40:05.039343Z", 
  "msg": [
   "QPID-5263: Fix boost files on windows.", 
   "- As we no longer install any header files with boost dependencies we can stop", 
   "shipping any boost includes files in the windows kit.", 
   "- Install correct Boost DLLs."
  ], 
  "revision_id": "1536332"
 }, 
 {
  "author": "astitcher", 
  "date": "2013-10-28T12:40:02.406688Z", 
  "msg": [
   "QPID-5262: Install debug versions of MS runtime DLLs"
  ], 
  "revision_id": "1536331"
 }, 
 {
  "author": "astitcher", 
  "date": "2013-10-28T12:39:59.834729Z", 
  "msg": [
   "QPID-5261: Install DLLs and import Libs to more usual places for a windows SDK"
  ], 
  "revision_id": "1536330"
 }, 
 {
  "author": "astitcher", 
  "date": "2013-10-28T12:39:56.802006Z", 
  "msg": [
   "QPID-5260: Significant tidy up of cmake build", 
   "* Move to cmake 2.6 as minimum required version", 
   "(2.4 is extremely long in the tooth now)", 
   "* Add control over building individual language bindings", 
   "* Make settings you don't usually want to change advanced", 
   "so they are hidden by default", 
   "* Changed to a uniform naming scheme for options:", 
   "** Options controlling what to build are all BUILD_", 
   "** Options controlling features of he build are ENABLE_", 
   "** Options controlling internal aspects of the qpid runtime are QPID_", 
   "* Respect the BUILD_TESTING option so that we won't build the", 
   "tests unless it is set (it is by default)", 
   "* If we don't find the boost_unit_test_framework then don't fail,", 
   "just don't build the unit tests (this is motivated by one of the", 
   "Apache Jenkins ubuntu builders which has this set up)", 
   "* Tidied up some of the detection of external dependencies to make it", 
   "more idiomatic cmake (but there is more to do here)"
  ], 
  "revision_id": "1536329"
 }
]