[
 {
  "author": "brane", 
  "date": "2013-10-28T12:28:38.376039Z", 
  "msg": [
   "On the javahl-1.8-extensions branch: Sync JavaHL with trunk up to r1536324."
  ], 
  "revision_id": "1536328"
 }, 
 {
  "author": "alexoree", 
  "date": "2013-10-28T12:28:22.094364Z", 
  "msg": [
   "JUDDI-674 added more unit tests, pulling a wadl from the cxf project"
  ], 
  "revision_id": "1536327"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2013-10-28T12:21:52.142721Z", 
  "msg": [
   "XBEAN-253 using asynchronism rather than multithreaded implementation since the whole finder is not thread safe at all"
  ], 
  "revision_id": "1536326"
 }, 
 {
  "author": "rhuijben", 
  "date": "2013-10-28T12:19:31.566842Z", 
  "msg": [
   "When an Sqlite statement raises some error, the same error is reported", 
   "when resetting the statement for the first time, originally for error", 
   "reporting reasons, but now this is considered an original design flaw.", 
   "But in this case we forget to mark the statement as already been reset,", 
   "which may cause an unnecessary false abort() when running in maintainer mode.", 
   "* subversion/libsvn_subr/sqlite.c", 
   "(svn_sqlite__reset): Reverse code, documenting why."
  ], 
  "revision_id": "1536325"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-10-28T12:12:43.701954Z", 
  "msg": [
   "Fixes <<Services allow arbitrary HTML for parameters with allow-html set to \"safe\">> https://issues.apache.org/jira/browse/OFBIZ-5254", 
   "After r751990, <<allow-html=\"any\">> and <<allow-html=\"safe\">> are the same: they do nothing! The only difference is the warning message from the OWASP Antisamy IntrusionDetector, which is both, as Christoph noted \"giving you a false sense of security\" or as I wrote \"disturbing, wrong and useless\". So there are no longer any reasons for differencing \"safe\" and \"any\".", 
   "This", 
   "* Deprecates \"safe\" (making it clear in the XSD documentation), keeping only \"none\" and \"any\". This is for backward compatibility, else we could completely remove the misleading \"safe\". Note that \"none\" is the default.", 
   "* Replaces in services definition all allow-html=\"safe\" by allow-html=\"any\"", 
   "* Remove from ModelService.java (near line 587) the code which throws the OWASP Antisamy IntrusionDetector message in log"
  ], 
  "revision_id": "1536324"
 }
]