[
 {
  "author": "rwesten", 
  "date": "2013-10-30T12:53:41.127654Z", 
  "msg": [
   "STANBOL-1127: fixed several issues with the integration-tests: fixed rdf files with syntax errors in the apache-project-doap-files.zip; fixed some regex expressions used in assertions for expected content; fixed some requests to use the application/x-www-form-urlencoded Content-Type; NOTE: there are still three failing integration tests for the entityhub because of an error related to serializing JSON-LD"
  ], 
  "revision_id": "1537068"
 }, 
 {
  "author": "alg", 
  "date": "2013-10-30T12:52:12.373465Z", 
  "msg": [
   "i122433 corrected export of polygons with text"
  ], 
  "revision_id": "1537067"
 }, 
 {
  "author": "rhuijben", 
  "date": "2013-10-30T12:40:46.210443Z", 
  "msg": [
   "* subversion/libsvn_wc/wc_db.c", 
   "(bump_node_revision): Following up on r1537065, remove now duplicated", 
   "handling of not present and server excluded nodes."
  ], 
  "revision_id": "1537066"
 }, 
 {
  "author": "rhuijben", 
  "date": "2013-10-30T12:36:47.456394Z", 
  "msg": [
   "When walking the base tree during update for crawling and bumping, do a tiny", 
   "bit more work in the query that handles all children of a directory to avoid", 
   "doing things in the later per node change.", 
   "This patch removes at least one query per node within an update, but as this", 
   "query is evaluated within an existing transaction this is not really", 
   "measurable on small working copies.", 
   "A followup patch will remove a more expensive query per node.", 
   "* subversion/libsvn_wc/wc-queries.sql", 
   "(STMT_SELECT_BASE_CHILDREN_INFO): Duplicate query to optimize for the case", 
   "where we don't need the lock join.", 
   "* subversion/libsvn_wc/wc_db.c", 
   "(base_get_children_info): New function, extracted from...", 
   "(svn_wc__db_base_get_children_info): which now just calls", 
   "base_get_children_info.", 
   "(bump_node_revision): Call base_get_children_info to get the list of children", 
   "and information about them in a single query. Move the operations that", 
   "only apply to children and not to the update/switch root to the child loop."
  ], 
  "revision_id": "1537065"
 }, 
 {
  "author": "kwright", 
  "date": "2013-10-30T12:27:17.761166Z", 
  "msg": [
   "Probable fix for CONNECTORS-796."
  ], 
  "revision_id": "1537064"
 }
]