[
 {
  "author": "nkeywal", 
  "date": "2013-11-06T23:28:13.940974Z", 
  "msg": [
   "HBASE-9885 Avoid some Result creation in protobuf conversions - REVERT to check the cause of precommit flakiness"
  ], 
  "revision_id": "1539493"
 }, 
 {
  "author": "nkeywal", 
  "date": "2013-11-06T23:19:56.380880Z", 
  "msg": [
   "HBASE-9885 Avoid some Result creation in protobuf conversions - REVERT to check the cause of precommit flakiness"
  ], 
  "revision_id": "1539492"
 }, 
 {
  "author": "mck", 
  "date": "2013-11-06T22:55:26.447461Z", 
  "msg": [
   "Inspired by http://struts.apache.org", 
   "I applied the same skin and simplification to our site.", 
   "A summary of changes involved:", 
   "a) I've taken away a number of pages that i felt were presenting duplicate information. contributers.html and volunteers.html since the information, apart from the long entries about individuals, were already present on the \"Project Team\" page. Antonio Petrelli", 
   "and David H. DeWolf, do you mind having the extra info about the two of you taken away? (it's easy to put it elsewhere and link to it from the teams page)", 
   "b) a number of the links in the navigation have been removed. related projects, thanks, sponsorship, security.", 
   "c) much of the text on the front page has been removed. \"About Tiles as an Apache project\", \"Powered by Apache Tiles\", and all links to Tiles-2.1. All this stuff on Apache can be found easily enough if people are searching for it. And we really want to encourage", 
   "people to only be downloading tiles-3 or tiles-2.2. We don't have the manpower to be supporting extra versions.", 
   "d) The security warning has been removed from the front page. It is old, and it still exists on the security bulletin pages.", 
   "e) The \"hero-unit\" summary is extended, including the quote from Nick.", 
   "f) on the faq page move the stuff about relationship to struts to the bottom of the page. this is old history now, the technical faq are likely more interesting to newcomers."
  ], 
  "revision_id": "1539491"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2013-11-06T22:52:28.094493Z", 
  "msg": [
   "Initial version of a 'deltaForDoubleToDecimal' method for estimating the difference between an", 
   "IEEE 754 double value and its definitive value as defined in base 10 by international standards."
  ], 
  "revision_id": "1539490"
 }, 
 {
  "author": "sergeyb", 
  "date": "2013-11-06T22:45:34.335111Z", 
  "msg": [
   "[CXF-5309] Validating Response values only if Valid annotation is present: updating the invoker too"
  ], 
  "revision_id": "1539489"
 }
]