[
 {
  "author": "hashutosh", 
  "date": "2013-11-10T16:47:21.485123Z", 
  "msg": [
   "HIVE-5626 : enable metastore direct SQL for drop/similar queries (Sergey Shelukhin via Ashutosh Chauhan)"
  ], 
  "revision_id": "1540493"
 }, 
 {
  "author": "hashutosh", 
  "date": "2013-11-10T16:43:53.601099Z", 
  "msg": [
   "HIVE-5700 : enforce single date format for partition column storage (Sergey Shelukhin via Ashutosh Chauhan)"
  ], 
  "revision_id": "1540492"
 }, 
 {
  "author": "adrianc", 
  "date": "2013-11-10T16:43:20.178300Z", 
  "msg": [
   "Merged revision(s) 1526276 from ofbiz/trunk:", 
   "Fixed a warning caused by a framework dependency on the Party component.", 
   "Merged revision(s) 1527626 from ofbiz/trunk:", 
   "Fixed a subtle flaw in the GenericDelegator.findOne method. When a database query returns no result, GenericValue.NULL_VALUE is put in the pk cache - so future findOne calls will know the entity value doesn't exist. But the findOne method never checked for GenericValue.NULL_VALUE in cache gets, so the database was queried again for an entity value we already know doesn't exist.", 
   "https://issues.apache.org/jira/browse/OFBIZ-5332", 
   "Merged revision(s) 1527609 from ofbiz/trunk:", 
   "Small change to GenericDelegator.findOne method - moved the primary key validation check to the beginning of the method.", 
   "I believe the original intention was to perform the validation check after the EV_VALIDATE ECAs were run, but the primary key was being used in three method calls before that happened - so those methods could have been passed an invalid primary key.", 
   "Merged revision(s) 1527212 from ofbiz/trunk:", 
   "Replaced HashSet with LinkedHashSet in UtilMisc.java to preserve original ordering. Suggested by Leon on the dev mailing list.", 
   "Merged revision(s) 1527810 from ofbiz/trunk:", 
   "Fixed a problem with bad try-catch-finally nesting and transaction handling in GenericDelegator.", 
   "1. The only exception caught was GenericEntityException, so any other thrown exception was missed - meaning the transaction was committed and GenericDelegator acted as if nothing was wrong.", 
   "2. The commit was performed in the finally block, so it was ALWAYS performed - even after an exception was thrown and the transaction was rolled back.", 
   "We managed to get away with this all along because typically there is a wrapping transaction that clears it all up. But still, the Delegator code needs to handle transactions correctly.", 
   "Merged revision(s) 1530976 from ofbiz/trunk:", 
   "Allow redefinition of view entities. XML schema change only - implementation exists already.", 
   "Merged revision(s) 1533542 from ofbiz/trunk:", 
   "Fixed a bug in the entity tests - JUnit expected and actual arguments were reversed in the testTransactionUtilRollback test.", 
   "Merged revision(s) 1536170 from ofbiz/trunk:", 
   "Small fix for StringUtil.toMap method - avoid array index exceptions when a Map element is missing a value.", 
   "Merged revision(s) 1539781 from ofbiz/trunk:", 
   "Fixed broken ModelInduceFromDb.jsp file."
  ], 
  "revision_id": "1540491"
 }, 
 {
  "author": "hashutosh", 
  "date": "2013-11-10T16:40:05.260608Z", 
  "msg": [
   "HIVE-5753 : Remove collector from Operator base class (Mohammad Islam via Ashutosh Chauhan)"
  ], 
  "revision_id": "1540490"
 }, 
 {
  "author": "hashutosh", 
  "date": "2013-11-10T16:33:08.257549Z", 
  "msg": [
   "HIVE-5737 : Provide StructObjectInspector for UDTFs rather than ObjectInspect[] (Navis via Ashutosh Chauhan)"
  ], 
  "revision_id": "1540489"
 }
]