[
 {
  "author": "felicity", 
  "date": "2005-02-20T06:59:43.976149Z", 
  "msg": [
   "bug 3864: add new ratware rule"
  ], 
  "revision_id": "154479"
 }, 
 {
  "author": "skitching", 
  "date": "2005-02-20T06:58:49.620883Z", 
  "msg": [
   "Move findLoader method to Declaration class."
  ], 
  "revision_id": "154478"
 }, 
 {
  "author": "dolander", 
  "date": "2005-02-20T06:48:39.426501Z", 
  "msg": [
   "Work on a number of bug fixes:", 
   "Jira 309 -- Added a separate image for the root of the tree.  The root must be of type ITreeRootElement", 
   "to support this.  The root images are specified on tree tag.  There are default root images now", 
   "checked into the resources which will be used when the tree doesn't specify images.  If a dynamically created", 
   "tree doesn't return a root image, then we will use the normal expand/contract images.", 
   "Jira 312 -- Started to hook up support for the title.  At the moment this will set the title on the", 
   "selection action.  There is a bit more work to allow this to set the alt text on the itemIcon if the", 
   "label is not used.", 
   "Jira 337 -- Changed how the alt text is output.  Now the itemIcon will also use the label for it's alt", 
   "text, unless the label contains a character that is illegal inside of an HTML attribute '&', '<' and '\"'.", 
   "The double quote is not allowed because we output the alt text using the double quote.  In addition,", 
   "the expand/contract image will have alt text indicating it's function (to expand/collapse the node).", 
   "Cleaned up the icon images a bit, so the look better.", 
   "This pretty much affects every tree results file, so they've been updated."
  ], 
  "revision_id": "154477"
 }, 
 {
  "author": "felicity", 
  "date": "2005-02-20T05:56:03.928590Z", 
  "msg": [
   "rework a few paragraphs from the INSTALL doc, per bug 3392 add in a note reminding people to read the whole document before installing..."
  ], 
  "revision_id": "154476"
 }, 
 {
  "author": "felicity", 
  "date": "2005-02-20T05:46:15.601276Z", 
  "msg": [
   "bug 3371: files with multiple whitespace characters in a row would be mishandled and split into multiple files."
  ], 
  "revision_id": "154475"
 }
]