[
 {
  "author": "ebourg", 
  "date": "2013-11-28T10:36:36.015152Z", 
  "msg": [
   "Hide the internal PNM classes"
  ], 
  "revision_id": "1546338"
 }, 
 {
  "author": "tripod", 
  "date": "2013-11-28T10:36:13.846778Z", 
  "msg": [
   "OAK-1222 Migration of Group Members stored in tree structure", 
   "- refactor upgrade tests to get better test reports", 
   "- add group editor to manage migration of group memebers", 
   "- make logic in GroupMemembershipProvider reusable by upgrade"
  ], 
  "revision_id": "1546337"
 }, 
 {
  "author": "bdelacretaz", 
  "date": "2013-11-28T10:28:05.853642Z", 
  "msg": [
   "Note about announcements"
  ], 
  "revision_id": "1546336"
 }, 
 {
  "author": "jawi", 
  "date": "2013-11-28T10:27:26.058940Z", 
  "msg": [
   "ACE-433 - preparing agent for custom controller handling:", 
   "- the default controller is a component that is handled like all other", 
   "components. While this works, the controller is actually a 'special'", 
   "beast for the agent: it controls everything for the agent. Hence,", 
   "it should have a more explicit place in the (internal) API of the", 
   "agent;", 
   "- when using a custom controller, the old controller needs to be", 
   "disabled, but still was created and invoked albeit for a short time.", 
   "This while a custom controller still needs to be packaged along with", 
   "the rest of the agent (for all kinds of reasons), so it makes much", 
   "more sense to load this custom controller at startup instead of the", 
   "default one. For this, we've added a new property that allows one to", 
   "specify the FQCN of the custom controller. In case this property is", 
   "omitted, the default controller is loaded and used;", 
   "- fixed a small issue where system properties were always used instead", 
   "of framework properties."
  ], 
  "revision_id": "1546335"
 }, 
 {
  "author": "bdelacretaz", 
  "date": "2013-11-28T10:26:47.722282Z", 
  "msg": [
   "Note about announcements"
  ], 
  "revision_id": "1546334"
 }
]