[
 {
  "author": "challngr", 
  "date": "2013-12-02T20:54:00.230772Z", 
  "msg": [
   "UIMA-3457 Be sure to catch and handle all interrupts or the threading can hang."
  ], 
  "revision_id": "1547188"
 }, 
 {
  "author": "markrmiller", 
  "date": "2013-12-02T20:51:19.903435Z", 
  "msg": [
   "SOLR-1301: Ivy likes to act funny if you don't declare compile and test resources in the same dependency."
  ], 
  "revision_id": "1547187"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-12-02T20:49:10.386269Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 1533839\"", 
   "------------------------------------------------------------------------", 
   "r1533839 | jleroux | 2013-10-20 00:07:35 +0200 (dim. 20 oct. 2013) | 27 lignes", 
   "Set different ports for testing in a CI environment (e.g. Jenkins) https://issues.apache.org/jira/browse/OFBIZ-4794", 
   "*What's for?*", 
   "Finally, OOTB the port offset is interesting in 2 cases:", 
   "# To eventually run Sonar on OFBiz sources https://issues.apache.org/jira/browse/INFRA-3590", 
   "# To simultaneously run the demos without having to change much things, just one parameter (this will need to have the same commited in R13.07... to be discussed...)", 
   "Of course, It can be used for other purposes outside of the ASF context...", 
   "*How it's done?*", 
   "Basically, I just added a portoffset integer parameter to 3 ant targets (of course this JVM param can also be used in a Java call from command line): start, start-pos, start-both,", 
   "The portoffset parameter is set to zero by default in ClassLoaderContainer.java.", 
   "If a value is passed, it's then grabed by Config.java and passed to ClassLoaderContainer.java, where it's set to this value.", 
   "The portoffset is then used to change in one shoot all the default ports values defined (in config or hardcoded), and the admin port value", 
   "This is done in following classes:", 
   "CatalinaContainer", 
   "NamingServiceContainer", 
   "ServiceEngine through ServiceLocation", 
   "RmiServiceContainer", 
   "XMLRPCClientEngine", 
   "XmlRpcTests", 
   "To avoid hardcoding locations in services definitions, I also created 2 service-locations: main-http and main-soap", 
   "*To summarize:* these changes will be used to run \"ant start\" with a portoffset value which will take care of all ports values, including admin port. For running R12.04 demo as stable we will still need to create a patch for the last time. R13.07 could have a similar patch applied since it's not yet released...", 
   "------------------------------------------------------------------------", 
   "?\\026"
  ], 
  "revision_id": "1547186"
 }, 
 {
  "author": "ehans", 
  "date": "2013-12-02T20:48:28.959689Z", 
  "msg": [
   "HIVE-5581: Implement vectorized year/month/day... etc. for string arguments (Teddy Choi via Eric Hanson)"
  ], 
  "revision_id": "1547185"
 }, 
 {
  "author": "veithen", 
  "date": "2013-12-02T20:47:38.257705Z", 
  "msg": [
   "Added an explanation why the working directory for the integration tests must be set to the root directory of the Synapse project."
  ], 
  "revision_id": "1547184"
 }
]