[
 {
  "author": "crossley", 
  "date": "2005-02-22T06:40:07.881697Z", 
  "msg": [
   "Change to document-v20", 
   "Add section about plugins.", 
   "Minor text changes."
  ], 
  "revision_id": "154804"
 }, 
 {
  "author": "crossley", 
  "date": "2005-02-22T06:38:13.554454Z", 
  "msg": [
   "Make it more obvious that \"leather-dev\" is still in development."
  ], 
  "revision_id": "154803"
 }, 
 {
  "author": "crossley", 
  "date": "2005-02-22T06:36:34.632068Z", 
  "msg": [
   "Tidy the change notes for this release."
  ], 
  "revision_id": "154802"
 }, 
 {
  "author": "rich", 
  "date": "2005-02-22T06:31:48.984247Z", 
  "msg": [
   "Fix for http://issues.apache.org/jira/browse/BEEHIVE-190 : The prevent double submit feature does not work if the back button is not using the cached page", 
   "The 'preventDoubleSubmit' attribute on @Jpf.Action/@Jpf.SimpleAction works in conjunction with NetUI tags (anchor, button, etc.) to throw an exception if an action is raised twice from the same page.  This works when the user double-clicks a link, but it doesn't always work when the user clicks the link, reaches a success page, goes back using the back button, and clicks the link again.  The specific case where this doesn't work is when the browser is instructed *not* to cache the original page, so each time you go back to it, a new one is rendered.  By default, pages reached through Page Flow actions included no-cache headers when the server was not in production mode (to make iterative development easier).", 
   "To mitigate this, I've added the ability to configure action/page caching (i.e., the headers that are sent to the browser to configure caching).  The default behavior now is *not* to prevent caching on pages, which fixes this bug.  If you *do* still want to prevent caching of pages, you can add either of the following snippets to netui-config.xml:", 
   "<pageflow-config>", 
   "<prevent-cache>always</prevent-cache>", 
   "</pageflow-config>", 
   "-or-", 
   "<pageflow-config>", 
   "<prevent-cache>inDevMode</prevent-cache>", 
   "</pageflow-config>", 
   "The \"always\" value always prevents caching, and the \"inDevMode\" value prevents caching when the server is not in production mode.", 
   "I also added a 'disableOnClick' attribute to the Anchor, ImageAnchor, and Button tags.  When this is set to true, the button/link can't be clicked twice -- this eliminates the need for server-side checking in cases where JavaScript is enabled.", 
   "DRT/BVT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "154801"
 }, 
 {
  "author": "joes", 
  "date": "2005-02-22T06:27:27.077274Z", 
  "msg": [
   "Get the glue/perl/t/apreq/big_input tests passing again on *nix.", 
   "Also reorder apreq_params arguments to match OO pattern."
  ], 
  "revision_id": "154800"
 }
]