[
 {
  "author": "jsc", 
  "date": "2013-12-11T14:34:38.877699Z", 
  "msg": [
   "#123819# integrate Thai translation for AOO4.1"
  ], 
  "revision_id": "1550153"
 }, 
 {
  "author": "dag", 
  "date": "2013-12-11T14:34:31.859015Z", 
  "msg": [
   "DERBY-532 Support deferrable constraints", 
   "Patch derby-532-nullableUniqueFix. When we changed the implementation from", 
   "special treatment of deferrable constraints in the BTree, a couple of extra", 
   "predicates needed to be added were omitted - added those here: we should not", 
   "mark the physical index with \"uniqueWithDuplicateNulls\" if it is deferrable.", 
   "This error was found when running the regressions with default deferrable for", 
   "all pk and unique constraints.", 
   "We also removed an unused flag \"hasDeferrableChecking\" in the same places (it is", 
   "not longer used by the physical index).", 
   "Added a new test case, testCompressTable, which tests the", 
   "\"uniqueWithDuplicateNulls\" case.", 
   "We also change the behavior in the following way for deferrable, but not", 
   "deferred constraints: if we hit a time-out or dead-lock when checking uniqueness", 
   "(in the BTree scan), we throw that time-out or dead-lock. Up till now we", 
   "converted it to a duplicate exception. We will only assume it can be a duplicate", 
   "- for later checking - iff the constraint mode is deferrable."
  ], 
  "revision_id": "1550152"
 }, 
 {
  "author": "andygumbrecht", 
  "date": "2013-12-11T14:34:11.436450Z", 
  "msg": [
   "More pom cleanups. Need to ensure versions go up to top pom to avoid conflicts.", 
   "mbean-annotation-api now belongs to container."
  ], 
  "revision_id": "1550151"
 }, 
 {
  "author": "kwright", 
  "date": "2013-12-11T14:27:40.943293Z", 
  "msg": [
   "Rework a couple of things in the zookeeper implementation; this is in conjunction with CONNECTORS-835"
  ], 
  "revision_id": "1550150"
 }, 
 {
  "author": "chetanm", 
  "date": "2013-12-11T14:25:51.177880Z", 
  "msg": [
   "OAK-1276 MongoDocumentStore sometimes returns NodeDocument.NULL instead of null document"
  ], 
  "revision_id": "1550149"
 }
]