[
 {
  "author": "alexoree", 
  "date": "2013-12-31T15:35:27.676987Z", 
  "msg": [
   "JUDDI-241 adding persistence layer for replication configuration. added queuing mechanism"
  ], 
  "revision_id": "1554543"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-12-31T15:33:14.279780Z", 
  "msg": [
   "This one missed in previous commit not sure why"
  ], 
  "revision_id": "1554542"
 }, 
 {
  "author": "alexoree", 
  "date": "2013-12-31T15:32:50.417740Z", 
  "msg": [
   "JUDDI-729 adding a feature to strip digital signatures (branch 3.3)"
  ], 
  "revision_id": "1554541"
 }, 
 {
  "author": "jleroux", 
  "date": "2013-12-31T15:32:33.012421Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 1554536  \" (2 small conflicts handled by hand)", 
   "------------------------------------------------------------------------", 
   "r1554536 | jleroux | 2013-12-31 16:22:21 +0100 (mar. 31 déc. 2013) | 10 lignes", 
   "This fixes the geolocation in OFBiz, for both Google Maps and OpenLayers. It seems few changes, it took me more time than I thought. I hope this will last few years again, and it should be easier to maintain now.", 
   "What I did:", 
   "Upgraded from Google Maps API 2 to 3, which also means removing the keys in general.properties. They are no longer needed in API-3 (at least for our demo and local test uses), one worry less!", 
   "Refactored Google Maps code in geolocation.ftl: put more things in common,  simplified code (the API-3 is better from this POV).", 
   "For OpenLayers, due to most browsers now rejecting mixed content (HTTP vs HTTPS), I had to follow their advice and put OpenLayers-2.13.1.js + images and theme(finally not used) in the framework. Not a big deal in term of size but again one more lib to worry about. Anyway geolocation is not vital for OFBiz. I have also added a zoom and navigation widget in maps. Note that IE warns about mixed content, but you can bypass it.", 
   "While working on editGeoLocation (in Party) I noticed it does not update the elevation. I found it was possible http://www.daftlogic.com/sandbox-google-maps-find-altitude.htm but I did not implement it, lack of time...", 
   "Also I got once a NPE in CallSimpleMapProcessor (when using editGeoLocation) but was unable to reproduce (w/o changes before and after)", 
   "------------------------------------------------------------------------", 
   "?\\026"
  ], 
  "revision_id": "1554540"
 }, 
 {
  "author": "alexoree", 
  "date": "2013-12-31T15:32:16.505263Z", 
  "msg": [
   "JUDDI-729 adding a feature to strip digital signatures"
  ], 
  "revision_id": "1554539"
 }
]