[
 {
  "author": "bodewig", 
  "date": "2014-01-07T17:59:15.549426Z", 
  "msg": [
   "AR stores date as seconds since epoch"
  ], 
  "revision_id": "1556293"
 }, 
 {
  "author": "kwall", 
  "date": "2014-01-07T17:58:41.600677Z", 
  "msg": [
   "QPID-5420: Restore ability to consume using BURLs specifying default exchange.", 
   "* Java Broker: Changed AbstractVirtualHost so that createExchange throws ExchangeExistException before checking for a reserved exchnage name.  The effect will be that the Java Broker will again accept active declaration of the built in exchanges (amq.*, qpid.* and default).", 
   "* Java Broker: Changed the 0-8..0-9-1 ExchangeBoundHandler so that a null exchnage name is treated to mean the default exchange.  This matches the behaviour of ServerSessionDelegate#exchangeBound() on the 0-10 path.  This allows the Java client to query bindings on the default exchange.", 
   "* Client: Changed AbstractAMQMessageDelegate.java so that 0-10 knows the type of the default exchange when populating the JMSDestination on received messages.", 
   "* Client: Introduced system property qpid.bind_queues system property so that the exchange/queue bind side effect can be suppressed on consumer creation.  Like qid.declare_exchanges and declare_queues, this system propery has effect when using BURLs. Might be useful if using a new client with older broker.", 
   "* Added new system tests."
  ], 
  "revision_id": "1556292"
 }, 
 {
  "author": "tschoening", 
  "date": "2014-01-07T17:54:38.357009Z", 
  "msg": [
   "guessed issue types from messages"
  ], 
  "revision_id": "1556291"
 }, 
 {
  "author": "kbrand", 
  "date": "2014-01-07T17:52:34.909219Z", 
  "msg": [
   "Backport r1544784 from trunk:", 
   "Remove SSLPKCS7CertificateFile support:", 
   "- was never documented, so very unlikely that it was ever used", 
   "- adds complexity without apparent benefit; PKCS#7 files can", 
   "be trivially converted to a file for use with SSLCertificateChainFile", 
   "(concatenated X509 CERTIFICATE chunks, openssl pkcs7 -print_certs...)", 
   "- only supports PKCS7 files with PEM encoding, i.e. relies on a", 
   "non-standardized PEM header (cf. RFC 2315 and draft-josefsson-pkix-textual)", 
   "- issues pointed out in http://mail-archives.apache.org/mod_mbox/httpd-dev/200607.mbox/%3C20060723093125.GA19423@redhat.com%3E", 
   "were never fully addressed (cf. r424707 and r424735)", 
   "- has never worked in vhost context due to a cfgMergeString", 
   "call missing from modssl_ctx_cfg_merge", 
   "Proposed by: kbrand", 
   "Reviewed by: covener, druggeri"
  ], 
  "revision_id": "1556290"
 }, 
 {
  "author": "alg", 
  "date": "2014-01-07T17:50:46.811693Z", 
  "msg": [
   "Creating a branch for working on writer FlyFrame FillAttributes"
  ], 
  "revision_id": "1556289"
 }
]