[
 {
  "author": "lucastheisen", 
  "date": "2014-01-24T22:03:10.747628Z", 
  "msg": [
   "DIRSERVER-1948: NPE in AuthenticationInterceptor when password policy is in place and user does not have a pwdChangedTime"
  ], 
  "revision_id": "1561208"
 }, 
 {
  "author": "vinodkv", 
  "date": "2014-01-24T22:02:22.889817Z", 
  "msg": [
   "YARN-321. Forwarding YARN-321 branch to latest trunk."
  ], 
  "revision_id": "1561207"
 }, 
 {
  "author": "aconway", 
  "date": "2014-01-24T21:54:59.759160Z", 
  "msg": [
   "QPID-5513: HA backup fails if number of replicated queues exceeds number of channels.", 
   "The problem:", 
   "- create cluster of 2 brokers.", 
   "- create more than 32768 queues (exceeds number of channels on a connection)", 
   "- backup exits with critical error but", 
   "- client creating queues receives no error, primary continues with unreplicated queue.", 
   "The solution: Primary raises an error to the client if it attempts to create", 
   "queues in excess of the channel limit. The queue is not created on primary", 
   "or backup, primary and backup continue as normal.", 
   "In addition: raised the channel limit from 32k to 64k. There was no reason for", 
   "the smaller limit. See discussion: http://qpid.2158936.n2.nabble.com/CHANNEL-MAX-and-CHANNEL-HIGH-BIT-question-tp7603121p7603138.html", 
   "New unit test to reproduce the issue, must create > 64k queues.", 
   "Other minor improvements:", 
   "- brokertest framework doesn't override --log options in the arguments.", 
   "- increased default heartbeat in test framework for tests that have busy brokers."
  ], 
  "revision_id": "1561206"
 }, 
 {
  "author": "rfscholte", 
  "date": "2014-01-24T21:53:37.101974Z", 
  "msg": [
   "Use strategy of AbstractSink.unifyEOLs to unify EOLs. Small bugfix: also respect MacOS9 EOLs"
  ], 
  "revision_id": "1561205"
 }, 
 {
  "author": "lucastheisen", 
  "date": "2014-01-24T21:48:03.460695Z", 
  "msg": [
   "DIRAPI-169: Formalize the contract of PasswordPolicyResponse by stating that -1 is returned if no value is set."
  ], 
  "revision_id": "1561204"
 }
]