[
 {
  "author": "breser", 
  "date": "2014-02-12T04:41:57.166676Z", 
  "msg": [
   "backport.pl: Be more flexible about indentation.", 
   "The initial indentation before the * will determine how deep", 
   "everything else needs to be.  So if for instance someone puts", 
   "the * in the first column, it'll work as long as the relative", 
   "indents are all correct.", 
   "* tools/dist/backport.pl", 
   "(parse_entry): calculate the relative indentation and strip it.", 
   "(backport_main): asterisk can be in any position with or without", 
   "leading spaces to start a backport entry."
  ], 
  "revision_id": "1567523"
 }, 
 {
  "author": "larsh", 
  "date": "2014-02-12T04:41:47.882867Z", 
  "msg": [
   "HBASE-10505 Import.filterKv does not call Filter.filterRowKey."
  ], 
  "revision_id": "1567522"
 }, 
 {
  "author": "rhys", 
  "date": "2014-02-12T04:34:39.984858Z", 
  "msg": [
   "LOG4CXX-337 Attempt to get threadcxx.cpp compiling", 
   "r1566630 broke this compilation unit with mismatched", 
   "preprocessor directives and making Thread::join()", 
   "disappear.  I suspect the problem was a patch against", 
   "an older version.  This is an attempt to get the", 
   "file building again by comparing r1566629 against", 
   "the patch attached to LOG4CXX-337."
  ], 
  "revision_id": "1567521"
 }, 
 {
  "author": "svn-role", 
  "date": "2014-02-12T04:04:53.550365Z", 
  "msg": [
   "Merge r1543187 from trunk:", 
   "* r1543187", 
   "Fix SWIG bindings not building in release mode with out of tree builds.", 
   "Justification:", 
   "Build systems should work.  This makes Branko cranky every release.", 
   "Notes: Test by using ./autogen.sh --release, then do an out of tree build", 
   "without this fix swig-py and swig-rb fail immediately.", 
   "Votes:", 
   "+1: breser, brane, rhuijben"
  ], 
  "revision_id": "1567520"
 }, 
 {
  "author": "breser", 
  "date": "2014-02-12T04:03:51.778240Z", 
  "msg": [
   "backport.pl: Avoid problems like Bert fixed in r1567239.", 
   "That problem was created by a revision not being prefixed by r.  So don't", 
   "require that.", 
   "Additional unreliability existed since the code used the r prefix to decide", 
   "if a line was a revision line and the revision list can wrap to the next line.", 
   "However, the logsummary line is difficult to distinguish from a wrapped revision", 
   "list.  So now we only treat a line as a revision list if all characters are used", 
   "up in calculating the revision list.  This also means if the first line used as", 
   "a revision list doesn't match the pattern then no revisions will be matched and", 
   "the line will error about having neither revisions or branch.  There is still", 
   "one ambiguous case.  If a revision list wraps and has some extra garbage in it,", 
   "it'll be treated as the log summary.  Can't really fix that without changing", 
   "the format.", 
   "* tools/dist/backport.pl", 
   "(parse_entry): Revision lines match all characters following the repeating", 
   "pattern we're using.  The r prefix is optional."
  ], 
  "revision_id": "1567519"
 }
]