[
 {
  "author": "kasha", 
  "date": "2014-02-21T21:20:59.690956Z", 
  "msg": [
   "YARN-1470. Add audience annotations to MiniYARNCluster. (Anubhav Dhoot via kasha)"
  ], 
  "revision_id": "1570708"
 }, 
 {
  "author": "mreutegg", 
  "date": "2014-02-21T21:17:48.021063Z", 
  "msg": [
   "OAK-1260: Using multiple cluster nodes can corrupt the data", 
   "- make sure initial content is visible to subsequently started cluster nodes"
  ], 
  "revision_id": "1570707"
 }, 
 {
  "author": "breser", 
  "date": "2014-02-21T21:13:28.347788Z", 
  "msg": [
   "Remove the overthought svn_fs_base__key_compare() function.", 
   "The old implmenetation ran strlen() on both strings, which in my opinion is a", 
   "really dubious optimization.  I kinda doubt that walking both strings twice in", 
   "cases where the key is the same size is optimally better than saving the", 
   "character comparisons when they are different sizes.  I'd bet that we're", 
   "comparing identically sized strings a lot of the time.  Forcing -1, 0, or 1", 
   "as the only return values seems entirely pointless to me since the only thing", 
   "we ever do is test for 0 when calling this.", 
   "This incidentally fixes a compiler warning since we we were putting the return", 
   "of strlen into an int which isn't necessarily the same size as the strlen().", 
   "* subversion/libsvn_fs_base/key-gen.h", 
   "(svn_fs_base__key_compare): Convert the function to a macro to strcmp and", 
   "update the documentation to not promise things strcmp() doesn't promise.", 
   "* subversion/libsvn_fs_base/key-gen.c", 
   "(svn_fs_base__key_compare): Delete."
  ], 
  "revision_id": "1570706"
 }, 
 {
  "author": "thejas", 
  "date": "2014-02-21T21:01:04.497327Z", 
  "msg": [
   "HIVE-6464 : Test configuration: reduce the duration for which lock attempts are retried (Thejas Nair, reviewed by Navis)"
  ], 
  "revision_id": "1570705"
 }, 
 {
  "author": "arp", 
  "date": "2014-02-21T20:54:53.036588Z", 
  "msg": [
   "HADOOP-10278. Merging r1570703 from trunk to branch-2"
  ], 
  "revision_id": "1570704"
 }
]