[
 {
  "author": "breser", 
  "date": "2014-02-28T22:18:07.919400Z", 
  "msg": [
   "Followup to r1573096, add some comments I should have added.", 
   "* subversion/libsvn_subr/sysinfo.c", 
   "(write_to_cfmutabledata): Document.", 
   "(system_version_plist): Explain why we're copying data around."
  ], 
  "revision_id": "1573098"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2014-02-28T22:12:46.006684Z", 
  "msg": [
   "Change in DefaultParameterDescriptor implementation: replace the minValue, maxValue and unit properties by a Range property.", 
   "The Range objects contain information about whether the bounds are inclusive or exclusive.", 
   "This change also simplify a little bit the DefaultParameterDescriptor implementation."
  ], 
  "revision_id": "1573097"
 }, 
 {
  "author": "breser", 
  "date": "2014-02-28T22:11:00.099359Z", 
  "msg": [
   "Stop using a deprecated (as of OS X 10.9) function to get OS X version.", 
   "CFURLCreateDataAndPropertiesFromResource() is now listed as being deprecated.", 
   "It still works but this code goes to a lot of effort to use OS X's", 
   "CoreFoundation framework to read the plist when we have our own functions", 
   "for reading files.  I think it's much better for our maintenance purposes to", 
   "use our functions for as much as we can.", 
   "* subversion/libsvn_subr/sysinfo.c", 
   "(write_to_cfmutabledata): svn_write_fn_t implementation that feeds data into", 
   "a CFMutableDataRef (Core Foundation's version of streams).", 
   "(system_version_plist): Use our stream interface to read the plist files", 
   "and wire it up to a stream that feeds the data to a CFMutableDataRef", 
   "so we can still let OS X's property list code do the parsing for us.", 
   "Also fix a small comment typo."
  ], 
  "revision_id": "1573096"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2014-02-28T22:10:14.794672Z", 
  "msg": [
   "Initial draft of support classes for DefaultFeature."
  ], 
  "revision_id": "1573095"
 }, 
 {
  "author": "tfischer", 
  "date": "2014-02-28T22:02:39.702437Z", 
  "msg": [
   "TORQUE-310 add processors to organize imports and to convert windows linefeeds to unix linefeeds."
  ], 
  "revision_id": "1573094"
 }
]