[
 {
  "author": "mdrob", 
  "date": "2014-03-05T16:44:03.840787Z", 
  "msg": [
   "Adding Bylaws Draft for Voting."
  ], 
  "revision_id": "1574568"
 }, 
 {
  "author": "simonetripodi", 
  "date": "2014-03-05T16:40:41.991636Z", 
  "msg": [
   "Oltu main site deployment"
  ], 
  "revision_id": "1574567"
 }, 
 {
  "author": "rhillegas", 
  "date": "2014-03-05T16:38:40.389637Z", 
  "msg": [
   "DERBY-3155: Add privilege checks for the UPDATE actions of MERGE statements; commit derby-3155-34-ab-updatePrivs.diff."
  ], 
  "revision_id": "1574566"
 }, 
 {
  "author": "mamta", 
  "date": "2014-03-05T16:31:07.932491Z", 
  "msg": [
   "DERBY-6025(Wrong results with IN lists and indexes in territory based collation)", 
   "Basically, when all the elements in the inlist are not all constants, then we can not figure out at compile time the minimum and maximum values in the list. Mimimum and maximum values in the in list are required to be passed as start and stop keys if compiler decides to use an index for the inlist predicate. Since these can not be determined at compile time for non constant elements, InListOperatorNoce.generateStartStopKey ends up generating code which will run at execution time of the query and at that time, we will compare the values of the individual elements in the in list to determine the minimum and maximum values. The porblem is that currently, Derby does not pass the collation information of the left operand of the inlist to execution time and because of that, we end up doing English comparison of the values rather than terriroty based comparison in case of territory based database. The fix is to have InListOperatorNoce.generateStartStopKey generate code to pass collation information also. This way, we will do collation based comparison of in list elements in case of territory based database. I have run the reproducible case from jira against my changes and the query now returns correct row. I have run derbyall against the changes and it finished with no errors. The junit suite is running into following 3 failures but I have verified that those 3 failures happen without my changes too. So I will assume that these failures are not caused by my changes. The failures are copied below.", 
   "There were 3 failures:", 
   "1) testStartNetworkServerLogMessageOnDualStart(org.apache.derbyTesting.functionTests.tests.derbynet.DerbyNetAutoStartTest)junit.framework.AssertionFailedError: did not find the expected string: An exception was thrown during network server startup within the maximum wait time 240000", 
   "at org.apache.derbyTesting.functionTests.tests.derbynet.DerbyNetAutoStartTest.testStartNetworkServerLogMessageOnDualStart(DerbyNetAutoStartTest.java:272)", 
   "2) test_5391(org.apache.derbyTesting.functionTests.tests.lang.SysDiagVTIMappingTest)junit.framework.AssertionFailedError", 
   "at org.apache.derbyTesting.functionTests.tests.lang.SysDiagVTIMappingTest.vetTimestamp(SysDiagVTIMappingTest.java:933)", 
   "3) test_5391(org.apache.derbyTesting.functionTests.tests.lang.SysDiagVTIMappingTest)junit.framework.AssertionFailedError", 
   "at org.apache.derbyTesting.functionTests.tests.lang.SysDiagVTIMappingTest.vetTimestamp(SysDiagVTIMappingTest.java:933)"
  ], 
  "revision_id": "1574565"
 }, 
 {
  "author": "rgodfrey", 
  "date": "2014-03-05T16:29:48.847359Z", 
  "msg": [
   "NO-JIRA : formatting of license above package statement"
  ], 
  "revision_id": "1574564"
 }
]