[
 {
  "author": "rajeshbabu", 
  "date": "2014-03-05T18:05:07.210570Z", 
  "msg": [
   "HBASE-10669 [hbck tool] Usage is wrong for hbck tool for -sidelineCorruptHfiles option(Deepak Sharma)"
  ], 
  "revision_id": "1574593"
 }, 
 {
  "author": "arkurth", 
  "date": "2014-03-05T18:03:10.883489Z", 
  "msg": [
   "VCL-734", 
   "Updated vcld to not check for cluster requests and to not update the request state to pending. The data returned from get_management_node_requests only includes reservations assigned to the running management node. Cluster reservations assigned to other MN's isn't included. Moved logic to State.pm.", 
   "Updated State.pm::initialize:", 
   "-Call reservation_failed if any of the supporting objects can't be created", 
   "-Added additional checks before a request is set to pending to detect if it was deleted or if any cluster child reservations have already failed.", 
   "Added State.pm::does_loadstate_exist_any_reservation. It is used to detect if any other cluster reservations have failed.", 
   "Moved steps which were in State.pm::DESTROY to State.pm::state_exit and added a call to state_exit in DESTROY. This ensures the steps always occur. Added a flag to state_exit so it is only run once. Added failed cluster reservation check. Added check before request state is updated to determine if it was updated by another process.", 
   "Added temporary condition to inuse.pm to skip all connection checks for cluster requests unless the previous state was reserved.", 
   "Added get_parent_reservation_id to DataStructure.pm"
  ], 
  "revision_id": "1574592"
 }, 
 {
  "author": "rhs", 
  "date": "2014-03-05T17:55:11.801206Z", 
  "msg": [
   "PROTON-527: added events API to proton-j"
  ], 
  "revision_id": "1574591"
 }, 
 {
  "author": "markrmiller", 
  "date": "2014-03-05T17:50:57.218039Z", 
  "msg": [
   "SOLR-5813: tests for \"\" or null collection name - should default to core name."
  ], 
  "revision_id": "1574590"
 }, 
 {
  "author": "markrmiller", 
  "date": "2014-03-05T17:48:27.599269Z", 
  "msg": [
   "SOLR-5813: tests for \"\" or null collection name - should default to core name."
  ], 
  "revision_id": "1574589"
 }
]