[
 {
  "author": "oheger", 
  "date": "2014-03-09T21:01:55.317495Z", 
  "msg": [
   "NodeModel no longer defines the getRootNode() method.", 
   "The root node now has to be obtained from the NodeHandler. This is necessary at", 
   "least for implementations like InMemoryNodeModel which use immutable structures", 
   "that can be replaced by new instances. A NodeHandler is a kind of snapshot of", 
   "such a structure at a certain point in time. If the root node is obtained in a", 
   "different method call, it may no longer be compatible with the snapshot used by", 
   "the node handler."
  ], 
  "revision_id": "1575763"
 }, 
 {
  "author": "oheger", 
  "date": "2014-03-09T21:01:04.811762Z", 
  "msg": [
   "Added method getRootNode() to NodeHandler interface.", 
   "A node handler is always associated with a specific nodes structure. If the", 
   "handler and the root node are queried from different objects, there is a", 
   "potential race condition that the nodes structure has been updated in the mean", 
   "time."
  ], 
  "revision_id": "1575762"
 }, 
 {
  "author": "oheger", 
  "date": "2014-03-09T21:00:32.266491Z", 
  "msg": [
   "Renamed TreeData.getRoot() to getRootNode().", 
   "This is in sync with other classes."
  ], 
  "revision_id": "1575761"
 }, 
 {
  "author": "oheger", 
  "date": "2014-03-09T20:59:39.187695Z", 
  "msg": [
   "InMemoryNodeModel no longer implements the NodeHandler interface.", 
   "This caused a number of adaptations in other classes."
  ], 
  "revision_id": "1575760"
 }, 
 {
  "author": "oheger", 
  "date": "2014-03-09T20:58:23.490285Z", 
  "msg": [
   "TreeData now implements the NodeHandler interface.", 
   "The current solution that InMemoryNodeModel implements NodeHandler is", 
   "problematic because of the implementation of the getParent() method: there can", 
   "be race conditions if the model was updated and now uses a different TreeData", 
   "instance. Therefore, all this functionality has to be kept in a single place:", 
   "in TreeData."
  ], 
  "revision_id": "1575759"
 }
]