[
 {
  "author": "angela", 
  "date": "2014-03-07T14:42:21.475387Z", 
  "msg": [
   "minor improvement"
  ], 
  "revision_id": "1575273"
 }, 
 {
  "author": "angela", 
  "date": "2014-03-07T14:40:05.582887Z", 
  "msg": [
   "OAK-1261: WIP", 
   "- move global @Ignore to individual tests (sync not yet implemented)", 
   "- rename ldaploginwithrepo test", 
   "- add test for GuestCredentials login", 
   "- add test for config with TokenLm, DefaultLm, LDAPLm", 
   "- add test for config with GuestLm, TokenLm, DefaultLm, LDAPLm"
  ], 
  "revision_id": "1575272"
 }, 
 {
  "author": "angela", 
  "date": "2014-03-07T14:36:55.305102Z", 
  "msg": [
   "OAK-1261: WIP", 
   "- remove duplicate options map which caused login failure", 
   "- add test for Null-Login (must fail)"
  ], 
  "revision_id": "1575271"
 }, 
 {
  "author": "rhuijben", 
  "date": "2014-03-07T14:31:50.013401Z", 
  "msg": [
   "Resolve a hard to find regression introduced in Subversion 1.8.8 proplist", 
   "handling of inherited properties when using absolute paths.", 
   "* subversion/libsvn_client/prop_commands.c", 
   "(recursive_proplist_receiver): When listing paths via an absolute path,", 
   "report the inherited properties on the root instead of on the first", 
   "reported path. (b->anchor is NULL when the original path is absolute)", 
   "Found by: brane"
  ], 
  "revision_id": "1575270"
 }, 
 {
  "author": "jawi", 
  "date": "2014-03-07T14:30:09.987327Z", 
  "msg": [
   "ACE-445 - allow launcher to set system properties:", 
   "- simplified the launcher in the handling and setting of configuration properties:", 
   "* (almost) all configuration properties are now passed to the OSGi framework as", 
   "framework property, except for properties starting with 'system.', which are", 
   "set as system property;", 
   "* the 'framework.' prefix is deprecated, as it is no longer needed, but the", 
   "launcher still will strip off this prefix if supplied;", 
   "* agent configuration properties are now regarded as framework properties, and", 
   "the agent now uses BundleContext#getProperty() to obtain its configuration", 
   "options;", 
   "* updated and clarified the help text of the launcher.", 
   "- allow configuration options to be set as *normal* arguments of the launcher", 
   "itself, as well as system property, so, '-Dfoo=bar' and 'foo=bar' both will", 
   "work;", 
   "- simplified the semantics of the agent with respect to its configuration", 
   "handling: system properties are now regarded as default values that can be", 
   "superseded by explicitly configured values (through framework properties, or", 
   "explicit configuration). The '.retain' suffix for system properties to always", 
   "supersede framework properties is removed, as it is quite difficult to explain", 
   "and understand how they should work."
  ], 
  "revision_id": "1575269"
 }
]