[
 {
  "author": "marcus", 
  "date": "2014-03-10T16:05:19.964957Z", 
  "msg": [
   "Changed link for verifing hash values and checksum files"
  ], 
  "revision_id": "1575983"
 }, 
 {
  "author": "tedyu", 
  "date": "2014-03-10T16:04:17.419568Z", 
  "msg": [
   "HBASE-10712 Backport HBASE-8304 to 0.94 and 0.96 (Haosdent)"
  ], 
  "revision_id": "1575982"
 }, 
 {
  "author": "marcus", 
  "date": "2014-03-10T16:04:14.791463Z", 
  "msg": [
   "Changed link for verifing hash values and checksum files"
  ], 
  "revision_id": "1575981"
 }, 
 {
  "author": "dennisl", 
  "date": "2014-03-10T16:03:28.194334Z", 
  "msg": [
   "[MPMD-166] Plugin fails when switching from 2.7.1 to 3.0.1", 
   "- Adjusted the paths to bundled rule sets", 
   "- Add a note for people migrating to Maven PMD Plugin 3.0", 
   "- Make the link to the PMD rules index versioned, because PMD now have versioned documentation"
  ], 
  "revision_id": "1575980"
 }, 
 {
  "author": "julianfoad", 
  "date": "2014-03-10T16:03:01.608691Z", 
  "msg": [
   "Remove a redundant empty write, because redundant code is annoying to read.", 
   "It sent me on a wild goose chase through the code to discover what it's for,", 
   "only to find in the end it's for nothing. The API we are providing does not", 
   "promise it, the called APIs do not require it nor guarantee to do anything", 
   "with it, and the 'svnadmin load' code does not need it. It originated as an", 
   "innocent-looking single line in r842201 and then grew to its current form in", 
   "r842708, all in the pre-1.0 era.", 
   "This code was only reached for a fulltext, never for a delta.", 
   "(svn_txdelta_parse_svndiff() treats a close after no data bytes were", 
   "received as an \"early\" close, and so would return an error on closing the", 
   "stream if we ever processed a zero-length delta block in this function.)", 
   "An API user would be able to see this change but should not be relying on it.", 
   "* subversion/libsvn_repos/load.c", 
   "(parse_text_block): Remove an empty write to the stream in the case of an", 
   "empty content block."
  ], 
  "revision_id": "1575979"
 }
]