[
 {
  "author": "thejas", 
  "date": "2014-03-12T11:30:35.234838Z", 
  "msg": [
   "HIVE-6512 : HiveServer2 ThriftCLIServiceTest#testDoAs is an invalid test (Vaibhav Gumashta via Thejas Nair)"
  ], 
  "revision_id": "1576698"
 }, 
 {
  "author": "kwall", 
  "date": "2014-03-12T11:28:49.734653Z", 
  "msg": [
   "QPID-5410: [Java Broker/BDB]. Introduce a thin facade (EnvironmentFacade) between the BDBMessage and BDB JE's Environment/ReplicatedEnvironment. The motivation behind this facade is principally HA; there are a number of cases where JE requires the ReplicatedEnvironment is recreated. The facade layer allows for this to be done transparently from the upper tiers (the BDBMessageStore). The facade has two implementations StandardFacade used in the non-HA use case, and ReplicatedEnvironmentFacade in the HA case.", 
   "Key changes:", 
   "* BDBHAVirtualHost is now responsible for the creation of ReplicatedEnvironmentFacade", 
   "* BDBMessageStore reverts to a single implementation without knowledge of HA.", 
   "* BDBMessageStore now interacts with JE via the facade.", 
   "* BDBHAMessageStoreManagerMBean interrogates the facade", 
   "* ReplicatedEnvironmentFacade monitors the group for changes in state (nodes becoming uncontactable etc), if such a state change is detected, the DatabasePinger", 
   "fires a single transaction to determine if quorum still exists.  If quorum does not exist, the environment is restarted, thus transition the environment into", 
   "the UNKNOWN state."
  ], 
  "revision_id": "1576697"
 }, 
 {
  "author": "reschke", 
  "date": "2014-03-12T11:25:47.927794Z", 
  "msg": [
   "fix svn:eol-style"
  ], 
  "revision_id": "1576696"
 }, 
 {
  "author": "nkeywal", 
  "date": "2014-03-12T11:18:27.153460Z", 
  "msg": [
   "HBASE-10720 rpcClient: Wrong log level when closing the connection"
  ], 
  "revision_id": "1576695"
 }, 
 {
  "author": "nkeywal", 
  "date": "2014-03-12T11:17:43.641560Z", 
  "msg": [
   "HBASE-10703 TestAsyncProcess does not pass on HBASE-10070"
  ], 
  "revision_id": "1576694"
 }
]