[
 {
  "author": "jing9", 
  "date": "2014-03-20T21:04:30.139922Z", 
  "msg": [
   "HDFS-6131. Merge change r1579736 from branch-2."
  ], 
  "revision_id": "1579738"
 }, 
 {
  "author": "dag", 
  "date": "2014-03-20T21:03:44.854579Z", 
  "msg": [
   "DERBY-6374 Bulk insert of data with nullable UNIQUE constraint fails to detect duplicates", 
   "Backported to 10.10, had to do major surgery since the original fix", 
   "was part of a DERBY-532 patch."
  ], 
  "revision_id": "1579737"
 }, 
 {
  "author": "jing9", 
  "date": "2014-03-20T21:03:42.587162Z", 
  "msg": [
   "HDFS-6131. Move HDFSHighAvailabilityWithNFS.apt.vm and HDFSHighAvailabilityWithQJM.apt.vm from Yarn to HDFS. Contributed by Jing Zhao."
  ], 
  "revision_id": "1579736"
 }, 
 {
  "author": "schultz", 
  "date": "2014-03-20T21:03:19.715274Z", 
  "msg": [
   "Votes"
  ], 
  "revision_id": "1579735"
 }, 
 {
  "author": "chug", 
  "date": "2014-03-20T20:58:51.623645Z", 
  "msg": [
   "QPID-5631: Adjust for changes to Qpid CMake detection of Proton.", 
   "Buried deep in cpp\\bindings\\qpid\\dotnet is a script configure-windows.ps1. This script originally came into being to support the .NET binding, which is a .NET project that has no support from CMake. The script gathers the facts of where cmake runs and where boost comes from and embeds the environment into launch scripts used to start the .NET binding solution(s). Then the .NET solution can link naturally to the rest of the cmake project environment.", 
   "Before this commit the script was very liberal about where one could root a build (run cmake). This patch forces some order onto the build and install directories to ease integration with proton. I use a couple of conventions and it makes life much easier.", 
   "1. Map some drives.", 
   "Drive P: maps to the root of a proton checkout", 
   "Drive Q: maps to the root of a qpid checkout", 
   "Strictly speaking this is not necessary and if you use this scheme then you must be careful about the drive mappings. If you get them wrong then your builds will be confused.", 
   "2. Use fixed names for the studio/platform builds and installs.", 
   "Builds go to:", 
   "P:\\build_2008_x86   Q:\\build_2008_x86", 
   "P:\\build_2008_x64   Q:\\build_2008_x64", 
   "P:\\build_2010_x86   Q:\\build_2010_x86", 
   "P:\\build_2010_x64   Q:\\build_2010_x64", 
   "Installs go to:", 
   "Q:\\install_2008_x86", 
   "Q:\\install_2008_x64", 
   "Q:\\install_2010_x86", 
   "Q:\\install_2010_x64", 
   "That is, cmake for a VS2010 32-bit build is run in P:\\build_2010_x86 and Q:\\build_2010_x86", 
   "But both of these builds use -DCMAKE_INSTALL_PREFIX=Q:\\install_2010_x86 to install into the same place.", 
   "3. To build qpid with proton support: build and install proton first and then build and install qpid.", 
   "To build qpid with no proton support: just build and optionally install qpid.", 
   "Other fixes to this script are:", 
   "* Adds --help option", 
   "* It does only one studio/platform at a time. It doesn't mix 32- and 64-bit builds together.", 
   "* It is callable from the command line:", 
   "> cd cpp\\bindings\\qpid\\dotnet", 
   "> powershell -ExecutionPolicy unrestricted .\\configure-windows.ps1 2010-x86 c:\\boost-win-1.47-32bit-vs2010", 
   "It will create the canonical build directory and run cmake in it.", 
   "* A new batch file is emitted that has the exact cmake command used.", 
   "You can use this to rerun cmake without rerunning any powershell."
  ], 
  "revision_id": "1579734"
 }
]