[
 {
  "author": "gdamour", 
  "date": "2005-03-22T10:03:00.640177Z", 
  "msg": [
   "Allow remote class loading via RMI annotation for deployment. This includes:", 
   "o the definition of a ClassLoaderServer used to export and unexport", 
   "ClassLoaderInfo. This later is a simple wrapper around ClassLoader.", 
   "Provide an implementation of ClassLoaderServer using HTTP as the communication", 
   "protocol.", 
   "o define ConfigurationClassLoader, a specific ClassLoader for Configuration,", 
   "which adds two new attributes on top of the URLClassLoader type: ID, which is", 
   "the ID of the defining Configuration; and classLoaderServerURLs, which is", 
   "an array of URLs defining the locations from which the Configuration classes", 
   "are services by a ClassLoaderServer.", 
   "o impact RMIClassLoaderSpiImpl such that it uses the classLoaderServerURLs", 
   "defined by a ConfigurationClassLoader to provide the codebase of serialized", 
   "classes.", 
   "o add the org/apache/geronimo/RemoteClassLoadingDeployer configuration, which", 
   "exports the ConfigurationClassLoader of the org/apache/geronimo/Server and", 
   "org/apache/geronimo/RuntimeDeployer configurations.", 
   "o add a policy file, which can be used along with deployer.jar to enable", 
   "remote class loading.", 
   "This policy file is \"opened\" and needs to be updated to reflect the", 
   "execution environment."
  ], 
  "revision_id": "158589"
 }, 
 {
  "author": "erodriguez", 
  "date": "2005-03-22T09:43:51.896342Z", 
  "msg": [
   "o  Updated AS and TGS services to use new command pattern-based backing store operations packages.", 
   "o  Added a guard clause to return a Kerberos null key error instead of returning a decrypted field integrity check failure error."
  ], 
  "revision_id": "158588"
 }, 
 {
  "author": "tripod", 
  "date": "2005-03-22T09:39:21.368842Z", 
  "msg": [
   "- adapting first steps login"
  ], 
  "revision_id": "158587"
 }, 
 {
  "author": "trustin", 
  "date": "2005-03-22T09:39:07.027294Z", 
  "msg": [
   "* Added InterceptorContext which gives access to various internal properties of service.", 
   "* Modified Interceptor.init() to have InterceptorContext passed to interceptors.", 
   "* Updated all interceptor implementations to have default constructors and configure themselves in init().", 
   "* InterceptorChain is now Interceptor, and thus InterceptorChains can nest.", 
   "* Added EnvKeys.INTERCEPTOR property to let users override the default interceptor chain."
  ], 
  "revision_id": "158586"
 }, 
 {
  "author": "erodriguez", 
  "date": "2005-03-22T09:32:41.091370Z", 
  "msg": [
   "Refactored the Kerberos store operations to use the Command pattern."
  ], 
  "revision_id": "158585"
 }
]