[
 {
  "author": "arp", 
  "date": "2014-04-24T18:04:45.136579Z", 
  "msg": [
   "HDFS-6273. Add file missed in previous checkin."
  ], 
  "revision_id": "1589808"
 }, 
 {
  "author": "aconway", 
  "date": "2014-04-24T17:54:05.379749Z", 
  "msg": [
   "QPID-5719: HA becomes unresponsive once any of the brokers are SIGSTOPed", 
   "- Added timeout to qpid-ha.", 
   "- qpidd init script pings broker to verify it is not hung.", 
   "- updated documentation in qpid/doc/book/src/cpp-broker/Active-Passive-Cluster.xml.", 
   "The new results for the cases mentioned in the bug:", 
   "a] stopped ALL brokers: rgmanager restarts the entire cluster but data is lost.", 
   "Equivalent to killing all the  brokers at once. This does not affect quorum because", 
   "only qpidd services are affected, not other services managed by cman.", 
   "b] stopped the primary: rgmanager restarts the primary after a timeout and promotes one of the backups.", 
   "c] stopped a backup: rgmanager restarts the backups after a timeout.", 
   "Clients that are actively sending messages may see a delay while backup is restarted.", 
   "Note you need to set link-heartbeat-interval in qpidd.conf. The default is very", 
   "high (120 seconds), it should be set lower to see recovery from sigstop in a", 
   "reasonable time.", 
   "See the updated documentation in qpid/doc/book/src/cpp-broker/Active-Passive-Cluster.xml."
  ], 
  "revision_id": "1589807"
 }, 
 {
  "author": "nick", 
  "date": "2014-04-24T17:44:10.182188Z", 
  "msg": [
   "More NPOIFS write testing, and fix a problem with writing xbat details out"
  ], 
  "revision_id": "1589806"
 }, 
 {
  "author": "arp", 
  "date": "2014-04-24T17:41:05.867463Z", 
  "msg": [
   "HDFS-6273: Merging r1589803 from trunk to branch-2."
  ], 
  "revision_id": "1589805"
 }, 
 {
  "author": "kmcgrail", 
  "date": "2014-04-24T17:40:53.957513Z", 
  "msg": [
   "added get_names_of_tests_hit_with_scores_hash, get_names_of_tests_hit_with_scores functions to PMS along with trivial fixing of triggered being misspelled."
  ], 
  "revision_id": "1589804"
 }
]