[
 {
  "author": "lbernardo", 
  "date": "2014-05-07T22:53:35.722975Z", 
  "msg": [
   "replaced fontbox jar by new release (1.8.5) jar"
  ], 
  "revision_id": "1593153"
 }, 
 {
  "author": "rmuir", 
  "date": "2014-05-07T22:44:18.101789Z", 
  "msg": [
   "LUCENE-5654: Fix close methods that would suppress OOME or similar"
  ], 
  "revision_id": "1593152"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2014-05-07T22:37:25.901381Z", 
  "msg": [
   "Removal of the PropertyList class, since the approach allowing a [0 ... n] cardinality for Attribute instance has been abandoned", 
   "(see comment in commit 1593149 for more details). The case of PropertySingleton still needs to be re-evaluated."
  ], 
  "revision_id": "1593151"
 }, 
 {
  "author": "smohanty", 
  "date": "2014-05-07T22:33:42.088546Z", 
  "msg": [
   "SLIDER 32. slider-agent.tar.gz is not getting included in the slider package"
  ], 
  "revision_id": "1593150"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2014-05-07T22:31:28.445727Z", 
  "msg": [
   "Attempt to simplify the feature model. The ISO 19109 specification said that attributes may have a [0 ... n] cardinality,", 
   "but does not said how multi-occurrences should be represented. There is 2 ways to represent an occurrence of n attributes:", 
   "1) As n instance of Attribute, where each Attribute contains one value.", 
   "2) As only once instance of Attribute, which contains n value (e.g. as a collection).", 
   "The old GeoAPI model in the org.opengis.feature package was implementing approach 1, so our previous org.apache.sis.feature", 
   "model was following the same path.  However after seeing where this approach was leading us (more complexity in the form of", 
   "special PropertyList and PropertySingleton implementations for keeping decent performances) and after discussion with users", 
   "of previous model, we feel that approach 2 would be both simpler and a better fit for users of Features.", 
   "In this commit, we change the cardinality of 'DefaultFeature.getProperty(String)' from [0 ... n] to [0 ... 1].", 
   "A future commit will need to change the cardinality of 'DefaultAttribute.getValue()' from [0 ... 1] to [0 ... n],", 
   "with a convenience method for the very common case where we know that n = 1."
  ], 
  "revision_id": "1593149"
 }
]