[
 {
  "author": "desruisseaux", 
  "date": "2014-05-11T20:44:20.853577Z", 
  "msg": [
   "Added basic tests for Feature Associations."
  ], 
  "revision_id": "1593858"
 }, 
 {
  "author": "covener", 
  "date": "2014-05-11T20:41:45.097504Z", 
  "msg": [
   "Extend the socket callbacks in event to allow a timeout on the I/O callback.", 
   "When a socket callback has a timeout, an associated timer event is used to", 
   "remove the sockets from the pollset and call a timeout function.", 
   "* This includes a noteworthy change to the main event loop. Previously,", 
   "we would call epoll, then process the timer events, then iterate through the", 
   "poll results. After this patch, the timer events are processed before the poll()", 
   "a _non-queued_ action can change the pollset conents (a users timed callback", 
   "function conversely could easily sit in a queue while the main thread continues", 
   "down into epoll)", 
   "* timer events can now have sockets associated with them, those sockets are", 
   "removed from the pollset when the timer event fires w/o a queue to the worker.", 
   "* timer events now have a canceled flag that can be toggled without locking", 
   "the timer list.", 
   "* Drop the severity of some wstunnel messages from DEBUG to TRACE1", 
   "* Lift the restriction on using asynchronous websockets connections but having", 
   "an idle timeout"
  ], 
  "revision_id": "1593857"
 }, 
 {
  "author": "rmuir", 
  "date": "2014-05-11T20:38:21.746071Z", 
  "msg": [
   "LUCENE-5666: get solr compiling"
  ], 
  "revision_id": "1593856"
 }, 
 {
  "author": "hibou", 
  "date": "2014-05-11T20:38:12.792430Z", 
  "msg": [
   "Make getExtraInfos and getExtraInfo work on the same data, with the explicit bias on getting the data out on the deprecated mathod"
  ], 
  "revision_id": "1593855"
 }, 
 {
  "author": "mbertozzi", 
  "date": "2014-05-11T20:36:50.850273Z", 
  "msg": [
   "HBASE-11139 BoundedPriorityBlockingQueue#poll() should check the return value from awaitNanos() (Shengzhe Yao)"
  ], 
  "revision_id": "1593854"
 }
]