[
 {
  "author": "peter_firmstone", 
  "date": "2014-05-09T07:03:18.375108Z", 
  "msg": [
   "Stop using daemon threads for IO in services and platform, for cases where snapshots could be taken during jvm shutdown, use explicit shutdown handler for ThreadPool and interruption instead.", 
   "Close standard output in ClassDep at the end of main method call as per Gregg Wonderly's suggestion.", 
   "Eliminate a contention hotspot in ConnectionManager.", 
   "Increase default connection timeout in ConnectionManager for extended periods of high load.", 
   "Replace string concatenation in LeaseRenewDurRFE with StringBuilder", 
   "Reduce number of threads used in stress tests, too many threads cause contention and actually reduce the load on the components being tested.", 
   "Use RemoteEventComparator in NotifyOnSrvcLeaseExpiration.", 
   "Reduce unnecessary thread consumption in Mahalo, use number of processors to assist default number of threads used, if not specified in configuration.", 
   "Use a Collection<Permission> instead of Permissions, in PreferredClassLoader, Permissions caused contention in stress tests, where an unsynchronized non mutating final Collection<Permission> has no contention and is thread safe.", 
   "Various minor improvements including @Override annotations.", 
   "Remove UriString and associated tests."
  ], 
  "revision_id": "1593493"
 }, 
 {
  "author": "andreapatricelli", 
  "date": "2014-05-09T06:55:48.889771Z", 
  "msg": [
   "improved management of page number sent to rest services that allow pagination"
  ], 
  "revision_id": "1593492"
 }, 
 {
  "author": "smohanty", 
  "date": "2014-05-09T06:21:24.784451Z", 
  "msg": [
   "SLIDER 41. Some of the unit tests are not running as the class name do not start with Test"
  ], 
  "revision_id": "1593491"
 }, 
 {
  "author": "rwesten", 
  "date": "2014-05-09T05:08:21.652266Z", 
  "msg": [
   "STANBOL-488: implemetnation of chain scoped enhancement properties for 0.12.1; Chain scoped Enhancement Properties are stored as RDF within the execution paln. Added Helper Methods for doing so to the ExecutionPlanHelper. EnhancementProperties do now consider chain scoped properties. Adapted the helper methods in the EnhancementEngineHelper accodringly. Added enhancement properties support to the list, weighted and graph chain."
  ], 
  "revision_id": "1593490"
 }, 
 {
  "author": "sdeboy", 
  "date": "2014-05-09T05:04:41.031070Z", 
  "msg": [
   "Replace '(LF)' with '(NL)' for newline format and fix support for + in timestamp formats"
  ], 
  "revision_id": "1593489"
 }
]