[
 {
  "author": "chetanm", 
  "date": "2014-05-13T09:09:32.466460Z", 
  "msg": [
   "OAK-1813 - LastRevSingleNodeRecoveryTest fails with Mongo", 
   "lastRevisionTimestamp was not getting reset when Revision clock was getting reset in test execution. This caused mismatch in timings. As a fix the  lastRevisionTimestamp would be set to clock time upon reset"
  ], 
  "revision_id": "1594158"
 }, 
 {
  "author": "julianfoad", 
  "date": "2014-05-13T09:06:34.000129Z", 
  "msg": [
   "* STATUS: Nominate r1594156: Fix a problem with the Unix build..."
  ], 
  "revision_id": "1594157"
 }, 
 {
  "author": "julianfoad", 
  "date": "2014-05-13T09:03:50.220925Z", 
  "msg": [
   "Fix a problem with the Unix build that could result in linking to the wrong", 
   "Subversion libraries at build time or at run time.", 
   "The bug shows up when all of these conditions are met:", 
   "* there is a development package of Subversion libraries, that we don't", 
   "want to use, installed somewhere (such as /usr);", 
   "* the 'serf' package that we are building against is installed under that", 
   "same prefix (such as /usr);", 
   "* 'pkgconfig' is not being used to find the 'serf' package;", 
   "* the libtool in use does not strip out indirect dependencies.", 
   "See the email thread \"Issues with bindings tests\" started by Julian Foad on", 
   "2014-05-12, at e.g. <http://svn.haxx.se/dev/archive-2014-05/0066.shtml>.", 
   "Thanks to Philip for help in tracking down the cause.", 
   "* build/ac-macros/serf.m4", 
   "(SVN_SERF_PREFIX_CONFIG): Remove standard paths from LDFLAGS additions,", 
   "like we already do for other packages.", 
   "* build/ac-macros/berkeley-db.m4", 
   "(SVN_LIB_BERKELEY_DB): Same."
  ], 
  "revision_id": "1594156"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2014-05-13T08:45:01.670642Z", 
  "msg": [
   "Use IllegalArgumentException instead than planing to add an IllegalAttributeException.", 
   "If we want a more specific exception, we will define it in SIS rather than GeoAPI."
  ], 
  "revision_id": "1594155"
 }, 
 {
  "author": "rhuijben", 
  "date": "2014-05-13T08:26:30.802771Z", 
  "msg": [
   "* STATUS: Cast vote."
  ], 
  "revision_id": "1594154"
 }
]