[
 {
  "author": "smartini", 
  "date": "2014-05-29T15:15:55.522928Z", 
  "msg": [
   "bump release to next (2.0.5), and empty release notes"
  ], 
  "revision_id": "1598318"
 }, 
 {
  "author": "davidb", 
  "date": "2014-05-29T15:05:08.029038Z", 
  "msg": [
   "[FELIX-4220] BundleException type not set to START_TRANSIENT_ERROR", 
   "This commit fixes this issue."
  ], 
  "revision_id": "1598317"
 }, 
 {
  "author": "jeremias", 
  "date": "2014-05-29T15:04:15.891575Z", 
  "msg": [
   "PDFBOX-2102: Fix for swallowed character in COSString.getString().", 
   "Introduced a java.nio.charset.Charset subclass implementing \"PDFDocEncoding\" fully, not just partially like in PdfDocEncoding. This should also be faster than the other class. It also made it possible to remove the requirement for the \"isDictionaryValue\" parameter introduced with PDFBOX-1437. Methods and constructors with that parameter are now marked deprecated and they have no internal references anymore. Compatibility of the change has been checked against the test file in PDFBOX-1437 and a unit test covers it, too.", 
   "There is a META-INF/services registration for the CharsetProvider but it is not used by PDFBox's code right now because it might be unreliable when PDFBox is used in environments like a WAR due to class loading issues. Still, it does no harm and maybe someone may find it useful."
  ], 
  "revision_id": "1598316"
 }, 
 {
  "author": "aconway", 
  "date": "2014-05-29T15:02:15.912886Z", 
  "msg": [
   "NO-JIRA: HA documentation: security configuration troubleshooting", 
   "Common issue for new users is cluster failing to start due to incorrect", 
   "security configuration. Added some notes to highlight the need for", 
   "security configuration and updated the troubleshooting section."
  ], 
  "revision_id": "1598315"
 }, 
 {
  "author": "junrao", 
  "date": "2014-05-29T15:01:24.760878Z", 
  "msg": [
   "Fix typo in introduction; patched by Chengwei Yang"
  ], 
  "revision_id": "1598314"
 }
]