[
 {
  "author": "cnauroth", 
  "date": "2014-06-16T23:09:30.160256Z", 
  "msg": [
   "HADOOP-10702. KerberosAuthenticationHandler does not log the principal names correctly. Contributed by Benoy Antony."
  ], 
  "revision_id": "1603023"
 }, 
 {
  "author": "dag", 
  "date": "2014-06-16T23:09:03.944841Z", 
  "msg": [
   "DERBY-6552 The public api includes methods inherited from superclasses which aren't in the public api and so have no javadoc comments", 
   "Follow-up patch derby-6552-restructure-even-more. This restructures", 
   "the embedded hierarchy to avoid duplication also. It eliminates", 
   "EmbeddedBaseDataSource. Removed a slew of warnings in the IDE also by", 
   "some code washing, and regenerated the 10.11 serialized data sources", 
   "for the SerializedDataSourceTest. I removed some Javadoc from", 
   "non-public members in the API classes, and replaced them with", 
   "end-of-line comments instead (to avoid user confusion)."
  ], 
  "revision_id": "1603022"
 }, 
 {
  "author": "wang", 
  "date": "2014-06-16T23:08:24.128074Z", 
  "msg": [
   "HDFS-6528. Add XAttrs to TestOfflineImageViewer. Contributed by Stephen Chu."
  ], 
  "revision_id": "1603021"
 }, 
 {
  "author": "wang", 
  "date": "2014-06-16T23:07:31.841189Z", 
  "msg": [
   "HDFS-6528. Add XAttrs to TestOfflineImageViewer. Contributed by Stephen Chu."
  ], 
  "revision_id": "1603020"
 }, 
 {
  "author": "dag", 
  "date": "2014-06-16T23:00:34.136867Z", 
  "msg": [
   "DERBY-6552 The public api includes methods inherited from superclasses which aren't in the public api and so have no javadoc comments", 
   "Patch derby-6552-restructure-more:", 
   "- adds wrappers so that the exposed classes have the expected methods", 
   "and constants.", 
   "- changes the doc build for publishedapi so that we have a", 
   "\"sourcepath\" for Javadoc which contains all the sources. This is", 
   "necessary to make the wrappers inherit the (common for Basic* and", 
   "regular data sources) javadoc from a class that is otherwise not in", 
   "the API.", 
   "- added reference \"link\"s to official Java Javadocs for ease of", 
   "reading (SE: 8, J2EE: 7)", 
   "- removed ClientBaseDataSourceRoot putting its contents into", 
   "BasicClientDataSource40", 
   "- removed ClientBaseDataSource moving its contents into ClientDataSource", 
   "- added new serialized data source tests for 10.11"
  ], 
  "revision_id": "1603019"
 }
]