[
 {
  "author": "cschneider", 
  "date": "2014-06-25T08:06:37.082736Z", 
  "msg": [
   "Simplify customizer tests"
  ], 
  "revision_id": "1605288"
 }, 
 {
  "author": "kahatlen", 
  "date": "2014-06-25T08:05:13.574630Z", 
  "msg": [
   "DERBY-6634: Improve test coverage of SqlXmlUtil.java", 
   "Add missing test cases for:", 
   "- XMLQUERY that returns an atomic boolean", 
   "- XMLEXISTS where the query returns an atomic value"
  ], 
  "revision_id": "1605287"
 }, 
 {
  "author": "mor", 
  "date": "2014-06-25T08:02:51.601649Z", 
  "msg": [
   "Fix: When redirectAddress is specified and mail notification is disabled 'subject' can grow longer than the specified char limit in db and the service updateCommEventAfterEmail triggered on sendMail is failing for the same reason. The issue occurred when system invoke a failed job for the service sendCommEventAsEmail.", 
   "Note: sendCommEventAsEmail service also update the status of communication event by calling an inline service setCommEventComplete if there is no error in sendMail result. The service updateCommEventAfterEmail is also triggered by an eca on sendEmail which also do the same. They both eventually callthe service updateCommunicationEvent. In this case we should option (1) not call updateCommEventAfterEmail or option (2) make changes to updateCommunicationEvent so that it check for a status valid change before updating the communciation event record or option(3) just make updateCommEventAfterEmail responsible for updating the communication event record by removing the inline code that update the communication event to complete. Option (2) seemsright to me."
  ], 
  "revision_id": "1605286"
 }, 
 {
  "author": "kahatlen", 
  "date": "2014-06-25T07:58:04.996040Z", 
  "msg": [
   "DERBY-6634: Improve test coverage of SqlXmlUtil.java", 
   "Remove dead code from the time when SqlXmlUtil implemented the", 
   "Formatable interface (before DERBY-3870)."
  ], 
  "revision_id": "1605285"
 }, 
 {
  "author": "jsc", 
  "date": "2014-06-25T07:52:26.308729Z", 
  "msg": [
   "#125130# merge translaton update from AOO410 (4.1.1) branch)"
  ], 
  "revision_id": "1605284"
 }
]