[
 {
  "author": "brett", 
  "date": "2005-04-08T12:07:08.705959Z", 
  "msg": [
   "fix server name"
  ], 
  "revision_id": "160544"
 }, 
 {
  "author": "andreas", 
  "date": "2005-04-08T11:30:01.504763Z", 
  "msg": [
   "applied patch for bug #34348, thanks to Felix Roethenbacher"
  ], 
  "revision_id": "160543"
 }, 
 {
  "author": "bgoodin", 
  "date": "2005-04-08T10:49:27.153036Z", 
  "msg": [
   "Added new removeFirstPrepend functionality. I made sure that it is completely backwards compatible.", 
   "I also added open and close attributes to all dynamic tags for dealing with nested bracketing. This is to avoid users from putting certain characters like \"(\" \")\" into the body of the dynamic tags and receiving bad sql because the tag sees content in it's body.", 
   "The <dynamic> tag does NOT have the option to removeFirstPrepend. It will automatically remove the first prepend if it contains a prepend attribute. If it does not contain a prepend attribute then the first prepend is used. This was for backwards compatibility.", 
   "All other dynamic tags have the removeFirstPrepend attribute. The default behavior is to NOT removeFirstPrepend. You must explicitly set removeFirstPrepend=\"true\" for it to remove the first prepend.", 
   "I added a LinkedList to the SqlContext. I also added an inner class named RemoveFirstPrependMarker to the SqlContext. This object is used to track the state of nested prepend removal in the LinkedList.", 
   "I added a test method in the DynamicTest class called testComplexDynamicQuery. I also added a mapped statement to the query called complexDynamicQueryByExample which makes heavy use of the new removeFirstPrepend attribute and open close attributes."
  ], 
  "revision_id": "160542"
 }, 
 {
  "author": "trustin", 
  "date": "2005-04-08T09:47:21.673782Z", 
  "msg": [
   "Suppressed ProviderNexusAspect to throw NullPointerException in case user wants to create Invocations outside of the server context (e.g. Unit testing)"
  ], 
  "revision_id": "160541"
 }, 
 {
  "author": "quinlan", 
  "date": "2005-04-08T09:12:03.343289Z", 
  "msg": [
   "bug 3250: possible replacement rules"
  ], 
  "revision_id": "160540"
 }
]