[
 {
  "author": "rwhitcomb", 
  "date": "2014-07-15T00:29:37.880009Z", 
  "msg": [
   "PIVOT-953: Update startup positioning code to make sure that the final position", 
   "for a desktop application is within the current virtual screen area.  This is a", 
   "better fix for earlier code that attempted to make the x and y values never go", 
   "negative for two reasons:  the previous code only worked on the --x and --y", 
   "values specified on the command line, but not for saved positions, and for", 
   "multiple monitor configurations where the secondary monitor(s) are left / above", 
   "the primary monitor, the actual virtual screen coordinates could legitimately", 
   "be negative and the window is still visible.", 
   "So, compute the bounds of the whole virtual screen space, by getting the union", 
   "of all the screen device bounds, then make sure the x and y coordinates (just", 
   "before using them to set the main window position) are within the virtual screen", 
   "boundaries."
  ], 
  "revision_id": "1610563"
 }, 
 {
  "author": "kkolinko", 
  "date": "2014-07-14T23:57:35.918073Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=56717", 
   "Fix duplicate registration of MapperListener during repeated starts of embedded Tomcat.", 
   "Properly unregister it when Tomcat stops."
  ], 
  "revision_id": "1610562"
 }, 
 {
  "author": "kwright", 
  "date": "2014-07-14T23:35:57.181610Z", 
  "msg": [
   "Remove debugging output"
  ], 
  "revision_id": "1610561"
 }, 
 {
  "author": "kwright", 
  "date": "2014-07-14T23:33:47.472448Z", 
  "msg": [
   "Get basic crawling working again in a backwards-compatible way"
  ], 
  "revision_id": "1610560"
 }, 
 {
  "author": "vinodkv", 
  "date": "2014-07-14T23:32:36.190349Z", 
  "msg": [
   "YARN-2260. Fixed ResourceManager's RMNode to correctly remember containers when nodes resync during work-preserving RM restart. Contributed by Jian He.", 
   "svn merge --ignore-ancestry -c 1610557 ../../trunk/"
  ], 
  "revision_id": "1610559"
 }
]