[
 {
  "author": "aconway", 
  "date": "2014-07-18T18:18:42.146837Z", 
  "msg": [
   "QPID-5888: transaction should always be aborted on failover", 
   "C++ and python clients were attempting to continue the transation transparently", 
   "after failover which is in correct. They were re-sending messages in the", 
   "transaction but there is no way to re-do transactional receives. The transaction", 
   "must be aborted.", 
   "The C++ and python clients have been modified to kill a transactional session", 
   "with a TransactionAborted exception if there is a failover.", 
   "Note the Java client already behaves correctly but not identically.", 
   "It defers raising an exception until commit rather than failing", 
   "immediately on failover, and the session can still be used.", 
   "The following commits are involved:", 
   "r1611349 QPID-5887: revised approach to implict abort", 
   "r1610959 QPID-5887: allow qpid-txtest2 to be run by make test", 
   "r1610958 QPID-5887: fix to new txtest2, acknowledge messages in the check phase to ensure queues remain drained for any subsequent runs", 
   "r1609748 QPID-5887: abort transactional session on failover; added equivalent of txtest using messaging API", 
   "This commit does the following:", 
   "- Update ha_tests.py tx_simpler_failover test to expect transaction aborted.", 
   "- Minor improvements to qpid-txtest2", 
   "- Fix native (non-swig) python client."
  ], 
  "revision_id": "1611748"
 }, 
 {
  "author": "aconway", 
  "date": "2014-07-18T18:17:17.657746Z", 
  "msg": [
   "NO-JIRA: Added qpid-ha query --all flag."
  ], 
  "revision_id": "1611747"
 }, 
 {
  "author": "jquinn", 
  "date": "2014-07-18T18:17:01.507520Z", 
  "msg": [
   "Fixed sandbox rules error and uncommented rules"
  ], 
  "revision_id": "1611746"
 }, 
 {
  "author": "aconway", 
  "date": "2014-07-18T18:15:45.149089Z", 
  "msg": [
   "No-JIRA: Get rid of throw in destructor for ~Waitable."
  ], 
  "revision_id": "1611745"
 }, 
 {
  "author": "humbedooh", 
  "date": "2014-07-18T18:15:42.172407Z", 
  "msg": [
   "backport for mod_lua: Don't quote values in cookies; Make IE happy again [#56734]"
  ], 
  "revision_id": "1611744"
 }
]