[
 {
  "author": "rmannibucau", 
  "date": "2014-07-23T17:20:44.760310Z", 
  "msg": [
   "TOMEE-1277 cxf 3.0.1"
  ], 
  "revision_id": "1612878"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2014-07-23T17:08:37.220919Z", 
  "msg": [
   "TOMEE-1276 TimerExecutor shouldn't kill the executor each time"
  ], 
  "revision_id": "1612877"
 }, 
 {
  "author": "rmannibucau", 
  "date": "2014-07-23T17:08:09.257461Z", 
  "msg": [
   "no need of a max since it is user specified it is fine"
  ], 
  "revision_id": "1612876"
 }, 
 {
  "author": "arkurth", 
  "date": "2014-07-23T17:04:47.708954Z", 
  "msg": [
   "VCL-770", 
   "Added pre_capture and prepare_post_load subroutines to 8.pm. These configure the image to run a scheduled task to configure sshd when the image loads instead of having root log in and run the script via the Startup folder. This is necessary to allow the script to run with Administrator privileges with UAC enabled. A scheduled task can run as Administrator fairly easily. Startup folder scripts cannot.", 
   "Other", 
   "Rearranged Windows.pm::pre_capture. It was not locking down RDP and setting the Administrator password as the first steps. This was allowing an image creator to log back in during the capture process."
  ], 
  "revision_id": "1612875"
 }, 
 {
  "author": "chug", 
  "date": "2014-07-23T17:01:40.278543Z", 
  "msg": [
   "QPID-4123: C++ Broker ACL creates too many rules", 
   "Recent changes have added new tables to define what", 
   "are ACL lookups and their properties. This commit", 
   "finishes that work by not propagating rules that", 
   "will never match. Also, it completes the scaffolding", 
   "for allowed and denied host lists to be fully", 
   "integrated. This commit:", 
   "* Adds startup logging of ACL validation tables", 
   "with cross references to possible rule matches.", 
   "* Hooks the ACL host allow/deny connection lists", 
   "into self test.", 
   "* Fixes self tests that get broken by proper rule", 
   "table handling.", 
   "* Introduces a 'create connection' decision mode", 
   "similar to ACL rule decision mode.", 
   "* Describes it all in doc book."
  ], 
  "revision_id": "1612874"
 }
]