[
 {
  "author": "gdamour", 
  "date": "2005-04-14T15:23:31.187670Z", 
  "msg": [
   "A couple of changes to get document style working, at least for POJO WS.", 
   "o update JettyPOJOWebServiceHolder such that it registers during start-up the", 
   "TypeDesc of the exposed service. This also includes a new dependency to", 
   "geronimo-axis from geronimo-jetty.", 
   "o add a TypeDescInfo class wrapping all the information required to recreate", 
   "a TypeDesc. As a matter of fact TypeDesc cannot be serialized \"as is\" due", 
   "to the contained property descriptors, which are not serializable. An Axis", 
   "patch is required to fix this problem.", 
   "o update HeavyweightOperationDescBuilder such that parameters and return", 
   "value of document style operations are \"correctly\" mapped. In the case of", 
   "document style operations, the names of the parameters and return values are", 
   "the names of the elements defined by the message part.", 
   "o fix AxisServiceBuilder.buildOperations such that the soap:binding style is", 
   "provided as the default style for the nested soap:operation.", 
   "o Definition.getTypes() may return null. This is not specified by the API;", 
   "yet, I have observed this behavior."
  ], 
  "revision_id": "161304"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-04-14T15:19:44.755095Z", 
  "msg": [
   "perform validity check in accordance with contract"
  ], 
  "revision_id": "161303"
 }, 
 {
  "author": "jwkaltz", 
  "date": "2005-04-14T15:18:29.395490Z", 
  "msg": [
   "[minor change] changed index from i to j in inner loop - I assume this was a typo"
  ], 
  "revision_id": "161302"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-04-14T15:17:55.733685Z", 
  "msg": [
   "perform validity check in accordance with contract"
  ], 
  "revision_id": "161301"
 }, 
 {
  "author": "rgardler", 
  "date": "2005-04-14T15:05:43.079450Z", 
  "msg": [
   "rename to bring into line with naming conventions"
  ], 
  "revision_id": "161300"
 }
]