[
 {
  "author": "rgardler", 
  "date": "2005-04-14T16:09:16.548188Z", 
  "msg": [
   "rename to bring into line with new naming conventions"
  ], 
  "revision_id": "161314"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-04-14T16:04:10.238383Z", 
  "msg": [
   "implement %{rootThrowable}"
  ], 
  "revision_id": "161313"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-04-14T16:03:28.558180Z", 
  "msg": [
   "implement %{rootThrowable}"
  ], 
  "revision_id": "161312"
 }, 
 {
  "author": "rgardler", 
  "date": "2005-04-14T15:57:45.464140Z", 
  "msg": [
   "rename to bring into line with new naming conventions"
  ], 
  "revision_id": "161311"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-04-14T15:46:57.995815Z", 
  "msg": [
   "NetUI bug fixes:", 
   "BEEHIVE-506    \t data grid state objects need to be marked serializable", 
   "The DataGridState object is now serializable.  There are more serialization tests and changes coming.", 
   "BEEHIVE-416    \t DataGrid's setRow feature can lead to skipped rows when going to a previous page", 
   "The default PagerModel has been rewritten to support dynamically adjusting the row / page given a page size and data set size.  If provided a row \"25\" with a page size of 10, the current row is set to \"20\" so that the row \"25\" appears on the page and the page size is maintained but no rows are skipped.", 
   "BEEHIVE-526    \t previous / next pager doesn't render previous / next links when those pages don't exist", 
   "The previous / next pager now displays the previous and next labels though they're only links when there are previous / next pages to display.", 
   "BEEHIVE-417    \t DataGrid - if setRow is set to a value greater than max rows go to the last row", 
   "The new PagerModel adjusts the page size to the end of the data set size if set to display a row that does not exist.", 
   "Added new JUnit tests where appropriate to ensure that the PagerModel works correctly.", 
   "This change also removes some PagerModel APIs that don't line-up with the dynamic way of determing the current row.  The use of pages for building paging UI has been changed slightly.  The methods:", 
   "getRowForFirstPage", 
   "getRowForPreviousPage", 
   "getRowForNextPage", 
   "getRowForLastPage", 
   "should be used to build URLs for navigating to the given pages.  The methods:", 
   "getFirstPage", 
   "getPreviousPage", 
   "getNextPage", 
   "getLastPage", 
   "are used to build labels of the current page.", 
   "BB: self", 
   "DRT: NetUI pass", 
   "BVT: NetUI pass (1 failure)"
  ], 
  "revision_id": "161310"
 }
]