[
 {
  "author": "vgritsenko", 
  "date": "2005-04-15T16:36:03.969891Z", 
  "msg": [
   "Add thread-pool configuration to CocoonStoreJanitor (default: daemon).", 
   "Change runnable manager default thread pool block policy to ABORT", 
   "(if pool is exausted we don't want the only scheduling thread get busy by executing tasks)"
  ], 
  "revision_id": "161499"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-04-15T16:34:31.619324Z", 
  "msg": [
   "Add thread-pool configuration to CocoonStoreJanitor (default: daemon).", 
   "Change runnable manager default thread pool block policy to ABORT", 
   "(if pool is exausted we don't want the only scheduling thread get busy by executing tasks)"
  ], 
  "revision_id": "161498"
 }, 
 {
  "author": "germuska", 
  "date": "2005-04-15T16:33:24.073060Z", 
  "msg": [
   "Add the ability to FormBeanConfig to create an ActionForm based on an ActionContext instead of a Servlet, hiding a dependency on the Servlet API.", 
   "This enables the elimination of o.a.s.chain.commands.AbstractCreateForm and it's subclass in the o.a.s.c.c.servlet package.  These are deprecated, but will be removed before the first Struts 1.3 release, but are preserved temporarily to smooth the transition for users who have customized the default chain-config.xml file.  (In that file, \"org.apache.struts.chain.commands.servlet.CreateActionForm\" should be changed to \"org.apache.struts.chain.commands.CreateActionForm\".", 
   "Change chain-config.xml to use new version of CreateActionForm.", 
   "Add convenience method to ActionContextBase to findOrCreateForm given a form name and scope name, since it contains all the necessary referents to achieve that.", 
   "Add logger property to ActionContextBase, with default initialization strategy.", 
   "Create generic command which can use configuration parameters to lookup or create an ActionForm and place it in the ActionContext under a specified key, so that a subsequent command can prepopulate fields.", 
   "Centralize logic to determine whether a given ActionForm instance can be \"re-used\" for a given FormBeanConfig as an instance method of FormBeanConfig.  Adjust RequestUtils to use newly centralized logic."
  ], 
  "revision_id": "161497"
 }, 
 {
  "author": "dolander", 
  "date": "2005-04-15T16:31:24.732815Z", 
  "msg": [
   "Fix a bug generating the Id Scope on the HTML tag."
  ], 
  "revision_id": "161496"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-04-15T16:05:53.714883Z", 
  "msg": [
   "Move source resolver config to protocols section", 
   "Add/update some logger attributes."
  ], 
  "revision_id": "161495"
 }
]