[
 {
  "author": "hashutosh", 
  "date": "2014-08-06T20:01:41.031398Z", 
  "msg": [
   "HIVE-7426 : ClassCastException: ...IntWritable cannot be cast to ...Text involving ql.udf.generic.GenericUDFBasePad.evaluate (Matt McCline via Jason Dere)"
  ], 
  "revision_id": "1616333"
 }, 
 {
  "author": "dag", 
  "date": "2014-08-06T20:01:26.785188Z", 
  "msg": [
   "DERBY-6688 NPE (or sane: ASSERT failure) with ROW_NUMBER in some subqueries", 
   "In FromSubquery (used in the OK subquery) the phasing is different", 
   "than in SubqueryNode (used in the failing query): the order by list is", 
   "pushed down too late in the SubqueryNode (after the", 
   "SelectNode#preprocess), so that the fact that the order by carries an", 
   "implicit window definition isn't recorded, causing the \"windows\" field", 
   "to be null, leading to missing rewriting in the getProjectRestrict", 
   "phase, hence the error.", 
   "In FromSubquery, the order by list is pushed down into the child", 
   "select node just before calling its preprocess method, i.e. the order", 
   "by list is present what that happens.", 
   "The patch (derby-6688-b) moves the pushing down of the order by list", 
   "in SubqueryNode#preprocess to the resultSet (the SelectNode) to just", 
   "before the call to preprocess of the resultSet, so the rest of the", 
   "windows rewriting machinery kicks in."
  ], 
  "revision_id": "1616332"
 }, 
 {
  "author": "khorgath", 
  "date": "2014-08-06T19:59:11.225215Z", 
  "msg": [
   "HIVE-7472 : CLONE - Import fails for tables created with default text, sequence and orc file formats using HCatalog API (Sushanth Sowmyan, reviewed by Thejas Nair)"
  ], 
  "revision_id": "1616331"
 }, 
 {
  "author": "nslater", 
  "date": "2014-08-06T19:52:46.211346Z", 
  "msg": [
   "Improve nav, change Quick Links to More"
  ], 
  "revision_id": "1616330"
 }, 
 {
  "author": "tilman", 
  "date": "2014-08-06T19:52:34.059479Z", 
  "msg": [
   "PDFBOX-1915: use PaintContext deviceBounds and BBox for types 1,4,5,6,7, as done by Shaola Ren in GSoC2014"
  ], 
  "revision_id": "1616329"
 }
]