[
 {
  "author": "arp", 
  "date": "2014-08-13T00:54:29.840690Z", 
  "msg": [
   "HADOOP-10281. Create a scheduler, which assigns schedulables a priority level. (Contributed by Chris Li)"
  ], 
  "revision_id": "1617643"
 }, 
 {
  "author": "mamta", 
  "date": "2014-08-13T00:53:17.366106Z", 
  "msg": [
   "DERBY-6684(Failure in testDERBY5120NumRowsInSydependsForTrigger when upgrading from 10.11.1.0 to trunk)", 
   "Backporting changes from trunk to 10.11. No futher backporting is needed because the test had started failing because of DERBY-2041(Trigger should register a dependency on tables and columns used in its body) but the change for DERBY-2041 went in 10.11 codeline"
  ], 
  "revision_id": "1617642"
 }, 
 {
  "author": "mamta", 
  "date": "2014-08-13T00:42:04.273520Z", 
  "msg": [
   "DERBY-6684(Failure in testDERBY5120NumRowsInSydependsForTrigger when upgrading from 10.11.1.0 to trunk)", 
   "We ran into DERBY-6684 after the fix for DERBY-2041 went into 10.11", 
   "The failure is the expected behavior since when dropping a table,", 
   "we should detect any dependent triggers defined on other tables", 
   "and drop table should fail if such dependencies exist. To fix the", 
   "test failure, we just need to switch the order of drop table", 
   "DERBY-2041(Trigger should register a dependency on tables and columns used in its body)", 
   "Drop ATDC_TAB1 before ATDC_BKUP1 because ATDC_TAB1 has a trigger", 
   "on it which references ATDC_BKUP1. If we try dropping ATDC_BKUP1", 
   "without first dropping ATDC_TAB1, there will be an error message", 
   "that trigger ATDC_TAB1_TRG1 depends on ATDC_BKUP1"
  ], 
  "revision_id": "1617641"
 }, 
 {
  "author": "mattsicker", 
  "date": "2014-08-13T00:33:52.913662Z", 
  "msg": [
   "Fix bug where boolean value could never change.", 
   "- Addresses potential problem where more than one resource in the war file matches the regexp \"^/WEB-INF/log4j2.*$\"."
  ], 
  "revision_id": "1617640"
 }, 
 {
  "author": "mattsicker", 
  "date": "2014-08-13T00:33:50.160517Z", 
  "msg": [
   "Use Loader class instead of Class.forName()."
  ], 
  "revision_id": "1617639"
 }
]