[
 {
  "author": "justin", 
  "date": "2014-08-22T14:18:41.862143Z", 
  "msg": [
   "fixing error in Sling Models test code - service ranking must be an integer to be effective"
  ], 
  "revision_id": "1619818"
 }, 
 {
  "author": "markrmiller", 
  "date": "2014-08-22T14:15:27.549681Z", 
  "msg": [
   "SOLR-6405: ZooKeeper calls can easily not be retried enough on ConnectionLoss."
  ], 
  "revision_id": "1619817"
 }, 
 {
  "author": "aconway", 
  "date": "2014-08-22T14:13:14.393263Z", 
  "msg": [
   "QPID-5855: JAVA Client Can not recieve message with qpid ha cluster \"Session exception occured while trying to commit\"", 
   "The problem: the java client sets the sync flag on tx.commit and then waits for", 
   "completion of the entire transaction. According to the 0-10 spec, this is", 
   "correct, the commit (or rollback) will not complete until all of the", 
   "transactional commands have completed. However the C++ broker was sometimes", 
   "completing a commit *before* one of the the corresponding enqueues. It issued", 
   "the completions up to the commit (because the commit is makred sync) but there", 
   "is a \"hole\" for the incomplete enqueue. The enqueue is not marked sync so when", 
   "this hole is filled no completion is sent and the client hangs.", 
   "Fix: make tx.commit a \"sync point\", that is it behaves like execution.sync and", 
   "is not completed till all preceeding commands are complete. Note tx.rollback", 
   "does not need modification as it is never completed asynchronously."
  ], 
  "revision_id": "1619816"
 }, 
 {
  "author": "alexparvulescu", 
  "date": "2014-08-22T14:13:10.950279Z", 
  "msg": [
   "OAK-2039 SegmentNodeStore might not create a checkpoint", 
   "- added warning logs when checkpoint creation fails"
  ], 
  "revision_id": "1619815"
 }, 
 {
  "author": "aconway", 
  "date": "2014-08-22T14:13:09.559114Z", 
  "msg": [
   "NO-JIRA: Clean up test_store.cpp async functionality.", 
   "Clean up test_store.cpp to allow control over async completion of messsages."
  ], 
  "revision_id": "1619814"
 }
]