[
 {
  "author": "rmannibucau", 
  "date": "2014-08-22T18:11:16.205232Z", 
  "msg": [
   "TOMEE-1327 log4j2 integration"
  ], 
  "revision_id": "1619878"
 }, 
 {
  "author": "aconway", 
  "date": "2014-08-22T18:06:20.110685Z", 
  "msg": [
   "QPID-6035: HA clearly distinguish qpid-ha commands intended for cluster manager.", 
   "This commit adds a --cluster-manager flag to qpid-ha tool.", 
   "Without this flag", 
   "- the 'promote' command is not listed in the tool help.", 
   "- using the promote command raises an error saying that it is only for cluster manager use", 
   "and mentioning the --cluster-manager flag.", 
   "With the flag: promote functions as before.", 
   "The qpid-ha help text for promote is also more clear now that it is for cluster", 
   "manager only.", 
   "Originally the idea was to split qpid-ha into two tools but I have kept one tool", 
   "with the flag and warning messages because it:", 
   "- avoids packaging changes that might trip things up.", 
   "- helps people who are already using qpid-ha promote: their scripts will", 
   "break but the error message explains how to fix it.", 
   "I think the special role of promote is sufficiently clear now even if it is", 
   "part of the same tool.", 
   "This commit also updates the following to take account of the new flag:", 
   "- rgmanager qpidd-primary script.", 
   "- qpidd tests.", 
   "- qpid book HA chapter.", 
   "NOTE: THIS WILL BREAK TEST HARNESSES that do promotion outside of rgmanager.", 
   "You'll need to add the --cluster-manager flag in the relevant places."
  ], 
  "revision_id": "1619877"
 }, 
 {
  "author": "tilman", 
  "date": "2014-08-22T17:53:14.830175Z", 
  "msg": [
   "PDFBOX-2275: add a test that the resource map is filled at PDF creation time"
  ], 
  "revision_id": "1619876"
 }, 
 {
  "author": "r4zoli", 
  "date": "2014-08-22T17:53:06.461783Z", 
  "msg": [
   "correction, bugfix test-hu site"
  ], 
  "revision_id": "1619875"
 }, 
 {
  "author": "brock", 
  "date": "2014-08-22T17:51:35.799316Z", 
  "msg": [
   "HIVE-7828 - TestCLIDriver.parquet_join.q is failing on trunk (Brock reviewed by Alan)"
  ], 
  "revision_id": "1619874"
 }
]