[
 {
  "author": "andy", 
  "date": "2014-08-25T17:44:27.073232Z", 
  "msg": [
   "Don't initialize dispatch too early - extensions can't override."
  ], 
  "revision_id": "1620388"
 }, 
 {
  "author": "khmarbaise", 
  "date": "2014-08-25T17:41:14.001252Z", 
  "msg": [
   "[MDOAP-40]", 
   "- Upgrade scm to 1.9.1."
  ], 
  "revision_id": "1620387"
 }, 
 {
  "author": "gmazza", 
  "date": "2014-08-25T17:38:42.016408Z", 
  "msg": [
   "Update to 5.1.1-SNAPSHOT, simplifications to roller.css and ThemeEdit.jsp"
  ], 
  "revision_id": "1620386"
 }, 
 {
  "author": "dag", 
  "date": "2014-08-25T17:33:49.345724Z", 
  "msg": [
   "DERBY-6619 After silently swallowing SecurityExceptions, Derby can leak class loaders", 
   "Patch derby-6619-2-refinement which implements the following", 
   "refinements to the test to avoid changing the context class loader in", 
   "SingletonTimerFactory (suggested by Knut):", 
   "The orginal test tested against the system class loader. This new patch will:", 
   "1) Check if the context class loader is the same as the loader of the", 
   "SingletonTimerFactory class (that is, the class loader from which", 
   "Derby classes are loaded). Even if this isn't the same as the system", 
   "class loader, it would be safe to skip the workaround for DERBY-3745,", 
   "since the class loader for the Derby classes would not be eligible for", 
   "garbage collection until the engine is shut down anyway. This would", 
   "prevent some more false positives from being reported in", 
   "derby.log. I'd assume this is a kind of false positive that could", 
   "easily occur in an application server environment where the Derby", 
   "classes are not found on the system class loader.", 
   "2) Check against Thread.class.getClassLoader() instead of", 
   "ClassLoader.getSystemClassLoader(). Normally, those two checks would", 
   "be identical. If however the setup is such that they aren't identical,", 
   "we'd still know that the class loader actually used for system classes", 
   "such as the Thread class would have to stay in memory for as long as", 
   "the timer thread is alive, regardless of the context class loader of", 
   "the thread, so the workaround for DERBY-3745 can be skipped if it's", 
   "the same as the context class loader. The check will be a bit more", 
   "specific this way."
  ], 
  "revision_id": "1620385"
 }, 
 {
  "author": "slebresne", 
  "date": "2014-08-25T17:26:34.862619Z", 
  "msg": [
   "Update website for 2.0.10 release"
  ], 
  "revision_id": "1620384"
 }
]