[
 {
  "author": "crossley", 
  "date": "2005-04-21T03:45:09.448579Z", 
  "msg": [
   "Regex must anchor to beginning-of-line."
  ], 
  "revision_id": "162119"
 }, 
 {
  "author": "craigmcc", 
  "date": "2005-04-21T03:35:03.782066Z", 
  "msg": [
   "Initially working version of the logon and edit profile dialogs, using the", 
   "new support.  The old stuff in faces-config.xml is commented out so you", 
   "can see how much easier it is to configure the new style dialogs.", 
   "There are two defined dialogs:", 
   "* Log On", 
   "* Edit Profile", 
   "that can be utilized separately, and the Log On dialog also has a case that", 
   "uses Edit Profile as a subdialog to create a new profile."
  ], 
  "revision_id": "162118"
 }, 
 {
  "author": "craigmcc", 
  "date": "2005-04-21T03:32:17.207934Z", 
  "msg": [
   "Debugging changes so that dialog navigation basically works.  Outstanding", 
   "issues:", 
   "* By default, Tomcat is a little bit too helpful -- if you are in the", 
   "middle of a dialog and get an exception, then go fix the code and", 
   "reload the app, Tomcat saves and restores the session state for you", 
   "(including your Status variable marking where you are in the dialog", 
   "that you were running).  That makes it difficult to start from the", 
   "beginning again.", 
   "* It's not clear what the correct behavior should be for an end state", 
   "that doesn't list a viewId, with respect to what outcome is returned", 
   "to the calling dialog.  The current code returns the outcome that", 
   "caused the child end state to be reached, but that doesn't feel quite", 
   "right."
  ], 
  "revision_id": "162117"
 }, 
 {
  "author": "shash", 
  "date": "2005-04-21T03:29:17.052310Z", 
  "msg": [
   "Chnage Excalibur dependencies for upcoming -RC1 releases"
  ], 
  "revision_id": "162116"
 }, 
 {
  "author": "parker", 
  "date": "2005-04-21T03:28:26.130794Z", 
  "msg": [
   "Fix up test failures and extra debug output from logging code"
  ], 
  "revision_id": "162115"
 }
]