[
 {
  "author": "rwesten", 
  "date": "2014-09-10T14:29:11.356652Z", 
  "msg": [
   "merged implementation for STANBOL-1391 from 0.12.1 to trunk"
  ], 
  "revision_id": "1624013"
 }, 
 {
  "author": "macbean", 
  "date": "2014-09-10T14:28:02.229309Z", 
  "msg": [
   "QPID-6090: [Java Broker] Prevent removal of existing group nodes from the permitted nodes attribute on VHN"
  ], 
  "revision_id": "1624012"
 }, 
 {
  "author": "kotkov", 
  "date": "2014-09-10T14:25:49.032402Z", 
  "msg": [
   "Fix a broken assumption within the r1603605 changeset.", 
   "When format 1 and 2 filesystems are being upgraded, the upgrade routine", 
   "leaves the db/current contents as is.  As a consequence, there is a window", 
   "when a filesystem has a new format, but the 'current' file still contains the", 
   "additional IDs left from an old format, i.e. it could look like \"359 j5 v\\n\"", 
   "(last values are bogus and won't be there after the next transaction commit).", 
   "We should be able to parse it, otherwise any upgraded pre-1.4-compatible", 
   "repository will block the commits.", 
   "Loosen the corresponding checks.", 
   "* subversion/libsvn_fs_fs/util.c", 
   "(svn_fs_fs__read_current): Do not be too strict for new filesystem formats", 
   "and only expect a parseable revision number.  Adjust a scope of the local", 
   "variable.", 
   "* subversion/tests/cmdline/svnadmin_tests.py", 
   "(upgrade): New regression test.  Prior to this change, we actually had no", 
   "tests covering the 'svnadmin upgrade' behavior, so we use this opportunity", 
   "to test both BDB and FSFS.  Even though BDB is deprecated, its upgrade code", 
   "does some amount of work in this case, and there should be nothing wrong", 
   "with testing it.", 
   "(test_list): Reference the new test."
  ], 
  "revision_id": "1624011"
 }, 
 {
  "author": "rhuijben", 
  "date": "2014-09-10T14:23:56.615143Z", 
  "msg": [
   "Remove some invalid documentation of completely unused defines. Too bad", 
   "we can't just remove them... Just mark them deprecated.", 
   "* subversion/include/svn_client.h", 
   "(SVN_CLIENT_AUTH_USERNAME,", 
   "SVN_CLIENT_AUTH_PASSWORD):", 
   "Deprecate two defines from the original cvs code, which were", 
   "unused since the introduction of the generic auh handling in 2003."
  ], 
  "revision_id": "1624010"
 }, 
 {
  "author": "rmuir", 
  "date": "2014-09-10T14:23:48.871550Z", 
  "msg": [
   "LUCENE-5863: add 3.0.3 and fix numeric testing bug"
  ], 
  "revision_id": "1624009"
 }
]