[
 {
  "author": "mbenson", 
  "date": "2014-10-01T04:37:36.833214Z", 
  "msg": [
   "use commons weaver/privilizer"
  ], 
  "revision_id": "1628598"
 }, 
 {
  "author": "misty", 
  "date": "2014-10-01T04:28:55.065297Z", 
  "msg": [
   "Published website using script in auto mode. This commit changed the size of the website by 422 MB and the number of files by 16084 files.", 
   "The following directories (if any) might be stale:", 
   "The following files (if any) might be stale:", 
   "Not taking care of stale directories and files in auto mode.", 
   "If necessary, handle them in a manual commit."
  ], 
  "revision_id": "1628597"
 }, 
 {
  "author": "mamta", 
  "date": "2014-10-01T04:28:01.121381Z", 
  "msg": [
   "DERBY-6742(For update statement, collect generated keys if Statement.RETURN_GENERATED_KEYS flag is supplied to the JDBC call.)", 
   "This commit now allows JDBC statement to receive a resultset for auto generated keys for an UPDATE statement updating the generated values with DEFAULT clause. Such a resultset will be generated only if the UPDATE statement updated a single row and there were generated columns involved in the update. This functionality already exists for INSERT statement. It is currently implemented for INSERT statement by calling VALUES IDENTITY_VAL_LOCAL() from EmbedStatement.getGeneratedKeys(). I have used this existing mechanism to collect generated values resultset for UPDATE too. This means that the scope of IDENTITY_VAL_LOCAL() function has grown from INSERT statement to also include UPDATE statement. This will require us to update the documentation for IDENTITY_VAL_LOCAL(). I have created DERBY-6753(Docs for IDENTITY_VAL_LOCAL needs to be updated to indicate that the return value will be impacted by single row UPDATE of identity column) for the documentation task."
  ], 
  "revision_id": "1628596"
 }, 
 {
  "author": "kschenk", 
  "date": "2014-10-01T04:20:00.910292Z", 
  "msg": [
   "Put error_report.xhp bake in makefile lineup."
  ], 
  "revision_id": "1628595"
 }, 
 {
  "author": "amitj", 
  "date": "2014-10-01T04:19:33.956939Z", 
  "msg": [
   "Oak 1.1.0 release notes", 
   "Added entries for temporary workarounds - OAK-2153, OAK-2152"
  ], 
  "revision_id": "1628594"
 }
]