[
 {
  "author": "trygvis", 
  "date": "2004-08-26T10:16:28.000000Z", 
  "msg": [
   "o Adding excludes."
  ], 
  "revision_id": "163009"
 }, 
 {
  "author": "trygvis", 
  "date": "2004-08-26T10:14:04.000000Z", 
  "msg": [
   "o Removing IDEA project files."
  ], 
  "revision_id": "163008"
 }, 
 {
  "author": "jdcasey", 
  "date": "2004-08-26T04:40:02.000000Z", 
  "msg": [
   "o Removed GoalDecorationPhase, since goal decoration is now a part of the model", 
   "o Removed PluginDownloadPhase, since plugin resolution/download has to be a part of the prereq and pre/postGoal resolution, too", 
   "o Changed DefaultMaven to execute the session lifecycle, and the component wiring to likewise wire the DefaultMaven with a session lifecycle manager", 
   "o Removed the org.apache.maven.decoration package and its contents, since this is all in the model now", 
   "o Fixed the GoalResolutionPhase to verify each goal's plugin in turn as it resolves prereqs, preGoals and postGoals", 
   "o Fixed the GoalResolutionPhaseTest to work with the new resolution model", 
   "o Added a new createGoalExecutionContext to the MavenTestCase base class, to allow me to inject a MavenProject directly rather than a pom file", 
   "o Fixed the MavenLifecycleManagerTest to only expect 4 lifecycle phases, now than the plugin resolution and goal decoration phases are obsoleted", 
   "o All builds on local machine, but will depend on plexus-0.17.jar/pom and plexus-artifact-container-1.0-alpha-1.jar/pom to build on beaver", 
   "o I uploaded plexus-artifact-container-1.0-alpha-1.jar to ${plexus.home}/dist, but cannot upload POMs due to priveleges problem in poms dir."
  ], 
  "revision_id": "163007"
 }, 
 {
  "author": "jdcasey", 
  "date": "2004-08-26T01:18:19.000000Z", 
  "msg": [
   "o Changed to depend on plexus-0.17 instead of -0.16", 
   "o Changed the embedder/container used to be the new artifact-aware container (plexus-artifact-container-1.0-alpha-1)", 
   "o Added new dependency to maven-core for artifact-container."
  ], 
  "revision_id": "163006"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2004-08-25T21:13:43.000000Z", 
  "msg": [
   "o forgot the trailing slash"
  ], 
  "revision_id": "163005"
 }
]