[
 {
  "author": "desruisseaux", 
  "date": "2014-10-13T16:03:10.191761Z", 
  "msg": [
   "Bug fix in ScopeAdapter: the value was lost if the MetadataScope was not an instance of DefaultMetadataScope.", 
   "This bug has been identified by the port to trunk (it has not been identified by the tests on the JDK8 branch,", 
   "but the fact that the tests on trunk sometime follow a different code path has made this bug visible)."
  ], 
  "revision_id": "1631453"
 }, 
 {
  "author": "jleroux", 
  "date": "2014-10-13T16:02:22.850839Z", 
  "msg": [
   "Keeps in sync with OFBiz trunk HEAD", 
   "Merged revision(s) 1629587-1631449 from ofbiz/trunk:", 
   "Removes a number of duplicated labels certainly introduced with https://issues.apache.org/jira/browse/OFBIZ-5737", 
   "There are still some, I reopen the Jira issue", 
   "........", 
   "Add cache(boolean) method to EntityQuery to allow the cache to be used or not based on a boolean variable.  Avoids the need to use an if block when the caching decision isn't hardcoded", 
   "........", 
   "No functional change, clean end line space", 
   "........", 
   "Add junit test to control entity-auto on create, update and delete to ensure no regression when the entity-auto engine will be improve (like OFBIZ-5800)", 
   "........", 
   "Better French translation", 
   "........", 
   "Add where(EntityCondition...) to EntityQuery", 
   "........", 
   "Make use of EntityQuery.where(EntityCondition...)", 
   "........", 
   "Complete conversion of accounting java files from delegator to EntityQuery", 
   "........", 
   "Parameter name correction", 
   "........", 
   "Fix dead code warning by moving null check to the correct spot", 
   "........", 
   "Remove dead code", 
   "........"
  ], 
  "revision_id": "1631452"
 }, 
 {
  "author": "markt", 
  "date": "2014-10-13T16:01:59.444440Z", 
  "msg": [
   "Fix HTML entity"
  ], 
  "revision_id": "1631451"
 }, 
 {
  "author": "markt", 
  "date": "2014-10-13T16:01:07.038062Z", 
  "msg": [
   "Missed a Java8 Javadoc issue in previous commit"
  ], 
  "revision_id": "1631450"
 }, 
 {
  "author": "tilman", 
  "date": "2014-10-13T16:00:15.403336Z", 
  "msg": [
   "PDFBOX-1512: use quicksort if run in an applet"
  ], 
  "revision_id": "1631449"
 }
]