[
 {
  "author": "tilman", 
  "date": "2014-10-14T16:35:21.817888Z", 
  "msg": [
   "PDFBOX-1727: Adjust the cropbox to a smaller mediabox if needed, as pointed out by Jake Robb"
  ], 
  "revision_id": "1631813"
 }, 
 {
  "author": "jfthomps", 
  "date": "2014-10-14T16:31:53.859993Z", 
  "msg": [
   "VCL-531 - additions to dashboard", 
   "VCL-773 - Dashboard View Update", 
   "dashboard.php:", 
   "-modified dashboard: moved blockallocation block to end of left column; added managementnodes block to top of right column", 
   "-modified AJupdateDashboard: added call to getManagementNodeData to include management node information with returned data", 
   "-modified getNewReservationData and getFailedImagingData: added code to honor selected affiliation", 
   "-added getManagementNodeData", 
   "utils.php: modified getDojoHTML: added dojox.string.sprintf to dashboard dojo includes", 
   "dashboard.js:", 
   "-modified updateDashboardCB: added call to clearTimeout for refreshtimer before calling setTimeout for it again, there was a problem where selecting an affiliation would cause lots of refreshes of the data; added call to updateManagementNodes", 
   "-modified updateNewReservations: added section for displaying user information", 
   "-added updateManagementNodes", 
   "-added secToMin", 
   "-added secToHour"
  ], 
  "revision_id": "1631812"
 }, 
 {
  "author": "sebb", 
  "date": "2014-10-14T16:23:08.078967Z", 
  "msg": [
   "NPE in ResultCollector.testEnded", 
   "Bugzilla Id: 57088"
  ], 
  "revision_id": "1631811"
 }, 
 {
  "author": "kwall", 
  "date": "2014-10-14T16:13:20.693170Z", 
  "msg": [
   "QPID-6152: [Java Client] Allow connection/session close time to be overridden by system property.", 
   "Change implementation so that the timeout is applied individually to each session close, the connection and", 
   "the shutdown of the task pool.   Also moved the shutdown of the task pool to a finally, so that it occurs", 
   "even if one or more sessions fail to close."
  ], 
  "revision_id": "1631810"
 }, 
 {
  "author": "dlester", 
  "date": "2014-10-14T16:12:57.050451Z", 
  "msg": [
   "Adds ProfitStars to PoweredByMesos page."
  ], 
  "revision_id": "1631809"
 }
]