[
 {
  "author": "pmoravec", 
  "date": "2014-10-23T14:11:43.780627Z", 
  "msg": [
   "QPID-6177: qpid-tool should print warning when initial connection to broker fails"
  ], 
  "revision_id": "1633818"
 }, 
 {
  "author": "pmoravec", 
  "date": "2014-10-23T14:09:11.476045Z", 
  "msg": [
   "QPID-6182: AMQP 1.0 consumer should be able to get messages from browse-only queue (2/2)"
  ], 
  "revision_id": "1633817"
 }, 
 {
  "author": "desruisseaux", 
  "date": "2014-10-23T14:05:57.767526Z", 
  "msg": [
   "Review of JDBC base driver class:", 
   "- Retrofit resources in to the SIS system.", 
   "- Do not log exceptions.", 
   "- Provide default implementations for some methods.", 
   "- Rearrange method order for keeping together related methods."
  ], 
  "revision_id": "1633816"
 }, 
 {
  "author": "kwright", 
  "date": "2014-10-23T14:00:16.672323Z", 
  "msg": [
   "web connector reorganization which causes classloader verification failure under both JDK 7 and 8."
  ], 
  "revision_id": "1633815"
 }, 
 {
  "author": "aconway", 
  "date": "2014-10-23T14:00:06.899989Z", 
  "msg": [
   "DISPATCH-72: Sporadic core dumps in dispatch tests.", 
   "Added missing lock scopes around calls to python code, this resoloved the", 
   "sporadic core dumps (over 1000 test runs overnight with no failures)", 
   "Initially I speculated that the problem was that we don't lock the GIL as recommended by", 
   "the python C API docs https://docs.python.org/2/c-api/init.html#non-python-created-threads.", 
   "Instead we use a separate mutex in the C code.", 
   "I attempted to use the GIL but that caused deadlocks. They appeared to be", 
   "associated with locking a python mutex in the management agent - this causes", 
   "python to unlock and relock the GIL. That allows other threads into the python", 
   "code which somehow causes deadlock - I am not sure exactly why.", 
   "I believe it is OK to use the separate C mutex *provided* we never create", 
   "threads in python code.  If we do that then I think we will need to re-visit the", 
   "GIL and figure out how to lock it correctly."
  ], 
  "revision_id": "1633814"
 }
]