[
 {
  "author": "rezan", 
  "date": "2014-10-20T16:14:09.522799Z", 
  "msg": [
   "module update"
  ], 
  "revision_id": "1633183"
 }, 
 {
  "author": "jacopoc", 
  "date": "2014-10-20T16:13:33.277965Z", 
  "msg": [
   "Cleaned up the way the classloaders are setup at startup by removing duplicate logic and responsibilities between the start and base components.", 
   "Before this change the following classloader hierarchy was setup:", 
   "1) the \"application\" classloader for the \"start\" component", 
   "2) one \"native lib\" classloader for the \"base\" component", 
   "3) one \"native lib\" classloader for the all the other (non \"base\") framework/application/specialpurpose/hot-deploy components", 
   "4) one \"web app\" classloader for each of the webapplications", 
   "After this commit the hierarchy is simplified by merging #2 and #3:", 
   "a) the \"application\" classloader for the \"start\" component", 
   "b) one \"native lib\" classloader for the all the framework/application/specialpurpose/hot-deploy components (including the \"base\" component)", 
   "c) one \"web app\" classloader for each of the webapplications", 
   "This has been achieved by merging the code that was setting up classloader #2 in the start component (for the \"base\" component) with the code that was setting up the classloader #3 in the base component: now all the code is in the start component."
  ], 
  "revision_id": "1633182"
 }, 
 {
  "author": "kwall", 
  "date": "2014-10-20T16:13:16.550553Z", 
  "msg": [
   "QPID-6169: [Java Broker] HA Prevent IllegalStateException possibility from remote state learner", 
   "* Prevents a race condition between a node becoming master and the desired durability being read from", 
   "store and set on the environment."
  ], 
  "revision_id": "1633181"
 }, 
 {
  "author": "clin", 
  "date": "2014-10-20T16:01:00.171073Z", 
  "msg": [
   "add \"deprecated\" annotation"
  ], 
  "revision_id": "1633180"
 }, 
 {
  "author": "clin", 
  "date": "2014-10-20T15:58:20.919209Z", 
  "msg": [
   "reserve residue 6 and 7. Re-split the thyme data:", 
   "0,1,2 for train", 
   "3 for dev", 
   "4 and 5 for test"
  ], 
  "revision_id": "1633179"
 }
]