[
 {
  "author": "desruisseaux", 
  "date": "2014-10-27T07:36:36.025175Z", 
  "msg": [
   "Consolidation of deprecated method implementations:", 
   "- Setting a null value should remove the wrapper object if the later became empty.", 
   "- The deprecated getter methods invoke only the non-deprecated getter replacement.", 
   "- The deprecated setter methods invoke only the non-deprecated setter replacement (unless the invoked methods are final).", 
   "This means that if a deprecated setter methods need the old value, it will read the field directly.", 
   "The intend is to avoid surprising code paths for user who override some methods."
  ], 
  "revision_id": "1634463"
 }, 
 {
  "author": "tfischer", 
  "date": "2014-10-27T07:35:29.952971Z", 
  "msg": [
   "fix javadoc of generated files"
  ], 
  "revision_id": "1634462"
 }, 
 {
  "author": "krosenvold", 
  "date": "2014-10-27T07:23:35.671694Z", 
  "msg": [
   "Hnm"
  ], 
  "revision_id": "1634461"
 }, 
 {
  "author": "elecharny", 
  "date": "2014-10-27T07:19:42.683716Z", 
  "msg": [
   "Added the 11* fortress issues"
  ], 
  "revision_id": "1634460"
 }, 
 {
  "author": "jacopoc", 
  "date": "2014-10-27T07:13:36.340079Z", 
  "msg": [
   "A pretty large commit (I couldn't isolate the changes in smaller atomic commits as I was hoping) that includes the following:", 
   "* moved the json-lib jar (json-lib-2.2.3-jdk15.jar) from the framework/webapp to the framework/base component: this will facilitate the definition of a small set of classes for the management of JSON conversions; in one of the next commits we will replace json-lib with jackson library", 
   "* removed the SQL select Parser.jj (parser definition) and its unit tests: it was not used (and never used) by any OFBiz code", 
   "* removed the JSON.jj (parser definition) and its unit tests: it was not used (and never used) by any OFBiz code apart from the JSON Converters (now migrated to json-lib, see next items in this list) some utility methods in UtilIO.java (that have been removed too because they have never been used in OFBiz)", 
   "* removed the JavaCC jar and related ant scripts because no more needed after the removal of Parser.jj and JSON.jj", 
   "* converted the JSONConverter code that was based on JSON.jj to json-lib; some of the converters (the ones for basic type conversions) have been removed because they didn't seem to be useful; some new converters have been created (for List/Map to JSON conversions)", 
   "* added a new class org.ofbiz.base.conversion.JSON that have been contributed by Adrian Crum that will be used as a facade for simplifying the client code and for hiding the specific JSON library being used; at the moment the class is not used but one of the next commit should address this by converting the signatures of the JSON Converters to use this class rather than the json-lib JSON class", 
   "* in CommonEvents, converted some client code to use the new JSON Converter framework; however this code will be modified soon to use the org.ofbiz.base.conversion.JSON object instead", 
   "* removed an unused method: ImageManagementServices.toJsonObject(...)", 
   "* added TestBooleanConverters to the list of tests (it was missing)", 
   "* new unit tests for the new JSON converters"
  ], 
  "revision_id": "1634459"
 }
]