[
 {
  "author": "lehmi", 
  "date": "2014-11-01T09:08:19.097613Z", 
  "msg": [
   "PDFBOX-2468: switch FDFDocument to NonSequentialParser, enable FDF support within NonSequentialParser"
  ], 
  "revision_id": "1635903"
 }, 
 {
  "author": "jacopoc", 
  "date": "2014-11-01T09:07:09.486301Z", 
  "msg": [
   "Remove json-integration-refactoring branch, reintegrated with trunk in rev. 1635901"
  ], 
  "revision_id": "1635902"
 }, 
 {
  "author": "jacopoc", 
  "date": "2014-11-01T09:06:42.553421Z", 
  "msg": [
   "Merged json-integration-refactoring into trunk:", 
   "* moved the json-lib jar (json-lib-2.2.3-jdk15.jar) from the framework/webapp to the framework/base component", 
   "* removed the SQL select Parser.jj (parser definition) and its unit tests: it was not used (and never used) by any OFBiz code", 
   "* removed the JSON.jj (parser definition) and its unit tests: it was not used (and never used) by any OFBiz code apart from the JSON Converters (now migrated to json-lib, see next items in this list) some utility methods in UtilIO.java (that have been removed too because they have never been used in OFBiz)", 
   "* removed the JavaCC jar and related ant scripts because no more needed after the removal of Parser.jj and JSON.jj", 
   "* converted the JSONConverter code that was based on JSON.jj to Jackson", 
   "* added a new class org.ofbiz.base.lang.JSON that have been contributed by Adrian Crum that is a facade for simplifying the client code and for hiding the specific JSON library being used", 
   "* removed an unused method: ImageManagementServices.toJsonObject(...)", 
   "* added TestBooleanConverters to the list of tests", 
   "* new unit tests for the new JSON converters", 
   "* refactored Ajax code in applications to use the common request json response rather than a custom method", 
   "* OFBIZ-5790 Implemented ability to call a service event by passing its input parameters in the request body as JSON data. These classes provide a simple mechanism, based on the request's content type, that can be extended to support other formats (e.g. XML).", 
   "This commit resolves OFBIZ-4572, OFBIZ-3365, OFBIZ-5751, OFBIZ-5790"
  ], 
  "revision_id": "1635901"
 }, 
 {
  "author": "spamassassin_role", 
  "date": "2014-11-01T08:50:39.163386Z", 
  "msg": [
   "promotions validated"
  ], 
  "revision_id": "1635900"
 }, 
 {
  "author": "spamassassin_role", 
  "date": "2014-11-01T08:50:02.232826Z", 
  "msg": [
   "promotions validated"
  ], 
  "revision_id": "1635899"
 }
]