[
 {
  "author": "seanfinan", 
  "date": "2014-11-04T16:08:25.444039Z", 
  "msg": [
   "Slight restructuring, including the addition of \"small\" and \"tiny\" list versions.  These do not actually create \"tiny\" databases - to do that you'd need to do something like select fewer or different tuis OR use cmd parameters to increase the minimum text character length, decrease the maximum word token length, disable abbreviation extraction, etc.  They do, however, remove some text extraction in favor of text ignorance.  The reduction in text count, cui count, and db MB is roughly 5%, but mostly fat trimming."
  ], 
  "revision_id": "1636628"
 }, 
 {
  "author": "stefan2", 
  "date": "2014-11-04T16:07:33.485639Z", 
  "msg": [
   "Sync FSX with FSFS:  Merge assorted fixes and improvements from libsvn_fs_fs", 
   "and resolve the usual conflicts with FSX.  The merged revisions are:", 
   "r1605633 - remove obsolete race handling between 'hotcopy' and 'pack'", 
   "r1616613 - improve config file documentation", 
   "r1620930 - reintroduce SVN_FS_FS__USE_LOCK_MUTEX conditional flag", 
   "r1622946 - fix rev/pack file open retry after pack", 
   "r1623368 - factor out some common code into svn_fs_fs__packed_base_rev()", 
   "r1623381 - bump instance ID upon recover", 
   "r1623402 - don't use instance IDs as part of the cache keys", 
   "r1626246 - fix some compiler warnings", 
   "r1627949 - make sure to detect format upgrades before committing", 
   "r1628161 - add missing error tracing", 
   "r1628393, r1628415 - fix compiler warnings in index.c", 
   "r1632908 - fix error leak"
  ], 
  "revision_id": "1636627"
 }, 
 {
  "author": "nick", 
  "date": "2014-11-04T16:03:25.195555Z", 
  "msg": [
   "More disabled unit tests relating to external workbook formula references"
  ], 
  "revision_id": "1636626"
 }, 
 {
  "author": "milamber", 
  "date": "2014-11-04T16:03:01.097929Z", 
  "msg": [
   "Update screenshots in changes for next version 2.12", 
   "Bugzilla Id: 57183"
  ], 
  "revision_id": "1636625"
 }, 
 {
  "author": "cwiklik", 
  "date": "2014-11-04T16:02:20.346402Z", 
  "msg": [
   "UIMA-4087 modified to copy jars to known location before tests are run"
  ], 
  "revision_id": "1636624"
 }
]