[
 {
  "author": "jfthomps", 
  "date": "2014-11-03T20:47:20.545651Z", 
  "msg": [
   "VCL-776 - rework resource code to have a base class for all resources and inheriting classes for each resource type", 
   "updated confirm delete of resource to have user friendly field names and values", 
   "resource.php: modified AJpromptToggleDeleteResource: send array of field/name/value combinations instead of just html so that javascript function that generates user friendly values can be called on the values", 
   "image.js: modified colformatter: added conditional for maxinitialtime", 
   "resources.js: modified toggleDeleteResourceCB: generate html table for names/values from array instead of just using passed in html; join with passed in html when displaying so that data passed in via toggleDeleteResourceExtra gets displayed"
  ], 
  "revision_id": "1636438"
 }, 
 {
  "author": "adrianc", 
  "date": "2014-11-03T20:46:34.988434Z", 
  "msg": [
   "Extract rendering code from ModelForm.java to rendering classes."
  ], 
  "revision_id": "1636437"
 }, 
 {
  "author": "tripod", 
  "date": "2014-11-03T20:45:02.225385Z", 
  "msg": [
   "JCRVLT-64 Nodes that have a user parent are not installed if they are in the same .content.xml as their parent", 
   "- fixing case when installing content below a user that does not exist"
  ], 
  "revision_id": "1636436"
 }, 
 {
  "author": "tn", 
  "date": "2014-11-03T20:37:24.916106Z", 
  "msg": [
   "Change recently added method to package private to avoid a Clirr error. Fix typos."
  ], 
  "revision_id": "1636435"
 }, 
 {
  "author": "jfthomps", 
  "date": "2014-11-03T20:33:58.387246Z", 
  "msg": [
   "minor changes", 
   "utils.php:", 
   "-modified abort: if $errcode == 8 (login problem) replace the password argument with *******", 
   "-modified getDojoHTML: added \"?v=$v\" to end of custom dojo file script include (was having problems with users using an older cached version of the file after doing an upgrade)", 
   "requests.php and requests.js: fixed typo (newReservationHTML and selectResType) changed indefinteend to indefiniteend"
  ], 
  "revision_id": "1636434"
 }
]