[
 {
  "author": "jdcasey", 
  "date": "2005-04-05T02:47:43.000000Z", 
  "msg": [
   "Clean-ups. Reporters only write on error/warn...since info no longer exists, and file opening is lazy now.", 
   "Also, cleaner now checks to make sure the target file is missing and/or out of date before processing the source file. This should allow us to avoid reprocessing the whole source repo every time."
  ], 
  "revision_id": "163774"
 }, 
 {
  "author": "brett", 
  "date": "2005-04-05T01:58:33.000000Z", 
  "msg": [
   "use a local snapshot if its file timestamp is newer than the remote timestamp inside the version file. This opens us back up to clock skew again, but should be preferential to local snapshots and less confusing"
  ], 
  "revision_id": "163773"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-04T21:32:53.000000Z", 
  "msg": [
   "o Simplified the ResourcesMojo to eliminate the need for a ResourceEntry class, which is easily replaced by usage of a TreeMap (avoid the NoClassDefFoundError from before SEE MNG-243)", 
   "o Changed the references to repo1.maven.org for central repository to repo1.maven.org/maven2 in preparation for switchover to ibiblio.org", 
   "This will allow us to transparently switch between redirects and CNAME changes for referencing ibiblio.org, since ibiblio will not allow a", 
   "vhost for m2 or a rewrite rule...switching the URL for the repo will allow changes to the CNAME (satisfy ibiblio's pathing) while at the same", 
   "time allowing the use of redirects (redirect can be at /maven2/index.html rather than /index.html, f.e.)."
  ], 
  "revision_id": "163772"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-04T21:26:20.000000Z", 
  "msg": [
   "Added waitFor() call so avoid a race condition between chmod'ing the m2 script and trying to use it. Should impose little or no performance penalty on the bootstrap process."
  ], 
  "revision_id": "163771"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-04T20:45:24.000000Z", 
  "msg": [
   "o Adding checklist for deploying the repository layout/pom style changes in advance of a m2 alpha-1 rollout."
  ], 
  "revision_id": "163770"
 }
]