[
 {
  "author": "ashish", 
  "date": "2014-11-15T05:15:17.866671Z", 
  "msg": [
   "Applied bug fix from jira issue OFBIZ-5854 - Order On Hold Auto Approves When Edited.", 
   "Thanks Vikas for creating the issue and thanks Akash for verification."
  ], 
  "revision_id": "1639833"
 }, 
 {
  "author": "jhyde", 
  "date": "2014-11-15T04:17:59.699155Z", 
  "msg": [
   "Calcite release 0.9.2"
  ], 
  "revision_id": "1639832"
 }, 
 {
  "author": "ate", 
  "date": "2014-11-15T04:10:09.741261Z", 
  "msg": [
   "SCXML-222: Add support for executing the SCXML IRP test cases"
  ], 
  "revision_id": "1639831"
 }, 
 {
  "author": "ate", 
  "date": "2014-11-15T03:48:38.000568Z", 
  "msg": [
   "SCXML-221: Implementation of the SCXML specification required support for the \"null\" datamodel"
  ], 
  "revision_id": "1639830"
 }, 
 {
  "author": "ate", 
  "date": "2014-11-15T03:07:58.356105Z", 
  "msg": [
   "SCXML-213: Fixing the datamodel handling and bringing it more in line with the SCXML specification", 
   "This is a very large commit as so many of the needed changes turned out to be interdependent,", 
   "and committing these in separate logical steps simply wouldn't work without complete intermediate breakage of the build.", 
   "For background and more high-level details concerning these changes, see: https://issues.apache.org/jira/browse/SCXML-213", 
   "Important new features and changes:", 
   "- complete replacing the JAXP xpath usage with Commons JXPath", 
   "- re-implement the xpath Data() builtin function and introducing the xpath Location() builtin function", 
   "- simplify (strip) the corresponding Builtin class and adding the XPathBuiltin to handle the xpath specific features separately", 
   "- extend the Evaluator interface and corresponding language specific implementations to support all the SCXML spec <assign> xpath requirements using the XPathEvaluator", 
   "- complete the <send> action implementation proper, and the default SimpleDispatcher implementation with it (dropping the SimpleScheduler)", 
   "- implement the SCXML spec requirements for the _ioprocessors services lookup and proper handling of internal/external SCXML I/O Event Processors", 
   "- also largely improve the <invoke> implementation and execution, although there remains several things TODO for it to be fully SCXML spec compliant"
  ], 
  "revision_id": "1639829"
 }
]