[
 {
  "author": "chetanm", 
  "date": "2014-11-20T11:29:18.956489Z", 
  "msg": [
   "OAK-2278 - Same Lucene index to support both property restrictions and fulltext constraints (WIP)", 
   "* Restrict LuceneIndex to work with V1 format and LucenePropertyIndex to work", 
   "with V2 onwards", 
   "* Testcase currently specify compatVersion to ensure that LuceneIndex gets used.", 
   "This is required because testcase create a fresh index and by default fresh index", 
   "are always created to support latest version. In actual case (upgrade) LuceneIndex", 
   "would anyway be used as for existing index compatible format is used", 
   "As we enable support for fulltext in LucenePropertyIndex this compat mode would be", 
   "removed"
  ], 
  "revision_id": "1640723"
 }, 
 {
  "author": "chetanm", 
  "date": "2014-11-20T11:29:02.728379Z", 
  "msg": [
   "OAK-2272 - Compatibility support for pre index rule configuration", 
   "Add a 'compatVersion' property to force usage of specific index format version. This is done to ensure that current test work untill OAK-2278 is done"
  ], 
  "revision_id": "1640722"
 }, 
 {
  "author": "rafabene", 
  "date": "2014-11-20T11:20:14.747199Z", 
  "msg": [
   "Site checkin for project Apache DeltaSpike - Documentation"
  ], 
  "revision_id": "1640721"
 }, 
 {
  "author": "olli", 
  "date": "2014-11-20T11:00:06.157624Z", 
  "msg": [
   "SLING-3027 use latest releases (Sling Engine, Sling Servlets Resolver)"
  ], 
  "revision_id": "1640720"
 }, 
 {
  "author": "jleroux", 
  "date": "2014-11-20T10:51:50.915555Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 1640717\"", 
   "------------------------------------------------------------------------", 
   "r1640717 | jleroux | 2014-11-20 11:49:56 +0100 (jeu. 20 nov. 2014) | 1 ligne", 
   "At r1639887 I forgot to put the content of templateContext in the local tempTemplateContext. Thanks to Deepak for spotting it.", 
   "------------------------------------------------------------------------", 
   "?\\026"
  ], 
  "revision_id": "1640719"
 }
]