[
 {
  "author": "brane", 
  "date": "2014-11-21T07:50:38.680662Z", 
  "msg": [
   "* autogen.sh: Fix typo; remove double slash from constructed path."
  ], 
  "revision_id": "1640873"
 }, 
 {
  "author": "chetanm", 
  "date": "2014-11-21T07:47:41.485311Z", 
  "msg": [
   "OAK-2283 - Fix inconsistent handling of includedPropertyTypes", 
   "Adding experimental support for propertyType restriction in property definition. This is mostly for existing testcase. In general fulltext index case rule level setting for 'includePropertyTypes' would be sufficient", 
   "LuceneIndexEditor", 
   "* Fixed the editor to not evaluate property type restriction on its", 
   "own and instead rely in IndexingRule", 
   "* Removed TODO related to Analyzed field should be stored against", 
   "different field name as that has already been done with OAK-2280"
  ], 
  "revision_id": "1640872"
 }, 
 {
  "author": "chetanm", 
  "date": "2014-11-21T07:47:27.691675Z", 
  "msg": [
   "OAK-2278 - Make current testcases pass with new index implementation", 
   "Add support for detecting which queries can never be handled by the LuceneIndex (with current design so far). For example queries involving node name, OR conditions etc. In such case with testMode enabled it should not throw exception"
  ], 
  "revision_id": "1640871"
 }, 
 {
  "author": "chetanm", 
  "date": "2014-11-21T07:47:17.377464Z", 
  "msg": [
   "OAK-2278 - Make current testcases pass with new index implementation", 
   "Refactor the testcase to use LucenePropertyIndex.  Currently testLucene3 is ignored due to OAK-2283 as type based exclusion is currently not supported for property index", 
   "LuceneIndexHelper - Allow null for async. This is only done for testcase to ensure lucene index can be used in sync mode. For production code it should be set to 'async'. Hence @Nonnull annotation is retained"
  ], 
  "revision_id": "1640870"
 }, 
 {
  "author": "chetanm", 
  "date": "2014-11-21T07:47:03.905275Z", 
  "msg": [
   "OAK-2277 - Field for analyzed field should use different name", 
   "Fix the testcase to use the new naming scheme"
  ], 
  "revision_id": "1640869"
 }
]