[
 {
  "author": "covener", 
  "date": "2014-12-05T13:41:31.145514Z", 
  "msg": [
   "Merge r1643277 from trunk:", 
   "add some hints about using expressions in mod_headers"
  ], 
  "revision_id": "1643278"
 }, 
 {
  "author": "covener", 
  "date": "2014-12-05T13:41:05.079233Z", 
  "msg": [
   "add some hints about using expressions in mod_headers"
  ], 
  "revision_id": "1643277"
 }, 
 {
  "author": "aconway", 
  "date": "2014-12-05T13:39:28.103320Z", 
  "msg": [
   "QPID-6252: AMQP 1.0 browsing client generates large number of errors on broker (better fix)", 
   "This is a simpler and better fix based on the discussion at:", 
   "http://qpid.2158936.n2.nabble.com/Re-svn-commit-r1642720-in-qpid-trunk-qpid-cpp-src-qpid-messaging-amqp-AddressHelper-h-ConnectionConth-td7617083.html", 
   "The changes are all client-side:", 
   "- A browsing address is unreliable by default. An explicit reliability setting is respected.", 
   "- The client session does not record pre-settled deliveries in it's unacked list.", 
   "So by default:", 
   "- Browsing links are unreliable. Broker sends pre-settled, messages are not recorded in unacked list.", 
   "- The user is not required to acknowledge browsed messages for proper clean-up.", 
   "- Calling acknowledge() for a browsed message is a no-op, not an error.", 
   "If the user explicitly requests a reliable browsing link, then we behave exactly as before.", 
   "I can't see any value in doing this with qpidd but maybe with some other broker there might be", 
   "a use for being able to control the accept of browsed messages.", 
   "This does affect non-browsing, unreliable links but it is an improvement.", 
   "Settling a pre-settled messages is a no-op, so there is no point in recording", 
   "pre-settled messages in the unacked list since we do nothing when they are", 
   "acknoweldged."
  ], 
  "revision_id": "1643276"
 }, 
 {
  "author": "aconway", 
  "date": "2014-12-05T13:39:23.509371Z", 
  "msg": [
   "Revert \"QPID-6252: AMQP 1.0 browsing client generates large number of errors on broker.\"", 
   "This reverts commit 78d7f0727227f13da826180b2fe98f799160a93a."
  ], 
  "revision_id": "1643275"
 }, 
 {
  "author": "markt", 
  "date": "2014-12-05T13:35:52.676536Z", 
  "msg": [
   "Possible fix for https://issues.apache.org/bugzilla/show_bug.cgi?id=57265"
  ], 
  "revision_id": "1643274"
 }
]