[
 {
  "author": "markt", 
  "date": "2014-12-05T15:18:46.462825Z", 
  "msg": [
   "Replace System.getProperty(\"line.separator\") with System.lineSeparator()"
  ], 
  "revision_id": "1643323"
 }, 
 {
  "author": "krosenvold", 
  "date": "2014-12-05T15:18:03.989037Z", 
  "msg": [
   "[MASSEMBLY-741] wrong paths in file-modes tests", 
   "Patch by Sven Meier, applied unmodified"
  ], 
  "revision_id": "1643322"
 }, 
 {
  "author": "dsmiley", 
  "date": "2014-12-05T15:17:18.321642Z", 
  "msg": [
   "LUCENE-6034: Highlighter QueryScorer/WeightedSpanTermExtractor shouldn't re-invert a term vector based TokenStream. It can now highlight payload-sensitive queries."
  ], 
  "revision_id": "1643321"
 }, 
 {
  "author": "danhaywood", 
  "date": "2014-12-05T15:15:05.098955Z", 
  "msg": [
   "new page on suppressing contributions"
  ], 
  "revision_id": "1643320"
 }, 
 {
  "author": "aconway", 
  "date": "2014-12-05T15:12:53.270912Z", 
  "msg": [
   "DISPATCH-80: Management schema: implement annotations and entity inheritance as per AMQP management WD 09", 
   "Renamed \"includes\" as \"annotations\" - The AMQP management 09 draft introduces annotations", 
   "which serve exactly the same function as our includes, so renamed according to the standard.", 
   "Introduced entity inheritance and created the following hierarchy among entity types:", 
   "\"entity\": the base of all entity types.", 
   "- \"configurationEntity\": base for all types that hold configuration information.", 
   "- \"operationalEntity\": base for all types that hold operational information.", 
   "\"Configuration\" information is supplied in advance and expresse intent. For", 
   "example \"I want the router to listen on port N\", or, \"I want the router to", 
   "connect to this address\" All the entities that can be used in the configuration", 
   "file are \"configurationEntity\".", 
   "\"Operational\" information reflects the actual state of the router at a given", 
   "moment in time.  For example, \"how many addresses are presently active on the", 
   "router?\" All the entities queried by qdstat are \"operationalEntity\".", 
   "The two types are often related, for example \"I want an on-demand connection to", 
   "this address\" and \"is there presently a live outgoing connection to this", 
   "address?\"  As a matter of good practice we separate the two kinds of", 
   "entities. For example \"listener\" and \"connector\" are configuration entities", 
   "expressing the intent to make or receive connectoins. The \"connection\" entity", 
   "holds live operational information about an actual connection.", 
   "- Fixed man pages and configuration to use new hierarchy.", 
   "- Fixed use of \"connection\" as both annotation and entity type name.", 
   "- Implemented GET-ANNOTATIONS and GET-TYPES to return annotations and bases."
  ], 
  "revision_id": "1643319"
 }
]