[
 {
  "author": "jfthomps", 
  "date": "2014-12-11T16:01:45.562118Z", 
  "msg": [
   "VCL-780 - combine new reservation and current reservations pages", 
   "requests.php:", 
   "-modified viewRequests: added 'notbyowner' variable to AJconfirmDeleteRequest continuation so it will prompt with the owner of the reservation instead of assuming the user is the owner; added dijit Dialog for prompting users when attempting to delete a server reservation owned by another user to make it clear that someone else owns it", 
   "-modified AJconfirmDeleteRequest: if user is not owner, return status to have user prompted that someone else owns the reservation", 
   "requests.js:", 
   "-modified endReservation: save passed in continuation in hidden form element so it can be reused when prompting user about deleting server reservation owned by another user", 
   "-added endServerReservation", 
   "-modified endReservationCB: if status is 'serverconfirm', prompt user that someone else owns the reservation; if prompt is open, hide it and enable the Confirm Delete button"
  ], 
  "revision_id": "1644688"
 }, 
 {
  "author": "arkurth", 
  "date": "2014-12-11T16:01:36.686599Z", 
  "msg": [
   "VCL-179", 
   "Updated VMware.pm to allow a powered off VM to be captured. Updated get_active_vmx_file_path to return the path of a powered off VM if:", 
   "-no powered on VMs were found with matching MAC addresses", 
   "-a singled powered off VM was found with matching MAC addresses", 
   "Removed calls to is_ssh_responding and write_currentimage_txt in capture. These is handled by the OS module."
  ], 
  "revision_id": "1644687"
 }, 
 {
  "author": "sebb", 
  "date": "2014-12-11T15:59:13.069889Z", 
  "msg": [
   "Simplify by using common test method"
  ], 
  "revision_id": "1644686"
 }, 
 {
  "author": "sebb", 
  "date": "2014-12-11T15:58:34.450791Z", 
  "msg": [
   "Need to check all significant units are set ..."
  ], 
  "revision_id": "1644685"
 }, 
 {
  "author": "aconway", 
  "date": "2014-12-11T15:51:01.994854Z", 
  "msg": [
   "DISPATCH-82: Poor error handling by qdmanage and qdstat tools.", 
   "Fixed error handling for qd tools as follows:", 
   "- Forked future proton reactor work into qpid_dispatch.internal.proton_future", 
   "- Added proton_future.util.SyncRequestResponse to implement request-response pattern", 
   "- Updated qpid_dispatch.management.client to use SyncRequestResponse", 
   "When the reactor work has made it into a proton release, the proton_future package", 
   "should be removed."
  ], 
  "revision_id": "1644684"
 }
]