[
 {
  "author": "khmarbaise", 
  "date": "2014-12-12T20:18:48.032690Z", 
  "msg": [
   "[MEAR-182] Skinny WAR's - Skip Class-Path Modification in Manifest", 
   "Applied patch of Mario Däpp with slight enhancement by using the", 
   "option skipClassPathModification which is defined to true", 
   "by default to keep backward compatibility."
  ], 
  "revision_id": "1645058"
 }, 
 {
  "author": "arkurth", 
  "date": "2014-12-12T20:17:47.093050Z", 
  "msg": [
   "VCL-174", 
   "Changed iptables.pm::initialize to only check for the iptables command, not the service. The command can be used if firewalld is used.", 
   "Updated configure_nat to figure out the internal network address and network bits. The MASQUERADE rule was tightened so that it matches only if the destination address is not on the internal network to allow things to work if the public and internal networks are using the same interface.", 
   "Added check to Windows.pm::grant_access when process_connect_methods is called. It was not returning if process_connect_methods failed. As a result, the reservation did not fail when it should have.", 
   "Other", 
   "Updated Linux.pm::update_public_hostname. It was generating unnecessary warnings if the public IP address did not resolve. Added utils.pm::ip_address_to_hostname. This is called by update_public_hostname instead of running ipcalc. If the hostname can't be resolved the hostname is set to the name in the VCL database.", 
   "Updated Linux.pm::set_static_public_address to continue to try to set the default route even if the IP address is correct to begin with."
  ], 
  "revision_id": "1645057"
 }, 
 {
  "author": "cheolsoo", 
  "date": "2014-12-12T20:15:26.899181Z", 
  "msg": [
   "PIG-4066: An optimization for ROLLUP operation in Pig (cheolsoo)"
  ], 
  "revision_id": "1645056"
 }, 
 {
  "author": "mikem", 
  "date": "2014-12-12T20:13:25.338895Z", 
  "msg": [
   "DERBY-6774 background post commit threads cause ASSERTS/errors on interaction with alter table add column", 
   "Renable the tests that were failing on some platforms, and adds tests that", 
   "were failing consistently in my environment (laptop, windows 7, ibm17).", 
   "The fix was to insure that background threads waited on table intent lock", 
   "before going to the conglomerate cache.", 
   "Before doing this an inconsistent conglomerate would sometimes be faulted into", 
   "the cache between time when alter table abort was invalidating the cache and", 
   "abort had finished backing out the alter table. Then a subsequent alter table", 
   "would fail as it correctly passed in that there was 1 existing column, but the", 
   "conglomerate cache thought there were 2 columns."
  ], 
  "revision_id": "1645055"
 }, 
 {
  "author": "brock", 
  "date": "2014-12-12T20:01:04.173802Z", 
  "msg": [
   "HIVE-6623 - Add \"owner\" tag to ptest2 created instances (Brock reviewed by Szehon)"
  ], 
  "revision_id": "1645054"
 }
]