[
 {
  "author": "jbonofre", 
  "date": "2014-12-12T18:21:11.081005Z", 
  "msg": [
   "[maven-release-plugin] prepare release org.apache.servicemix.bundles.spring-jms-4.1.0.RELEASE_3"
  ], 
  "revision_id": "1645018"
 }, 
 {
  "author": "jfthomps", 
  "date": "2014-12-12T18:20:12.665499Z", 
  "msg": [
   "VCL-780 - combine new reservation and current reservations pages", 
   "fixed a problem where when the Reservations page is initially loaded, an image only has 1 revision. So, the data for imagestore contains 'revisions' = 0. However, if a user creates a new revision and never leaves the page, once the revision has been captured, the user will not be prompted to select a revision. Fixed this by setting 'revisions' in imagestore for the image to 1. There is a problem that needs to be fixed later where the new revision will not show up in the prompting until it is finished and has 'deleted' set to 0. This results in a user being prompted to select a revision when only 1 revision exists until the catpure is finished.", 
   "image.php: modified AJupdateImage: send imageid back with returned data", 
   "requests.php: modified newReservationHTML: changed imagestore from ItemFileReadStore to ItemFileWriteStore so we can change the value of 'revisions'", 
   "image.js: modified submitUpdateImageClickthroughCB: update value of 'revisions' for entry in imagestore to = 1 so that user will get prompted to select an image revision"
  ], 
  "revision_id": "1645017"
 }, 
 {
  "author": "tilman", 
  "date": "2014-12-12T18:18:31.855375Z", 
  "msg": [
   "PDFBOX-2559: Fix -ttf option, as done by John Hewson in the trunk"
  ], 
  "revision_id": "1645016"
 }, 
 {
  "author": "markt", 
  "date": "2014-12-12T18:18:30.478841Z", 
  "msg": [
   "Follow on to r1642702", 
   "Only currently running contexts should be returned.", 
   "Handle the case where the mapper returns an unwanted non-exact match."
  ], 
  "revision_id": "1645015"
 }, 
 {
  "author": "markt", 
  "date": "2014-12-12T18:14:28.563509Z", 
  "msg": [
   "Whoops. Null check."
  ], 
  "revision_id": "1645014"
 }
]