[
 {
  "author": "brock", 
  "date": "2014-12-12T21:07:45.357622Z", 
  "msg": [
   "HIVE-9092 - Change Hadoop version on HIVE-8065 to 2.6.0 (Sergio Penia via Brock)"
  ], 
  "revision_id": "1645073"
 }, 
 {
  "author": "jahewson", 
  "date": "2014-12-12T21:02:49.112621Z", 
  "msg": [
   "PDFBOX-2524: Refactor common functionality of PDTrueTypeFont into super class"
  ], 
  "revision_id": "1645072"
 }, 
 {
  "author": "xuefu", 
  "date": "2014-12-12T20:56:35.918526Z", 
  "msg": [
   "HIVE-9079: Hive hangs while failed to get executorCount[Spark Branch] (Chengxiang via Xuefu)"
  ], 
  "revision_id": "1645071"
 }, 
 {
  "author": "aconway", 
  "date": "2014-12-12T20:56:28.045705Z", 
  "msg": [
   "NO-JIRA: Avoid use of GNU extension ## comma deletion.", 
   "The following idiom is GNU C specific:", 
   "-#define log(fmt, ...)", 
   "-            log_impl(fmt , ##__VA_ARGS__);", 
   "The use of ## after a comma deletes the comma if __VA_ARGS__ is empty, so the above works", 
   "even if there is no argument after fmt.", 
   "The following is more portable:", 
   "+#define log(...)", 
   "+            log_impl(__VA_ARGS__);", 
   "Now fmt is included in the variadic argument list so it is never empty.  This is", 
   "slightly less self-descriptive since it doesn't correspond as well to the", 
   "signature of log_impl(fmt, ...), but it is standard C99."
  ], 
  "revision_id": "1645070"
 }, 
 {
  "author": "jfthomps", 
  "date": "2014-12-12T20:55:14.685795Z", 
  "msg": [
   "VCL-776 - rework resource code to have a base class for all resources and inheriting classes for each resource type", 
   "added a function to all resources (except computer) to check for resource usage before prompting to confirm deleting it", 
   "computer.php: modified AJdeleteComputers: added query to check usage in blockComputers", 
   "image.php: added checkResourceInUse: checks for image usage in reservation, blockComputers, blockRequest, serverprofile, subimages, and vmprofile", 
   "managementnode.php: added checkResourceInUse: check for managment node usage in reservations and blockRequest", 
   "resource.php:", 
   "-modified AJpromptToggleDeleteResource: added call to checkResourceInUse before prompting to confirm deleting resource", 
   "-added checkResourceInUse stub function", 
   "schedule.php: added checkResourceInUse: check for schedule usage in computer table", 
   "resources.js: modified toggleDeleteResourceCB: if status is 'inuse' create dialog to display message to user about resource being in use"
  ], 
  "revision_id": "1645069"
 }
]