[
 {
  "author": "jfthomps", 
  "date": "2014-12-18T19:43:14.816029Z", 
  "msg": [
   "VCL-174 - NAT - support for sites that have small IP address ranges", 
   "added NAT host section to add/edit management node", 
   "utils.php: modified getManagementNodes: added nathostenabled, natpublicIPaddress, and natinternalIPaddress to returned data", 
   "managementnode.php:", 
   "-modified addEditDialogHTML: added form fields for nathostenabled, natpublicipaddress, and natinternalipaddress", 
   "-modified AJsaveResource: removed previous code that modified nathost table; added new code to handle entries from form fields for nathost table", 
   "-modified validateResourceData: added nathostenabled, natpublicIPaddress, and natinternalIPaddress to validated and returned fields", 
   "-modified addResource: removed previous code that modified nathost table; added new code to handle entries from form fields for nathost table", 
   "computer.php: modified validateResourceData: added conditional for nathostenabled being 1 in order to validate natpublicIPaddress and natinternalIPaddress; removed resource table from query that checks for reservations for computers using this computer as a nat host", 
   "managementnode.js:", 
   "-modified addNewResource: added initialization for nathostenabled, natpublicipaddress, and natinternalipaddress", 
   "-added toggleNAThost", 
   "-modified inlineEditResourceCB: added code to handle nathostenabled, natpublicipaddress, and natinternalipaddress", 
   "-modified resetEditResource: added natpublicipaddress natinternalipaddress to list of fields", 
   "-modified saveResource: added natpublicipaddress natinternalipaddress to list of fields; added nathostenabled to data submitted", 
   "computer.js: modified addNewResource: initialize nathostenabled to false"
  ], 
  "revision_id": "1646518"
 }, 
 {
  "author": "kaspersor", 
  "date": "2014-12-18T19:36:47.278248Z", 
  "msg": [
   "CMS commit to metamodel by kaspersor"
  ], 
  "revision_id": "1646517"
 }, 
 {
  "author": "arkurth", 
  "date": "2014-12-18T19:26:20.796637Z", 
  "msg": [
   "VCL-16", 
   "Updated code which inserts computerloadlog 'acknowledgetimeout', 'initialconnecttimeout' and 'reconnecttimeout' so the the timestamp of these entries is used to determine when to stop checking for ack or connection.", 
   "Removed condition in utils.pm::check_time where it would return 'poll' whenever request.laststate = reserved. This is no longer necessary.", 
   "Moved initial connection check from inuse.pm to reserved.pm. This fixed problems where the state was left in inuse/inuse after the first connection check causing the computer to always be reloaded.", 
   "Moved user_connected and check_imaging_request subroutines from inuse.pm to State.pm since it is now used by both inuse.pm and reserved.pm.", 
   "VCL-174", 
   "Removed computer IP address from email messages sent to users. This information would not be accurate when NAT is used.", 
   "Other", 
   "Cleaned up utils.pm::insertloadlog."
  ], 
  "revision_id": "1646516"
 }, 
 {
  "author": "tross", 
  "date": "2014-12-18T19:23:27.308377Z", 
  "msg": [
   "NO-JIRA - Removed unneeded Management Url test"
  ], 
  "revision_id": "1646515"
 }, 
 {
  "author": "jfthomps", 
  "date": "2014-12-18T19:09:20.219087Z", 
  "msg": [
   "VCL-16 - Enhance cluster reservation process", 
   "requests.php: modified AJconnectRequest: removed updating of lastcheck; this was in place for the backend to quickly pick up when a user clicks Connect; backend behaviour has changed and it is no longer needed"
  ], 
  "revision_id": "1646514"
 }
]