[
 {
  "author": "philip", 
  "date": "2014-12-17T13:39:18.704905Z", 
  "msg": [
   "* subversion/libsvn_client/copy.c", 
   "(repos_to_repos_copy): Change 'already exists' error message to", 
   "include the full path in the repository rather than just the", 
   "basename as the basename can be confusing.", 
   "* subversion/tests/cmdline/copy_tests.py", 
   "(no_copy_overwrites): Require full path."
  ], 
  "revision_id": "1646233"
 }, 
 {
  "author": "mpetria", 
  "date": "2014-12-17T13:20:47.898489Z", 
  "msg": [
   "SLING-4153: adjusting osgi configs to dedicated factories"
  ], 
  "revision_id": "1646232"
 }, 
 {
  "author": "heneveld", 
  "date": "2014-12-17T13:15:05.744904Z", 
  "msg": [
   "copied across old versions, updated website in root from merged files, and added v/latest and 0.7.0-SNAPSHOT"
  ], 
  "revision_id": "1646231"
 }, 
 {
  "author": "julianfoad", 
  "date": "2014-12-17T13:12:06.982286Z", 
  "msg": [
   "In the svnsync tests, remove a load-and-dump cycle from the repository", 
   "comparison function.", 
   "The load-and-dump cycle was introduced in r1230676 to account for different", 
   "ordering of nodes in dumpfiles generated by different versions of", 
   "Subversion.", 
   "In r1292507 the test suite was changed to compare dumpfiles in parsed form,", 
   "to account for variable ordering of nodes produced by different runs of", 
   "Subversion. This makes the previous patch redundant.", 
   "Loading and dumping can change data in some cases -- for example 'load'", 
   "currently rewrites svn:mergeinfo -- and so could mask errors or cause errors", 
   "in certain tests. The current tests seem to be unaffected but it broke a", 
   "test that I am writing for issue #4476 \"Mergeinfo containing r0 makes", 
   "svnsync and dump and load fail\". That is not to say that comparing dumpfiles", 
   "in parsed form cannot also mask errors, but one procedure is better than", 
   "two.", 
   "* subversion/tests/cmdline/svnsync_tests.py", 
   "(verify_mirror): Take the expected dump file contents directly instead", 
   "of in a repository in a sandbox.", 
   "(run_test,", 
   "delete_revprops): Pass the expected dump file contents directly instead", 
   "of in a repository in a sandbox."
  ], 
  "revision_id": "1646230"
 }, 
 {
  "author": "olegk", 
  "date": "2014-12-17T13:06:01.889855Z", 
  "msg": [
   "Upgraded API baseline to 4.4"
  ], 
  "revision_id": "1646229"
 }
]