[
 {
  "author": "aconway", 
  "date": "2014-12-22T21:07:49.441342Z", 
  "msg": [
   "Logging improvements"
  ], 
  "revision_id": "1647403"
 }, 
 {
  "author": "arkurth", 
  "date": "2014-12-22T21:06:29.644211Z", 
  "msg": [
   "VCL-781", 
   "Added OS.minram column to database. Added explicit get_image_minram subroutine to DataStructure.pm which returns the larger of the image.minram and OS.minram values. Removed code from VMware.pm which determined minimum OS RAM values as it is now replaced by OS.minram."
  ], 
  "revision_id": "1647402"
 }, 
 {
  "author": "kelly", 
  "date": "2014-12-22T21:04:47.424563Z", 
  "msg": [
   "OODT-799 WIP maybe! This replaces distribute_setup with ez_setup and invokes it (more) correctly. It aslo ignores some of the downloaded artifacts and the generated doc.txt"
  ], 
  "revision_id": "1647401"
 }, 
 {
  "author": "radu", 
  "date": "2014-12-22T21:04:16.706551Z", 
  "msg": [
   "Updated website prototype", 
   "* removed LESS source files (we're now using a customised bootstrap)", 
   "* changed members files from YAML to JSON", 
   "* updated content", 
   "* updated provisioning to use newer releases for Ruby, Jekyll, Node.js"
  ], 
  "revision_id": "1647400"
 }, 
 {
  "author": "jfthomps", 
  "date": "2014-12-22T21:01:39.963095Z", 
  "msg": [
   "VCL-568 - refresh current reservations page 15 minutes after a reservation becomes available", 
   "requests.php:", 
   "-modified viewRequests: removed 'userconnected' from each entry in $requests, handling process a different way", 
   "-modified getViewRequestHTMLitem: changed how timeoutdata items are handled, base more things on entries in computerloadlog, if no entries in computerloadlog, refresh page after reconnecttimeout or at end of reservation, whichever is sooner; set id for each timeoutvalue based on request id", 
   "-modified AJconnectRequest: removed 'timeoutvalue' class from timeout, changed id from timeoutvalue to connecttimeout; switched to using getReservationNextTimeout instead of getReservationConnectTimeout; if timeout is not null, send it with returned data so javascript can update timeout value for reservation", 
   "-modified getReservationNextTimeout: changed connecttimeout to initialconnecttimeout, added reconnecttimeout, stopped using loadstate ids and added subquery to get ids from computerloadstate table based on the names", 
   "-removed getReservationConnectTimeout", 
   "-removed checkUserConnect", 
   "-modified addConnectTimeout: updated to get state id from computerloadstate based on state name instead of using id directly", 
   "requests.js:", 
   "-modified checkTimeouts: changed nextcheck to 15; delete timeoutvalue dom element when timeout expires; if no timeouts, set nextcheck to 60", 
   "-modified connectRequestCB: if timeoutid in data.items, update value to data.items.timeout", 
   "-modified checkConnectTimeout: if no connecttimeout object, return; updated to get value from connecttimeout instead of timeoutvalue; if value == 0, return; set value to 0 when expires before doing AJAX call"
  ], 
  "revision_id": "1647399"
 }
]