[
 {
  "author": "mikem", 
  "date": "2005-04-27T15:41:45.814556Z", 
  "msg": [
   "committing upgrade change related to DERBY-96 for suresh.thalamati.suresh.thalamati@gmail.com", 
   "Attached is the  new  patch  with the suggested changes to make", 
   "softupgrade correctly with the  transaction log", 
   "checksum feature in 10.1 Added  checkVersion() method  to log factory it", 
   "self,  becuase that is where", 
   "the  version numbers are read  from  from the log control file , but did", 
   "not export the call it to  the", 
   "rawstore factory  as it is not needed now.  (This can be done easlily", 
   "when there is a  need for upgrade", 
   "checks  in the other store modules..)"
  ], 
  "revision_id": "164994"
 }, 
 {
  "author": "jwkaltz", 
  "date": "2005-04-27T15:28:11.227711Z", 
  "msg": [
   "[minor change] added missing svn property"
  ], 
  "revision_id": "164993"
 }, 
 {
  "author": "jwkaltz", 
  "date": "2005-04-27T15:22:48.753610Z", 
  "msg": [
   "[minor change] fixed to use text in dictionary"
  ], 
  "revision_id": "164992"
 }, 
 {
  "author": "michi", 
  "date": "2005-04-27T15:12:58.686916Z", 
  "msg": [
   "show configuration of crawler fixed"
  ], 
  "revision_id": "164991"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-27T15:11:28.737489Z", 
  "msg": [
   "Modifying the mojo generators to handle alias, and other missing elements where appropriate. Changed the resources mojos to be as trim as I can, and added @required to the field-level annotations (this might be a good thing to do for all plexus components, dunno if it's there already)...finally, trimmed up the annotation handling in the JavaMojoDescriptorExtractor to push as many annotation fields as possible into the endangered area, and started pulling as much info from the field, other companion annotations on the field, etc. as I can...I think the annotations are there, now. They need to be cleaned up after converting all the core plugins to use field-level annotations, then we're set."
  ], 
  "revision_id": "164990"
 }
]