[
 {
  "author": "chetanm", 
  "date": "2015-01-04T09:08:47.797689Z", 
  "msg": [
   "SLING-3227 - FormLoginModulePlugin does not work with Oak", 
   "Updating the form auth bundle version to 1.0.7-SNAPSHOT"
  ], 
  "revision_id": "1649303"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-01-04T09:08:39.585957Z", 
  "msg": [
   "SLING-3227 - FormLoginModulePlugin does not work with Oak", 
   "Add FormLoginModule based on Oak support for JAAS authentication", 
   "-- FormAuthenticationHandler would use FormLoginModule or FormLoginModulePlugin depending on support for Oak LoginModule. This would enable use of same bundle in both Oak and JR2 based Sling deployments", 
   "-- For JAAS auth the handler would construct a FormCrendentials instance which is supported by FormLoginModule only. Once validated it would make use of Oak pre auth support to let Oak complete the JAAS login"
  ], 
  "revision_id": "1649302"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-01-04T09:08:25.595712Z", 
  "msg": [
   "SLING-4277 - Enable JAAS integration with Oak", 
   "-- Use SecurityProvider registered by Oak instead of instantiating a custom one", 
   "-- Add OSGi config to enable JR2 compatible config. This replaces the config as created in buildSecurityConfig", 
   "-- Replace the various login method with a single login method which is eventually called by RepositoryImpl", 
   "-- Add import for Felix JAAS package"
  ], 
  "revision_id": "1649301"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-01-04T09:08:10.935507Z", 
  "msg": [
   "SLING-3479 - Upgrade to Oak 1.0", 
   "Upgraded Oak to 1.0.9"
  ], 
  "revision_id": "1649300"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-01-04T09:08:03.309862Z", 
  "msg": [
   "SLING-4277 - Enable JAAS integration with Oak", 
   "-- Adding Felix JAAS bundle at start level 9. The start level needs to be lower than start level of Oak", 
   "-- Add config related to default LoginModules provided as part of Oak", 
   "-- Make use of Configuration SPI (OAK-2051). This would allow JAAS auth without switching TCCL"
  ], 
  "revision_id": "1649299"
 }
]