[
 {
  "author": "parker", 
  "date": "2005-04-27T21:08:43.357409Z", 
  "msg": [
   "Preparing for 3.0.3 Release"
  ], 
  "revision_id": "165049"
 }, 
 {
  "author": "trygvis", 
  "date": "2005-04-27T21:06:57.236196Z", 
  "msg": [
   "o Finalizing CONTINUUM-60.", 
   "o Added tests to the integration test.", 
   "o Removing \"ContinuumBuildResult.updatedFiles\", it's replaced with the UpdateScmResult."
  ], 
  "revision_id": "165048"
 }, 
 {
  "author": "kylem", 
  "date": "2005-04-27T20:46:49.339306Z", 
  "msg": [
   "Improved serializability checking of ControlImplementation classes, per http://issues.apache.org/jira/browse/BEEHIVE-351.  The basic rule is that a control impl can either be stateful (and serializable) or stateless.  Note: in the stateless case, bean properties may still be serialized;  the 'transient' nature of the impl refers only to nested implementation state, not property state.", 
   "The annotation processor for implementation will now require one of two things to be true for a ControlImplementation class:", 
   "- the impl class should implement the java.io.Serializable interface indicating that it is stateful and serializable.", 
   "- the impl class can set the (new) isTransient attribute of @ControlImplementation to indicate that the implementation is stateless and does not need to be persisted as part of the containing bean's state.  In this case, a new impl instance will be created upon demand after deserialization.", 
   "THIS CHECKIN WILL REQUIRE EXISTING CONTROL IMPLEMENTATIONS TO EITHER DECLARE THEY IMPLEMENT JAVA.IO.SERIALIZABLE OR HAVE @ControlImplementation(isTransient=true) IN THEIR DECLARATION.  I've fixed all samples and tests in the SVN tree to follow this rule, and Eddie has done the same for ControlHaus controls.", 
   "A seperate JIRA docs issue (http://issues.apache.org/jira/browse/BEEHIVE-558) has been opened to capture the fact that the programming model doc needs a better description of state handling for controls."
  ], 
  "revision_id": "165047"
 }, 
 {
  "author": "parker", 
  "date": "2005-04-27T20:46:09.763576Z", 
  "msg": [
   "Bug 4201: Do no lookup email addresses for URIBL tests"
  ], 
  "revision_id": "165046"
 }, 
 {
  "author": "djencks", 
  "date": "2005-04-27T20:43:57.669481Z", 
  "msg": [
   "repair security demo"
  ], 
  "revision_id": "165045"
 }
]