[
 {
  "author": "violetagg", 
  "date": "2015-01-14T07:41:59.392397Z", 
  "msg": [
   "Correct import order."
  ], 
  "revision_id": "1651578"
 }, 
 {
  "author": "cziegeler", 
  "date": "2015-01-14T07:34:49.917103Z", 
  "msg": [
   "SLING-4288 : JSONObject.toString() returns null when having a value of type map with a null value"
  ], 
  "revision_id": "1651577"
 }, 
 {
  "author": "misty", 
  "date": "2015-01-14T07:08:45.992397Z", 
  "msg": [
   "Published website using script in auto mode. This commit changed the size of the website by 4 MB and the number of files by 203 files.", 
   "The following directories (if any) might be stale:", 
   "The following files (if any) might be stale:", 
   "Not taking care of stale directories and files in auto mode.", 
   "If necessary, handle them in a manual commit."
  ], 
  "revision_id": "1651576"
 }, 
 {
  "author": "krosenvold", 
  "date": "2015-01-14T07:06:22.054371Z", 
  "msg": [
   "Added ZipArchiveEntryRequest class", 
   "ZipArchiveEntry is not thread safe, and the hand-off between the creating thread", 
   "and the executorService actually doing the compression has been somewhat of a", 
   "tightrope-walking effort, since we cannot reliably read fields off the ZipArchiveEntry", 
   "Furthermore, to achieve true maximum IO performance in the gather-phase it would", 
   "be required that Zip headers be created in the parallel part of the compression run,", 
   "which was not possible prior to this commit.", 
   "The ZipArchiveEntryRequest has clear and well-defined thread semantics and can cater", 
   "for any future algorithmic improvements that may want to try to take performance to the", 
   "very edge of what is achievable. To my understanding this will not be for this next", 
   "relasease :)"
  ], 
  "revision_id": "1651575"
 }, 
 {
  "author": "szehon", 
  "date": "2015-01-14T06:28:57.275168Z", 
  "msg": [
   "HIVE-9360 : TestSparkClient throws Timeoutexception (Szehon, reviewed by Brock)"
  ], 
  "revision_id": "1651574"
 }
]