[
 {
  "author": "jdcasey", 
  "date": "2005-04-28T23:05:01.892842Z", 
  "msg": [
   "o Cleaned up field-level annotation support (especially descriptor extraction, generation, and building)", 
   "o Converted all \"core\" plugins (including maven-core-it-plugin) to use field-level annotations", 
   "o Removed generation of parameter descriptors for ${/#component.* param specifications.", 
   "o Added @readonly for parameters that cannot be overridden by user configuration (List override was dangerous here)", 
   "o Added validation against pom-derived configuration for @readonly parameters", 
   "o Fixed @parameter alias=\"\" support...now configuration of the mojo instance actually will work with either the real param name or the alias. Would be nice to support multiple aliases, but that might require @alias annotations...", 
   "o Added [temporary?] support for null editable attributes for parameters, to support pre-built mojos from the repo.", 
   "Annotation support should be just about ready to go..."
  ], 
  "revision_id": "165224"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-04-28T23:03:55.060838Z", 
  "msg": [
   "Added the missing transition in the SPNEGO grammar for the NegTokenInit part.", 
   "The NegTokenTarg part is still to be added.", 
   "Actions are to be completed."
  ], 
  "revision_id": "165223"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-04-28T23:01:32.829312Z", 
  "msg": [
   "Modified the transitions and improved the getState function"
  ], 
  "revision_id": "165222"
 }, 
 {
  "author": "kentam", 
  "date": "2005-04-28T22:57:57.893941Z", 
  "msg": [
   "BEEHIVE-15: Refactor control compilation-time code to use TwoPhaseAnnotationProcessor", 
   "wrappers (or equiv) for diagnostics.", 
   "The Apt* class heirarchy now passes TwoPhaseAnnotationProcessor through its ctor chain, and uses", 
   "the TPAP.printError() helper to emit diagnostics.", 
   "All controls build-time diagnostic messages have been externalized into strings.properties for i18n", 
   "purposes."
  ], 
  "revision_id": "165221"
 }, 
 {
  "author": "stocco", 
  "date": "2005-04-28T22:52:27.912545Z", 
  "msg": [
   "Submission by Patrick Osborne.  Had extra \"{\" causing compile failure."
  ], 
  "revision_id": "165220"
 }
]