[
 {
  "author": "mridulpathak", 
  "date": "2015-01-17T15:48:18.426240Z", 
  "msg": [
   "[OFBIZ-3433] eCommerce main store front error returned when attempt is made to \"Sign Up For Contact List\" - as reported by Ruth. Not a service level bug but a UI issue. Email is a required input parameter in \"signUpForContactList\" service. Sign up form does have a field for email but has no label which is confusing to user, neither it is displayed as a required field. Applied patch from the issue to fix UI. Thanks Ruth for reporting the issue. Applying changes from trunk r1652627."
  ], 
  "revision_id": "1652628"
 }, 
 {
  "author": "mridulpathak", 
  "date": "2015-01-17T15:46:01.984296Z", 
  "msg": [
   "[OFBIZ-3433] eCommerce main store front error returned when attempt is made to \"Sign Up For Contact List\" - as reported by Ruth. Not a service level bug but a UI issue. Email is a required input parameter in \"signUpForContactList\" service. Sign up form does have a field for email but has no label which is confusing to user, neither it is displayed as a required field. Applied patch from the issue to fix UI. Thanks Ruth for reporting the issue."
  ], 
  "revision_id": "1652627"
 }, 
 {
  "author": "noble", 
  "date": "2015-01-17T15:40:41.450127Z", 
  "msg": [
   "SOLR-5147 addressing the OOM failures"
  ], 
  "revision_id": "1652626"
 }, 
 {
  "author": "pranayp", 
  "date": "2015-01-17T15:27:57.994167Z", 
  "msg": [
   "Applied bug fix from trunk r1652624.", 
   "=================================================================", 
   "Applied patch from jira issue OFBIZ-3563 which also resolves OFBIZ-2361. Creating a category with an ID (manually or automatically) that matches an existing productID will show the unrelated product when enter into the category on the 'Browse category' of the Ecommerce application.", 
   "Thanks  Jonatan Soto  and Rohit Sureka for reporting the issue. Thanks Divesh Dutta for providing patch for the fix.", 
   "================================================================="
  ], 
  "revision_id": "1652625"
 }, 
 {
  "author": "pranayp", 
  "date": "2015-01-17T15:20:57.733986Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3563 which also resolves OFBIZ-2361. Creating a category with an ID (manually or automatically) that matches an existing productID will show the unrelated product when enter into the category on the 'Browse category' of the Ecommerce application.", 
   "Thanks  Jonatan Soto  and Rohit Sureka for reporting the issue. Thanks Divesh Dutta for providing patch for the fix."
  ], 
  "revision_id": "1652624"
 }
]