[
 {
  "author": "dgeary", 
  "date": "2005-04-28T23:24:30.350914Z", 
  "msg": [
   "Reinstated some navigation cases that don't use dialogs and fixed the class name of the validator Test managed bean"
  ], 
  "revision_id": "165229"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-28T23:14:23.746914Z", 
  "msg": [
   "Cleaning up sysout from debugging."
  ], 
  "revision_id": "165228"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-28T23:13:28.394563Z", 
  "msg": [
   "Adding @readonly annotations to those parameters which should never be directly configured by users..."
  ], 
  "revision_id": "165227"
 }, 
 {
  "author": "rich", 
  "date": "2005-04-28T23:13:25.084339Z", 
  "msg": [
   "This is a contribution from Julie Zhuo to address http://issues.apache.org/jira/browse/BEEHIVE-545 : Add the struts 1.1 bvts to the test distribution.  Thanks Julie!", 
   "tests: drt in trunk, build.dist.full/build.test.dist in trunk, run.tests against the distribution (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "165226"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-04-28T23:06:11.305648Z", 
  "msg": [
   "o Cleaned up field-level annotation support (especially descriptor extraction, generation, and building)", 
   "o Converted all \"core\" plugins (including maven-core-it-plugin) to use field-level annotations", 
   "o Removed generation of parameter descriptors for ${/#component.* param specifications.", 
   "o Added @readonly for parameters that cannot be overridden by user configuration (List override was dangerous here)", 
   "o Added validation against pom-derived configuration for @readonly parameters", 
   "o Fixed @parameter alias=\"\" support...now configuration of the mojo instance actually will work with either the real param name or the alias. Would be nice to support multiple aliases, but that might require @alias annotations...", 
   "o Added [temporary?] support for null editable attributes for parameters, to support pre-built mojos from the repo.", 
   "Annotation support should be just about ready to go..."
  ], 
  "revision_id": "165225"
 }
]