[
 {
  "author": "jleroux", 
  "date": "2015-01-29T19:06:49.582015Z", 
  "msg": [
   "This implements OFBIZ-5312 \"Proposal: URL-Generation Changes (mostly for SEO reasons but not only)\" by merging the \"SEO branch\" in trunk", 
   "After some efforts to take into consideration Anil's justified concerns (simply put: keep the current behaviour), the modifications are finally light, which is greater for reviews. Most important are:", 
   "* Product component", 
   "** I have moved the OfbizCatalogAltUrlTransform and OfbizCatalogUrlTransform classes to a ftl subdirectory with the new FTL macros implementation: CatalogAltUrlSeoTransform, CatalogUrlSeoFilter, CatalogAltUrlSeoTransform, CatalogUrlSeoTransform, SeoTransform, UrlRegexpTransform", 
   "** A bunch of new filters have been added CatalogUrlSeoFilter, controlServlet, SeoCatalogUrlServlet, SeoContentUrlFilter, SeoContextFilter, SeoControlServlet, UrlRegexpContextFilter", 
   "** 2 util classes: SeoConfigUtil, SeoUrlUtil", 
   "** By default ofbizCatalogAltUrl and ofbizCatalogUrl macros now use the new implementations by CatalogAltUrlSeoTransform and CatalogUrlSeoTransform. This can be changed back in freemarkerTransforms.properties", 
   "** A SeoConfig.xml file define some SEO parameters, the SeoConfig.xsd can be sued as documentation, globally please refer to OFBIZ-5312.", 
   "* Framework webapp component", 
   "** By default ofbizUrl macro now uses the new implementations by UrlRegexpTransform. This can be changed back in freemarkerTransforms.properties", 
   "* Ecommerce component", 
   "** A new ecomseo webapp clones the ecommerce webapp on the model of ecomclone. There is not much there: mostly a controller with a new JspViewHandler class (in ecommerce) and a web.xml file", 
   "With these changes we can have both worlds running side by side. So you can use eitherb http://localhost:8080/ecommerce/control/main as root or http://localhost:8080/ecomseo, but also if you want http://localhost:8080/ecommerce/. Then everything follows.", 
   "From my reviews and tests all is working as expected. I only found a trivial bug that I can also reproduce in current trunk see OFBIZ-5305 (sometimes not locally, weird).", 
   "Of course, all the tests passes."
  ], 
  "revision_id": "1655803"
 }, 
 {
  "author": "rhuijben", 
  "date": "2015-01-29T19:05:32.554949Z", 
  "msg": [
   "* subversion/libsvn_client/copy.c", 
   "(wc_to_repos_copy): Following up on r1655796, avoid possible segfault."
  ], 
  "revision_id": "1655802"
 }, 
 {
  "author": "mrumph", 
  "date": "2015-01-29T19:05:32.219774Z", 
  "msg": [
   "Generated doc changes"
  ], 
  "revision_id": "1655801"
 }, 
 {
  "author": "mrumph", 
  "date": "2015-01-29T18:56:52.455516Z", 
  "msg": [
   "Add doc links between mod_proxy_fcgi and mod_authnz_fcgi"
  ], 
  "revision_id": "1655800"
 }, 
 {
  "author": "jfthomps", 
  "date": "2015-01-29T18:54:37.604894Z", 
  "msg": [
   "initial creation of 2.3.2 to 2.4 upgrade guide"
  ], 
  "revision_id": "1655799"
 }
]