[
 {
  "author": "ekoneil", 
  "date": "2005-05-02T17:24:30.238310Z", 
  "msg": [
   "Remove the TLDX metadata from the NetUI JSP tags.", 
   "This was display-time information for IDEs that is no longer needed.", 
   "BB: self", 
   "DRT: NetUI pass"
  ], 
  "revision_id": "165649"
 }, 
 {
  "author": "trygvis", 
  "date": "2005-05-02T17:17:06.068148Z", 
  "msg": [
   "Fixes CONTINUUM-60: checkout in background", 
   "o The background check outs are implemented with a CheckOutProjectTask and", 
   "COPTExecutor reading from the check out TaskQueue.", 
   "o Adding two more states: \"checking out\" and \"updating\".", 
   "o Adding a \"project state guard\" that's consulted by the ContinuumStore to", 
   "ensure that the project is in a legal state at all times. This might not be", 
   "the ideal solution to this problem but it's good enough for now.", 
   "o Updated some test to use the utility methods from", 
   "ModelloJPoxContinuumStoreTest to create projects it's a bit more complicated", 
   "now with the extra state transitions required to create a \"new\" project.", 
   "o Updating the integration tests as the tests have to wait for the check out to", 
   "complete before continuing.", 
   "o Cleaned up the exception handling in Continuum a bit, making all exception", 
   "instanciation go through a method to be able to centralize all logging. This", 
   "implies that the core will log every exception it throws.", 
   "o Removed all logging from the ContinuumXmlRpc interface as the core does it", 
   "now. The XML RPC clients will still get any exceptions returned as before."
  ], 
  "revision_id": "165648"
 }, 
 {
  "author": "", 
  "date": "2005-05-02T17:11:59.541042Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "165647"
 }, 
 {
  "author": "scamp", 
  "date": "2005-05-02T17:02:23.479375Z", 
  "msg": [
   "updated for packages"
  ], 
  "revision_id": "165646"
 }, 
 {
  "author": "mikem", 
  "date": "2005-05-02T15:51:48.688966Z", 
  "msg": [
   "committing this patch for DERBY-235 for suresh.thalamati@gmail.com", 
   "Problem was service name on database creation  was getting just set to the canonical name of the database directory", 
   "without subsub protocol name added in the beginning. Whereas rest of the system seems to expect that the", 
   "subsub protocol name  also is part of the  service  name.  For example if \"csf\" is  subprotocol name ,", 
   "service name should be  \"csf:C:\\suresht\\databases\\wombat1\" not just \"C:\\suresht\\databases\\wombat1\".", 
   "Attached diff fixes the problem by  prefixing the subsub protocol name  to the canonical name, to generate", 
   "the service name in the case of create also.", 
   "This was not an issue with default \"directory\"  subsub protocol because the system consistently generates", 
   "the service name as just the canonical name of  the service root.", 
   "Another doubt I had while fixing this issue why we generate the service name after creating the service root,", 
   "my guess is because of the following comment in the java docs for java.io.File.getCanonicalPath() method:", 
   "\" Every pathname that denotes an existing file or directory has a unique canonical form. Every pathname that", 
   "denotes a nonexistent file or directory also has a unique canonical form. The canonical form of the pathname of a", 
   "nonexistent file or directory may be different  from the canonical form of the same pathname after the file or", 
   "directory is created. Similarly, the canonical form of the pathname of an existing file or directory may be different from the", 
   "canonical form of the same pathname after the file or directory is deleted.", 
   "\""
  ], 
  "revision_id": "165645"
 }
]