[
 {
  "author": "rhuijben", 
  "date": "2015-02-05T21:12:03.396231Z", 
  "msg": [
   "Reduce the update-move baton usage by introducing an tree_conflicted argument", 
   "on all the operation functions handling the changes. This allows avoiding more", 
   "work, simplifies code and makes things much easier to debug.", 
   "* subversion/libsvn_wc/wc_db_update_move.c", 
   "(update_move_baton_t): Remove pool and conflict_root_relpath.", 
   "(check_tree_conflict): Stop checking skip handling here.", 
   "(tc_editor_add_directory,", 
   "tc_editor_add_file,", 
   "tc_editor_alter_directory,", 
   "tc_editor_alter_file,", 
   "tc_editor_delete): Add tree_conflicted output argument.", 
   "(update_moved_away_node): Handle tree conflicted, to stop recursing earlier.", 
   "(update_moved_away_conflict_victim): Simplify baton init."
  ], 
  "revision_id": "1657693"
 }, 
 {
  "author": "jailletc36", 
  "date": "2015-02-05T21:03:04.500653Z", 
  "msg": [
   "Save a few bytes in conf pool when parsing some directives. Use temp_pool when applicable."
  ], 
  "revision_id": "1657692"
 }, 
 {
  "author": "jfthomps", 
  "date": "2015-02-05T21:00:14.924655Z", 
  "msg": [
   "VCL-174 - NAT - support for sites that have small IP address ranges", 
   "updated code so that the drop down for selecting a NAT host when changing the nat host setting for multiple computers gets dynamically updated as computers are configured/unconfigured as NAT hosts", 
   "computer.php: modified extraResourceFilters: set an id for the 'Confirm NAT Change' button", 
   "managementnode.php: (just removed unnecessary newlines)", 
   "utils.php: modified getNAThosts: added conditionals to not include deleted computers and management nodes", 
   "computers.js:", 
   "-modified initPage: added line to disable newnathostbtn if there are no options in newnathostid", 
   "-modified saveResourceCB: add option to netnathostid select when an added or edited computer is enabled as a nat host and set newnathostbtn to be enabled; if a computer is edited and removed as a nat host, remove the computer from the options in newnathostid, if no options left, disable newnathostbtn", 
   "-modified confirmNATchange: if no options in newnathostid, return"
  ], 
  "revision_id": "1657691"
 }, 
 {
  "author": "jahewson", 
  "date": "2015-02-05T20:57:08.576029Z", 
  "msg": [
   "PDFBOX-2373: Use minimum line width for dash patterns to avoid JVM crash"
  ], 
  "revision_id": "1657690"
 }, 
 {
  "author": "jailletc36", 
  "date": "2015-02-05T20:47:38.561067Z", 
  "msg": [
   "Improve doc as spotted by Kalessin in online doc"
  ], 
  "revision_id": "1657689"
 }
]