[
 {
  "author": "tripod", 
  "date": "2015-02-17T20:09:02.053035Z", 
  "msg": [
   "Moving rcp docu to site"
  ], 
  "revision_id": "1660483"
 }, 
 {
  "author": "tilman", 
  "date": "2015-02-17T19:59:38.869301Z", 
  "msg": [
   "PDFBOX-2673: Add output path prefix param, as suggested by Arsen Borovinskiy"
  ], 
  "revision_id": "1660482"
 }, 
 {
  "author": "msahyoun", 
  "date": "2015-02-17T19:56:59.247589Z", 
  "msg": [
   "PDFBOX-2687 avoid ClassCastException when adding an OutputIntent"
  ], 
  "revision_id": "1660481"
 }, 
 {
  "author": "kotkov", 
  "date": "2015-02-17T19:51:23.383234Z", 
  "msg": [
   "Improve the way we currently log assertions and malfunctions in mod_dav_svn.", 
   "Prior to this changeset we were delegating this to the default malfunction", 
   "handler, svn_error_abort_on_malfunction().  If a malfunction happens, this", 
   "handler outputs the information about it to STDERR.  Apache usually replaces", 
   "STDERR with what the ErrorLog directive points to, but there are a couple", 
   "of caveats:", 
   "- First of all, doing so bypasses existing error log hooks installed via", 
   "ap_hook_error_log().  There might be existing installations that happen to", 
   "use custom error log hooks as an addition to the main error log or even as", 
   "a complete replacement for it — think ErrorLog /dev/null, but with a custom", 
   "logging module doing all the work.  In the latter case, the information", 
   "about the malfunction would be completely lost.", 
   "- Secondly, the error message contains an unnecessary \"svn:\" prefix, and this", 
   "is inconsistent with other Subversion errors that can appear in the Apache", 
   "error log.", 
   "Avoid them by installing a custom malfunction handler.  Related discussion", 
   "can be found in http://svn.haxx.se/dev/archive-2015-02/0268.shtml", 
   "(Subject: \"Handling assertions and malfunctions in mod_dav_svn\")", 
   "* subversion/mod_dav_svn/mod_dav_svn.c", 
   "(malfunction_handler): New function that logs the malfunction details with", 
   "ap_log_error() and aborts the current process.", 
   "(init_dso): Install new malfunction_handler in this APR_HOOK_REALLY_FIRST", 
   "pre_config hook."
  ], 
  "revision_id": "1660480"
 }, 
 {
  "author": "markt", 
  "date": "2015-02-17T19:50:40.006458Z", 
  "msg": [
   "Typical. The tests starts failing regularly and it is the test that isn't configured for debug that fails."
  ], 
  "revision_id": "1660479"
 }
]