[
 {
  "author": "brock", 
  "date": "2015-02-26T22:12:00.282097Z", 
  "msg": [
   "HIVE-9772 - Hive parquet timestamp conversion doesn't work with new Parquet (Jimmy Xiang via Brock)"
  ], 
  "revision_id": "1662588"
 }, 
 {
  "author": "sarowe", 
  "date": "2015-02-26T22:05:54.905679Z", 
  "msg": [
   "SOLR-7016: Fix bin\\solr.cmd to work in a directory with spaces in the name. (merged branch_5x r1655080)"
  ], 
  "revision_id": "1662587"
 }, 
 {
  "author": "kschenk", 
  "date": "2015-02-26T22:05:18.236476Z", 
  "msg": [
   "Replace lost suffix \"search\" in google reference to get search working again."
  ], 
  "revision_id": "1662586"
 }, 
 {
  "author": "stefan2", 
  "date": "2015-02-26T22:02:46.081814Z", 
  "msg": [
   "Globally prevent paths with newlines in them from being created at the FS", 
   "layer.  Various higher-level functionality can't handle them ATM and this", 
   "is the most central / convenient place to prevent those paths.", 
   "Our svn: property formats that contain paths (svn:mergeinfo, svn:externals", 
   "and svn:ignore) don't support newlines in those paths.  For the latter two", 
   "properties, this is simply a feature limitation.  Mergeinfo, however, gets", 
   "added by SVN to paths at its own discretion and \"sticks\" after renames etc.", 
   "So, that would be bound to break eventually.", 
   "The fix for issue #4340 did only address the storage lager itself (FSFS)", 
   "but not the impact of such paths on other parts of the system.  Keep the", 
   "FSFS-private check in place.  Once the remainder of SVN handles these paths", 
   "correctly, the FS-global ban may be lifted again.", 
   "* subversion/libsvn_fs/fs-loader.c", 
   "(svn_fs__path_valid): Reject the introduction of paths with \\n in them.", 
   "* subversion/tests/libsvn_fs/fs-test.c", 
   "(filename_trailing_newline): Even if the backend could handle \\n paths,", 
   "ATM there is no way to create them."
  ], 
  "revision_id": "1662585"
 }, 
 {
  "author": "aconway", 
  "date": "2015-02-26T21:59:23.621630Z", 
  "msg": [
   "QPID-4710: [AMQP 1.0] Support for transactions in qpid::messaging C++ client."
  ], 
  "revision_id": "1662584"
 }
]