[
 {
  "author": "desruisseaux", 
  "date": "2015-03-06T23:05:32.386969Z", 
  "msg": [
   "Referencing: added the LongitudeRotation operation method.", 
   "This is probably the simplest operation."
  ], 
  "revision_id": "1664758"
 }, 
 {
  "author": "pderop", 
  "date": "2015-03-06T23:01:58.819139Z", 
  "msg": [
   "Added Javadocs in guides section."
  ], 
  "revision_id": "1664757"
 }, 
 {
  "author": "jfthomps", 
  "date": "2015-03-06T23:00:54.797196Z", 
  "msg": [
   "VCL-392 - Add option to rename computer separate from Sysprep", 
   "image.php:", 
   "-modified fieldDisplayName: added sethostname to fields for which a custom value is returned", 
   "-modified addEditDialogHTML: (unrelated) wrapped description text for Usage Notes and Revision Comments; added sethostname widget that is wrapped with a div that can be hidden; wrapped sysprep with a div that can be hidden", 
   "-modified AJsaveResource: added sethostname to fields that trigger imagemeta table being updated", 
   "-modified createImage: added ostype to fields added to $data for passing to addResource", 
   "-modified addResource: added sethostname to fields that trigger entry being added imagemeta table", 
   "-modified validateResourceData: added sethostname to fields returned and validated", 
   "resource.php: modified AJstartImage: added ostype to array of json data returned", 
   "utils.php: getImages: added 'sethostname' to set of fields returned for each image", 
   "xmlrpcWrappers.php: modified XMLRPCautoCapture: added 'ostype' and 'sethostname' to array of data passed to addResource function", 
   "image.js:", 
   "-modified colformatter: added sethostname to fields for which true/false is returned", 
   "-modified inlineEditResourceCB: added sethostname to widgets having their value set; show/hide sethostnamediv based on ostype", 
   "-modified resetEditResource: added sethostname to fields reset", 
   "-modified saveResource: added sethostname to data that is validated, only show error if sethostnamediv is displayed", 
   "-modified saveResourceCB: added sethostname to fields updated in store and to widgets being reset", 
   "-modified startImageCB: added code to show/hide sethostnamediv and to initialize value for sethostname widget; added code to show/hide new div that wrpas the sysprep widget so it is only shown for Windows images"
  ], 
  "revision_id": "1664756"
 }, 
 {
  "author": "xuefu", 
  "date": "2015-03-06T22:56:10.917376Z", 
  "msg": [
   "HIVE-9620: Cannot retrieve column statistics using HMS API if column name contains uppercase characters (Chaoyu via Xuefu)"
  ], 
  "revision_id": "1664755"
 }, 
 {
  "author": "gnodet", 
  "date": "2015-03-06T22:48:24.757869Z", 
  "msg": [
   "[maven-release-plugin] prepare for next development iteration"
  ], 
  "revision_id": "1664754"
 }
]