[
 {
  "author": "jleroux", 
  "date": "2015-03-14T10:29:14.898939Z", 
  "msg": [
   "A patch from Taher Alkhateeb for \"date-find in form widget does not persist value\" https://issues.apache.org/jira/browse/OFBIZ-5074", 
   "Any search form that calls \"performFind\" and has a \"date-find\" tag will not persist but it will give correct search results.", 
   "For example, If I go to Order -> Requests and search using any of the date fields, the result will be correct but the field will be blank upon returning results. This behavior affects only dates.", 
   "I suspect the main offender here is a bug in performFind service or one of the services it calls (prepareFind or executeFind). I believe that the \"queryStringMap\" does not contain the date-find fields in its returned value. I did not look heavily into the code but I think \"fld\" types are not persisted in-between requests.", 
   "jleroux: this is a R12.04 specific patch"
  ], 
  "revision_id": "1666648"
 }, 
 {
  "author": "rfscholte", 
  "date": "2015-03-14T10:22:49.476725Z", 
  "msg": [
   "assert number of installed files, should be good enough to verify maven-artifact-transfer"
  ], 
  "revision_id": "1666647"
 }, 
 {
  "author": "rfscholte", 
  "date": "2015-03-14T09:53:51.279623Z", 
  "msg": [
   "migrate to M3.0.", 
   "Step 1: only update maven version and compiler source/target", 
   "- fix maven dependencies (add maven-compat, to be removed)", 
   "- upgrade maven-plugin-testing-harness to 2.1 (matching Aether of Maven 3.0)", 
   "- Adjust junit tests by preparing LegacySupport (to be removed)", 
   "- remove RepositoryLayout test, no support for legacy repo anymore"
  ], 
  "revision_id": "1666646"
 }, 
 {
  "author": "deepak", 
  "date": "2015-03-14T09:26:43.403376Z", 
  "msg": [
   "Applied fix from trunk r#1666633.", 
   "=========================================", 
   "Fixed incorrect tempTemplateContext assignment for renderContentAsText method, as UtilMisc.<String,Object>toMap method creating tempTemplateContext via call by reference mechanism, hence all the request parameters copy to original templateContext. In this case UtilMisc.toMap calling the UtilGenerics.checkMap()."
  ], 
  "revision_id": "1666645"
 }, 
 {
  "author": "cziegeler", 
  "date": "2015-03-14T09:09:28.966971Z", 
  "msg": [
   "SLING-4503 : Provide a mechanism to notify a JMX Bean about startup progress"
  ], 
  "revision_id": "1666644"
 }
]