[
 {
  "author": "svn-role", 
  "date": "2015-03-19T18:23:43.504369Z", 
  "msg": [
   "Merge r1666851 from trunk:", 
   "* r1666851", 
   "Make JavaHL fetch all revision properties when the api promises too.", 
   "Justification:", 
   "Simple bugfix makes new in 1.9 code do what it was designed to do.", 
   "Votes:", 
   "+1: rhuijben, brane"
  ], 
  "revision_id": "1667833"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-03-19T18:23:38.688593Z", 
  "msg": [
   "Merge the r1666270 group from trunk:", 
   "* r1666270, r1666272", 
   "Resolve a segfault when an update introduces a conflict on the update root", 
   "Justification:", 
   "Regression from 1.8.x.", 
   "Votes:", 
   "+1: rhuijben, philip, brane"
  ], 
  "revision_id": "1667832"
 }, 
 {
  "author": "rhuijben", 
  "date": "2015-03-19T18:23:34.506877Z", 
  "msg": [
   "* STATUS: Nominate v1.7.x-VS2012-15 branch"
  ], 
  "revision_id": "1667831"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-03-19T18:23:34.417683Z", 
  "msg": [
   "Merge the r1663338 group from trunk:", 
   "* r1663338, r1663347, r1663374", 
   "Properly record resolving of individual property conflicts.", 
   "Justification:", 
   "Fixes a few implementation bugs in the resolver code and exposes the", 
   "api for more users than those that pass a callback function.", 
   "Notes:", 
   "Bert says it changes a public API and so needs to go into 1.9.0: see", 
   "http://colabti.org/irclogger/irclogger_log/svn-dev?date=2015-03-10#l93", 
   ".", 
   "rhuijben: While the new feature of allowing the resolving of individual", 
   "properties is not a release blocker to me, the known buggy behavior of", 
   "the current code that may cause unuexpected loss of properties and", 
   "conflict data is.", 
   ".", 
   "The part of the patch that enables the new feature is very small", 
   "compared to the part that fixes the issue, and the regression", 
   "test would be at least tree times harder to write and review without", 
   "enabling the resolving of individual property conflicts.", 
   ".", 
   "Note that not being able to resolve individual property conflicts", 
   "on update/switch/merge is a regression against 1.7.x, where we didn't", 
   "switch to resolving after the update completed yet.", 
   ".", 
   "Votes:", 
   "+1: rhuijben, philip", 
   "+1: brane (But there's no API change here, no public headers are", 
   "modified by the backport merge.)"
  ], 
  "revision_id": "1667830"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-03-19T18:23:29.228444Z", 
  "msg": [
   "Merge the r1664078 group from trunk:", 
   "* r1664078,r1664080,r1664187,r1664191,r1664200,r1664344,r1664588,r1664927,r1665886", 
   "Instead of making more changes to the auth batons from ra sessions, reduce", 
   "the number of changes by introducing an internal slave auth baton feature.", 
   "Justification:", 
   "Without this patch (or a complete redesign of the auth layer), the", 
   "ra sessions cache (currently on a feature branch), will open the ra", 
   "sessions from outside configuration changes caused by opening other", 
   "ra sessions. This patch not only reverts the additional changes to the", 
   "auth baton on init that are new in 1.9, but also removes cases where we", 
   "already applied similar changes inside specific ra providers.", 
   "Notes:", 
   "The reason I group this under release blockers, is to avoid the behavior", 
   "change introduced in r1609499 from reaching released versions. The changes", 
   "itself are safe for a later backport as it only affects ra-session", 
   "internal state.", 
   "Votes:", 
   "+1: rhuijben, brane, philip"
  ], 
  "revision_id": "1667829"
 }
]