[
 {
  "author": "bridgetb", 
  "date": "2015-03-26T22:07:50.466656Z", 
  "msg": [
   "DRILL-2505: doc math/trig functions"
  ], 
  "revision_id": "1669458"
 }, 
 {
  "author": "pfg", 
  "date": "2015-03-26T22:07:21.624285Z", 
  "msg": [
   "Huge update to the FreeBSD port (i386 part).", 
   "Starting with FreeBSD 10, the FreeBSD project has moved from using", 
   "gcc/libstdc++ to using a complete C++ stack based on clang/llvm", 
   "libc++ and libcxxrt. This new stack has better standards compliance", 
   "and has huge similarities with MacOSX but it brought subtle low", 
   "level problems for our outdated bridges code.", 
   "Don Lewis has done a brave effort to update this code and", 
   "has done extensive testing within FreeBSD port. Support", 
   "for older versions of gcc has been dropped.", 
   "Code Review:", 
   "https://reviews.freebsd.org/D2108", 
   "https://reviews.freebsd.org/D2055", 
   "Author:\t\tDon Lewis (truckman at FreeBSD)"
  ], 
  "revision_id": "1669457"
 }, 
 {
  "author": "pfg", 
  "date": "2015-03-26T22:06:29.164534Z", 
  "msg": [
   "Bring to SAL a wrapper implementation of the powr() IEEE 754 math function.", 
   "This function was originally brought in r1444110 and is useful for", 
   "OOXML compatibility. At this time it is not being used to fix the", 
   "original issue it was meant to address but it is convenient for", 
   "future use.", 
   "It also reduces the differences from FreeBSD's port which will", 
   "be receiving updates."
  ], 
  "revision_id": "1669456"
 }, 
 {
  "author": "pfg", 
  "date": "2015-03-26T22:05:42.752084Z", 
  "msg": [
   "Re-implement Calc's RAND() function using a variant of KISS PRNG.", 
   "George Marsaglia's KISS algorithm is a rather simple implementation", 
   "of a random number generator but it has interesting properties with", 
   "respect ot the traditional Mersenne Twister.", 
   "I used the 2011 32 bit Multiply-with-carry variant, with an", 
   "undetermined  period which is known to be not less than 10^40000000;", 
   "it is known to pass all the statistical tests.", 
   "The Apache OpenOffice implementation uses an aggressive seeding", 
   "scheme based on the internal rtl_random functions, rendering the", 
   "function basically unpredictable. As a side effect it is also not", 
   "possible to specify a seed for repeatability. No claims are made", 
   "concerning crypto-safeness.", 
   "The specific adaption for Apache OpenOffice is:", 
   "Copyright 2015 Pedro Giffuni", 
   "All rights reserved.", 
   "Huge thanks to Steve Kargl for pointing me to the algorithm and", 
   "the late George Marsaglia for creating it in the first place."
  ], 
  "revision_id": "1669455"
 }, 
 {
  "author": "degenaro", 
  "date": "2015-03-26T21:51:54.791164Z", 
  "msg": [
   "UIMA-4311 DUCC Job Driver (JD) clean-up Junit tests"
  ], 
  "revision_id": "1669454"
 }
]