[
 {
  "author": "breser", 
  "date": "2015-04-02T19:05:44.747129Z", 
  "msg": [
   "Fix building with apr trunk by removing unnecessary header includes.", 
   "apr_thread_mutex.h is included by apr_allocator.h which is included", 
   "by apr_pools.h.  This header is prone to circular references because", 
   "it also includes apr_pools.h and despite efforts to prevent this", 
   "it's blowing up clang pretty bad with apr trunk.  However, we don't", 
   "need it at all because we always have apr_pools.h.", 
   "* subversion/include/private/svn_mutex.h,", 
   "subversion/libsvn_fs/fs-loader.c,", 
   "subversion/libsvn_fs_fs/fs.c,", 
   "subversion/libsvn_fs_x/fs.c,", 
   "subversion/libsvn_subr/cache-inprocess.c,", 
   "subversion/libsvn_subr/dso.c,", 
   "subversion/libsvn_subr/pool.c:  Remove apr_thread_mutex.h include."
  ], 
  "revision_id": "1670953"
 }, 
 {
  "author": "nmalin", 
  "date": "2015-04-02T19:04:49.797336Z", 
  "msg": [
   "Apply patch OFBIZ-6209 Error when call updateNote service report by Supachai Chaima-ngua"
  ], 
  "revision_id": "1670952"
 }, 
 {
  "author": "degenaro", 
  "date": "2015-04-02T18:44:56.527902Z", 
  "msg": [
   "UIMA-4318 DUCC Web Server (WS) reduce JD storage use", 
   "- synchronize to prevent multiple instance of MessageHandler"
  ], 
  "revision_id": "1670951"
 }, 
 {
  "author": "jfthomps", 
  "date": "2015-04-02T18:30:52.384117Z", 
  "msg": [
   "VCL-763 - Add missing constraints to database tables", 
   "blockallocations.php:", 
   "-modified AJtoggleBlockTime - if setting skip from 1 to 0 in database, also set processed to 0 in case the blockTime had been processed already. Otherwise, when skip is set to 0, if the block time had been prevously processed, it will not get processed again (and what had been set up by the previous processing would have been undone when skip was set to 1)", 
   "-modified processBlockAllocationInput: if $return['groupid'] == 0, set it to 'NULL' so when it is used for an insert or update, it will be NULL instead of 0", 
   "utils.php: modified checkClearImageMeta - added check for query that gets existing imagemeta entry returning no rows - this can happen if the imagemeta entry is due to subimages, and someone deletes the subimages and then updates the image profile, in which case the deleting of the subimages will remove the imagemeta entry, but the continuation for editing the image profile will still have the imagemetaid"
  ], 
  "revision_id": "1670950"
 }, 
 {
  "author": "jfthomps", 
  "date": "2015-04-02T17:51:03.072366Z", 
  "msg": [
   "fixed typo in error message string"
  ], 
  "revision_id": "1670949"
 }
]