[
 {
  "author": "svn-role", 
  "date": "2015-04-18T04:00:44.509388Z", 
  "msg": [
   "Merge r1664035 from trunk:", 
   "* r1664035", 
   "Keep track of changes when a file external is replace by a real file", 
   "Justification:", 
   "When a file-external is deleted, there might be a real node that", 
   "want to take its place. This patch makes svn update introduce a", 
   "not present marker node, so a follow-up update will bring in the", 
   "new file (that was previously reported as skipped)", 
   "Notes:", 
   "To implement this some features had to be added to the generic", 
   "base remove function.", 
   "Votes:", 
   "+1: rhuijben, brane, philip"
  ], 
  "revision_id": "1674438"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-04-18T04:00:42.653712Z", 
  "msg": [
   "Merge the r1663671 group from trunk:", 
   "* r1663671, r1666832", 
   "Resolve an assertion on a bad update report involving incomplete status", 
   "Justification:", 
   "The tree conflict detection logic in the update editor wasn't", 
   "designed to handle BASE adds, where the is an existing basenode. This", 
   "patch makes the update logic handling properly handle this bad state", 
   "for incomplete nodes, like it already does for status normal nodes.", 
   ".", 
   "Resolves a reproducable assertion in an restarted checkout against", 
   "github.", 
   "Votes:", 
   "+1: rhuijben, stefan2, brane"
  ], 
  "revision_id": "1674437"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-04-18T04:00:40.157404Z", 
  "msg": [
   "Merge the r1667228 group from trunk:", 
   "* r1667228, r1667234, r1667249, r1667250, r1667258, r1667290, r1667691, r1667692, r1667693", 
   "Fix various problems with binary file conflicts.", 
   "Justification:", 
   "Conflict description API violates its own promises for binaries.", 
   "Current behaviour can cause user confusion since conflict prompt", 
   "options for binary files won't work as expected.", 
   "Notes:", 
   "r1667258, r1667290 resolve a performance regression introduced by the", 
   "code which now needs the actual property values. It also avoids creating temporary", 
   "files for property conflicts in cases where a caller can never use them.", 
   "Votes:", 
   "+1: rhuijben, stefan2, brane, philip", 
   "+1: stsp (r1667228, r1667234, r1667249, r1667250, r1667691, r1667692, r1667693 only)"
  ], 
  "revision_id": "1674436"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-04-18T04:00:34.473259Z", 
  "msg": [
   "Remove the '1.9.x-r1664664' branch, merged in r1674434."
  ], 
  "revision_id": "1674435"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-04-18T04:00:19.030853Z", 
  "msg": [
   "Merge the 1.9.x-r1664664 branch:", 
   "* r1664664, r1664672, r1664674", 
   "Make detection of invalid (newer than HEAD) base revision on commit behave", 
   "the same on all RA layers.", 
   "Justification:", 
   "The error was visible when the http-v1 dav protocol was used. I think it", 
   "is a better fix to backport the check to the other layers than to hide", 
   "the problem.", 
   "Branch:", 
   "^/subversion/1.9.x-r1664664", 
   "Votes:", 
   "+1: rhuijben, philip, brane", 
   "+1: stefan2 (before branch)"
  ], 
  "revision_id": "1674434"
 }
]