[
 {
  "author": "cmarcum", 
  "date": "2015-05-02T15:24:43.862519Z", 
  "msg": [
   "#i126246#", 
   "added sdkOk property and getter/setter in UNOClientAppWizardIterator to keep track of valid office and sdk locations.", 
   "added getter for UNOClientAppWizardIterator in UNOClientAppWizardPanel to be used by UNOClientAppPanelVisual valid method.", 
   "added check of sdkOk in UNOClientAppPanelVisual valid method to disable next button and display message.", 
   "added message to bundle to display instructions to cancel dialog if settings were skipped and where to find settings in tools > options.", 
   "added same message in it_IT bundle."
  ], 
  "revision_id": "1677323"
 }, 
 {
  "author": "cmarcum", 
  "date": "2015-05-02T15:19:57.596403Z", 
  "msg": [
   "#i126246#", 
   "added sdkOk property and getter/setter in ComponentWizardIterator to keep track of valid office and sdk locations.", 
   "added getter for ComponentWizardIterator in ComponentWizardPanel1Project to be used by ComponentPanelVisual1Project valid method.", 
   "added check of sdkOk in ComponentPanelVisual1Project valid method to disable next button and display message.", 
   "added message to bundle to display instructions to cancel dialog if settings were skipped and where to find settings in tools > options.", 
   "added same message in it_IT bundle."
  ], 
  "revision_id": "1677322"
 }, 
 {
  "author": "cmarcum", 
  "date": "2015-05-02T15:12:24.682521Z", 
  "msg": [
   "#i126246#", 
   "added sdkOk property and getter/setter in AddinWizardIterator to keep track of valid office and sdk locations.", 
   "added getter for AddinWizardIterator in AddinWizardPanel1Project to be used by AddinPanelVisual1Project valid method.", 
   "added check of sdkOk in AddinPanelVisual1Project valid method to disable next button and display message.", 
   "added message to bundle to display instructions to cancel dialog if settings were skipped and where to find settings in tools > options.", 
   "added same message in it_IT bundle."
  ], 
  "revision_id": "1677321"
 }, 
 {
  "author": "cmarcum", 
  "date": "2015-05-02T15:08:21.446364Z", 
  "msg": [
   "#i126246#", 
   "added sdkOk property and getter/setter in AddOnWizardIterator to keep track of valid office and sdk locations.", 
   "added getter for AddOnWizardIterator in AddOnWizardPanel1Project to be used by AddOnPanelVisual1Project valid method.", 
   "added check of sdkOk in AddOnPanelVisual1Project valid method to disable next button and display message.", 
   "added message to bundle to display instructions to cancel dialog if settings were skipped and where to find settings in tools > options.", 
   "added same message in it_IT bundle."
  ], 
  "revision_id": "1677320"
 }, 
 {
  "author": "cmarcum", 
  "date": "2015-05-02T14:44:13.431052Z", 
  "msg": [
   "#i126246#", 
   "ConfigurationValidator used a ConfigurationPanel to get office and sdk paths if they are not already valid. This panel was copied to ConfigurationValidatorPanel to add the DialogDescriptor necessary to disable and enable the OK button. A copy was needed because the ConfigurationOptionsPanelController used ConfigurationPanel which is final and could not be extended.", 
   "ConfigurationOptionsPanelController was not enabling the Apply button when paths were valid in ConfigurationPanel. This was due to some checks being reversed. This was corrected."
  ], 
  "revision_id": "1677319"
 }
]