[
 {
  "author": "vy", 
  "date": "2015-05-06T14:07:56.540108Z", 
  "msg": [
   "DMAP-96 Add unit test for \"Samsung Galaxy S3 Mini LTE\" (SM-G730W8)."
  ], 
  "revision_id": "1677998"
 }, 
 {
  "author": "arkurth", 
  "date": "2015-05-06T14:07:44.415410Z", 
  "msg": [
   "VCL-844", 
   "Reworked much of VMware.pm::migrat_vm to overcome issues with VMs which use dedicated vmdk files - mainly for server requests.", 
   "Added optional type argument to OS.pm::find_files and vSphere_SDK.pm::find_files.", 
   "Moved recently created SSH key subroutines from OS.pm to Linux.pm. They do not work as-is on Windows. Reworked new SSH subroutines in VMware.pm. Most of this code has been generalized and now exists in Linux.pm.", 
   "Added VMware.pm::add_ssh_host_key_to_known_hosts. SSH/SCP would hang on host to host operations without any warning. This should allow host-host communication to work without any manual changes.", 
   "Added caching to VIM_SSH.pm::_get_vm_id. This subroutine was inefficiently being called numerous times for basic operations such as register_vm. The cached VM ID is deleted when a VM is unregistered.", 
   "Updated vSphere_SDK.pm::initialize to attempt to load VIExt (vSphere SDK) after checking if vmprofile username and password are defined. If not defined, initialize returns immediately. This prevents unnecessary warnings from appearing in vcld.log.", 
   "Added code to vSphere_SDK.pm::initialize to attempt to use the result of determine_remote_connection_target.", 
   "Added vSphere_SDK.pm::get_vm_virtual_disk_file_paths to match VIM_SSH.pm. This is now used in VMware.pm::delete_vm. Reworked delete_vm. It was not deleting the directory containing the .vmdk for server reservations under some circumstances.", 
   "Renamed VMware.pm::_get_vmx_file_path_computer_name to _get_file_path_computer_name. Updated it to attempt to determine a computer name from any path, not just a .vmx file path. This allows a VM's working directory path to be passed to it. Updated VMware.pm::is_vmdk_directory_shared to call _get_file_path_computer_name as an extra security check.", 
   "VCL-853", 
   "Updated vSphere_SDK.pm::_get_resource_pool_view to return the root pool if a pool isn't configured in the VM profile and multiple pools are found on this host."
  ], 
  "revision_id": "1677997"
 }, 
 {
  "author": "vy", 
  "date": "2015-05-06T14:07:39.931138Z", 
  "msg": [
   "DMAP-96 Add \"Samsung Galaxy S3 Mini LTE\" (SM-G730W8) device."
  ], 
  "revision_id": "1677996"
 }, 
 {
  "author": "vy", 
  "date": "2015-05-06T14:02:50.815573Z", 
  "msg": [
   "DMAP-96 Add unit test for \"Samsung Galaxy S5 LTE-A\" (SM-G906L)."
  ], 
  "revision_id": "1677995"
 }, 
 {
  "author": "clay", 
  "date": "2015-05-06T14:02:48.308794Z", 
  "msg": [
   "Adding Andreas here too!"
  ], 
  "revision_id": "1677994"
 }
]