[
 {
  "author": "donaldp", 
  "date": "2003-04-06T11:29:43.000000Z", 
  "msg": [
   "Do not attempt to auto-translate the schema type to URI. Not doing it will mean that the user gets a warning everytime they try to deploy the component to phoenix.", 
   "Also autodetermine the location of schema to be 'Foo-schema.xml' for component type com.biz.Foo"
  ], 
  "revision_id": "16804"
 }, 
 {
  "author": "donaldp", 
  "date": "2003-04-06T11:23:52.000000Z", 
  "msg": [
   "Remove unused properties file"
  ], 
  "revision_id": "16803"
 }, 
 {
  "author": "donaldp", 
  "date": "2003-04-06T11:23:22.000000Z", 
  "msg": [
   "Rework the way that configuration and configuration validation is", 
   "handled internally to Phoenix.", 
   "Now configuration is all associated with the ComponentProfile. So no", 
   "longer does any of the code rely on the ConfigurationRepository managing", 
   "configuration. The ConfigurationRepository now acts more like a config", 
   "interceptor that gets a chance to manipulate or rewrite configuration", 
   "(thus supporting the existing use cases and also opening up future use", 
   "cases such as jelly-ification of applications config files).", 
   "ConfigurationValidator no longer stores or manages schemas it simply", 
   "loads the schemas just prior to validation. The validator also does not", 
   "try to do delegation but assumes that the jarv interface along with", 
   "msv and jing is sufficient for all validation purposes.", 
   "DefaultConfigurationValidator is now enabled by default so all components", 
   "that declare schema type are now passed through validator. This means that", 
   "malformed configurations that were previous accepted may no longer be", 
   "accepted.", 
   "PR: PNIX-21"
  ], 
  "revision_id": "16802"
 }, 
 {
  "author": "donaldp", 
  "date": "2003-04-06T10:51:04.000000Z", 
  "msg": [
   "Specify the location because legacy loader now autosets the location"
  ], 
  "revision_id": "16801"
 }, 
 {
  "author": "donaldp", 
  "date": "2003-04-06T10:46:30.000000Z", 
  "msg": [
   "styled"
  ], 
  "revision_id": "16800"
 }
]