[
 {
  "author": "jleroux", 
  "date": "2015-05-21T13:45:02.904395Z", 
  "msg": [
   "A patch from Gil Portenseigne for \"Field Lookup do not show description when widget-verbose is set to false\" https://issues.apache.org/jira/browse/OFBIZ-6396", 
   "When widget verbose is set to false and using field lookup, the description of the selected object is not displayed (not using auto completion but the popup).", 
   "To reproduce : Set widget.verbose=false in framework/widget/config/widget.properties", 
   "Clear OFBiz cache then go to : https://localhost:8443/partymgr/control/EditPartyRelationships?partyId=Company", 
   "In the partyRelationship creation form, in party Id From field, click on lookup, search, select AUTHOR_MADMAX, and so no description displayed. Using autocompletion it's fine.", 
   "This patch use a trick to no care about widgetVerbose comments. Sad to use this kind of trick, but if not, spaces might not be trimed. With that, the display is perfect. No side effect detected.", 
   "jleroux: I still regret Hans past attitude about widgetVerbose which initially forced me to this hack"
  ], 
  "revision_id": "1680873"
 }, 
 {
  "author": "dsmiley", 
  "date": "2015-05-21T13:42:16.149382Z", 
  "msg": [
   "SOLR-5855: Re-use the document's term vectors in DefaultSolrHighlighter. Also refactored DefaultSolrHighlighter's methods to be a little nicer."
  ], 
  "revision_id": "1680872"
 }, 
 {
  "author": "dsmiley", 
  "date": "2015-05-21T13:30:22.668878Z", 
  "msg": [
   "SOLR-5855:  Re-use the document's term vectors in DefaultSolrHighlighter.", 
   "Also refactored DefaultSolrHighlighter's methods to be a little nicer."
  ], 
  "revision_id": "1680871"
 }, 
 {
  "author": "noble", 
  "date": "2015-05-21T13:24:32.164976Z", 
  "msg": [
   "SOLR-7577: Add support for rules in CREATESHARD and ADDREPLICA"
  ], 
  "revision_id": "1680870"
 }, 
 {
  "author": "dsmiley", 
  "date": "2015-05-21T13:16:52.972886Z", 
  "msg": [
   "SOLR-7379: Spatial RptWithGeometrySpatialField (based on CompositeSpatialStrategy)"
  ], 
  "revision_id": "1680869"
 }
]