[
 {
  "author": "jdcasey", 
  "date": "2005-05-06T00:37:27.574479Z", 
  "msg": [
   "Updating README.txt with it1005"
  ], 
  "revision_id": "168484"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-05-06T00:36:00.512351Z", 
  "msg": [
   "IT for testing failure when duplicate goal names are specified in multiple mojos..."
  ], 
  "revision_id": "168483"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-05-06T00:34:25.506692Z", 
  "msg": [
   "changes ...", 
   "o turned 1000 * 60 into 60000 in constant", 
   "o the principal store is a specific type namely JNDI based store so renamed the", 
   "principal store implementation to point this out", 
   "o added new kdc.store.searchbase env property key and constant for the", 
   "search base rdn used by the store relative to the jndi context it gets", 
   "o added kerberos deps (common and protocol) into main's project descriptor", 
   "o made it so SCF now can start both the LDAP and Kerberos protocol", 
   "provider services", 
   "o also we cleanup both services if shutdown is requested and both are on ...", 
   "it does not matter if none, one or both is enabled the factory handles it", 
   "o added trigger property to enable kerberos called server.enable.kerberos"
  ], 
  "revision_id": "168482"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-05-06T00:32:08.781221Z", 
  "msg": [
   "Final pass on cleaning up the mojo api...collapsed MavenPluginDescriptor and PluginDescriptor in the same way as MavenMojoDescriptor/MojoDescriptor had been; eliminated the need for plugin.descriptor.Dependency and MavenPluginDependency (using ComponentDependencies instead); adjusted the MojoExtractors (name?) to return Lists instead of Sets; added duplicate checking to a new addMojo(MojoDescriptor) method on PluginDescriptor, so we catch it on all sides; changed the Generators to use execute(outputDirectory, pluginDescriptor) rather than the myriad pluginDescriptor-derived values; added an IT for checking that the build for a plugin will fail if multiple mojos are detected with the same goal; and, added a special case to PluginDescriptor.getGoalPrefixFromArtifactId() to handle maven-plugin-plugin. That should be about it. I'm not sure that I've gotten the IT for that failure test added to svn yet, so that may follow."
  ], 
  "revision_id": "168481"
 }, 
 {
  "author": "ehatcher", 
  "date": "2005-05-06T00:32:00.047841Z", 
  "msg": [
   "rename WordNet to wordnet, required intermediate move due to OS case insensitivity"
  ], 
  "revision_id": "168480"
 }
]