[
 {
  "author": "rwhitcomb", 
  "date": "2015-06-10T23:40:39.771229Z", 
  "msg": [
   "Add some Javadoc to TerraTableViewSkin to explain the new \"editOnMouseDown\"", 
   "property (both on the \"get\" and the \"set\" methods)."
  ], 
  "revision_id": "1684798"
 }, 
 {
  "author": "gchanan", 
  "date": "2015-06-10T23:30:45.461460Z", 
  "msg": [
   "SOLR-7628: Investigate not using apacheds-all jar"
  ], 
  "revision_id": "1684797"
 }, 
 {
  "author": "gchanan", 
  "date": "2015-06-10T23:29:03.563416Z", 
  "msg": [
   "SOLR-7628: Investigate not using apacheds-all jar"
  ], 
  "revision_id": "1684796"
 }, 
 {
  "author": "rwhitcomb", 
  "date": "2015-06-10T23:12:07.834582Z", 
  "msg": [
   "PIVOT-971: Add the ability to use tri-state checkmarks in a ListView when", 
   "checkmarks are enabled.  This has lots of implications including adding", 
   "new properties to ListView itself, lots of new methods to its listeners", 
   "so that these new property changes can be tracked, and a lot of new code", 
   "in the TerraListViewSkin to implement the visual appearance changes (as", 
   "well as mouse changes).", 
   "Since the ListView.ItemRenderer method had to change parameter types in", 
   "order to accommodate the tri-state checkmarks, all the other places that", 
   "implement these renderers had to change their signature as well.", 
   "This is a non-backward-compatible change for version 2.1 in that these", 
   "interface changes were made.  The impact is not great, in that the", 
   "listener adapters have suitable implementations of the new methods, and", 
   "the renderer change is only to one parameter, and this can be caught", 
   "at compile time.", 
   "Tested in our application, where there is a use for this new capability", 
   "and it works perfectly (as far as I can tell)."
  ], 
  "revision_id": "1684795"
 }, 
 {
  "author": "rgodfrey", 
  "date": "2015-06-10T23:10:20.647284Z", 
  "msg": [
   "QPID-6581 : [Java Broker] Bind the rest serlvet to paths based purely on the model meta-data"
  ], 
  "revision_id": "1684794"
 }
]