[
 {
  "author": "stefan2", 
  "date": "2015-06-20T10:12:21.834085Z", 
  "msg": [
   "* subversion/tests/cmdline/svnadmin_tests.py", 
   "(hotcopy_read_only): Add svnadmin's stderr output to the error message."
  ], 
  "revision_id": "1686543"
 }, 
 {
  "author": "stefan2", 
  "date": "2015-06-20T10:00:10.578803Z", 
  "msg": [
   "For FSFS, make 'svnadmin pack' lock the repo only if there is a shard", 
   "to pack.", 
   "This is more a refactoring job than an actual scalability improvement.", 
   "As long as a pack is running, any additional pack requests will pile up", 
   "waiting for the first one to complete.  Only when that one is done, no", 
   "additional ones will queue while the already waiting ones are being", 
   "served as no-ops.", 
   "* subversion/libsvn_fs_fs/pack.c", 
   "(get_pack_status): Logic factored out of pack_body.", 
   "(pack_body): Call new function, remove pre-condition check here.", 
   "(svn_fs_fs__pack): Check preconditions before acquiring the lock.", 
   "Also have an early out if there is nothing to do."
  ], 
  "revision_id": "1686542"
 }, 
 {
  "author": "stefan2", 
  "date": "2015-06-20T09:45:58.614039Z", 
  "msg": [
   "Follow-up to r1686239: Make the source repo actually read-only.", 
   "* subversion/tests/cmdline/svnadmin_tests.py", 
   "(hotcopy_read_only): Correct the chmod_tree parameters and", 
   "revert back to \"deletable\" afterwards."
  ], 
  "revision_id": "1686541"
 }, 
 {
  "author": "centic", 
  "date": "2015-06-20T09:39:57.830250Z", 
  "msg": [
   "Update list of related projects, state license and add note that we only list open source projects here."
  ], 
  "revision_id": "1686540"
 }, 
 {
  "author": "mbrohl", 
  "date": "2015-06-20T09:19:50.058502Z", 
  "msg": [
   "Applied fix from trunk for revision: 1686536", 
   "===", 
   "Fix for \"Print Pick Sheet PDF using orderId.pdf as attachement name\" (OFBIZ-6398).", 
   "This was introduced by r1680671 during the improvement for (OFBIZ-4480). The behaviour is changed to name the attachment PickSheet<orderId>.pdf for single order pick sheets and preserve the original naming when used for multiple order pick sheets.", 
   "Thanks Deepak for reporting the issue and everyone else who took part in the discussion."
  ], 
  "revision_id": "1686539"
 }
]