[
 {
  "author": "rmannibucau", 
  "date": "2015-06-28T20:26:47.619645Z", 
  "msg": [
   "OWB-1084 tracking session to get the right (from owb point of view) session instance for destroy event"
  ], 
  "revision_id": "1688063"
 }, 
 {
  "author": "bpendleton", 
  "date": "2015-06-28T20:21:53.224721Z", 
  "msg": [
   "DERBY-6783: WHEN clause in CREATE TRIGGER for UPDATE is not working.", 
   "This patch was contributed by Abhinav Gupta (abhinavgupta2004 at gmail dot com)", 
   "The main challenge raised by this issue involved the analysis of which", 
   "columns are referenced by the trigger. Trigger statements can reference", 
   "columns in a number of ways, including the \"AFTER UPDATE OF\" clause, the", 
   "trigger's action statement, and the trigger's \"WHEN\" clause.", 
   "When the WHEN clause support was introduced, this added a new way in which", 
   "a TRIGGER could reference columns, and the compiler code which translated", 
   "the trigger's logic into specific column references at runtime wasn't", 
   "getting the right set of columns.", 
   "The intent of this patch is to successfully run sql queries in Derby that", 
   "trigger updates in a table, affecting only a certain rows of data that", 
   "is determined by the when clause. This patch tries to cover a wide range", 
   "of possible ways in which rows are conditionally updated after an event.", 
   "Before this patch such trigger commands failed to execute correctly and", 
   "left the data in an inconsistent state."
  ], 
  "revision_id": "1688062"
 }, 
 {
  "author": "pmouawad", 
  "date": "2015-06-28T20:18:30.757213Z", 
  "msg": [
   "Java7 multiple exception catching"
  ], 
  "revision_id": "1688061"
 }, 
 {
  "author": "pmouawad", 
  "date": "2015-06-28T20:17:42.790011Z", 
  "msg": [
   "Java7 multiple exception catching"
  ], 
  "revision_id": "1688060"
 }, 
 {
  "author": "pmouawad", 
  "date": "2015-06-28T20:16:19.418226Z", 
  "msg": [
   "Java7 multiple exception catching"
  ], 
  "revision_id": "1688059"
 }
]