[
 {
  "author": "svn-role", 
  "date": "2015-07-01T04:00:31.010567Z", 
  "msg": [
   "Merge the r1688273 group from trunk:", 
   "* r1688273, r1688395", 
   "Implement the new semantics of the changed svn_repos_verify_fs3 in JavaHL.", 
   "Justification:", 
   "This is a follow-up to the changed in the r1684940 group which is", 
   "already approved for backport, and a bindings API change that", 
   "can't be backported after 1.9.0.", 
   "Depends:", 
   "Depends on the r1684940, r1685034, r1687769, r1687776 backport.", 
   "Notes:", 
   "r1688273 implements the API semantics; r1688395 contains", 
   "minor spelling and documentation fixes.", 
   ".", 
   "Clean merge depends on merging the r1684940 group first.", 
   "Votes:", 
   "+1: brane, rhuijben"
  ], 
  "revision_id": "1688548"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-07-01T04:00:26.570655Z", 
  "msg": [
   "Merge the r1684940 group from trunk:", 
   "* r1684940, r1685034, r1687769, r1687776", 
   "Make 'svnadmin verify --keep-going --quiet' print error details to stderr,", 
   "as documented by 'svnadmin help verify'.", 
   "Justification:", 
   "Calling a command with --quiet should not hide important parts of the", 
   "output, such as verification errors.  Without this fix, 'svnadmin verify", 
   "--keep-going --quiet' is rather useless in terms that it only gives an", 
   "indication of whether a particular repository passes the verification or", 
   "not, but doesn't show the root cause (error details) of what's wrong.", 
   "Notes:", 
   "This change features a redesign of the error reporting scheme being used", 
   "by svn_repos_verify_fs3() API.  At some point we realized that the way", 
   "API was working previously forced us to write rather hacky code on the", 
   "calling side in order to achieve the wanted behavior.  With the API", 
   "redesign, this is no longer needed.  Full discussion can be found in", 
   "http://svn.haxx.se/dev/archive-2015-05/0141.shtml (Subject: \"Possible", 
   "incompatibility of svn_repos_verify_fs2() in 1.9.0-rc1\").", 
   ".", 
   "r1684940 and r1685034 contain the initial fix for this problem and the", 
   "test.  r1687769 is the core fix that changes svn_repos_verify_fs3() API", 
   "and supersedes the fix from r1684940.  r1687776 is a documentation-only", 
   "follow-up to r1687769.  This is a 1.9.0 blocker due to a change in the", 
   "unreleased API.", 
   "Votes:", 
   "+1: kotkov, rhuijben, brane"
  ], 
  "revision_id": "1688547"
 }, 
 {
  "author": "dsmiley", 
  "date": "2015-07-01T02:16:55.805954Z", 
  "msg": [
   "LUCENE-6578: Geo3D: compute the distance from a point to a shape."
  ], 
  "revision_id": "1688546"
 }, 
 {
  "author": "dsmiley", 
  "date": "2015-07-01T02:03:43.674244Z", 
  "msg": [
   "LUCENE-6578: Geo3D: compute the distance from a point to a shape."
  ], 
  "revision_id": "1688545"
 }, 
 {
  "author": "ylavic", 
  "date": "2015-07-01T01:39:44.022683Z", 
  "msg": [
   "Test trailing spaces after chunk-size, too much and multiple send."
  ], 
  "revision_id": "1688544"
 }
]