[
 {
  "author": "shijh", 
  "date": "2015-07-05T16:45:05.824568Z", 
  "msg": [
   "OFBIZ-6542 as Gan Hong-Wai suggested, added EntityCondition.makeCondition(\"geoTypeId\", \"TERRITORY\") in CommonWorkers.java of Release 13.07.", 
   "Tested the change on page /ecommerce/control/editcontactmechnosave with Australia as the country selected, the Australian Capital Territory (AU-ACT) and Northern Territory (AU-NT) are in state list now."
  ], 
  "revision_id": "1689263"
 }, 
 {
  "author": "veithen", 
  "date": "2015-07-05T16:44:20.771215Z", 
  "msg": [
   "Restore the original ant-test directory and properly mavenize it. Kill the mavenization in woden-ant. Reason:", 
   "- The files in woden-ant were copied from ant-test without preserving history.", 
   "- woden-ant/downloads contains ZIP files downloaded from the W3C. There is no license for them, and it is not clear if we can include them. Note that they are likely not covered by http://www.w3.org/Consortium/Legal/2008/04-testsuite-copyright.html because they have been produced before 2004."
  ], 
  "revision_id": "1689262"
 }, 
 {
  "author": "seelmann", 
  "date": "2015-07-05T15:52:42.999144Z", 
  "msg": [
   "Update checkstyle config file", 
   "* Make it compatible with checkstyle 6.8.1", 
   "* Disable Javadoc checks, they produce too much violations", 
   "* Enable and configure whitespace checks according to Directory formatting rules", 
   "* Enable and configure LeftCurly/RightCurly rules according to Directory formatting rules", 
   "* Disable AvoidInlineConditionals and SimplifyBooleanReturn checks, there are plenty of usages within the code", 
   "* Remove DoubleCheckedLocking and RedundantThrows checks, they have been removed from Checkstyle suite"
  ], 
  "revision_id": "1689261"
 }, 
 {
  "author": "veithen", 
  "date": "2015-07-05T14:52:32.723628Z", 
  "msg": [
   "Never write stuff to the source tree; always use the target directory to write files generated during the build."
  ], 
  "revision_id": "1689260"
 }, 
 {
  "author": "veithen", 
  "date": "2015-07-05T14:02:50.341199Z", 
  "msg": [
   "Plugin dependencies should not have scope."
  ], 
  "revision_id": "1689259"
 }
]