[
 {
  "author": "snagy", 
  "date": "2001-03-12T18:32:22.000000Z", 
  "msg": [
   "PR: the new classes do not belong to a package (just like the original TestBed).", 
   "i've replaced tabs with four spaces and tied them up so that they comply a", 
   "little better with the current coding standard.", 
   "i've tried to replace testN methods with more desciptive names and added a", 
   "little documentation where i can.", 
   "otherwise, they're just as they were before.", 
   "1. i guess that these files need to be added into this new location (rather", 
   "than patchs) so i've attached the new files. if it's patches that are needed,", 
   "could somebody point me in the right direction...", 
   "2. i don't think that anyone will be relying on the old classes so it should", 
   "be safe to remove them. but i could submit deprecated versions if that's", 
   "what's needed.", 
   "3. the documentation for these isn't brilliant. what'd be great would be for", 
   "somebody to volunteer to improve the examples documentation as a whole. (but", 
   "i'm not volunteering...)", 
   "4. i guess the examples/README.txt should be updated. i'm willing to submit a", 
   "patch. on the other hand, if there's somebody who really fancies doing 3, then", 
   "i'll leave it.", 
   "- robert", 
   "Submitted by: Robert Burrell Donkin robertdonkin@appleonline.net"
  ], 
  "revision_id": "168909"
 }, 
 {
  "author": "jon", 
  "date": "2001-03-09T22:44:17.000000Z", 
  "msg": [
   "the version in there at the moment is the rewritten ECSDefaults class i", 
   "submitted (which prevents ECS dying when the properties can't be loaded). i'm a", 
   "bit of a CVS newbie so i probably didn't get that other change in (sorry.) i", 
   "think i've got CVS set up right now on my development machine.", 
   "here's a patch which allows the property file to be overridden by setting the", 
   "ecs.properties property.", 
   "Robert Burrell Donkin <RobertDonkin@appleonline.net>"
  ], 
  "revision_id": "168908"
 }, 
 {
  "author": "jon", 
  "date": "2001-03-09T09:40:54.000000Z", 
  "msg": [
   "rebuilt with latest jakarta-site2 module"
  ], 
  "revision_id": "168907"
 }, 
 {
  "author": "jon", 
  "date": "2001-03-09T09:40:31.000000Z", 
  "msg": [
   "updated to latest properties", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "168906"
 }, 
 {
  "author": "jon", 
  "date": "2001-02-04T22:06:32.000000Z", 
  "msg": [
   "Robert Burrell Donkin <RobertDonkin@appleonline.net> contribution to", 
   "make ECSDefaults more easy to deal with...by allowing external ecs.properties", 
   "files to be set.", 
   "updated the .cvsignore to reflect reality"
  ], 
  "revision_id": "168905"
 }
]