[
 {
  "author": "krosenvold", 
  "date": "2015-08-06T12:49:39.207862Z", 
  "msg": [
   "Added changes.xml notes on patch for IO-446, that accidentally got commited with other changes in r1686747"
  ], 
  "revision_id": "1694488"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-08-06T12:42:28.061599Z", 
  "msg": [
   "OAK-3186 - Assign correct scope for various dependencies in oak-pojosr module", 
   "-- Specify test scope for Lucene related deps", 
   "-- Exclude animal sniffer from Felix SCR as it get pulled into webapp due to transitive dependency", 
   "-- Exclude OSGi deps from Felix Connect to prevent them from getting dumped in webapp"
  ], 
  "revision_id": "1694487"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-08-06T12:42:20.994146Z", 
  "msg": [
   "OAK-3185 - Port and refactor jackrabbit-webapp module to Oak (WIP)", 
   "Introducing repository-config.json which acts as a substitute for repository.xml to configure the whole repository", 
   "-- Changed the default folder to 'oak' under which repository would be created", 
   "-- Repository initialization logic would use OSGiRepositoryFactory to initialize repository. Still cannot use ServiceLoader approach as oak-jcr has a dummy factory", 
   "-- Disabled auto JNDI registration for now as we do not have MemoryInitialContextFactory. User can configure it as per requirement of respective app server"
  ], 
  "revision_id": "1694486"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-08-06T12:42:08.266401Z", 
  "msg": [
   "OAK-3185 - Port and refactor jackrabbit-webapp module to Oak (WIP)", 
   "-- Add intermediate pom for modules under oak-examples"
  ], 
  "revision_id": "1694485"
 }, 
 {
  "author": "chetanm", 
  "date": "2015-08-06T12:42:00.490785Z", 
  "msg": [
   "OAK-3185 - Port and refactor jackrabbit-webapp module to Oak (WIP)", 
   "-- Remove the compatibility.zip as thats related to JR2", 
   "-- Update Jetty plugin to latest", 
   "-- Configure failsafe plugin - Somehow without explicit config failsafe plugin is not getting executed", 
   "-- Add oak-pojosr dependency", 
   "-- Add explicit dependency to commons-io:2.4 - Somehow due to transitive pull commons-io:1.4 is getting used with which Oak does not work. So Adding explicit dependency"
  ], 
  "revision_id": "1694484"
 }
]