[
 {
  "author": "thomasm", 
  "date": "2015-08-05T06:55:40.959887Z", 
  "msg": [
   "OAK-3169 rep:versionablePaths mixin not always set for versionable nodes"
  ], 
  "revision_id": "1694138"
 }, 
 {
  "author": "thelabdude", 
  "date": "2015-08-05T04:23:51.585539Z", 
  "msg": [
   "SOLR-7847: Implement run example logic in Java instead of OS-specific scripts in bin/solr"
  ], 
  "revision_id": "1694137"
 }, 
 {
  "author": "svn-role", 
  "date": "2015-08-05T04:00:18.261207Z", 
  "msg": [
   "Merge r1694023 from trunk:", 
   "* r1694023", 
   "Fix typo in help string.", 
   "Justification:", 
   "Obvious fix.", 
   "Votes:", 
   "+1: danielsh"
  ], 
  "revision_id": "1694136"
 }, 
 {
  "author": "spamassassin_role", 
  "date": "2015-08-05T02:39:17.065472Z", 
  "msg": [
   "updated scores for revision 1694012 active rules added since last mass-check"
  ], 
  "revision_id": "1694135"
 }, 
 {
  "author": "bpendleton", 
  "date": "2015-08-05T02:12:49.209769Z", 
  "msg": [
   "DERBY-6801: Implement MessageUtils class so client/server can share error code.", 
   "This patch was contributed by Abhinav Gupta (abhinavgupta2004 at gmail dot com)", 
   "This change implements a new class in the \"shared\" portion of the Derby code", 
   "tree. The MessageUtils class contains code which was refactored from various", 
   "Engine and Network Server classes, including MessageService and DRDAConnThread.", 
   "The purpose of this class is to encapsulate certain details about how error", 
   "messages and exceptions are encoded and decoded when passed between the Network", 
   "Server and the Network Client, so that the Network Client can decode the", 
   "error information to access the arguments to the message when needed.", 
   "Nothing about the protocol between the client and server is changed, nor is", 
   "anything about the encoding of the data changed. The only change is to make", 
   "the logic which implements the encoding/decoding available to both the server", 
   "and the client so that they can both use it without duplicating the logic.", 
   "As of this change, nothing uses the MessageUtils class. That is, this change", 
   "adds the new class, but doesn't remove any of the existing implementations in", 
   "the Engine and Network Server code bases.", 
   "Follow-on changes will (incrementally) change the Engine, the Network Server,", 
   "and the Network Client to use the code in this new MessageUtils class."
  ], 
  "revision_id": "1694134"
 }
]