[
 {
  "author": "rhuijben", 
  "date": "2015-08-20T11:17:43.537904Z", 
  "msg": [
   "Make libsvn_fs_util, libsvn_fs_base, libsvn_fs_fs and libsvn_fs_x proper", 
   "shared libraries on Windows when shared libraries are enabled in the build,", 
   "just like on other platforms. Before this all of them were statically", 
   "linked into libsvn_fs and any project that directly used their functions.", 
   "This patch automatically detects circular reference problems in this code,", 
   "such as the one fixed in r1696695 and will allow delay loading quite a bit", 
   "of code from svn and svnadmin in a followup patch.", 
   "The 'msvc-force-static' markers on many test projects formalizes that these", 
   "projects already depended on internal apis, which were only available because", 
   "they were statically linked.", 
   "* build.conf", 
   "(libsvn_fs_base,", 
   "libsvn_fs_fs,", 
   "libsvn_fs_x,", 
   "libsvn_fs_util): Properly declare exports of these libraries.", 
   "* subversion/libsvn_fs/fs-loader.h", 
   "(LIBSVN_FS_FS_H): Use proper unique define.", 
   "(svn_fs_base__init,", 
   "svn_fs_fs__init,", 
   "svn_fs_x__init): Move to separate header files to allow using the export", 
   "generator.", 
   "* subversion/libsvn_fs_base/fs_init.h", 
   "* subversion/libsvn_fs_fs/fs_init.h", 
   "* subversion/libsvn_fs_x/fs_init.h", 
   "New files containing the single entry point of these libraries."
  ], 
  "revision_id": "1696758"
 }, 
 {
  "author": "markt", 
  "date": "2015-08-20T11:10:24.873891Z", 
  "msg": [
   "Expand the test to ensure that once the flow control window goes negative, nothing is written until it becomes positive again."
  ], 
  "revision_id": "1696757"
 }, 
 {
  "author": "markt", 
  "date": "2015-08-20T11:02:58.592046Z", 
  "msg": [
   "Changes to the initial window size need to modify existing flow control windows as if the had started with the new initial size."
  ], 
  "revision_id": "1696756"
 }, 
 {
  "author": "icing", 
  "date": "2015-08-20T10:56:08.930773Z", 
  "msg": [
   "fixed type of error parameter for invalid_frame_recv_cb callback"
  ], 
  "revision_id": "1696755"
 }, 
 {
  "author": "markt", 
  "date": "2015-08-20T10:36:25.685190Z", 
  "msg": [
   "Refactor setting handling so common validation is applied to local and remote"
  ], 
  "revision_id": "1696754"
 }
]