[
 {
  "author": "julianfoad", 
  "date": "2015-08-18T14:04:13.208137Z", 
  "msg": [
   "On the 'move-tracking-2' branch: In svnmover, allow the WC working branch", 
   "to be a different branch from its base branch. This will be useful if we want to", 
   "enable a WC to commit a top-level branching operation.", 
   "Also allow the WC to be rooted at any branch, not necessarily at the top level,", 
   "as this makes the code more regular and flexible.", 
   "TODO: When looking up PATH@REV inputs, this still uses the top branch number", 
   "within revision REV to look up PATH.", 
   "* subversion/svnmover/svnmover.h", 
   "(svnmover_wc_t): Replace top_branch_num with base and working branch ids.", 
   "* subversion/svnmover/svnmover.c", 
   "(wc_checkout): Take the base branch id as a parameter. Use base and working", 
   "branch ids instead of top branch number.", 
   "(wc_create,", 
   "do_update,", 
   "do_commit): Pass branch ids around.", 
   "(commit_callback_baton_t,", 
   "wc_commit,", 
   "display_diff_of_commit): When showing a diff of the commit, use branch ids", 
   "of the base and working branches instead of assuming a single top-level", 
   "branch number suffices for both.", 
   "(execute): Adjust accordingly.", 
   "(sub_main): Pass a branch id instead of a top branch number to create_wc()."
  ], 
  "revision_id": "1696418"
 }, 
 {
  "author": "yonik", 
  "date": "2015-08-18T14:04:06.018977Z", 
  "msg": [
   "SOLR-7935:fix race that can cause a NPE in openNewSearcher called from an update concurrent with a core reload"
  ], 
  "revision_id": "1696417"
 }, 
 {
  "author": "cziegeler", 
  "date": "2015-08-18T14:02:13.714045Z", 
  "msg": [
   "Add connect release"
  ], 
  "revision_id": "1696416"
 }, 
 {
  "author": "kgiusti", 
  "date": "2015-08-18T13:29:56.542743Z", 
  "msg": [
   "QPID-6698: use the monotonic clock for AMQP 1.0 idle timeout"
  ], 
  "revision_id": "1696415"
 }, 
 {
  "author": "markt", 
  "date": "2015-08-18T13:03:11.365692Z", 
  "msg": [
   "Fix HTTP2 6.1 test case failure.", 
   "Validate data frame padding before sending notifications for that frame in case the padding is invalid. In that case we do not want to process the data part of the frame."
  ], 
  "revision_id": "1696414"
 }
]