[
 {
  "author": "desruisseaux", 
  "date": "2015-09-02T15:37:39.804232Z", 
  "msg": [
   "Add test for <gml:Conversion> unmarshalling."
  ], 
  "revision_id": "1700843"
 }, 
 {
  "author": "jwross", 
  "date": "2015-09-02T15:26:45.180625Z", 
  "msg": [
   "ARIES-1392 Provide a more efficient implementation of a system repository.", 
   "While running the same test case developed as part of ARIES-1357, profiling continually showed a bottleneck surrounding the system repository. A more efficient implementation has been provided using code copied over from the Apache Felix (http://felix.apache.org/) project.", 
   "http://svn.apache.org/viewvc/felix/trunk/framework/src/main/java/org/apache/felix/framework/capabilityset/CapabilitySet.java?view=log", 
   "http://svn.apache.org/viewvc/felix/trunk/framework/src/main/java/org/apache/felix/framework/capabilityset/CapabilitySet.java?view=log", 
   "http://svn.apache.org/viewvc/felix/trunk/framework/src/main/java/org/apache/felix/framework/util/SecureAction.java?view=log", 
   "http://svn.apache.org/viewvc/felix/trunk/framework/src/main/java/org/apache/felix/framework/util/StringComparator.java?view=log", 
   "These classes were copied to the org.apache.aries.subsystem.core.capabilityset package with some modifications. A new repository implementation called CapabilitySetRepository was created using these classes from the Felix project. This repository will index the standard namespaces along with their associated namespace attributes. It will also create additional capability sets as necessary when encountering custom namespaces.", 
   "The system repository now delegates to CapabilitySetRepository. In addition, the system repository now tracks both bundles and subsystem services. Capabilities are added to the repository as they appear and removed when they go away. Bundle revisions are wrapped with BundleRevisionResource in order to account for service capabilities.", 
   "Other changes resulting from this optimization are listed below. They were necessary and appropriate because either (a) BundleRevisionResource became part of the normal flow when delivered from the system repository, or (b) computing service capabilities for the system repository requires searching for blueprint.xml files in the bundle which causes the framework to attempt a resolution.", 
   "(1) BundleResourceInstaller must now check for BundleRevisionResource in addition to BundleRevision when installing a bundle.", 
   "(2) BundleRevisionResource now provides access to the wrapped BundleRevision.", 
   "(3) ResolveContext must now check for BundleRevisionResource in addition to BundleResource when identifying the region of an already installed resource.", 
   "(4) SubsystemResolverHook will now prevent bundles not referenced by any subsystems from resolving. A non-referenced bundle is one that is being installed as part of a subsystem installation before it has been added as a reference.", 
   "(5) Utils now includes BundleRevisionResource, in addition to BasicSubsystem and BundleRevision, as a shared resource, which is essentially any resource that has already been installed and being referenced by a new subsystem.", 
   "(6) RootSubsystemTest was modified to allow for the RESOLVED state when ensuring the bundle has not been started. Frameworks are allowed to attempt to resolve bundles as needed, and subsystems no longer prevent resolution after entering the installed state, which is the case in this test."
  ], 
  "revision_id": "1700842"
 }, 
 {
  "author": "noble", 
  "date": "2015-09-02T15:15:59.413053Z", 
  "msg": [
   "SOLR-7984: wrong and misleading error message 'no default request handler is registered'"
  ], 
  "revision_id": "1700841"
 }, 
 {
  "author": "noble", 
  "date": "2015-09-02T15:13:27.208480Z", 
  "msg": [
   "SOLR-7984: wrong and misleading error message 'no default request handler is registered'"
  ], 
  "revision_id": "1700840"
 }, 
 {
  "author": "rmuir", 
  "date": "2015-09-02T15:12:10.534286Z", 
  "msg": [
   "LUCENE-6774: Remove solr hack in MorfologikFilter"
  ], 
  "revision_id": "1700839"
 }
]