[
 {
  "author": "felicity", 
  "date": "2005-05-13T23:52:09.485812Z", 
  "msg": [
   "bug 4330: Conf::clone() was not restoring code references which made things like all eval rules stop functioning.  initial attempt to revert to a 'overwrite' mode instead of a 'make a new object' setup."
  ], 
  "revision_id": "170109"
 }, 
 {
  "author": "jta", 
  "date": "2005-05-13T23:38:43.624512Z", 
  "msg": [
   "Move the Derby 10.0 getstart manual from derby/site to derby/docs/branches/10.0"
  ], 
  "revision_id": "170108"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-05-13T23:30:30.947706Z", 
  "msg": [
   "Fixup the copyrights on the samples to run from 2004-2005.", 
   "BB: self", 
   "DRT: Beehive pass / build.dist pass"
  ], 
  "revision_id": "170107"
 }, 
 {
  "author": "mikem", 
  "date": "2005-05-13T22:51:08.476490Z", 
  "msg": [
   "committed the following change for ksunithaghm@gmail.com", 
   "enhancements to the  TestDurabilityProperty test as a first step  to try to take care of  slow machines where inserts may take longer time than estimated bound in this test.", 
   "So if inserts in autocommit mode take more time than the estimated bound, then the test now", 
   "--checks if time taken in autocommit on and off are within a close range ( this is because syncs are not happening with derby.system.durability=test mode)", 
   "-- if not, then it checks if the time taken to do the insert with derby.system.durability=test mode and without this mode set is within close range, if so it reports a failure with a detailed message explaining the above cases and that the test times the inserts and checks if it within the approximate bounds.", 
   "Also note, it will work as expected even if all tests (derbyall)  are running with derby.system.durability=test since this(derby.system.durability) property is explicitly set as needed within the test before booting the database.", 
   "The bounds work ok with write cache enabled /disabled on my laptop..  I also tried it out on a slow machine that I have access to and it seems fine. Next, I'll look into adding some kind of acceptable bounds as a percentage of the time taken with this mode set for slower machines.   But if someone notices any issues with the timing on different configurations please post to the list."
  ], 
  "revision_id": "170106"
 }, 
 {
  "author": "schof", 
  "date": "2005-05-13T22:45:53.987789Z", 
  "msg": [
   "email on build failure"
  ], 
  "revision_id": "170105"
 }
]