[
 {
  "author": "dreedy", 
  "date": "2015-09-15T18:11:59.600877Z", 
  "msg": [
   "Added pom for the browser"
  ], 
  "revision_id": "1703268"
 }, 
 {
  "author": "rwhitcomb", 
  "date": "2015-09-15T17:47:28.906769Z", 
  "msg": [
   "PIVOT-972:  Fix some more bugs with the calculator tutorial:", 
   "* Implement the difference between \"Clear\" and \"All Clear\".", 
   "* Highlight the current operator button (by changing border color).", 
   "* When two operators are pressed in a row, just change operators,", 
   "don't do the prior operation.", 
   "* Fix backspace not to do it twice, and to work properly when clearing", 
   "the last digit.", 
   "This is a merge of revision 1688484 from trunk to branches/2.0.x."
  ], 
  "revision_id": "1703267"
 }, 
 {
  "author": "rwhitcomb", 
  "date": "2015-09-15T17:44:38.548496Z", 
  "msg": [
   "PIVOT-972:  Fix a bug with percent calculations in the Calculator tutorial application.", 
   "This is a merge of revision 1688306 from trunk to branches/2.0.x."
  ], 
  "revision_id": "1703266"
 }, 
 {
  "author": "rwhitcomb", 
  "date": "2015-09-15T17:42:25.895513Z", 
  "msg": [
   "PIVOT-972:  Add a small tutorial application: a simple calculator app, to demonstrate", 
   "keyboard mappings and action mappings.", 
   "This is the first cut of the app, which works, except for some issues:", 
   "* The \"Settings\" button does nothing.", 
   "* There are issues with the result overflowing the display sometimes.", 
   "* Arithmetic errors are not trapped and handled gracefully.", 
   "* No shortcut key for the \"+/-\" button.", 
   "* Would like to \"push\" the buttons when the corresponding keys are pressed.", 
   "* No help is available.", 
   "* There may be a problem with \"Clear\" when an operator is pending.", 
   "* There is no check on the input size, which can easily overflow the display area.", 
   "* Backspace after an operator is chosen may not work correctly.", 
   "* The native window should be sized nicely to just fit the form.", 
   "* Needs Javadoc in the code.", 
   "Add another \"famfamfam\" icon for use here, and update the NOTICE file.", 
   "Add several Keyboard.KeyCode values that are used here for available virtual keys.", 
   "This is a merge of revision 1687874 from trunk to branches/2.0.x with one change", 
   "so that Calculator.java will compile with Java 6."
  ], 
  "revision_id": "1703265"
 }, 
 {
  "author": "schor", 
  "date": "2015-09-15T17:41:08.007824Z", 
  "msg": [
   "no Jira - just clarifying comments, including super UIMA and Java types of arrays"
  ], 
  "revision_id": "1703264"
 }
]