[
 {
  "author": "jleroux", 
  "date": "2015-09-20T08:37:51.769145Z", 
  "msg": [
   "A patch from Martin Becker from a Gareth Carter's idea for \"Fix deprecation issues in framework/entity\" https://issues.apache.org/jira/browse/OFBIZ-6276", 
   "As reported Adam:", 
   "It appears that the storeAll() variants are being refactor; basically, the useCache parameter is being removed.  However, this has caused the entity engine to have deprecation with itself.", 
   "Gareth suggested:", 
   "What about new method that allows passing in an options object", 
   "storeAll(List<GenericValue> values, StoreOptions options) ?", 
   "You can deprecate the old methods without changes", 
   "Moving forward, you would just need to add new values to the StoreOptions class rather than adding new parameters to the existing one", 
   "I am not sure about the name StoreOptions though, EntityOptions ?", 
   "Martin contributed the implementation and suggested EntityStoreOptions for the new class name.", 
   "Ha created a patch which removes the use of deprecated API and the deprecated API itself from Delegator and GenericDelegator.", 
   "Introduced the EntityStoreOptions class as mentioned in a comment before to substitute the createDummyFks parameter of storeAll method to avoid ambiguous API after removing the deprecated doCacheClear parameter.", 
   "The decryptFieldValue method, just defined deprecated by Jacopo is left there as deprecated. Only the \"old\" deprecated methods where removed.", 
   "Gil Portenseigne supplied a pure svn patch, actually I had conflicting pending changes locally which prevented me to apply Martin's original patch"
  ], 
  "revision_id": "1704108"
 }, 
 {
  "author": "hboutemy", 
  "date": "2015-09-20T07:50:29.425430Z", 
  "msg": [
   "[DOXIA-531] improved MacroRequest API with parser and sourceContent parameters requirements"
  ], 
  "revision_id": "1704107"
 }, 
 {
  "author": "cschneider", 
  "date": "2015-09-20T07:48:59.966786Z", 
  "msg": [
   "[ARIES-1373] Use new namespace"
  ], 
  "revision_id": "1704106"
 }, 
 {
  "author": "hboutemy", 
  "date": "2015-09-20T07:45:25.799906Z", 
  "msg": [
   "merge ifs"
  ], 
  "revision_id": "1704105"
 }, 
 {
  "author": "hboutemy", 
  "date": "2015-09-20T07:39:37.032838Z", 
  "msg": [
   "make xhtml and xdoc code about sourceContent for macro similar"
  ], 
  "revision_id": "1704104"
 }
]