[
 {
  "author": "leif", 
  "date": "2003-05-18T08:57:57.000000Z", 
  "msg": [
   "Up the required Wrapper version to 3.0.3 because previous 3.0.x versions had", 
   "some stability problems."
  ], 
  "revision_id": "17114"
 }, 
 {
  "author": "leif", 
  "date": "2003-05-17T20:16:59.000000Z", 
  "msg": [
   "Add an optional attribute to connector definitons so that if they fail to be", 
   "configured the user can control whether that should affect whether or not the", 
   "entire InstrumentManager fails to be configured.  By default it does not.  This", 
   "was done to prevent a bind failure by the Altrmi connector from causing an", 
   "entire application to fail to startup."
  ], 
  "revision_id": "17113"
 }, 
 {
  "author": "leif", 
  "date": "2003-05-17T19:02:44.000000Z", 
  "msg": [
   "Update the debug log messages so they all include both the name of the logger", 
   "as well as the current thread name.  A big help when trying to figure out what is", 
   "happening in the multi threaded chaos that is a thread pool.  Nice when they work", 
   "but when things are going wrong, debugging can have unexpected consequences", 
   "on your sanity."
  ], 
  "revision_id": "17112"
 }, 
 {
  "author": "leif", 
  "date": "2003-05-17T18:37:30.000000Z", 
  "msg": [
   "Make the time based tests less sensitive to external loads at the time the test is", 
   "run by increasing the window on time comparisons from 100ms to 500ms."
  ], 
  "revision_id": "17111"
 }, 
 {
  "author": "leif", 
  "date": "2003-05-17T18:30:19.000000Z", 
  "msg": [
   "Fixed a bad thread leak.  When a worker thread was trimmed from a thread pool it", 
   "was entering a wait state rather than terminating, this was leading to the pool", 
   "thinking it was freed.  Over time this would lead to an impressive number of idle", 
   "threads...", 
   "Also added a detail child logger so that problems like this can be more easily", 
   "tracked down by being able to set the main logger to DEBUG, and reduce the", 
   "total output by setting the detail child logger to INFO."
  ], 
  "revision_id": "17110"
 }
]