[
 {
  "author": "lehors", 
  "date": "2001-01-17T17:25:53.000000Z", 
  "msg": [
   "removed unused field that was left over"
  ], 
  "revision_id": "172499"
 }, 
 {
  "author": "tng", 
  "date": "2001-01-15T21:32:27.000000Z", 
  "msg": [
   "fixed typo"
  ], 
  "revision_id": "172498"
 }, 
 {
  "author": "tng", 
  "date": "2001-01-15T21:26:34.000000Z", 
  "msg": [
   "Performance Patches by David Bertoni.", 
   "Details: (see xerces-c-dev mailing Jan 14)", 
   "XMLRecognizer.cpp: the internal encoding string XMLUni::fgXMLChEncodingString", 
   "was going through this function numerous times.  As a result, the top hot-spot", 
   "for the parse was _wcsicmp().  The real problem is that the Microsofts wide string", 
   "functions are unbelievably slow.  For things like encodings, it might be", 
   "better to use a special comparison function that only considers a-z and", 
   "A-Z as characters with case.  This works since the character set for", 
   "encodings is limit to printable ASCII characters.", 
   "XMLScanner2.cpp: This also has some case-sensitive vs. insensitive compares.", 
   "They are also much faster.  The other tweak is to only make a copy of an attribute", 
   "string if it needs to be split.  And then, the strategy is to try to use a", 
   "stack-based buffer, rather than a dynamically-allocated one.", 
   "SAX2XMLReaderImpl.cpp: Again, more case-sensitive vs. insensitive comparisons.", 
   "KVStringPair.cpp & hpp: By storing the size of the allocation, the storage can", 
   "likely be re-used many times, cutting down on dynamic memory allocations.", 
   "XMLString.hpp: a more efficient implementation of stringLen().", 
   "DTDValidator.cpp: another case of using a stack-based buffer when possible", 
   "These patches made a big difference in parse time in some of our test", 
   "files, especially the ones are very attribute-heavy."
  ], 
  "revision_id": "172497"
 }, 
 {
  "author": "tng", 
  "date": "2001-01-12T22:09:08.000000Z", 
  "msg": [
   "Various update for Xerces 1.4"
  ], 
  "revision_id": "172496"
 }, 
 {
  "author": "tng", 
  "date": "2001-01-12T21:52:49.000000Z", 
  "msg": [
   "Documentation update ready for Xerces 1.4"
  ], 
  "revision_id": "172495"
 }
]