[
 {
  "author": "tng", 
  "date": "2001-12-06T17:52:17.000000Z", 
  "msg": [
   "Performance Enhancement.  The QName that was passed to the CMLeaf", 
   "constructor was always being copied, even though the CMLeaf objects", 
   "only existed during construction of a DFA.  In most cases the original", 
   "QName that was passed into the CMLeaf constructor continued to exist long", 
   "after the CMLeaf was destroyed; in some cases the QName was constructed", 
   "specifically to be passed to the CMLeaf constructor.  Added a second CMLeaf constructor that indicated the QName passed in was to be adopted; otherwise the CMLeaf constructor just sets a reference to the QName passed in.", 
   "By Henry Zongaro."
  ], 
  "revision_id": "173359"
 }, 
 {
  "author": "tng", 
  "date": "2001-12-06T17:51:18.000000Z", 
  "msg": [
   "Performance Enhancement. The ContentSpecNode constructor always copied the QName", 
   "that was passed to it.  Added a second constructor that allows the QName to be just assigned, not copied.", 
   "That was because there are some cases in which a temporary QName was constructed, passed to ContentSpecNode, and then deleted.", 
   "There were examples of that in TraverseSchema and DTDScanner.", 
   "By Henry Zongaro."
  ], 
  "revision_id": "173358"
 }, 
 {
  "author": "tng", 
  "date": "2001-12-06T17:48:36.000000Z", 
  "msg": [
   "Performance Enhancement.  Added setNPrefix and setNLocalPart methods that allow code to take advantage of the fact that it knows the length of the prefix and local name, when possible.  That can avoid a copy of the prefix into a null-terminated temporary variable before copying into the fPrefix.", 
   "Also changed the getRawName method so that it would simply return the local part when there is no prefix, instead of allocating another buffer to copy the local part into the fRawName.", 
   "When there is a prefix, changed the getRawName to copy the prefix and local part into the fRawName using XMLString::moveChars instead of using XMLString::copyString and XMLString::catString.  The catString method has to loop past the prefix portion of the fRawName, which seems like a waste.", 
   "By Henry Zongaro."
  ], 
  "revision_id": "173357"
 }, 
 {
  "author": "tng", 
  "date": "2001-12-06T17:47:04.000000Z", 
  "msg": [
   "Performance Enhancement.  Modify the handling of the fNEL option so that it results in fgCharCharsTable being modified, instead of having all of the low-level routines check the option.  This seemed acceptable because the code appears to only permit the option to be turned on and not turned off again.   By Henry Zongaro."
  ], 
  "revision_id": "173356"
 }, 
 {
  "author": "knoaman", 
  "date": "2001-12-06T17:45:01.000000Z", 
  "msg": [
   "Add identity constraints to samples."
  ], 
  "revision_id": "173355"
 }
]