[
 {
  "author": "neilg", 
  "date": "2003-04-17T21:58:50.000000Z", 
  "msg": [
   "Adding a new property,", 
   "http://apache.org/xml/properties/security-manager, with", 
   "appropriate getSecurityManager/setSecurityManager methods on DOM", 
   "and SAX parsers.  Also adding a new SecurityManager class.", 
   "The purpose of these modifications is to permit applications a", 
   "means to have the parser reject documents whose processing would", 
   "otherwise consume large amounts of system resources.  Malicious", 
   "use of such documents could be used to launch a denial-of-service", 
   "attack against a system running the parser.  Initially, the", 
   "SecurityManager only knows about attacks that can result from", 
   "exponential entity expansion; this is the only known attack that", 
   "involves processing a single XML document.  Other, simlar attacks", 
   "can be launched if arbitrary schemas may be parsed; there already", 
   "exist means (via use of the EntityResolver interface) by which", 
   "applications can deny processing of untrusted schemas.  In future,", 
   "the SecurityManager will be expanded to take these other exploits", 
   "into account."
  ], 
  "revision_id": "174904"
 }, 
 {
  "author": "peiyongz", 
  "date": "2003-04-15T15:58:19.000000Z", 
  "msg": [
   "Bug#17096 XMLUri relative path calculation badly broken", 
   "patch from berin@ozemail.com.au (Berin Lautenbach)"
  ], 
  "revision_id": "174903"
 }, 
 {
  "author": "gareth", 
  "date": "2003-04-14T08:41:00.000000Z", 
  "msg": [
   "Xlat now works under linux - Big thanks to Neil Graham (I no longer have to find a windows box). Still slight problems working with glibc before 2.2.4 (If you mess up the parameters it seg faults due to handling of wprintf)"
  ], 
  "revision_id": "174902"
 }, 
 {
  "author": "peiyongz", 
  "date": "2003-04-09T18:29:19.000000Z", 
  "msg": [
   "Bug#18860: Samples on Borland C++ 6 - access violations and build errors", 
   "patch from paol1976@yahoo.com (Pedro Lopes)"
  ], 
  "revision_id": "174901"
 }, 
 {
  "author": "peiyongz", 
  "date": "2003-04-09T15:36:18.000000Z", 
  "msg": [
   "Bug#18856: Example code do not compile, patch from", 
   "guido.gagliardi@ge.infn.it (Guido Gagliardi)"
  ], 
  "revision_id": "174900"
 }
]