[
 {
  "author": "skitching", 
  "date": "2005-05-29T06:55:48.705120Z", 
  "msg": [
   "bugzilla #23815.", 
   "Create new methods getPropertyOfMapBean and setPropertyOfMapBean that the existing", 
   "setNestedProperty and getNestedProperty methods now call when they discover the", 
   "bean they are accessing implements Map. This makes it much easier for users to", 
   "subclass and customise this behaviour of PropertyUtilsBean, eg in order to", 
   "restore pre-1.5 behaviour.", 
   "This patch also causes an exception to be thrown when the propertyName passed to", 
   "getPropertyOfMapBean or setPropertyOfMapBean has MAPPED_DELIM or INDEXED_DELIM", 
   "chars in it. This never worked as expected before (the whole string was treated", 
   "literally as the propertyName), so throwing an exception here should not break", 
   "any existing code. It should be of help to future developers who make this", 
   "mistake though..."
  ], 
  "revision_id": "178929"
 }, 
 {
  "author": "skitching", 
  "date": "2005-05-29T05:45:27.989703Z", 
  "msg": [
   "* replace test case PropertyUtilsTestCase.testSetMapExtension with test case", 
   "testMapExtensionDefault. This new test case verifies that a class that extends", 
   "Map will have any simple properties ignored in favour of Map.set/Map.get. This", 
   "behaviour has been agreed as per discussion on bugzilla #23815. With this", 
   "updated test case, the old PropertyUtilsBean code now fails - ie this change", 
   "breaks backward compatibility.", 
   "* fixes PropertyUtilsBean.setNestedProperty so it no longer checks for", 
   "the existence of a simple property before using Map methods; Map", 
   "methods are always used on a Map object. This backs out the change made", 
   "in bugzilla#14440.", 
   "* temporarily removes test PropertyUtilsTestCase.testBeanImplementingMap.", 
   "I'll add it (or a variant thereof) back soon."
  ], 
  "revision_id": "178928"
 }, 
 {
  "author": "", 
  "date": "2005-05-29T04:24:30.003469Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "178927"
 }, 
 {
  "author": "dgeary", 
  "date": "2005-05-29T04:12:52.006019Z", 
  "msg": [
   "I updated the javadocs for ValidatorScript.findCommonsValidators() to reflect handling of required validators. I also updated the validator use case so that we have a required validator on the server. (In an unrelated mod, I removed the required validator that was attached to the Amount field, because the field's converter provides 0.00 for empty input, thus obviating the need for the validatior). I updated the explanation of the validator use case in the JSP page, which meant changing Bundle.properties and Bundle_de.properties. I just copied the English text for the validation page from Bundle.properties to Bundle_de.properties; someone else will have to do the translation."
  ], 
  "revision_id": "178926"
 }, 
 {
  "author": "skitching", 
  "date": "2005-05-29T04:10:04.608848Z", 
  "msg": [
   "Test case to show bug for setNestedProperty with pattern \"a(b)\" when a is a Map."
  ], 
  "revision_id": "178925"
 }
]