[
 {
  "author": "bandaram", 
  "date": "2005-06-06T19:19:34.039194Z", 
  "msg": [
   "Derby-335: Add synonym support to Derby. See the following for more description of the functionality.", 
   "Submitted by Satheesh Bandaram (satheesh@sourcery.org)", 
   "Couple of changes still pending to complete this feature:", 
   "1) Add registering and checking for Dependencies. These ensure all required objects have been droped before droping synonyms and dropping of synonyms invalidate all required objects.", 
   "2) Add more tests and possible minor code cleanups.", 
   "Synonym Functionality:", 
   "----------------------", 
   "Synonym provides an alternate name for a table or a view that is present in the", 
   "same schema or another schema. A synonym can also be created for another", 
   "synonym, causing nesting of synonyms. A synonym can be used in SELECT, INSERT,", 
   "UPDATE, DELETE or LOCK TABLE statements instead of the original qualified table", 
   "or view name. Note that a synonym can be created for a table or a view that", 
   "doesn't yet exists. But the target table/view must be present before the", 
   "synonym can be used.", 
   "Synonyms are supported by all major database vendors, including Oracle, DB2 and", 
   "mySQL. DB2 also allows CREATE ALIAS statement, which does exactly same as", 
   "CREATE SYNONYM. Creating aliases instead of synonyms is not supported by Oracle", 
   "or mySQL, so I propose that Derby not support creating aliases. Synonyms are not", 
   "part of SQL-2003 spec, but is a common-SQL statement among major database", 
   "vendors. SQL standard doesn't pay attention to DDLs as much, so I suspect they", 
   "skipped synonyms.", 
   "I will be adding two new DDL statements to Derby:", 
   "CREATE SYNONYM <SynonymSchema>.<SynonymName> FOR <TargetSchema>.<TargetName>", 
   "DROP SYNONYM <SynonymSchema>.<SynonymName>", 
   "Synonyms share the same namespace as tables or views. It is not possible to", 
   "create a synonym with same name as a table that already exists in the same", 
   "schema. Similarly, a table/view can't be created that matches a synonym already", 
   "present."
  ], 
  "revision_id": "180459"
 }, 
 {
  "author": "jta", 
  "date": "2005-06-06T19:10:51.081277Z", 
  "msg": [
   "DERBY-340: committed Susan Clines's patch that modifies", 
   "integrate/plugin_howto.html to clarify which Eclipse releases can be used with", 
   "the 1.0 UI plug-in."
  ], 
  "revision_id": "180458"
 }, 
 {
  "author": "felicity", 
  "date": "2005-06-06T19:03:13.828401Z", 
  "msg": [
   "release is now v3.0.4"
  ], 
  "revision_id": "180457"
 }, 
 {
  "author": "", 
  "date": "2005-06-06T18:19:23.267235Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "180456"
 }, 
 {
  "author": "", 
  "date": "2005-06-06T18:15:49.084201Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "180455"
 }
]