[
 {
  "author": "paulsp", 
  "date": "2002-02-05T05:56:32.000000Z", 
  "msg": [
   "Mark completed items on todo list."
  ], 
  "revision_id": "182874"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-02-05T05:43:46.000000Z", 
  "msg": [
   "Add - Adding to HTMLRewrite. Thanks to Ozgur Balsoy (PS)", 
   "o Added support for HREF in AREA tag", 
   "o Added \"openInNewWindow\" parameter to insert TARGET=\"_BLANK\" attribute in AREA tag"
  ], 
  "revision_id": "182873"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-02-05T05:27:26.000000Z", 
  "msg": [
   "Fix - Cache updates (part 3 of 3) (PS)", 
   "Changes to the WebPagePortlet", 
   "o Implement refreshable functionality", 
   "o Do not get webpage during init().", 
   "o Renamed field pageCached to initDone to acuratly refect", 
   "it's use", 
   "o Cleanup import statements", 
   "o Do not cache an page the has \"no-cache\" set or expiration=0.", 
   "o Add parameter \"open_in_popup\" to enable opening links in a new bowser window."
  ], 
  "revision_id": "182872"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-02-05T03:08:05.000000Z", 
  "msg": [
   "Fix - Cache uppdates (part 2) (PS)", 
   "o The Abstract portlet is now refreshable. This means the caching system will call", 
   "refresh() when the portlet memory cache expires and portlet has not been idle", 
   "longer then TimeToLive.", 
   "o JetspeedPortletCacheService creates the appropiate cache container, CachedObject", 
   "or RefreshableCachedObject, for the item being cached.", 
   "o JetspeedPortletCacheService set the TimeToLive for Refreshable item based on the", 
   "JR.p property servics.PortletCache.TimeToLive.default.", 
   "o JetspeedPortletCacheService sets the TimeToLive for AbstractPortlets using the", 
   "parameter _TimeToLive, if present.", 
   "o Method have been added to various classes to support the updates to the memory", 
   "caching."
  ], 
  "revision_id": "182871"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-02-04T19:54:40.000000Z", 
  "msg": [
   "Apply a Jetspeed version of the turbine patch commited by Jeff Brekke.  Below the log", 
   "message from Jeff's commit", 
   "Updated test case to work on even slower or heavily loaded machines.  This was", 
   "not an issue with what was being tested, rather how soon the test was looking", 
   "for information."
  ], 
  "revision_id": "182870"
 }
]