[
 {
  "author": "sgala", 
  "date": "2002-01-17T10:56:27.000000Z", 
  "msg": [
   "This and next change address the following problem (reported by definete.com).", 
   "When memory cache entry gets created, two broken things happen:", 
   "1. No FileWatcher is created until getExpired is called", 
   "2. FileWatcher does not fill lastModified upon creation", 
   "So, if a file is modified on disk between portlet instantiation and next request,", 
   "the portlet will not be expired.", 
   "Patch: set lastModified in FileWatcher constructor, and call getExpire in Cacheable creation.", 
   "Note: memory cache is very broken. It really needs a rewriting with cleaner interfaces."
  ], 
  "revision_id": "182839"
 }, 
 {
  "author": "sgala", 
  "date": "2002-01-17T10:22:27.000000Z", 
  "msg": [
   "Content length test was failing to cache some unchanged URLs due to transcoding effects", 
   "(we store cache in utf-8 and content length is not directly comparable if original", 
   "resource used other encoding). Test was also mostly broken."
  ], 
  "revision_id": "182838"
 }, 
 {
  "author": "kimptoc", 
  "date": "2002-01-16T13:37:21.000000Z", 
  "msg": [
   "bug # 5091  CastorRegistryService.addEntry method fails"
  ], 
  "revision_id": "182837"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-01-11T23:52:31.000000Z", 
  "msg": [
   "Update documentation to reflect changes in HTMLRewriter"
  ], 
  "revision_id": "182836"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-01-11T23:29:56.000000Z", 
  "msg": [
   "o Fixed bug in <SCRIPT> processing. Thanks to patch provided by Ozgur Balsoy", 
   "o Comments that contain script and style code are now included", 
   "o Added \"openInNewWindow\" parameter to insert TARGET=\"_BLANK\" attribute in <A>.", 
   "o Added support for HREF in <BASE>", 
   "o Removed support for BACKGROUND attribute in <BODY>", 
   "o Removed URL rewriting from VALUE attribute in <OPTION>", 
   "o Added default CODEBASE attribute to <APPLET> and <OBJECT>", 
   "o General cleanup of import statements", 
   "o Added documentation"
  ], 
  "revision_id": "182835"
 }
]