[
 {
  "author": "paulsp", 
  "date": "2002-08-08T03:45:09.000000Z", 
  "msg": [
   "Localization need by Reference customization.", 
   "FIle missing from commit"
  ], 
  "revision_id": "183454"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-08-08T03:05:41.000000Z", 
  "msg": [
   "Customizer can now add reference.", 
   "Notes:", 
   "o  Only 1 reference will be displayed.  Looking into problem", 
   "o  Need to add limits on references displayed"
  ], 
  "revision_id": "183453"
 }, 
 {
  "author": "paulsp", 
  "date": "2002-08-08T02:57:11.000000Z", 
  "msg": [
   "Split exitCustomizer() out of doCancel()"
  ], 
  "revision_id": "183452"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-08-08T00:08:37.000000Z", 
  "msg": [
   "To support the \"current\" StateManager routines, getRunData and putRunData", 
   "have been enhanced to set / clear the current request's http session with", 
   "the StateManagerService.", 
   "Although this has only a little to do with the rundata (http session is part of the", 
   "rundata), this is THE place to the sort of thing that MUST be done at the start", 
   "of each http request, and MUST be un-done at the end.  Turbine will make sure", 
   "to call these two routines for each http request, no matter what happens."
  ], 
  "revision_id": "183451"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-08-08T00:05:18.000000Z", 
  "msg": [
   "The StateManagerService now has the getCurrentSessionState() methods:", 
   "one to get the state keyed by the current thread / http request / http session id,", 
   "and one to get the state keyed by the current session id plus additional text.", 
   "These are useful for getting session state where the rundata or http session", 
   "is not handy.", 
   "Note: they must be called in the context of a http request; if a service is running", 
   "a background thread, this thread will not have a current session associated with it.", 
   "Also Note: to have these work, each http request must install it's http session", 
   "with this service at the start, and remove it at the end.", 
   "The BaseStateManagerService has been updated to provide for these", 
   "getCurrentSessionState and set/clearSessionContext methods.  Note that", 
   "it now has available the http session for the current request / thread.", 
   "JetspeedHttpStateManagerService no longer asks for the current Jetspeed", 
   "Rundata to get the http session; it relies upon the current session kept by", 
   "the base class BseStateManagerService."
  ], 
  "revision_id": "183450"
 }
]