[
 {
  "author": "taylor", 
  "date": "2002-07-30T02:44:32.000000Z", 
  "msg": [
   "- Fixed bug with refresh pressed immediately after loggin in (resubmit params)"
  ], 
  "revision_id": "183429"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-07-30T02:07:59.000000Z", 
  "msg": [
   "The current pane id is stored in a session state associated with the", 
   "portlet set / portal page / user session, using the JetspeedStateManager", 
   "via the access in the JetspeedRunData getPortletSessionState(), using", 
   "the portlet set id as the \"portlet\" id in the call.", 
   "This replaces storing them in the user.getTemp(), using our new State", 
   "Management Service; it also adds distinction between portal pages.", 
   "Now, the selected pane for each portlet set of each different portal page is", 
   "independent - a user can switch between portal pages, and each will keep its", 
   "own set of \"current\" panes.", 
   "The distributed psml files were updated to include id attributes for all <portlets>", 
   "and <entry> tags, to assure that the portlet id works.  If these ids are missing,", 
   "they will be assigned at runtime, but a different value will be assigned each time", 
   "the portal page is loaded, so the element id will change over time in a session.", 
   "Making sure all ids are set in the psml files avoids this problem."
  ], 
  "revision_id": "183428"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-07-29T19:23:30.000000Z", 
  "msg": [
   "Switched to the JetspeedHttpStateManagerService, which stores", 
   "all state attributes (well wrapped) in the real HTTP session provided by the", 
   "container, and will clean up all values when sessions expire."
  ], 
  "revision_id": "183427"
 }, 
 {
  "author": "taylor", 
  "date": "2002-07-29T18:51:18.000000Z", 
  "msg": [
   "- Patch to check for null pointed out by Werner Ramaekers [werner@shiftat.com]"
  ], 
  "revision_id": "183426"
 }, 
 {
  "author": "taylor", 
  "date": "2002-07-29T04:50:34.000000Z", 
  "msg": [
   "- check for null ptr", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "183425"
 }
]