[
 {
  "author": "morciuch", 
  "date": "2002-09-09T19:07:57.000000Z", 
  "msg": [
   "Initial check in"
  ], 
  "revision_id": "183549"
 }, 
 {
  "author": "morciuch", 
  "date": "2002-09-09T18:50:23.000000Z", 
  "msg": [
   "Updated to demo PopupCalendar parameter style"
  ], 
  "revision_id": "183548"
 }, 
 {
  "author": "morciuch", 
  "date": "2002-09-09T18:48:40.000000Z", 
  "msg": [
   "Initial check in"
  ], 
  "revision_id": "183547"
 }, 
 {
  "author": "morciuch", 
  "date": "2002-09-09T18:48:14.000000Z", 
  "msg": [
   "Added a form name attribute of DefaultCustomizer. This is required by the PopupCalendar parameter style."
  ], 
  "revision_id": "183546"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-09-09T16:58:03.000000Z", 
  "msg": [
   "To aid in the integration of jetspeed into a portal project,", 
   "I want to use as much of Jetspeed \"out of the box\" as possible,", 
   "minimizing the set of files I need to patch or replace.", 
   "To support this, I've made a few changes to the vm templates that", 
   "control the portal page, content.vm and default.vm, with support in", 
   "JetspeedResources.properties and GlobalMacros.vm", 
   "First, each portal page html can have a set of scripts (javascript or whataver)", 
   "placed into the <head> section of the html.  This is done by invoking a velocity", 
   "macro #headScripts().  This invocation is now standard in the jetspeed templates.", 
   "The default headScripts() macro in GlobalMacros.vm is empty.  One would edit this or append another script by the same name with the content one wants for one's site (if there are two macros with the same name, the last one is used by Velocity).", 
   "Second, each portal page html <body> tag may have onLoad or other attributes.  This is done by invoking a velocity macro #bodyOnLoad(), now standard in the", 
   "jetspeed templates.", 
   "The default bodyOnLoad() in GlobalMacros.vm is empty, and can be edited or overridden for a site.", 
   "Third, the default.vm had a html title tag that included some text pre-pended to the portal page's title.  I've changed this so that there's a new jr.p field, \"portalpage.title_prefix\" to contain any prefix text for titles.  We can change or override this setting in the config files to control the title for our site."
  ], 
  "revision_id": "183545"
 }
]