[
 {
  "author": "morciuch", 
  "date": "2002-09-10T15:12:08.000000Z", 
  "msg": [
   "Implemented \"Print Friendly Format\" portlet action icon (see Bugzilla bug# 11741). Also, made necessary changes for displaying action icons' alt text in proper case and user friendly description (for example, \"Information\" rather than \"info\").", 
   "Initial implementation uses content.vm layout to display the portlet without any decorations. Note that this layout has no link to get back to prior page so the user has to click browser's previous button. Based on individual requirements, the layout may be customized with addition of \"Back to prior page\" link. To override the layout, change portlet.action.print.template in jr.props."
  ], 
  "revision_id": "183554"
 }, 
 {
  "author": "morciuch", 
  "date": "2002-09-10T15:03:14.000000Z", 
  "msg": [
   "Initial check in"
  ], 
  "revision_id": "183553"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-09-10T02:01:27.000000Z", 
  "msg": [
   "When overriding settings in the JetspeedResources.properties (and TurbineResources.properties), we might want to set a value with our", 
   "site's setting, a value that is also set in the standard jr.p and tr.p distribution files.  It's nice to be able to use these files unchanged so we can keep up easily", 
   "with Jetspeed development.", 
   "If the value we are setting is a string, this already works - the first value set to", 
   "the property is used, so we can just do our settings before the standard files", 
   "are read in.", 
   "If the value we are setting is a boolean, long, float, double, or int, this doesn't work - we get class cast exceptions.", 
   "JetspeedSecurity, which is used by Jetspeed code to access the configuration values, now catches these class cast exceptions, and also takes the calls to getString.  If there's an array of values, it will use the first one (it's the combination of the array of values that mess up the reading without this).", 
   "Note: this only works for Jetspeed properties - turbine properties don't use this", 
   "code.  Only string properties can be overridden by setting your site values first", 
   "for turbine properties.", 
   "Note: This code would be best deep inside turbine, but can live here till Turbine", 
   "handles these cases."
  ], 
  "revision_id": "183552"
 }, 
 {
  "author": "ggolden", 
  "date": "2002-09-10T01:54:39.000000Z", 
  "msg": [
   "To further aid in building portal environments on Jetspeed", 
   "while making minimal changes to the distributin Jetspeed files,", 
   "we can now configure which .vm file will be use for the site", 
   "navigation top, bottom and left, using the topnav.vm, bottomnav.vm", 
   "and leftnav.vm settings in the jr.p.", 
   "Simply change or override these settings (and the other top/left/bottom", 
   "nav settings from jr.p) in your site's configuration files.", 
   "Note: this is only supported currently on the .vm side of the house."
  ], 
  "revision_id": "183551"
 }, 
 {
  "author": "morciuch", 
  "date": "2002-09-09T19:20:10.000000Z", 
  "msg": [
   "Initial check in"
  ], 
  "revision_id": "183550"
 }
]