[
 {
  "author": "weaver", 
  "date": "2003-03-24T01:06:00.000000Z", 
  "msg": [
   "- Now correctly recognizes the do* method parameters passed by legacy JspActions", 
   "which included the Portlet as a argument in place of Context.", 
   "- reduced reflection lookups by caching Method objects.   Previous implementation", 
   "would lookup the method every time.  Now methods are pulled from a HashMap", 
   "if they have ever been called in the past."
  ], 
  "revision_id": "183934"
 }, 
 {
  "author": "weaver", 
  "date": "2003-03-24T01:02:17.000000Z", 
  "msg": [
   "- Added an additional setTemplate() method signature that accepts a", 
   "boolean arg, persistent that sets the life time of the template to either the", 
   "current request or the entire portlet session using the portlet session state", 
   "- protected resetTemplate() method to remove the \"template\" attribute from the", 
   "portlet session state.", 
   "- getPortlet() convenience method added", 
   "- getTemplate() convenience method added"
  ], 
  "revision_id": "183933"
 }, 
 {
  "author": "weaver", 
  "date": "2003-03-24T00:56:56.000000Z", 
  "msg": [
   "Deperecated setTemplate() as it's functionallity was somewhat different", 
   "than one would expect in that uses portlet session state for storage of the", 
   "template to use.  This functionality has been moved up into PortletAction", 
   "which now has an additional setTemplate() method that has a persistent boolean attribute", 
   "which determines the TTL of the overriden template."
  ], 
  "revision_id": "183932"
 }, 
 {
  "author": "morciuch", 
  "date": "2003-03-21T20:50:09.000000Z", 
  "msg": [
   "Made changes to maven goal for building binary distribution. The default binary distibution included only the jetspeed .jar file and javadocs which I think it's pretty meaningless with jetspeed (can't use the .jar file on its own.", 
   "New binary distribution also includes contents of the webapp directory. Such distribution could be basis for building a custom portal. Eventually, I'd like to modify the jestpeed plugin for Maven to allow building custom portal from binary distribution (it builds from the .war file now).", 
   "I'm sure others may have different ideas about the definition of binary distribution so I'll leave this up for discussion (for example, how do we package a release when using Maven?)."
  ], 
  "revision_id": "183931"
 }, 
 {
  "author": "weaver", 
  "date": "2003-03-20T18:11:50.000000Z", 
  "msg": [
   "Relative to enhancement bug id's17747 and 17756.", 
   "All Velocity/JSP Portlet/Actions now commonly extend GenericMVCPortlet and GenericMVCAction"
  ], 
  "revision_id": "183930"
 }
]