[
 {
  "author": "taylor", 
  "date": "2003-10-02T05:30:28.000000Z", 
  "msg": [
   "Spent some time redesigning refactoring the rewriter utility from Jetspeed-1.", 
   "Since Im going to use this in Jetspeed-1 (via the CPS bridge) and Jetspeed-2, thought it would be best to house it", 
   "in Jetspeed-2 CPS repo.", 
   "Summary:", 
   "- all input and output is now stream (Reader/Writer) based, no longer using strings.", 
   "- added more interfaces further distilling the concepts of Rewriter and ParserAdaptor", 
   "- removed all dependencies on Swing Parser from interfaces.", 
   "in fact it should be very easy now to plugin the better Neko HTML parser now.", 
   "- New Rewriter service", 
   "- pluggable rewriter and adaptor via media type (XML, HTML supported)", 
   "- more events, removed all ties to Swing in events", 
   "- unit tests", 
   "- xml rule-based configuration", 
   "all logic regarding rewriting is removed from adaptors", 
   "instead you should either", 
   "1. use an XML configuration file to define rewriting, stripping, and removal rules", 
   "2. write your own rewriting rules by extending the BasicRewriter and handling the events yourself", 
   "3. combine 1 and 2", 
   "Anyway been promising this for a while, so hope this is an improvement.", 
   "Its going to need a lot of tweaking still, but at least the design is in place now.", 
   "Still haven't completed the conversion of WebPage Service :(", 
   "Think that may have to go on the back burner until J2's aggregator is completed, which I will start on next week"
  ], 
  "revision_id": "185234"
 }, 
 {
  "author": "taylor", 
  "date": "2003-09-16T15:29:33.000000Z", 
  "msg": [
   "updated pluto charter"
  ], 
  "revision_id": "185233"
 }, 
 {
  "author": "taylor", 
  "date": "2003-09-12T16:52:03.000000Z", 
  "msg": [
   "added pluto charter"
  ], 
  "revision_id": "185232"
 }, 
 {
  "author": "taylor", 
  "date": "2003-09-05T22:54:53.000000Z", 
  "msg": [
   "mispelled \"emails\" (had \"email\") in locator", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185231"
 }, 
 {
  "author": "taylor", 
  "date": "2003-08-23T00:07:06.000000Z", 
  "msg": [
   "added invalidateObject method to persistence plugin", 
   "this can be useful for making sure that you get an object from the persistence store and not the cache"
  ], 
  "revision_id": "185230"
 }
]