[
 {
  "author": "taylor", 
  "date": "2003-10-08T04:36:39.000000Z", 
  "msg": [
   "Fixed nasty bug in Portal Context Provider and infinite loop.", 
   "Jetspeed's Portal Context is now implemented, retrieving portal info and default modes and states from the jetspeed configuration properties.", 
   "Enabled the PreferencesPortlet, however it is still not listing prefs and is now receiving an illegal state exception.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185259"
 }, 
 {
  "author": "taylor", 
  "date": "2003-10-07T21:38:17.000000Z", 
  "msg": [
   "1. Modified ContentType to keep a list of PortletMode objects, not Strings per latest Portlet API", 
   "- OJB mapping for registry", 
   "- Castor mapping for deployment descriptors", 
   "2. Commented out PreferencePortlet from the PSML as it has identified a infinite loop in the implementation", 
   "Need to debug this one later", 
   "3. Updated Unit Tests for PortletMode change", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185258"
 }, 
 {
  "author": "taylor", 
  "date": "2003-10-07T19:17:49.000000Z", 
  "msg": [
   "- Updated Portlet API to final release.", 
   "(Just noticed that we now have two sets of the portlet api, one in Pluto, one here.)", 
   "- Updated all project references to new 1.0 Portlet API Jar", 
   "- All unit tests pass", 
   "- System deploys", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185257"
 }, 
 {
  "author": "taylor", 
  "date": "2003-10-07T18:54:36.000000Z", 
  "msg": [
   "- updated references to new Pluto jar in demo ap", 
   "- updated latest tld", 
   "- changed portlet:encode tag to portlet:namespace", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185256"
 }, 
 {
  "author": "taylor", 
  "date": "2003-10-07T04:44:52.000000Z", 
  "msg": [
   "Good to be back ;) although Pluto has changed again", 
   "- CPS test was failing when called from allBuild root task, but not from the CPS directory.", 
   "I was under the impression the the maven reactor's basedir tag would chdir, but it does not.", 
   "This breaks the unit test for CPS, which depend on a certain relative directory structure.", 
   "I couldn't figure out how to get the reactor to chdir. Nor could I find an ant task to chdir.", 
   "This lack of sleep must be making me dense, because surely there must be a chdir in ant?", 
   "Anway we'll figure it out tomorrow, but for now the unit test runs from allBuild.", 
   "- Changed over to the new Pluto jar for catalina:shared target", 
   "- disabled Preferences Validator until a can review the Pluto code and see whats changed with the last code drop", 
   "(and i do mean last!)", 
   "- Deployed Jetspeed to Tomcat 5.", 
   "Some of the demo portlets are running, others are crashing.", 
   "This is caused by the latest changes to Pluto. Will have a look at it first thing in morning", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185255"
 }
]