[
 {
  "author": "taylor", 
  "date": "2003-12-04T04:53:20.000000Z", 
  "msg": [
   "updated dependencies between mockobjects and portal projects"
  ], 
  "revision_id": "185389"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-04T04:52:44.000000Z", 
  "msg": [
   "mock request context object, decoupling properties and things for unit tests"
  ], 
  "revision_id": "185388"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-04T04:52:10.000000Z", 
  "msg": [
   "- More code coverage tests for Profiler and Security", 
   "- removed old profiler properties from jetspeed.properties and moved them to old-profiler.properties"
  ], 
  "revision_id": "185387"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-04T04:50:52.000000Z", 
  "msg": [
   "added a default page in new psml format"
  ], 
  "revision_id": "185386"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-04T04:50:19.000000Z", 
  "msg": [
   "Swapped out old profiler in place of new profiler based on rules", 
   "The new profiler org.apache.jetspeed.profiler doesn't hardcode its profiling rules", 
   "but instead uses rules stored in the database. I haven't currently implemented the", 
   "default J1 fallback, but haven't completed role-based fallback.", 
   "I'd like to delete all the old profiler code from the CVS if nobody objects ...", 
   "and still leave it in J1 of course", 
   "The BasicAggregator now uses the new Page and Fragment model for page aggregation.", 
   "It hasn't yet integrated Desktops.", 
   "A new aggregator was added, Jetspeed1Aggregator which is actually the old BasicAggregator.", 
   "The goal here is to support different fragment (layout) models by swapping out aggregators.", 
   "This means you could have different fragment models such as J1, J2, IBM, Pluto...", 
   "Added a couple more valves:", 
   "- a simple localization valve which puts the locale in the requestContext", 
   "- a simple security valve that puts a JAAS Subject into the requestContext", 
   "the Subject has at least one principal, a User principal which is gathered", 
   "from the servlet api's. This can get us by for a while until the security service develops", 
   "- replaced the old profiler valve with a new one"
  ], 
  "revision_id": "185385"
 }
]