[
 {
  "author": "taylor", 
  "date": "2003-12-30T06:39:51.000000Z", 
  "msg": [
   "Added PAM portlet application to allBuild", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "185454"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-30T06:37:40.000000Z", 
  "msg": [
   "Modified the PAM to deploy to 2 different types of apps: WEBAPP and LOCAL", 
   "Before it only supported WEBAPP, which required a cross-context invoker.", 
   "LOCAL PAs do not require a cross-context invoker. Useful for app servers which do not support this esoteric feature. AFAIK, Weblogic does not support cross-context.", 
   "Added support for LOCAL portlet applications to the portal.", 
   "Tested RequestDispatcher and Resource loading from the portlet API.", 
   "However, there are still some important outstanding issues, almost all related to webapp resources:", 
   "1. Security. Someone with knowledge could possibly get to resources outside of the webapp", 
   "2. Resources that arent' loaded by the Portlet API need to be rewritten, unless someone else has a solution...", 
   "TLB, JSP includes, HREF, CSS, GIF, HTML snipets ....", 
   "One solution would be to rewrite all links for a known type of mimetype during deployment", 
   "3. PLT 10.3 - Portlet Context and its relationship to the ServletContext. There's some munging we'll have to do there", 
   "4. Should we support servlets in Local portlet applications? The easy answer is no...read sections PLT 3 and PLT 10.3..."
  ], 
  "revision_id": "185453"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-30T06:29:08.000000Z", 
  "msg": [
   "localizePath private method to localize paths relative to the apps/{pa}", 
   "used with resource retrieval and dispatching"
  ], 
  "revision_id": "185452"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-30T06:21:43.000000Z", 
  "msg": [
   "PAM (Portlet Application Manager) Portlet Application", 
   "This is the first 'local' portlet application.", 
   "It does nothing more than just test out the basics right now, ensures that:", 
   "- class loader is operating correctly", 
   "- getResource(AsStream) from the PortletAPI functions", 
   "- request dispatchers function correctly", 
   "The goal of the PAM PA is to provide deployment functions and portlet application management from a portlet application."
  ], 
  "revision_id": "185451"
 }, 
 {
  "author": "taylor", 
  "date": "2003-12-30T06:11:40.000000Z", 
  "msg": [
   "Service Framework proposal from DLS :-) (David Le Strat)"
  ], 
  "revision_id": "185450"
 }
]