[
 {
  "author": "weaver", 
  "date": "2004-01-16T19:53:34.000000Z", 
  "msg": [
   "fixed issue with install() not returning a response object", 
   "added additional methods for building the install query string"
  ], 
  "revision_id": "185569"
 }, 
 {
  "author": "weaver", 
  "date": "2004-01-16T19:52:28.000000Z", 
  "msg": [
   "For purposes of debugging the recent java.lang.Verify error, I copied the", 
   "gut of the FileSystemPAM into CatalinaPAM.  In the process, I refactored out", 
   "much of the logic into individual methods.  There are now to seperate rollback", 
   "methods, one for roling back the registery and one for the file system.  This", 
   "allows us more flexibility in terms of incremental recovery as opposed rollback", 
   "the entire process.  A good example is if you try to deploy an app that is already", 
   "registered, you probably dont want to really roll that back at as you will corrupt the", 
   "existing deployed app.", 
   "We should move all of the file system operations back into FileSystemPAM and then", 
   "have CatalinaPAM extend FileSystemPAM, which was the initial plan anyways."
  ], 
  "revision_id": "185568"
 }, 
 {
  "author": "weaver", 
  "date": "2004-01-16T19:47:31.000000Z", 
  "msg": [
   "deployArchive now throws an IOException instead of a PAE.  This makes", 
   "a little more sense from the stand point that deployArchive is a file operation", 
   "method.", 
   "An IOException is now thrown if the target for extracting the archive", 
   "already exists."
  ], 
  "revision_id": "185567"
 }, 
 {
  "author": "weaver", 
  "date": "2004-01-16T19:45:12.000000Z", 
  "msg": [
   "PortletApplicationExcpetions are just rethrown as themselves as opposed", 
   "to wrapping them in another  PAE.  This was the cause of the java.lang.Verify", 
   "error being thrown in Tomcat.", 
   "changed some exception handling"
  ], 
  "revision_id": "185566"
 }, 
 {
  "author": "weaver", 
  "date": "2004-01-16T19:41:21.000000Z", 
  "msg": [
   "deploy event now checks for the existance of the portlet application and skips", 
   "it if it is already registered"
  ], 
  "revision_id": "185565"
 }
]