[
 {
  "author": "taylor", 
  "date": "2004-03-25T00:40:45.000000Z", 
  "msg": [
   "omit maven", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "186199"
 }, 
 {
  "author": "taylor", 
  "date": "2004-03-25T00:39:28.000000Z", 
  "msg": [
   "removed aggregation and render services, these are now components"
  ], 
  "revision_id": "186198"
 }, 
 {
  "author": "taylor", 
  "date": "2004-03-24T23:31:19.000000Z", 
  "msg": [
   "Start of refactoring of Navigational State and Context", 
   "Unit test and test assembly in place", 
   "Added Mockrunner for Servlet Mock objects in tests", 
   "Goal is to replace PortalControlParameter and PortalURL with pluggable Nav State and URL generation components and context classes", 
   "The current implementation is very much coupled to Pluto's approach of storing nav state in the URL using Pluto-like navstate encoding", 
   "Plan to have 3 implementations in Jetspeed from NavState handling:", 
   "- Pluto Paths", 
   "- Session", 
   "- Encrypted", 
   "The NavigationalState component will eventually be capable of storing and retrieving navigational", 
   "state on a per user/window basis, so that when a user returns to a site, the window state can be", 
   "recreated on a per user basis, not per page", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "186197"
 }, 
 {
  "author": "taylor", 
  "date": "2004-03-24T20:16:12.000000Z", 
  "msg": [
   "added undeploy goal for PAM PA"
  ], 
  "revision_id": "186196"
 }, 
 {
  "author": "taylor", 
  "date": "2004-03-24T20:12:59.000000Z", 
  "msg": [
   "don't deploy to local pa, only normal pa"
  ], 
  "revision_id": "186195"
 }
]