[
 {
  "author": "dlestrat", 
  "date": "2004-06-12T04:13:01.000000Z", 
  "msg": [
   "Adding struts dependencies."
  ], 
  "revision_id": "186799"
 }, 
 {
  "author": "dlestrat", 
  "date": "2004-06-12T04:12:34.000000Z", 
  "msg": [
   "Adding link to user-mgt page."
  ], 
  "revision_id": "186798"
 }, 
 {
  "author": "weaver", 
  "date": "2004-06-11T20:02:52.000000Z", 
  "msg": [
   "Fixes to get any portlet to deploy to jetspeed 2.  Also added a psml for the RssPortlet from the POST", 
   "site at sourceforge."
  ], 
  "revision_id": "186797"
 }, 
 {
  "author": "ate", 
  "date": "2004-06-11T19:30:49.000000Z", 
  "msg": [
   "Enabled PortletEntity as collection of PortletDefintion with auto delete=\"true\".", 
   "With the new auto generation of non-existing portlet entities on first request", 
   "these really need to be removed also otherwise an undeploy/deploy sequence", 
   "to update a PA would fail if invalid entries would still exists.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "186796"
 }, 
 {
  "author": "weaver", 
  "date": "2004-06-11T18:01:35.000000Z", 
  "msg": [
   "committed Serge Huber's patch for VFS in the PortletApplicationWar"
  ], 
  "revision_id": "186795"
 }
]