[
 {
  "author": "paulsp", 
  "date": "2004-07-24T10:49:40.000000Z", 
  "msg": [
   "Enable checkstyle report"
  ], 
  "revision_id": "187109"
 }, 
 {
  "author": "ate", 
  "date": "2004-07-23T23:45:57.000000Z", 
  "msg": [
   "Corrected the reference where the tomcat5 jaas realm patch will be installed: ${org.apache.jetspeed.server.home}/server/classes"
  ], 
  "revision_id": "187108"
 }, 
 {
  "author": "ate", 
  "date": "2004-07-23T23:42:24.000000Z", 
  "msg": [
   "Fixed check.patch.tomcat5.jaas.realm goal which was using an incorrect (old) property to determine which version of Tomcat is used."
  ], 
  "revision_id": "187107"
 }, 
 {
  "author": "", 
  "date": "2004-07-23T05:55:13.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'JS2-0-2004-07-23-spring-start'."
  ], 
  "revision_id": "187106"
 }, 
 {
  "author": "taylor", 
  "date": "2004-07-23T05:55:13.000000Z", 
  "msg": [
   "pass in PAM to Portlet Services", 
   "btw (ahem) I had to officially migrate J2 to Spring out of necessity", 
   "Nano was giving me cyclic dependencies errors in multithreaded contention area", 
   "This is the second time Nano has had this error, one time Scott sent a patch in", 
   "Spring does not have this problem", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "187105"
 }
]