[
 {
  "author": "dlestrat", 
  "date": "2004-10-02T23:07:16.000000Z", 
  "msg": [
   "http://nagoya.apache.org/jira/browse/JS2-114#action_53626", 
   "This fixes the issues previously reported by Jeremy."
  ], 
  "revision_id": "187664"
 }, 
 {
  "author": "dlestrat", 
  "date": "2004-10-02T23:06:51.000000Z", 
  "msg": [
   "http://nagoya.apache.org/jira/browse/JS2-114#action_53626", 
   "Latest assembly.  Changes only made to security components assembly."
  ], 
  "revision_id": "187663"
 }, 
 {
  "author": "dlestrat", 
  "date": "2004-10-02T23:06:06.000000Z", 
  "msg": [
   "http://nagoya.apache.org/jira/browse/JS2-114#action_53626"
  ], 
  "revision_id": "187662"
 }, 
 {
  "author": "taylor", 
  "date": "2004-10-02T15:42:21.000000Z", 
  "msg": [
   "test"
  ], 
  "revision_id": "187661"
 }, 
 {
  "author": "rogerrut", 
  "date": "2004-10-02T00:13:57.000000Z", 
  "msg": [
   "Enhanced perl portlet so that perl/cgi script can invoke other perl scripts (as long as they are included in the PA). Because the requests are initiated by the portlet the query string can be used to pass the parameters. If another portlet passes a request to the perl portlet it has to pass it as a part of the session.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "187660"
 }
]