[
 {
  "author": "taylor", 
  "date": "2004-11-26T22:52:44.000000Z", 
  "msg": [
   "updated document-set documenation", 
   "from Randy Watler"
  ], 
  "revision_id": "187989"
 }, 
 {
  "author": "shinsuke", 
  "date": "2004-11-26T21:25:16.000000Z", 
  "msg": [
   "fixed garbage characters"
  ], 
  "revision_id": "187988"
 }, 
 {
  "author": "taylor", 
  "date": "2004-11-26T21:25:01.000000Z", 
  "msg": [
   "remove mysql dep"
  ], 
  "revision_id": "187987"
 }, 
 {
  "author": "taylor", 
  "date": "2004-11-26T18:56:34.000000Z", 
  "msg": [
   "Starting SSO Portlet implementation: SSOIFramePortlet", 
   "The SSOIFramePortlet will support all SSO authentication methods", 
   "Here we are starting on request parameter (and base64 request parameter) authentication"
  ], 
  "revision_id": "187986"
 }, 
 {
  "author": "taylor", 
  "date": "2004-11-26T18:52:38.000000Z", 
  "msg": [
   "Nested Document Sets implementation in page manager, decorators, templates, and demo site.", 
   "- Addition of getAll() method to jetspeed API Folder interface.", 
   "- Changes to CastorXmlPageManager/FolderImpl implementation and associated unit tests for updating and removing PSML pages.", 
   "- Improved indenting in left menu pane for Tigris layout.", 
   "Note that an updated profiler/page manager design document is contained in the \"new\" zip file.", 
   "To test nested document sets:", 
   "Login as user/user and validate nested document set named \"More Pages\" appears within \"Top Pages\" and contains a new page and link to the Tigris sample page.", 
   "patch from Randy Watler", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:\ttaylor@apache.org", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "187985"
 }
]