[
 {
  "author": "ate", 
  "date": "2005-03-26T22:05:13.000000Z", 
  "msg": [
   "Optionally create roles defined in the web descriptor on registration of a portlet application.", 
   "This is configurable in the springframework definition. Just set properties roleManager and autoCreateRoles.", 
   "See http://issues.apache.org/jira/browse/JS2-211"
  ], 
  "revision_id": "188449"
 }, 
 {
  "author": "ate", 
  "date": "2005-03-26T03:06:07.000000Z", 
  "msg": [
   "Small relative directory fix"
  ], 
  "revision_id": "188448"
 }, 
 {
  "author": "ate", 
  "date": "2005-03-26T02:17:10.000000Z", 
  "msg": [
   "Moved the recently added PortletApplicationManager Portlet to its own new PALM application (Portlet Application Lifecycle Management).", 
   "Now this portlet can be used in Fusion as well, replacing the Fusion JSR-168 Registry Management Portlets.", 
   "And its a fine beer too ;-)"
  ], 
  "revision_id": "188447"
 }, 
 {
  "author": "ate", 
  "date": "2005-03-26T00:22:53.000000Z", 
  "msg": [
   "Removed waiting for active Threads to complete before destroying the portlet.", 
   "I ran into deadlocks while testing this with J1/Fusion. Unclear why, but don't have the time to continue debugging this."
  ], 
  "revision_id": "188446"
 }, 
 {
  "author": "ate", 
  "date": "2005-03-25T21:11:13.000000Z", 
  "msg": [
   "Temporary (?) fix to get pa registration working on servlet init in Fusion.", 
   "Under fusion calling PortletApplicationManager.startPortletApplication always results in:", 
   "javax.naming.NameNotFoundException: \"Name jdbc is not bound in this Context\"", 
   "but when started from a separate (timer) Thread, even with only a delay of 1ms, it works alright.", 
   "I don't have any clue what is the cause of this or how to solve it (already been pulling my hairs out for more than 4 hours on this one),", 
   "so for now I disabled starting a pa directly from the servlet init Thread.", 
   "Anyone having a clue whats wrong here, please report..."
  ], 
  "revision_id": "188445"
 }
]