[
 {
  "author": "aheritier", 
  "date": "2005-06-09T05:46:20.412464Z", 
  "msg": [
   "reorder changes"
  ], 
  "revision_id": "189714"
 }, 
 {
  "author": "aheritier", 
  "date": "2005-06-09T05:42:50.805924Z", 
  "msg": [
   "fix MPPDF-36 : maven pdf fails with footer in navigation.xml.", 
   "fix MPPDF-24 : Internal links failed.", 
   "fix MPPDF-13 : img src attributes are not made relative to the xdoc source.", 
   "Patch from Lukas Theussl reviewed by aheritier"
  ], 
  "revision_id": "189713"
 }, 
 {
  "author": "skitching", 
  "date": "2005-06-09T05:34:54.447279Z", 
  "msg": [
   "Add javadoc describing default values for converters and related behaviour."
  ], 
  "revision_id": "189712"
 }, 
 {
  "author": "aheritier", 
  "date": "2005-06-09T05:31:11.210340Z", 
  "msg": [
   "Replace the java call to generate the pdf with the ant task.", 
   "Remove a xalan dependency."
  ], 
  "revision_id": "189711"
 }, 
 {
  "author": "kmarsden", 
  "date": "2005-06-09T05:26:41.545934Z", 
  "msg": [
   "DERBY-339 Network client XA should only keep XA state for transaction branch association", 
   "Network client XA should only keep XA state for transaction branch association, to track whether to send commit in autocommit mode. All other state and state related decisions should be defered to the server.", 
   "The client tries to track XA state to make decisions based on current XA state. Most of this state handling was removed with DERBY246, but it still was not being handled properly. This is evidenced by multiple failures in xaSimplePostive that now that it gets past DERBY-246.", 
   "This fix will have the client track only branch association as outlined in the XA+ specification. Table 6-2, State Table for Transaction Branch Association. The client will track only", 
   "XA_TO_NOT_ASSOCIATED", 
   "XA_T1_ASSOCIATED", 
   "Association Suspended (T2) will map to XA_TO_NOT_ASSOCIATED for the client's pupurposes.", 
   "The client commit in autocommit mode only for", 
   "XA_TO_NOT_ASSOCIATED."
  ], 
  "revision_id": "189710"
 }
]