[
 {
  "author": "jerenkrantz", 
  "date": "2002-07-01T15:12:55.000000Z", 
  "msg": [
   "Move the SERF_DECLARE macros to its own header files.", 
   "(serf_buckets.h needs these macros as well.)"
  ], 
  "revision_id": "19"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-07-01T14:02:24.000000Z", 
  "msg": [
   "Add initial build system based on flood's system with enough modifications", 
   "to make this work.", 
   "This can build an libserf.la file with a mock (almost empty) serf_connection.c", 
   "file.", 
   "Obtained from: Flood"
  ], 
  "revision_id": "18"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-07-01T13:51:55.000000Z", 
  "msg": [
   "Clean up types so that the file actually compiles.", 
   "(apr_bucket_brigade and apr_uri)", 
   "Not bad for doing these headers blind."
  ], 
  "revision_id": "17"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-07-01T13:34:08.000000Z", 
  "msg": [
   "autoconf should be sent to the detention room without any soup.", 
   "(It does rm -rf core in its generated configure script.)"
  ], 
  "revision_id": "16"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-06-26T05:49:49.000000Z", 
  "msg": [
   "- Remove serf_methods.h as Greg has shown me the light (for now).  serf", 
   "doesn't care a whit about the methods - it can send whatever it wants.", 
   "The server must be the one who rejects it.", 
   "- Consolidate the uri components to a single uri_path variable.", 
   "- Note why keepalive is present.", 
   "- Add note about synchronous handling - the handlers are NULL...", 
   "What would happen if we call the synch funcs when we have async handlers?", 
   "- Don't associate a connection with a request.  I'm thinking about reusing", 
   "a serf_request_t object across multiple connections.  That could work!", 
   "The relationship would only be stored in the connection.", 
   "- Add response filters in the request object as the response object is", 
   "created too late to give it per-response filters.  The response object", 
   "is only created as we receive data (in essence, it is just a big brigade).", 
   "- Remove serf_create_response call as that isn't very helpful, IMHO.", 
   "- Add pool parameter to serf_open_uri call."
  ], 
  "revision_id": "15"
 }
]