[
 {
  "author": "jdcasey", 
  "date": "2005-06-16T01:50:28.316736Z", 
  "msg": [
   "Working on issue: MNG-379", 
   "Added specified stop-gap patch for issue: MNG-473 (affects settings-builder and registry-builder)", 
   "Today I've made the following progress on this so far:", 
   "- Added a new project, called maven-plugin-registry, to house the model for this new file.", 
   "- Developed/debugged/tested PluginVersionManager/DefaultPluginVersionManager to isolate the plugin-version checks/management code away from the PluginManager", 
   "- Added interactiveMode (<interactiveMode>true|false</interactiveMode> directly under the root element of settings.xml, or -B short CLI option or --batch-mode CLI option, where the CLI options turn OFF interactiveMode). This will allow things like the maven-plugins build to register new plugins (and, for now, new versions of plugins) automatically.", 
   "- Added user input handler for when interactiveMode = true, to get a yes/no on whether to use the discovered version over the installed version and/or no version at all. If there is no installed version, and the user selects 'n', then the discovered version is used FOR THAT SESSION ONLY, and won't be recorded in the registry.", 
   "- Added checks/recording rejected versions against the registry, before attempting to use the discovered version.", 
   "Pending:", 
   "- Still need to add update-policies, to determine two things:", 
   "1. how often to check for updates", 
   "2. what to do when updates are found (autoUpdate, etc.)"
  ], 
  "revision_id": "190854"
 }, 
 {
  "author": "taylor", 
  "date": "2005-06-16T01:49:52.017563Z", 
  "msg": [
   "PREREFACTOR-2005-06-15"
  ], 
  "revision_id": "190853"
 }, 
 {
  "author": "taylor", 
  "date": "2005-06-16T01:48:45.860243Z", 
  "msg": [
   "allow override of sort"
  ], 
  "revision_id": "190852"
 }, 
 {
  "author": "crossley", 
  "date": "2005-06-16T01:48:29.593429Z", 
  "msg": [
   "Need at least one action for the 0.8 release."
  ], 
  "revision_id": "190851"
 }, 
 {
  "author": "taylor", 
  "date": "2005-06-16T01:48:20.748212Z", 
  "msg": [
   "cleanup formatting of Print link, and View in New Window links at top"
  ], 
  "revision_id": "190850"
 }
]