[
 {
  "author": "gregor", 
  "date": "2005-06-16T15:51:56.499948Z", 
  "msg": [
   "Properly lock affected documents when deactivating. Patch by Doug Chestnut, this resolves http://issues.apache.org/bugzilla/show_bug.cgi?id=35381"
  ], 
  "revision_id": "190939"
 }, 
 {
  "author": "gregor", 
  "date": "2005-06-16T15:49:07.276506Z", 
  "msg": [
   "Removed doctypes config from instantiator and did some minor code cleanup. This resolves http://issues.apache.org/bugzilla/show_bug.cgi?id=35382"
  ], 
  "revision_id": "190938"
 }, 
 {
  "author": "jwkaltz", 
  "date": "2005-06-16T15:44:10.514224Z", 
  "msg": [
   "[minor change] added sanity checks for clearer error message in the case of a missing configuration item"
  ], 
  "revision_id": "190937"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-06-16T15:34:54.032969Z", 
  "msg": [
   "Fix for BEEHIVE-808.", 
   "Implement the JSR 181 handler config file format.  The file format is now validated at build time and must conform to the XSD specified in Appendix B of the JSR 181 spec.  Validation is performed in the Jsr181TypeMetadataImpl class; on success, the correct SOAPHandler objects are created and are available at deploy time when the SOAP service is created in Axis.", 
   "When validation fails, the WSM annotation processor fails.  This happens by throwing an IllegalHandlerConfigException.", 
   "This change also adds a Jsr181ValidationException that extends RuntimeException and should be used when performing annotation checking.  It should eventually replace the (checked) ValidationException.", 
   "Upgrade the handlerChainConfig.xml file to be compliant with the XSD.", 
   "Add the XSD definition from the spec as wsm/src/api/schemas/jsr181-handler-config.xsd.  This file has two minor changes from the spec -- it uses <import> instead of <include> in order to pickup the types from the j2ee namespace.  We'll see if the next version of the specification contains this correction.  :)", 
   "Still likely some work that needs to be done with the name of the handler config chain.  Also need to figure out if server-side validation is meaningful (in the context of the spec) and if so, whether that validation should be strict.", 
   "BB: self", 
   "DRT: WSM pass", 
   "Test: built a simple handler chain config file and ran with a JWS on Axis to ensure that the correct handlers run"
  ], 
  "revision_id": "190936"
 }, 
 {
  "author": "rgrabowski", 
  "date": "2005-06-16T15:26:01.015542Z", 
  "msg": [
   "Changed text of Obsolete attributes to recommend using DomDaoManagerBuilder.Configure instead of DomSqlMapBuilder.Configure."
  ], 
  "revision_id": "190935"
 }
]