[
 {
  "author": "amassari", 
  "date": "2005-06-16T23:02:45.792279Z", 
  "msg": [
   "Fixed warnings with Visual .NET 2003"
  ], 
  "revision_id": "191024"
 }, 
 {
  "author": "crossley", 
  "date": "2005-06-16T22:59:31.155610Z", 
  "msg": [
   "Publish recent wsrp4j changes."
  ], 
  "revision_id": "191023"
 }, 
 {
  "author": "", 
  "date": "2005-06-16T22:51:49.105911Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "191022"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-06-16T22:38:57.634635Z", 
  "msg": [
   "Resolving issue: MNG-379", 
   "o Added support for update-all and update-none when prompting the user.", 
   "o Added --update-plugins/-F option to force an update of the plugins used in the project.", 
   "o Added autoUpdate setting for the plugin registry. This is used when in non-interactive mode, to determine whether to register plugin updates", 
   "o Added updateInterval to determine when/how often to check for updates to registered plugins. Supports three syntaxes:", 
   "- 'never'", 
   "- 'always'", 
   "- 'interval:XXX' (where XXX can be a combination of weeks, days, hours, and minutes in the syntax: 1w1d1h1m)", 
   "> this renders the interval syntax similar to 'interval:1w' to check every week.", 
   "NOTE: update intervals are calculated from the time a particular plugin was last checked.", 
   "o Added lastChecked attribute for registered plugins, to use as a basis for calculating update-check interval", 
   "o Added RuntimeInfo classes for maven-settings and maven-plugin-registry, to help in tracking the file each instance comes from, in addition to merging info which is useful when extracting the user-level instance from the merged instance (for persisting changes to the user instance, f.e.).", 
   "o Changed verifyPlugin(..) to take an instance of Settings, to allow persistent decisions across the session (like update-all, update-none in the plugin version manager)", 
   "This should take care of outstanding issues with this new feature. I'm closing the JIRA issue now, and we'll deal with any bugs/shortcomings as separate issues."
  ], 
  "revision_id": "191021"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2005-06-16T22:37:31.177226Z", 
  "msg": [
   "Regression: cacheKey != fileName"
  ], 
  "revision_id": "191020"
 }
]