[
 {
  "author": "thilina", 
  "date": "2005-06-22T04:08:15.184415Z", 
  "msg": [
   "changes due to merging OMBlob & OMText"
  ], 
  "revision_id": "191759"
 }, 
 {
  "author": "thilina", 
  "date": "2005-06-22T03:53:35.539805Z", 
  "msg": [
   "Cahges to Mime Helper & soem utility classes for attachements"
  ], 
  "revision_id": "191758"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-06-22T03:27:27.788659Z", 
  "msg": [
   "Fixing plugin-version prompting once and for all (hopefully)...at least, the logic."
  ], 
  "revision_id": "191757"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-06-22T03:10:00.038058Z", 
  "msg": [
   "Update the XMLBean JAR to the latest XMLBean v2 release candidate.", 
   "BB: self", 
   "DRT: Beehive / build.dist pass"
  ], 
  "revision_id": "191756"
 }, 
 {
  "author": "kmarsden", 
  "date": "2005-06-22T03:02:54.017549Z", 
  "msg": [
   "Fix for", 
   "DERBY-8", 
   "Connection object gets created with un-supported holdability on getting Connection object from XAConnection \"inside\" the global transaction", 
   "DERBY-366", 
   "In jdk13, when a connection transitions from global transaction to local transaction, its default holdability of HOLD_CURSORS_OVER_COMMIT is not restored.", 
   "have a patch to fix Derby-8 (Connection object gets created with un-supported holdability on getting Connection object from XAConnection \"inside\" the global transaction) and Derby-366 (In jdk13, when a connection transitions from global transaction to local transaction, its default holdability of HOLD_CURSORS_OVER_COMMIT is not restored.) The patch is attached to both Derby-8 and Derby-366.", 
   "The fix for both these bugs was centered around fixing the holdability handling in BrokeredConnection.java This was because BrokeredConnection.java had no code for restoring the holdability of real connection object and no code for saving the current holdability state of real connection object. I put fix for both these issues in BrokeredConnection.java so that both jdk13 and jdk14+ environments will be handled correctly. Had to use reflection for this holdability work", 
   "because Connection.setHoldability and Connection.getHoldability methods are not available through JDK13 apis.", 
   "Contributed by Mamta Satoor"
  ], 
  "revision_id": "191755"
 }
]