[
 {
  "author": "kevinross", 
  "date": "2003-06-03T02:18:58.000000Z", 
  "msg": [
   "PR: 17778", 
   "Obtained from: Bugzilla", 
   "Submitted by:\tGary Shea shea@gtsdesign.com", 
   "Reviewed by:\tKevin Ross kevin.ross@iverticalleap.com", 
   "All unit tests succeed. -Kevin Ross", 
   "The approach taken is to start out by creating a flexible and extensible", 
   "inline metadata service, activated on a per-collection basis. (By inline", 
   "metadata, I mean that the metadata is a header at the beginning of the BTree", 
   "data.) That gives me an efficient way of determining what type of resource a", 
   "particular BTree record holds.  All the code for the inline metadata service is", 
   "in org.apache.xindice.core.inlinemeta.", 
   "Because the Xindice BTree doesn't care much about what you put into it (bytes,", 
   "bytes, bytes), binary records are ordinary BTree records.", 
   "Most of the details for managing binary resources are found in Collection.  The", 
   "low-level getDocument() and putDocument() methods havebeen joined by getEntry()", 
   "(record type agnostic, needed for XML:DB), getBinary(), and putBinary().", 
   "One final note, these patches also fix a bug associated with XMLSerializable.", 
   "Most of the implementations of streamFromXML(Document)added themselves to the", 
   "parent document, but putObject() in Collection also added the Element returned", 
   "by streamFromXML(Document) to the document, causing it to end up in there", 
   "twice.  Took me a while to figure out that one!.  To me it made more sense that", 
   "a method should act as locally as possible, reducing side-effects, so now no", 
   "XMLSerializable.streamFromXML() implementation adds itself to its parent", 
   "Document.", 
   "-Gary Shea"
  ], 
  "revision_id": "192414"
 }, 
 {
  "author": "kevinross", 
  "date": "2003-05-30T22:39:16.000000Z", 
  "msg": [
   "PR: 1777", 
   "Obtained from: Bugzilla", 
   "Submitted by:\tGary Shea shea@gtsdesign.com", 
   "Reviewed by:\tKevin Ross", 
   "Eliminates the hardcoded use of Xerces", 
   "Use of xerces presently hard-coded.  Eliminated hard-coding, added", 
   "configuration mechanisms for the xml-rpc parser at clients and server.", 
   "Added tests.  Modified test framework and build.xml to make testing a bit", 
   "easier."
  ], 
  "revision_id": "192413"
 }, 
 {
  "author": "vladimir", 
  "date": "2003-05-30T06:21:45.000000Z", 
  "msg": [
   "the argument was never used..."
  ], 
  "revision_id": "192412"
 }, 
 {
  "author": "gianugo", 
  "date": "2003-05-05T16:18:22.000000Z", 
  "msg": [
   "Fix union operator in XPath queries to avoi a full collection scan and work", 
   "on indexes instead where available. Patch submitted by Terry Rosenbaum", 
   "(terry@amicas.com)."
  ], 
  "revision_id": "192411"
 }, 
 {
  "author": "gianugo", 
  "date": "2003-04-11T12:29:37.000000Z", 
  "msg": [
   "This should make Gump happy. So far all my tests have been succesful", 
   "so i don't expect that anything breaks, but you never know so feedback", 
   "is much appreciated, given also the level of undocumented black magic", 
   "that this class has.", 
   "NOTE: this doesn't mean that we can upgrade Xalan, since Xupdate would break", 
   "with 2.4.1 (hope to fix that soon)"
  ], 
  "revision_id": "192410"
 }
]