[
 {
  "author": "gmazza", 
  "date": "2004-07-20T21:28:50.000000Z", 
  "msg": [
   "1.) Moved the SAXParser-creating method from FOFileHandler to CommandLineOptions,", 
   "the latter being the class directly using it.", 
   "2.) Decoupled the SVG classes from apps.FOFileHandler, the SVG classes for some reason", 
   "want a string containing a name of a SAXParser.  We'll need to look in the future for", 
   "the actual need for this--normally error messages are done by the caller, not", 
   "the callee.  It would appear that Batik can generate a SAXParser name by default,", 
   "and use that when not explicitly overridden by the caller."
  ], 
  "revision_id": "197804"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-07-20T03:39:24.000000Z", 
  "msg": [
   "1.)  render() methods moved from Driver to XSLTInputHandler and FOFileHandler.", 
   "2.)  -param command line switch implemented for xml->xslt->pdf processes"
  ], 
  "revision_id": "197803"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-07-19T22:46:14.000000Z", 
  "msg": [
   "1.)  Moved exclusively to Simon's DefaultHandler object for both Transformer", 
   "and SAXParser usage.  DefaultHandler implements the ContentHandler interface", 
   "so it can be used where the latter was previously used, also it provides more", 
   "functionality.  [1]", 
   "2.) Updated the examples and internal code accordingly.", 
   "3.) Renamed ExampleFO2PDFUsingSAX to ...Parser to avoid confusion (both use", 
   "SAX.)", 
   "[1] http://www.cafeconleche.org/books/xmljava/chapters/ch06s03.html#d0e8440"
  ], 
  "revision_id": "197802"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-07-19T05:33:35.000000Z", 
  "msg": [
   "1.) Driver constructor modified to require RenderType, and setter functions", 
   "for RenderType and FOUserAgent removed, to allow for better checking of", 
   "a valid Driver object at time of construction.  (Also, will reduce need to", 
   "validate Driver object should it be a parameter to a method.)", 
   "2.) Added validity checking of renderType to FOTreeBuilder as well, in", 
   "effect decoupling Driver from FOTreeBuilder (the latter can work on its own", 
   "now.)", 
   "3.) Updated the various examples and the documentation to indicate the", 
   "new API."
  ], 
  "revision_id": "197801"
 }, 
 {
  "author": "spepping", 
  "date": "2004-07-18T19:55:17.000000Z", 
  "msg": [
   "Added alternative example for FO to PDF, using javax.xml.parsers"
  ], 
  "revision_id": "197800"
 }
]