[
 {
  "author": "spepping", 
  "date": "2004-12-21T11:28:05.000000Z", 
  "msg": [
   "Implemented cloning and reparenting of the subtree under a marker to", 
   "the retrieving retrieve-marker. The FO nodes are cloned. The new", 
   "subtree is attached to the RetrieveMarker object. The property", 
   "lists are not cloned. The subtree of property lists is attached to the", 
   "property list of the RetrieveMarker object. This is only needed for", 
   "the binding of the FO nodes. After that a subsequent retrieve-marker", 
   "may reparent the property lists.", 
   "Removed Marker's reference to its property list. In Marker.endOfNode()", 
   "the parent of the property lists of the direct children of marker is", 
   "reset to null. FOText nodes are not mapped to the Marker's property", 
   "list in Marker. This allows the Marker's property list and its", 
   "ancestors to be GC'ed.", 
   "FOText nodes use the parent FO node's property list or the", 
   "RetrieveMarker's property list for binding.", 
   "TODO: Block.handleWhiteSpace is not applied to text in retrieve-marker.", 
   "TODO: White space treatment around retrieve-marker is incorrect."
  ], 
  "revision_id": "198204"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-12-17T00:19:11.000000Z", 
  "msg": [
   "Moved the (upcoming) fo:bookmark-tree construction code from AreaTreeHandler", 
   "to the BookmarkData object."
  ], 
  "revision_id": "198203"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-12-16T23:59:13.000000Z", 
  "msg": [
   "More code commenting and minor cleanup of bookmark/Resolvable/ATH code."
  ], 
  "revision_id": "198202"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-12-16T01:03:04.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "Removed Runnable interface from PSLM; new method \"activateLayout()\" combines", 
   "former run() and doLayout() methods in PSLM."
  ], 
  "revision_id": "198201"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-12-14T23:16:44.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "AreaTreeModel detached from BookmarkData; more code commenting."
  ], 
  "revision_id": "198200"
 }
]