[
 {
  "author": "gmazza", 
  "date": "2004-12-25T01:08:11.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "More XSL 1.1-like terms for PDF bookmarks used, minor bug in TableLayoutManagerMaker fixed."
  ], 
  "revision_id": "198209"
 }, 
 {
  "author": "spepping", 
  "date": "2004-12-24T12:06:26.000000Z", 
  "msg": [
   "This patch implements a pluggable LayoutManagers system, according", 
   "to the ideas of Finn Bock and his patch in bug 30500.", 
   "Created a LayoutManagerMaker interface, with method", 
   "makeLayoutManagers(FONode, List), and two convenience methods on top", 
   "of it.", 
   "Created an implementation: LayoutManagerMapping. This is along the", 
   "pattern of FOElementMapping. It creates a Map from FObj class to Maker", 
   "objects. There are many static inner classes which are subclasses of", 
   "Maker. Each subclass implements its own version of the make method.", 
   "FOUserAgent has a setter and getter for", 
   "LayoutManagerMakerOverride. AreaTreeHandler creates a", 
   "LayoutManagerMaker, taking the user's override into account, using", 
   "LayoutManagerMapping as the default. It has a get method for it.", 
   "The LayoutManager interface has a get method for the AreaTreeHandler", 
   "object, a reference to which is held in PageSequenceLM, the top of the", 
   "LM tree."
  ], 
  "revision_id": "198208"
 }, 
 {
  "author": "gmazza", 
  "date": "2004-12-23T01:36:01.000000Z", 
  "msg": [
   "Very minor edits to Bookmark handling code."
  ], 
  "revision_id": "198207"
 }, 
 {
  "author": "spepping", 
  "date": "2004-12-22T18:22:35.000000Z", 
  "msg": [
   "Fixed the NPE for fo:title in FOText.createBlockPointers by returning", 
   "early.", 
   "Fixed the absence of output for fo:title: In ContentLM.fillArea, replace", 
   "curLM.getNextBreakPoss with getNextKnuthElements, BreakPossIter with", 
   "KnuthPossIter. Copied the line parameter calculations from", 
   "LineLM.makeLineBreakPosition. This is only a rough patch: leaders,", 
   "external graphics, page numbers cause null pointer exceptions."
  ], 
  "revision_id": "198206"
 }, 
 {
  "author": "spepping", 
  "date": "2004-12-22T08:54:10.000000Z", 
  "msg": [
   "Removed instances of InlineStackingLayoutManager. Created a new FO", 
   "node class, InlineLevel, a subclass of FObjMixed, a base class for", 
   "several inline-level FObj: Inline, Leader, Title. The", 
   "InlineLayoutManager constructor requires an FObj of this type."
  ], 
  "revision_id": "198205"
 }
]