[
 {
  "author": "deweese", 
  "date": "2001-01-17T15:05:57.000000Z", 
  "msg": [
   "Bug fixes:", 
   "1) The offset for GammaTransfers was being scaled to 8bits twice.  It", 
   "is now only scaled inside GammaTransfer.", 
   "2) LinearTransfer's intersection scaling was brought in line with", 
   "GammaTransfer (the scale was moved from ConcreateComponentTransferRable", 
   "to LinearTransfer.", 
   "3) ConcreteBufferedImageCachableRed no longer uses drawImage to implement", 
   "the copyData call. This was causing an inconvenient multiply followed by", 
   "a divide out of alpha.  This would show it's self as an ugly", 
   "artifact when manipulating Turbulence images, in addition to potentially", 
   "being slow.  The data is now copied by a convince function in", 
   "GraphicsUtils.", 
   "This results in some mostly non-visible changes in reference images.", 
   "The changes should always reflect increased accuracy in the color", 
   "channels.", 
   "3) PadRed now zeros the pad regions it's self", 
   "(PadMode.ZERO_PAD). Rather than relying on drawing a rect with zero", 
   "fill.  This helps to remove the possibility for an unwanted", 
   "multiply/divide of alpha cycle.  It should also be quicker.", 
   "4) All use of the Rectangle2D.intersection functions in the filters", 
   "package are now pre-flighted with Rectangle2D.intersects.  I", 
   "noticed that createIntersection and intersection both return bogus", 
   "rectangles when called on non-intersecting rects (the code had", 
   "previously assumed an empty rect was returned).", 
   "This was detected in filterRegions.svg where zooming in a lot would", 
   "result in cases where non-visible filterRegions computed large", 
   "offscreen buffers often resulting in out of memory errors.", 
   "This fix probably needs to be pushed out to the rest of the codebase."
  ], 
  "revision_id": "199339"
 }, 
 {
  "author": "tkormann", 
  "date": "2001-01-17T14:53:36.000000Z", 
  "msg": [
   "new section added", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199338"
 }, 
 {
  "author": "tkormann", 
  "date": "2001-01-17T13:38:42.000000Z", 
  "msg": [
   "draft in progress to learn how the transcoder API works", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199337"
 }, 
 {
  "author": "tkormann", 
  "date": "2001-01-17T13:35:23.000000Z", 
  "msg": [
   "improve javadoc and some code", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199336"
 }, 
 {
  "author": "billh", 
  "date": "2001-01-16T17:50:57.000000Z", 
  "msg": [
   "Changes to MessageArea class to preserve more of default", 
   "JLabel behavior for non-international strings."
  ], 
  "revision_id": "199335"
 }
]