[
 {
  "author": "vhardy", 
  "date": "2001-02-26T19:12:28.000000Z", 
  "msg": [
   "Fixed typo reported by Vladislav Protasov", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199524"
 }, 
 {
  "author": "deweese", 
  "date": "2001-02-23T20:29:34.000000Z", 
  "msg": [
   "1) Slightly improved the offscreen buffer handling code.", 
   "The offscreen buffer is now always aligned with the tile grid.", 
   "This allows all rendering to occure in the offscreen (previously", 
   "the edges often needed to be done in a tile then copied...", 
   "2) Fixed a few sample model creation bugs in some Reds.", 
   "(The 't-shirt' bug should be fixed Stephane)", 
   "3) Fixed a surround bug in FiterResRable, correctly this time :)", 
   "I needed to divide by the scale not multiply.", 
   "This should remove all the tiling artifacts that sometimes appear", 
   "in the shadow of batikLogo when zoomed and panning."
  ], 
  "revision_id": "199523"
 }, 
 {
  "author": "deweese", 
  "date": "2001-02-23T15:00:01.000000Z", 
  "msg": [
   "1) New Renderer architecture that ties in with the tile cache.", 
   "2) Default tiles size now controled by static method in AbstractTileRed", 
   "(eventually could be exported to user if we wanted to).", 
   "3) AbstractTileRed is even better at pulling stuff out of cache first."
  ], 
  "revision_id": "199522"
 }, 
 {
  "author": "deweese", 
  "date": "2001-02-22T14:35:53.000000Z", 
  "msg": [
   "1) Provided optimized implementations of all SVG composite modes for INT_PACK", 
   "data (2-3x improvement, but aren't _really_ widely used).", 
   "2) Fixed a bug in BackgroundRable where it modified the bounds stored in", 
   "the AbstractGraphicsNode.", 
   "3) AbstractGraphicsNode now checks to ensure the clip and mask intersect", 
   "the bounds before intersecting (avoids erronious intersection calc)."
  ], 
  "revision_id": "199521"
 }, 
 {
  "author": "cjolif", 
  "date": "2001-02-21T17:32:41.000000Z", 
  "msg": [
   "fix a remaining problem with drag event. When there's nothing under", 
   "the mouse the event should not be forwarded."
  ], 
  "revision_id": "199520"
 }
]