[
 {
  "author": "deweese", 
  "date": "2001-02-15T22:17:13.000000Z", 
  "msg": [
   "1) Tweaked the Light interface to offer a row based interface.", 
   "2) DiffuseLighting and SpectralLighting now scale the result of the lighting", 
   "calculation instead of scaling the input.  This generally gives", 
   "better results and is faster.  This behaviour is controlled by the", 
   "static variable SCALE_RESULTS in the two classes.", 
   "3) GraphicsUtil has been tweaked to assume destinations are sRGB unpremult.", 
   "This fixes some print problems Vincent was seeing.  This may", 
   "also fix some problems on Mac OS X."
  ], 
  "revision_id": "199504"
 }, 
 {
  "author": "hillion", 
  "date": "2001-02-15T16:56:24.000000Z", 
  "msg": [
   ".", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199503"
 }, 
 {
  "author": "hillion", 
  "date": "2001-02-15T16:42:03.000000Z", 
  "msg": [
   "Added 'color-profile' property support to the CSS engine.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199502"
 }, 
 {
  "author": "hillion", 
  "date": "2001-02-15T15:57:52.000000Z", 
  "msg": [
   "Added an option to the pretty-printer to specify an XML declaration.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199501"
 }, 
 {
  "author": "deweese", 
  "date": "2001-02-15T14:03:07.000000Z", 
  "msg": [
   "1) Tiled demand pull implementation of BumpMap, Gaussian, Composite, Flood,", 
   "SpecularLighting", 
   "2) GaussianBlurRable now uses an Affine if the StdDeviation of the gaussian", 
   "gets large (>10).", 
   "3) Fixed a bug where GaussianBlurRable wasn't accounting for surround needed", 
   "by skew/scale affine.", 
   "Fixed a similar bug where FilterResRable wasn't accoutning for the", 
   "surround needed for resampleing filter.", 
   "These caused white to appear at the edges of tiles (or the window).", 
   "4) Turbulance now clips it's computation to it's bounds (it clipped the", 
   "output anyway, but now it does less work).", 
   "5) Added AbstractTiledRed which is a useful base class for Red's that want", 
   "to use the TileCache.", 
   "6) Loosened the BufferedImage hint requirement on Graphics2D.", 
   "the Destination methods now return null if the destination is likely", 
   "to be incorrect.  Most code now simply assumes the 'work arounds' aren't", 
   "needed in these cases, which may or may not be true...", 
   "Worked around a bug in Graphics2D.drawImage(BufferedImage img,", 
   "BufferedImageOp op,", 
   "int x, int y)", 
   "that affected printing.", 
   "Vincent's SVGPrinting example now works properly."
  ], 
  "revision_id": "199500"
 }
]