[
 {
  "author": "vhardy", 
  "date": "2001-05-04T01:05:16.000000Z", 
  "msg": [
   "a. Added <switch> in moonPhases so that the image is now bilingual (french/english)", 
   "b. Added kernelLengthUnits to GVT.svg to get smooth result when zooming on", 
   "lighting effect.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199839"
 }, 
 {
  "author": "vhardy", 
  "date": "2001-05-04T00:56:36.000000Z", 
  "msg": [
   "Properties added for the PreferenceDialog GUI.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199838"
 }, 
 {
  "author": "vhardy", 
  "date": "2001-05-04T00:55:16.000000Z", 
  "msg": [
   "GUI Draft for the upcoming PreferenceDialog", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199837"
 }, 
 {
  "author": "deweese", 
  "date": "2001-05-03T22:11:08.000000Z", 
  "msg": [
   "There are four major pieces to this commit. I also did some more work", 
   "on the extendingBatik.xml document.", 
   "A) Cleaned up and generalized documented the ImageTagRegistry interfaces", 
   "B) Generalized the Broken Link code to enable the User agent to", 
   "provide better broken link images.  The goal here is to use", 
   "SVG content to provide the broken link image (possibly with error", 
   "information) in a resolution independent, internationalizable", 
   "manner.", 
   "C) Cleaned up, made easier to extend and pulled several inner class", 
   "out of ParsedURL, as well as documenting all the major interfaces.", 
   "Also added a Service Provider interface for protocols.", 
   "The service interface is org.apache.batik.util.ParsedURLProtocolHandler.", 
   "D) Added a proposal for the Service Provider interface for the Bridge.", 
   "The interface is org.apache.batik.bridge.BridgeExtension.", 
   "I also added some support methods to the end of BridgeContext.  This", 
   "shows the flavor of how the extensions will get boot-strapped in (note", 
   "that in particular the sorting of the extensions should only be done", 
   "once).  I've also included a \"sample\" bridge extension", 
   "(SVGBridgeExtension) that registers all the current tags in the", 
   "bridge.  This can be used to test the extension mechanism and to", 
   "give an idea of what the packaging looks like.  Currently this is", 
   "just a proposal and these may go away or undergo significant", 
   "revisions.  I am actively soliciting feedback here (which isn't to", 
   "say you aren't always free to give feedback :)."
  ], 
  "revision_id": "199836"
 }, 
 {
  "author": "vhardy", 
  "date": "2001-05-03T18:10:44.000000Z", 
  "msg": [
   "Added a \"Set Transform\" dialog box in viewer to let the user control", 
   "the rendering transform precisely. This can be used, for example, to", 
   "set a precise rotation angle.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "199835"
 }
]