[
 {
  "author": "deweese", 
  "date": "2001-09-20T19:36:05.000000Z", 
  "msg": [
   "1) BatikLogo.svg now uses an SVG font for the 'Batik'. So you can now", 
   "select the text (note the use of a Ligature for the 'ti').", 
   "2) Added kerning information to batikFont.svg", 
   "4) Lots of tweaks and rewritting of Glyph Logical bounds stuff so the", 
   "rectangle merging stuff for text selction works well for vertical", 
   "text, text on a path, vertical text on a path, text orientation", 
   "etc.  The only test it doesn't work well on right now is the circle", 
   "and box examples in samples/tests/textLayout2.svg.", 
   "3) Added some documentation renamed stuff in BackgroundRable."
  ], 
  "revision_id": "200169"
 }, 
 {
  "author": "deweese", 
  "date": "2001-09-19T18:46:07.000000Z", 
  "msg": [
   "1) Now uses a nice semi-transparent light grey field with a black border", 
   "to identify selected text.", 
   "2) modified how GlyphLayout generates Highlight shape to work much better", 
   "with #1.  Could still use some work for text on a path...", 
   "3) Pattern Paint now uses component transfer rather than color matrix", 
   "to apply opacity (should be much faster)."
  ], 
  "revision_id": "200168"
 }, 
 {
  "author": "tkormann", 
  "date": "2001-09-19T15:09:30.000000Z", 
  "msg": [
   "Add a way to set the TextPainter (on GVT and on the Bridge). Our current", 
   "behavior is unchanged.", 
   "In order to set on a particular TextNode, a particular TextPainter, use the", 
   "setTextPainter method.", 
   "In order to set a TextPainter for all TextNode created by the bridge, use the", 
   "BridgeContext setTextPainter method.", 
   "In order to set a TextPainter on some TextNode depending on the context (basic", 
   "or advanced text features) - override the SVGTextElementBridge and do your job.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "200167"
 }, 
 {
  "author": "vhardy", 
  "date": "2001-09-19T14:58:08.000000Z", 
  "msg": [
   "Added faq entry following bug #1579.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "200166"
 }, 
 {
  "author": "vhardy", 
  "date": "2001-09-19T14:46:57.000000Z", 
  "msg": [
   "New reference images:", 
   "- Reference images for gradientLimit.svg (a test that we now pass)", 
   "and zero.svg (a new test)", 
   "- New reference images for all the rendering regression tests to account for", 
   "the new behavior of the PNGTranscoder. The regression suite no longer", 
   "forces transparent white.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "200165"
 }
]