[
 {
  "author": "remm", 
  "date": "2000-08-13T02:41:34.000000Z", 
  "msg": [
   "- Placeholder for SlideResources, the implementation of Catalina Resources interface.", 
   "- Finally updated STATUS.html with new people volunteering for new tasks. Thanks (and sorry for  being so long to give you credit) !", 
   "- Thanks to Torgeir (torgeir@vertech.no) for pointing me out it was a nightmare to implement a  store. Now, it should be WAY easier :-) Also, it's a better, IMO, since the caching is made in  an intermediate level, between the helper level and the low level store. You can configure a  different caching layer, to choose different caching policies according to your needs.", 
   "- Adds a bunch of interfaces to the store system, one for each type. A store is something which  :", 
   "* implements at least one of these interfaces : NodeStore, LockStore, SecurityStore,", 
   "RevisionDescriptorsStore, RevisionDescriptorStore", 
   "* implements the Service interface, or extends the ServiceImpl abstract helper class, which", 
   "will probably make your life easier", 
   "- WARNING : Changed the config files format !! The documentation is correctly updated, but some", 
   "of the examples were not updated. Coming soon !", 
   "- ContentStore will be eventually treated like the other specific stores, to be consistent.  DescriptorsStore will be renamed Store. However, since :", 
   "* it involves quite a lot of changes all over the place and in the Slide core", 
   "* it's just a cleanup, since it works very well", 
   "* I have a million more urgent things to fix on Catalina, and a billion on Slide ;-)", 
   "* the implementation of a ContentStore won't change before or after this change", 
   "I have decided to postpone this change, but it will eventually happen.", 
   "- Removed the config files to enable Slide to be called through Catalina's servlet invoker,  since it's really useless."
  ], 
  "revision_id": "202689"
 }, 
 {
  "author": "remm", 
  "date": "2000-08-10T02:02:25.000000Z", 
  "msg": [
   "- Fix minor error in stylesheet", 
   "Submitted by Brian Leonard (brian@brainslug.org)"
  ], 
  "revision_id": "202688"
 }, 
 {
  "author": "remm", 
  "date": "2000-08-08T19:34:13.000000Z", 
  "msg": [
   "- Fixes a typo in the build.bat file"
  ], 
  "revision_id": "202687"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-08T04:57:31.000000Z", 
  "msg": [
   "Define the \"jaxp.home\" property based on the $JAXP_HOME environment", 
   "variable.  Otherwise, attempts to copy \"jaxp.jar\" and \"parser.jar\" will", 
   "fail when the build occurs on a machine that has the JAXP release", 
   "somewhere other than \"../jaxp\"."
  ], 
  "revision_id": "202686"
 }, 
 {
  "author": "remm", 
  "date": "2000-08-08T04:55:23.000000Z", 
  "msg": [
   "- Cookies support", 
   "- HTTP/1.0 support", 
   "- Better header handling", 
   "Patch submitted by B.C. Holmes (bcholmes@interlog.com)"
  ], 
  "revision_id": "202685"
 }
]