[
 {
  "author": "juergen", 
  "date": "2001-05-04T12:17:35.000000Z", 
  "msg": [
   "added webdav methods get, head, post, put to complete the set of webdav methods. these methods just extend the http version and add no additional semantics."
  ], 
  "revision_id": "203314"
 }, 
 {
  "author": "jericho", 
  "date": "2001-05-04T08:16:13.000000Z", 
  "msg": [
   "- Make sure to be set the client for each methods.", 
   "Because the resource might be set with NOACTION.", 
   "After the resource of setting NOACTION, some methods could be called.", 
   "- For above, Add the checking and setting client methods.", 
   "- Change the order to be set the connected information,", 
   "after setting the client in the WebdavSession class. (Not important though)"
  ], 
  "revision_id": "203313"
 }, 
 {
  "author": "msmith", 
  "date": "2001-05-04T04:23:05.000000Z", 
  "msg": [
   "Revamp of the JDBC descriptor store to use PreparedStatement instead of", 
   "Statement.", 
   "This is needed because slide allows pretty much anything in URI's, in", 
   "properties, etc. Directly using Statements doesn't allow escaping special", 
   "characters in these, whereas PreparedStatements escape anything that is", 
   "needed automatically.", 
   "Needs more testing, but seems reliable."
  ], 
  "revision_id": "203312"
 }, 
 {
  "author": "remm", 
  "date": "2001-05-04T03:32:20.000000Z", 
  "msg": [
   "- Add two helper class for WebDAV access control protocol support :", 
   "- Ace is a Java representation of the Ace element (which is a child element", 
   "of the Acl property)", 
   "- Privilege represents the privileges which can be associated with an Ace"
  ], 
  "revision_id": "203311"
 }, 
 {
  "author": "remm", 
  "date": "2001-05-02T23:15:01.000000Z", 
  "msg": [
   "- The behavior of the HTTP Client was confusing when using the constructor", 
   "new HttpClient(URL). Replace the constuctor with new HttpClient() + a call", 
   "to startSession(URL)."
  ], 
  "revision_id": "203310"
 }
]