[
 {
  "author": "msmith", 
  "date": "2001-06-13T04:46:35.000000Z", 
  "msg": [
   "Try to leave the repository in a more consistent state if an IOException", 
   "occurs while writing the file to the filesystem. Set the content length", 
   "to the correct value regardless of what happens. Neccesary because this", 
   "store doesn't implement transactional capabilities."
  ], 
  "revision_id": "203414"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-13T04:44:02.000000Z", 
  "msg": [
   "- Update the build system to generate a distribution of Slide packaged with", 
   "Tomcat 4, as was done a while ago (but it wasn't very useful way back then).", 
   "To build, you need a Tomcat distribution based on today's CVS (I had to fix a few", 
   "problems in Catalina to have this work). This is an optional dependency.", 
   "The packaging is quite complex, so there may be some issues I didn't notice", 
   "on some configurations."
  ], 
  "revision_id": "203413"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-13T04:39:42.000000Z", 
  "msg": [
   "- Complete the first part of the integration with Catalina, using custom hosts.", 
   "More details on this later."
  ], 
  "revision_id": "203412"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-13T04:38:45.000000Z", 
  "msg": [
   "- Add a new alternative API to Slide : a JNDI directory context.", 
   "It provides only read only access to the Slide namespace, only in guest", 
   "mode.", 
   "The dir context can be used for any purpose, but the main one is to provide", 
   "a clean integration with Catalina (aka the servlet container in Tomcat 4).", 
   "Some small improvements will be added later : for example, it could use the", 
   "filesPath attrbute as the root for browsing the namespace, since it is", 
   "supposed to provide a user view of the namespace."
  ], 
  "revision_id": "203411"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-13T04:34:09.000000Z", 
  "msg": [
   "- Remove the links to the manager servlet."
  ], 
  "revision_id": "203410"
 }
]