[
 {
  "author": "dirkv", 
  "date": "2001-08-18T13:11:39.000000Z", 
  "msg": [
   "improve error message when loading driver", 
   "indent cleanup"
  ], 
  "revision_id": "203634"
 }, 
 {
  "author": "cmlenz", 
  "date": "2001-08-17T14:39:12.000000Z", 
  "msg": [
   "- Moved many of the static methods in WebdavMethod (that shouldn't really", 
   "have been there in the first place) into a new WebdavUtils class.", 
   "- Added servlet initialization parameters:", 
   "- 'scope': let's you specify an offset into the Slide namespace that", 
   "should be exposed by the WebdavServlet.", 
   "- 'default-servlet': to indicate whether the servlet is mapped as", 
   "context default servlet. This let's you deploy the servlet as non", 
   "default-servlet.", 
   "Updated the webapp descriptor to reflect these new parameters, and added", 
   "<description> type comments.", 
   "- The WebdavServletConfig is now stored as the servlet config in the", 
   "init(ServletConfig) hook, the main initialization is still done in", 
   "init().", 
   "- Updates of various of the WebdavMethod subclasses to use the WebdavUtils", 
   "methods instead of the static methods in WebdavMethod."
  ], 
  "revision_id": "203633"
 }, 
 {
  "author": "juergen", 
  "date": "2001-08-16T17:22:27.000000Z", 
  "msg": [
   "the setQuery method can be used to transfer small String data too. Anyway the client/server will hang if I used sendData(String)???"
  ], 
  "revision_id": "203632"
 }, 
 {
  "author": "cmlenz", 
  "date": "2001-08-15T14:43:53.000000Z", 
  "msg": [
   "Use the qName instead of localName for the Element name, as we've turned", 
   "namespace awareness off for configuration parsing. The SAX2 specification", 
   "states that:", 
   "- localName: The local name (without prefix), or the empty string if", 
   "Namespace processing is not being performed.", 
   "- qName: The qualified name (with prefix), or the empty string if qualified", 
   "names are not available.", 
   "[from the API docs of ContentHandler.startElement(...)]", 
   "This change fixes interoperability with the Xerces parser, which seems to", 
   "be closer to the spec than Crimson."
  ], 
  "revision_id": "203631"
 }, 
 {
  "author": "dirkv", 
  "date": "2001-08-15T01:33:47.000000Z", 
  "msg": [
   "sync with main version"
  ], 
  "revision_id": "203630"
 }
]