[
 {
  "author": "craigmcc", 
  "date": "2005-07-02T01:58:10.835695Z", 
  "msg": [
   "Update the \"list categories\" and \"list locales\" implementations, and unit", 
   "tests, to use the new convenience base classes provided by the core library.", 
   "Implement a list of state names capability to illustrate use of the", 
   "\"list completion\" facility.", 
   "Also, add the beginnings of a very simple Ajax example, providing completion", 
   "lookup while using the standard JSF text input component.  It doesn't work", 
   "yet, but I need to commit (from the laptop I took to JavaOne) so that I can", 
   "work on this with my desktop machine)."
  ], 
  "revision_id": "208814"
 }, 
 {
  "author": "jm", 
  "date": "2005-07-02T01:55:17.254919Z", 
  "msg": [
   "bug 4450: add reuse flags for SPF and URIBL rules"
  ], 
  "revision_id": "208813"
 }, 
 {
  "author": "craigmcc", 
  "date": "2005-07-02T01:53:29.287679Z", 
  "msg": [
   "Update HTMLUNIT dependency to verison 1.6 (which purports to include support", 
   "for XMLHttpRequest testing)."
  ], 
  "revision_id": "208812"
 }, 
 {
  "author": "craigmcc", 
  "date": "2005-07-02T01:48:55.581076Z", 
  "msg": [
   "Add convenience base classes and command implementations for building the", 
   "server side business logic for remoting (especially Ajax-style) requests.", 
   "Three families of facility are provided:", 
   "* EvaluateExpression -- evaluate a specified value binding expression,", 
   "and store the result in the chain context under a specified attribute key.", 
   "NOTE:  This cannot be used yet, until the core code establishes a JSF", 
   "FacesContext for remote requests (since they do not flow through the", 
   "FacesServlet.", 
   "* AbstractListCompletions / BasicListCompletions -- code used to return", 
   "a String[] as an XML document with an outer element of <values>, and", 
   "an inner element (one per array element) of <value> containing the", 
   "specified values.  Optional testing against a request parameter (default", 
   "test is a case-insensitive prefix match) can be used to filter the", 
   "returned values.", 
   "* AbstractSelectItems / BasicSelectItems -- code used to return", 
   "a SelectItem[] as an XML document with an outer element of <items>,", 
   "an inner element <item> per item in the array, and inner subelements of", 
   "<value>, <label>, and <description> from the properties of the", 
   "corresponding SelectItem element.  Optional testing against a request", 
   "parameter (default test is a case-insensitive prefix match against the", 
   "\"label\" property) can be used to filter the returned values.", 
   "The latter two facilities support the (very common in Ajax type apps) use", 
   "cases where a dynamically calculated set of Strings, or a dynamically", 
   "calculated set of name/value pairs (represented as a SelectItem) need to", 
   "be acquired asynchronously via an XmlHttpRequest retrieval.", 
   "In these facilities, the AbstractXxx class can be directly subclasses,", 
   "with a single abstract method to implement, for a one-command implementation", 
   "of the business logic for a particular remote request.  The BasicXxx version", 
   "is designed to be used in a chain, where a previous command (often an", 
   "instance of EvaluateExpression) has been used to stash the required data", 
   "in a particular context attribute."
  ], 
  "revision_id": "208811"
 }, 
 {
  "author": "thilina", 
  "date": "2005-07-02T00:22:47.417226Z", 
  "msg": [], 
  "revision_id": "208810"
 }
]