[
 {
  "author": "leosimons", 
  "date": "2005-07-04T13:54:27.994004Z", 
  "msg": [
   "Sorry for the big commit, but I have some old stuff in a seperate development tree on my laptop that really needed to make it into this branch now. Changes:", 
   "* Make testcases a little more robust and less verbose", 
   "* Change finalize() signature for plugins to pass in the workspace", 
   "* Make ExceptionInfo a core model object", 
   "* Start work on a brain-dead-simple persistence module that saves the entire workspace on a pickle shelf. Without knowing exactly what to push to the SQL database, this means we can be 'sure' to save 'everything', which Stefano or his librarian friends c", 
   "an then put on big hard disks for later analysis. Moreover, it should be a simpler way (without having to do the object->relational->object translation) to implement the 'last successful build' part of our algorithm (hooks are there now).", 
   "* util/sysinfo is more system-specific than I hoped. /proc/xxxinfo only exists on linux.", 
   "* make the commandline failures provide useful (I hope) clues.", 
   "* Make pylids import-everything actually work"
  ], 
  "revision_id": "209079"
 }, 
 {
  "author": "trygvis", 
  "date": "2005-07-04T13:52:47.795841Z", 
  "msg": [
   "Fixing: CONTINUUM-191", 
   "o Cleaning up the web templates a bit.", 
   "- Making sure that errors are properly shown.", 
   "- Moving checkout errors to the project view template.", 
   "o Splitting up the \"checkout project\" action into \"checkout project\" and \"store", 
   "checkout result\"."
  ], 
  "revision_id": "209078"
 }, 
 {
  "author": "unico", 
  "date": "2005-07-04T13:51:17.582015Z", 
  "msg": [
   "Add version awareness to Lucene DASL implementation, see bugzilla issue 35539", 
   "Thanks to Tomasz Majchrzak <tomekem@poczta.fm>"
  ], 
  "revision_id": "209077"
 }, 
 {
  "author": "evenisse", 
  "date": "2005-07-04T13:49:35.983176Z", 
  "msg": [
   "Fix version check."
  ], 
  "revision_id": "209076"
 }, 
 {
  "author": "thilina", 
  "date": "2005-07-04T13:49:30.579204Z", 
  "msg": [
   "MTOM documentation"
  ], 
  "revision_id": "209075"
 }
]