[
 {
  "author": "", 
  "date": "2005-07-05T13:29:41.252442Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "209269"
 }, 
 {
  "author": "jkaputin", 
  "date": "2005-07-05T12:44:50.335734Z", 
  "msg": [
   "testService7B commented out, pending confirmation to", 
   "delete it."
  ], 
  "revision_id": "209268"
 }, 
 {
  "author": "jkaputin", 
  "date": "2005-07-05T12:34:17.919971Z", 
  "msg": [
   "added get/setFeature and get/setProperty methods to the", 
   "WSDLReader API and implementation"
  ], 
  "revision_id": "209267"
 }, 
 {
  "author": "jkaputin", 
  "date": "2005-07-05T12:33:26.363653Z", 
  "msg": [
   "added a getFormattedMessage method to ErrorReporter to", 
   "format non-parsing error messages that will typically", 
   "be thrown in exceptions, rather than reported by the", 
   "ErrorReporter."
  ], 
  "revision_id": "209266"
 }, 
 {
  "author": "leosimons", 
  "date": "2005-07-05T12:06:27.559281Z", 
  "msg": [
   "Make dynagumper (the gump3 plugin that pushes data into the dynagump database) push out most of the data (a few TODOs left), update the database definition to be a little simpler and a little more consistent, document the database schema, split out the sample data dump from the definitions, and add some gump-generated sample data.", 
   "* pygump/python/gump/plugins/dynagumper.py: write a whole bunch of store-the-model-inside-the-database. This plugin now contains most of the logic/intelligence that was so far implicit in the database schema (I hope).", 
   "* gumpdb/src/sql/gump3-database-definition.sql,", 
   "gumpdb/src/sql/gump3-sampledata.sql,", 
   "gumpdb/src/sql/gump3-old-sampledata.sql: splitting off the sample data into seperate files, and adding new gump-generated sample data.", 
   "* gumpdb/src/sql/gump3-database-definition.sql: so far gump doesn't actually have any 'runtime environment package management' so I'm removing that from the schema for now even if its a good idea. Added a bunch of documentation on what things are. Gave some variables (like all the ids) more space. Got rid of the 'descriptor' term all-round and just use 'id' everywhere. Added some useful keys. Added a 'causes' table which identifies why a project is stalled (still some work to do here, for example when the module is a cause). And other small tweaks."
  ], 
  "revision_id": "209265"
 }
]