[
 {
  "author": "leosimons", 
  "date": "2005-07-05T19:36:32.447912Z", 
  "msg": [
   "Rework and dramatically simply classpath management. See", 
   "http://mail-archives.apache.org/mod_mbox/gump-general/200505.mbox/%3c0e0201c55c01f1b1420401a8c0@sybase.com%3e", 
   "for background, as well as", 
   "http://issues.apache.org/jira/browse/GUMP-117", 
   "and", 
   "http://issues.apache.org/jira/browse/GUMP-118", 
   "and", 
   "http://mail-archives.apache.org/mod_mbox/gump-general/200505.mbox/%3cBEBB728C.3D48E%25mail@leosimons.com%3e", 
   "http://mail-archives.apache.org/mod_mbox/gump-general/200505.mbox/%3cBEBB77D8.3D49A%25mail@leosimons.com%3e", 
   "for more extensive discussion.", 
   "Basically, the old implementation delayed calculation of lots of paths instead of doing it in the objectification stage. Doing it there makes a *lot* of the pain go away. Other changes include simplification of the classpath calculation algorithm (and moving it into a utility method), code formatting, making a Work directory into an Output, getting rid of all the 'artifact' model objects, not swalling exceptions in the plugins, etc. Most of those change see lots of discussion in the linked mailing list threads."
  ], 
  "revision_id": "209309"
 }, 
 {
  "author": "leosimons", 
  "date": "2005-07-05T19:18:16.397924Z", 
  "msg": [
   "Fix a problem with the algorithm leading to a recursive cause list if a module fails to update.", 
   "* pygump/python/gump/engine/algorithm.py: if a module fails to update, don't mark the module as failing because of itself, since that doesn't work with the cause detection algorithms."
  ], 
  "revision_id": "209308"
 }, 
 {
  "author": "leosimons", 
  "date": "2005-07-05T19:16:49.722925Z", 
  "msg": [
   "Fix a dumb SQL bug in dynagumper.", 
   "* pygump/python/gump/plugins/dynagumper.py: id is now the primary key for projects, so use that when updating the table."
  ], 
  "revision_id": "209307"
 }, 
 {
  "author": "leosimons", 
  "date": "2005-07-05T19:14:03.911115Z", 
  "msg": [
   "Some more useful introspection.", 
   "* pygump/python/gump/plugins/introspection.py: also look at properties for Commands."
  ], 
  "revision_id": "209306"
 }, 
 {
  "author": "rwatler", 
  "date": "2005-07-05T18:58:05.599373Z", 
  "msg": [
   "COMMITTED:", 
   "- implemented new portal-site component", 
   "- added design document for portal-site component", 
   "- removed deprecated profiled page context from profiler and page manager", 
   "- stripped request page selection implementation from page manager", 
   "- tightened access to folders in page manager to require view permission", 
   "- expanded page manager support and tests to include PSML menu definitions", 
   "- modified page manager internals to include marshal/unmarshal hooks", 
   "- changed Castor page mananager implementation to use SAX XML processing", 
   "- integrated new portal-site component removing deprecated page mananger support in profiler valve", 
   "- ported portal pages site PSML, removing deprecated document sets", 
   "TODO:", 
   "- convert tigris decorators to use standard menu definitions from portal-site component", 
   "- fix visibilty of hidden pages in portal-site profiled page context compatibility mode", 
   "- commit HTML version of design document", 
   "- integrate portal-site component into page manager PSML change notification to dump internal caches", 
   "- profile new portal-site component and optimize"
  ], 
  "revision_id": "209305"
 }
]