[
 {
  "author": "jdcasey", 
  "date": "2005-07-12T04:13:40.265441Z", 
  "msg": [
   "Resolving:", 
   "MNG-511", 
   "MNG-513", 
   "Working on:", 
   "MNG-449", 
   "o Added code to stop the version manager from prompting the user for unregistered plugins; it will simply register them with the resolved version.", 
   "o Added failover fourth plugin-version resolution option, which is a plugin-specific artifact metadata called LATEST.version.txt, and will be published with each install/deployment", 
   "o Added MavenProject.get/setArtifact(..) to handle a single artifact instance for a project (allows injection of artifact metadata without having to handle it all within the install/deploy mojos).", 
   "o Changed plugin-version resolution to only use MavenMetadataSource rather than resolving the whole plugin artifact.", 
   "o Changed the install and deploy mojos to only use ${project.artifact} rather than constructing their own, so they can take advantage of metadata added elsewhere in the build.", 
   "o Factored the \"RELEASE\".equals(..) check in the DefaultRepositoryLayout to use new metadata method storedInArtifactDirectory() instead, since RELEASE and LATEST both share this characteristic.", 
   "NOTE: I'm not going to resolve MNG-449 yet, because I'm not sure what else Brett had in mind related to the plugin-development-without-release use case..."
  ], 
  "revision_id": "215919"
 }, 
 {
  "author": "thorsten", 
  "date": "2005-07-12T03:22:29.471251Z", 
  "msg": [
   "fixes FOR-320. Thanks for the patch  Cyriaque Dupoirieux. I refactored it to a contract. Also deleted obsolete stylesheet."
  ], 
  "revision_id": "215918"
 }, 
 {
  "author": "ddewolf", 
  "date": "2005-07-12T03:16:24.959811Z", 
  "msg": [
   "svn mirror updates."
  ], 
  "revision_id": "215917"
 }, 
 {
  "author": "ddewolf", 
  "date": "2005-07-12T03:15:11.779980Z", 
  "msg": [
   "updating mirroring download page."
  ], 
  "revision_id": "215916"
 }, 
 {
  "author": "schof", 
  "date": "2005-07-12T03:12:14.664759Z", 
  "msg": [
   "partial code needed to publish website"
  ], 
  "revision_id": "215915"
 }
]