[
 {
  "author": "evenisse", 
  "date": "2005-07-13T21:58:27.597104Z", 
  "msg": [
   "[CONTINUUM-222]. Capture new information provided by Maven SCM in UpdateScmResult."
  ], 
  "revision_id": "216274"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-07-13T21:57:57.316361Z", 
  "msg": [
   "Working on: MNG-576", 
   "o Implemented plan from my comments on MNG-576 for looking up lifecycle mappings within plugins.", 
   "o Fixed subtle bug in DefaultWagonManager for verifying checksums, where the destination file was being used to verify the checksum rather than the recently download temp destination.", 
   "o Fixed the DefaultRepositoryMetadataManager.resolve(..) method to allow the locally-installed metadata to be used if it is newer than the one resolved from the repository.", 
   "o Moved the lifecycle mappings for the EJB and WAR plugins out to META-INF/plexus/components.xml in the respective plugin's src/main/resources directory. it0016 and it0017 still pass.", 
   "o Changed the distributionManagement repository for maven-plugins/pom.xml to have id of 'central-plugins' and then added a normal artifact repository definition for central-plugins to that pom, to allow locally-installed repository metadata for the plugins to be put in the right place (and these builds should have access to the central plugin repo anyway).", 
   "o Changed the DefaultPluginMappingBuilder to only warn when plugins.xml for a particular plugin group is missing."
  ], 
  "revision_id": "216273"
 }, 
 {
  "author": "ips", 
  "date": "2005-07-13T21:48:15.433158Z", 
  "msg": [
   "use servlet context listener callback method instead of servlet init method to init WSRF JNDI context"
  ], 
  "revision_id": "216272"
 }, 
 {
  "author": "carlos", 
  "date": "2005-07-13T21:44:26.334950Z", 
  "msg": [
   "Upgraded names to latest conventions"
  ], 
  "revision_id": "216271"
 }, 
 {
  "author": "thorsten", 
  "date": "2005-07-13T21:40:51.224731Z", 
  "msg": [
   "Activated multiple skin facility in views. Now if you use project.view-defaultView=pelt.fv the views plugin will check whether there is a 'pelt.fv' in the plugin. If not it uses the default.fv otherwise pelt.fv."
  ], 
  "revision_id": "216270"
 }
]