[
 {
  "author": "dgeary", 
  "date": "2005-07-19T00:03:23.475336Z", 
  "msg": [
   "This checkin gives us a viable tiles-core.jar. I tested it against the", 
   "simple example from tiles-original. I thought of copying over that example", 
   "and the accompanying document, but we already have an examples directory", 
   "here under tiles-documentation, so I thought better of it. Perhaps later.", 
   "There's still some work to be done in the tiles-documentation directory and", 
   "we also should think about testing. Evidently, the only test in sight for", 
   "Tiles is the TilesPluginTest, which of course, is Struts specific and should", 
   "probably be removed from this source tree, no? Integration tests would be easy", 
   "enough with something like Canoo. What about unit tests?", 
   "Anyway, here's what this checkin entails:", 
   "1. Added the Tiles servlet from tiles-original", 
   "2. svn copied RequestUtils from the Struts utils directory and removed Struts-related code", 
   "(We only use 2 methods from RequestUtils, but I kept everything that wasn't Struts-related,", 
   "for good measure)", 
   "3. Changed ...org.apache.taglib.tiles... to ...org.apache.tiles.taglib... in tiles-core.tld", 
   "I also think we need to change the flush attribute's default to false. If you use", 
   "tiles:insert in the body of an enclosing tag, you'll get an exception, which forces", 
   "you to use flush=\"false\" more often than not."
  ], 
  "revision_id": "219584"
 }, 
 {
  "author": "carlos", 
  "date": "2005-07-18T23:31:02.157567Z", 
  "msg": [
   "Minor corrections"
  ], 
  "revision_id": "219583"
 }, 
 {
  "author": "carlos", 
  "date": "2005-07-18T23:21:20.874173Z", 
  "msg": [
   "Use artifactId instead of id"
  ], 
  "revision_id": "219582"
 }, 
 {
  "author": "geoff", 
  "date": "2005-07-18T23:13:47.559061Z", 
  "msg": [
   "use Apache2::Log->warn instead of Apache2->warn, which", 
   "requires Compat.pm.  thanks to Bengt-Arne Fjellner"
  ], 
  "revision_id": "219581"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-07-18T23:11:11.751367Z", 
  "msg": [
   "changes ...", 
   "o added more checks to test case", 
   "o checks revieled spaces were in attribute values after ldif parse", 
   "o corrected bug introduced after I changed the ldif parser last"
  ], 
  "revision_id": "219580"
 }
]