[
 {
  "author": "henning", 
  "date": "2003-03-07T11:56:20.000000Z", 
  "msg": [
   "Typo. This is the right version"
  ], 
  "revision_id": "221144"
 }, 
 {
  "author": "henning", 
  "date": "2003-03-07T11:50:45.000000Z", 
  "msg": [
   "Style fix"
  ], 
  "revision_id": "221143"
 }, 
 {
  "author": "henning", 
  "date": "2003-03-07T11:49:46.000000Z", 
  "msg": [
   "Fixed up the facade and interface class to match the various public", 
   "methods exported by the TemplateService"
  ], 
  "revision_id": "221142"
 }, 
 {
  "author": "henning", 
  "date": "2003-03-07T11:49:12.000000Z", 
  "msg": [
   "This is a complete rewrite of the Template Service. Whoever wrote this", 
   "thing: Please I'd like to have some of that stuff. :-)", 
   "I ripped out the various templating \"policies\", replaced them with an", 
   "uniform template mapper model, cleaned up the various methods dealing", 
   "with the defaults, unified the caching and keeping of objects,", 
   "reworked the template extension registration, dealt with various corner", 
   "cases concerning the template, path and class separators, factored out", 
   "the separator types into constants and very much more.", 
   "One ToDo item stays (I don't need this and I'm too lazy. ;-) ) One", 
   "could unify the various registerMapper(new ...) in initTemplateMapper", 
   "by creating interface classes (new PageMapper(), new ScreenMapper(),", 
   "new LayoutMapper() and then make these pluggable from the properties.", 
   "So one could very easy change the mapping strategies e.g. for layouts", 
   "or classes by configuring it with new mapper classes in the props. As I", 
   "said: I don't need it, if you need it, feel free to ask. :-)", 
   "Ah yes, and the docs are now terribly out of date."
  ], 
  "revision_id": "221141"
 }, 
 {
  "author": "henning", 
  "date": "2003-03-07T11:40:55.000000Z", 
  "msg": [
   "This mapper provides the matching path names for screens. It replaces", 
   "the template separators by path separators and tests if a given template", 
   "exists in the TemplateEngineService selected by the extension. If yes,", 
   "returns the path name, if no returns null."
  ], 
  "revision_id": "221140"
 }
]