[
 {
  "author": "quintonm", 
  "date": "2003-03-12T18:36:21.000000Z", 
  "msg": [
   "- The action now delcares the actual exception that will be thrown.", 
   "- Style fixes"
  ], 
  "revision_id": "221199"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-12T18:12:06.000000Z", 
  "msg": [
   "This class now inherits from SimpleEmail in commons-email instead of using delegation.", 
   "Again, I could see no benefit from using delegation other than additional coding.", 
   "setTo() has been deprecated.  Users should use addTo() from the superclass version instead.", 
   "setFrom(name,email) has been removed.  There is a superclass version of this method however,", 
   "the parameters are reversed.  It was not possible for me to leave this method and deprecate", 
   "it since the both parameters are strings.  This is a breaking change.", 
   "Misc style fixes and javadoc updates are included as well."
  ], 
  "revision_id": "221198"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-12T18:04:29.000000Z", 
  "msg": [
   "This class now inherits from HtmlEmail instead delegating to it.  I just could not see how", 
   "delegation would buy us anything exception additional coding.  All of the additional methods", 
   "needed for delegation have been removed.", 
   "Some style fixes and javadocs corrections have been made as well.", 
   "A note has been added in the class javadocs on how to activate the JavaMail API debugging.", 
   "The HtmlEmail in commons-email has also been changed so that the constructor does not declare", 
   "and exception to be thrown."
  ], 
  "revision_id": "221197"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-12T17:52:45.000000Z", 
  "msg": [
   "Switching to timestamp version on Torque and commons-configuration", 
   "Swicthing to timestamp on commons-email for upcoming changes to VelocityEmail and VelocityHtmlEmail."
  ], 
  "revision_id": "221196"
 }, 
 {
  "author": "henning", 
  "date": "2003-03-12T14:29:14.000000Z", 
  "msg": [
   "Deprecate the various path translation methods. They don't belong in the", 
   "template service but in the template engines"
  ], 
  "revision_id": "221195"
 }
]