[
 {
  "author": "quintonm", 
  "date": "2003-03-21T15:37:17.000000Z", 
  "msg": [
   "populateWithSessionTools only handles session and authorized scope tools now.  The tools are also", 
   "stored int he session instead of the user object. The synchronization around getting the tools", 
   "from the session and conditionally getting an instance from the pool uses the session object's", 
   "monitor.  The conditional code around setPerm is gone since this method does not handle perm", 
   "tools any longer.", 
   "Perm scope tools are handled by populateWithPermTools.  The new method is much like the older", 
   "version of popupulateWithSessionTools.  Synchronization is still handled using the user objects", 
   "monitor.  The conditional code around setPerm is gone since only perm tools are handled.  The", 
   "tool will still be stored in the user object for obvious reasons.", 
   "People using session scope tools must be aware that the tool _could_ get initialized with a", 
   "null user object.  This can happen if the very first request for the session invokes the login", 
   "action.  Since this will happen before the session validator executes, not even the anonymous", 
   "user will be available."
  ], 
  "revision_id": "221289"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-21T15:28:20.000000Z", 
  "msg": [
   "Added a new constant that contains a prefix for attribute names for tools stored in the session."
  ], 
  "revision_id": "221288"
 }, 
 {
  "author": "henning", 
  "date": "2003-03-21T12:11:40.000000Z", 
  "msg": [
   "We definitely don't want to log an user in which has", 
   "no username. This would lead us to having an Application", 
   "with a logged in user that is identified as \"Anonymous User\"."
  ], 
  "revision_id": "221287"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2003-03-20T20:06:49.000000Z", 
  "msg": [
   "o Remove the reports that trigger compilation. This will at least allow the", 
   "site to be generated.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "221286"
 }, 
 {
  "author": "quintonm", 
  "date": "2003-03-20T18:28:04.000000Z", 
  "msg": [
   "Added comment about the session pull tools being lost after the login action and possible", 
   "ways to fix it."
  ], 
  "revision_id": "221285"
 }
]