[
 {
  "author": "henning", 
  "date": "2003-04-09T22:27:47.000000Z", 
  "msg": [
   "- Rework the TurbineUploadService to use the highlevel FileUpload API", 
   "of the fileupload commons package. This cleans up most of the", 
   "strange code from the service, makes it much smaller and better to", 
   "understand.", 
   "- Bugfix: Make sure that form elements that are part of a multipart", 
   "document are actually added to the ParameterParser. This allows a", 
   "Turbine Developer to use an upload form as a part of an Intake", 
   "or HTML form", 
   "- Enhancement: If the name of the temporary upload directory start with", 
   "a slash (\"/\"), it is considered absolute and must exist. If it does", 
   "not start with a \"/\", it is considered relative to the webapp Root and", 
   "is created on the fly if it does not exist."
  ], 
  "revision_id": "221359"
 }, 
 {
  "author": "henning", 
  "date": "2003-04-09T22:24:14.000000Z", 
  "msg": [
   "- Change some constants to represent the \"natural\" type of the value that", 
   "they represent (e.g. bool value as boolean)", 
   "- Rework the BaseUploadService to still compile with these changed types"
  ], 
  "revision_id": "221358"
 }, 
 {
  "author": "henning", 
  "date": "2003-04-09T22:12:36.000000Z", 
  "msg": [
   "Rework the pool service to decouple it from the factory (it no longer", 
   "extends the factory but wraps a factory object.", 
   "Add debugging code to be able to simulate pool filling without actual", 
   "pressure from the application (the pool is filled up to half its capacity", 
   "before recycling starts). Finds lots of bugs. Controlled by the", 
   "services.PoolService.pool.debug = true", 
   "property in TR.props", 
   "reworked the init code to be cleaner and less error prone (parse", 
   "configuration only at init time)"
  ], 
  "revision_id": "221357"
 }, 
 {
  "author": "henning", 
  "date": "2003-04-09T22:08:17.000000Z", 
  "msg": [
   "Make the intake tool more robust when passing null to the remove() method."
  ], 
  "revision_id": "221356"
 }, 
 {
  "author": "henning", 
  "date": "2003-04-09T22:07:43.000000Z", 
  "msg": [
   "Make the getSignature method public. This is a workaround to be able", 
   "to decouple factory and pool service. This will get protected in the", 
   "2.4-dev code, once we can remove the deprecated methods from the pool", 
   "service.", 
   "Added a Facade class to the Factory."
  ], 
  "revision_id": "221355"
 }
]