[
 {
  "author": "jvanzyl", 
  "date": "2001-12-17T15:54:39.000000Z", 
  "msg": [
   "- be good if i actually added the service code.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222319"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-12-17T15:52:15.000000Z", 
  "msg": [
   "- adding a new service contributed by Geir Magnusson that lets us", 
   "use the new DVSL engine in Fulcrum!!! Yaaay!", 
   "There is also a test and it is probably a good pattern to use for testing", 
   "because it lets you isolate the test for a service, basically reduces", 
   "the test to a true unit test. We don't need to start the ServiceManager", 
   "in order to test.", 
   "For testing service interaction and the whole system we definitely", 
   "need the service manager running, but just instantiating the the", 
   "service and testing is a great, isolated and simple way to test a", 
   "service", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222318"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-12-17T15:04:56.000000Z", 
  "msg": [
   "- moving the scheduler doc/howto into fulcrum and adding a blurb about", 
   "the non-persistent scheduler to try and help a user get it running.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222317"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-12-16T18:04:22.000000Z", 
  "msg": [
   "- adding the same runtime test mechansim as there is in torque. there's", 
   "a nifty new service coming down the pipe! it has tests of course!", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222316"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-12-16T07:08:46.000000Z", 
  "msg": [
   "- creating a new test setup with everything in build-test.xml. preparing", 
   "to start adding some tests for fulcrum", 
   "NOTE: In order to use the <junit> task you must put the junit.jar", 
   "in your $ANT_HOME/lib directory as stated in the Ant docs", 
   "There is a mechanism in place that will allow you to write tests", 
   "and have them picked up in a batch (i think the commented out code", 
   "did the same thing) which is what i want to do.", 
   "dlr: i left your tests in the form they are but you might want", 
   "to convert them to junit tests. i think the problem was just", 
   "the junit.jar missing from your $ANT_HOME/lib", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222315"
 }
]