[
 {
  "author": "jvanzyl", 
  "date": "2002-03-14T06:43:50.000000Z", 
  "msg": [
   "A placeholder for me. This build file is using the maven build files but", 
   "we must still deal with generated sources and the structure of this file", 
   "which is what a project's build.xml file will look like and the fact", 
   "that in this case the maven bits can't easily be swapped because i put", 
   "the code generation target inside the maven flags. Another thing I'll", 
   "look at tomorrow.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222374"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-14T06:40:00.000000Z", 
  "msg": [
   "Almost having the build working with Fulcrum. The only issue left is", 
   "dealing with the very strange way our security service generates", 
   "itself. The generated code must be laid down over top of the existing", 
   "code in order for the compile to work.", 
   "Maven currently doesn't copy the sources to be compiled into a", 
   "'holding cell' so either maven is going to have to deal with copying", 
   "all the sources into a 'holding cell' or something else will have", 
   "to be figured out here. I'll think about it tomorrow.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222373"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-11T15:51:57.000000Z", 
  "msg": [
   "First attempt at the maven project descriptor for Fulcrum.", 
   "NOTE:", 
   "The developer list is not complete (I just copied the Maven one), so if", 
   "you are a Fulcrum developer then please add your name to the", 
   "developer list.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222372"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-03-11T15:22:08.000000Z", 
  "msg": [
   "Worked the OM generation problem with James. It appears that using", 
   "./${build.src}/report.turbine.om.generation", 
   "Seems to cause a problem with the <uptodate> task on W2K. Changing this", 
   "to:", 
   "${basedir}/${build.src}/report.turbine.om.generation", 
   "Appears to fix the problem. Maven uses ${basedir} so this won't be", 
   "a problem when we switch.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222371"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-03-11T12:55:18.000000Z", 
  "msg": [
   "Small change to make templateExists return false when no TemplateEngineService", 
   "is registered for the requested template. Also made the javadoc a little more", 
   "consistent.", 
   "I was holding off on this change since when I originally submitted it I was", 
   "told that the template service structure was going to be rewritten, but since", 
   "2.2 integrated with fulcrum is supposed to go out soon, this seems like an", 
   "appropriate fix."
  ], 
  "revision_id": "222370"
 }
]