[
 {
  "author": "jmcnally", 
  "date": "2002-11-04T05:36:50.000000Z", 
  "msg": [
   "initial conversion to avalon components.", 
   "the components will still use the old configuration file which uses properties", 
   "as well as the standard xml configuration.", 
   "modified TurbineServices so that if it is used along with FulcrumContainer,", 
   "an application will have very little code to modify for this first cut.", 
   "the only service functionality that was altered was the cache service which", 
   "was modified so the housekeeping thread will be stopped during disposal.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "222589"
 }, 
 {
  "author": "cvs2svn", 
  "date": "2002-10-16T11:51:26.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch", 
   "'PRE_AVALON_BRANCH'."
  ], 
  "revision_id": "222588"
 }, 
 {
  "author": "cvs2svn", 
  "date": "2002-10-16T11:51:26.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'PRE_AVALON'."
  ], 
  "revision_id": "222587"
 }, 
 {
  "author": "mpoeschl", 
  "date": "2002-10-16T11:51:26.000000Z", 
  "msg": [
   "o fix mailing list links", 
   "o upgrade to latest jars"
  ], 
  "revision_id": "222586"
 }, 
 {
  "author": "dlr", 
  "date": "2002-10-11T03:52:44.000000Z", 
  "msg": [
   "Removed worthless <mkdir> from the \"check-om\" goal.", 
   "Currently, the Fulcrum Maven build must be run _twice_ after a \"clean\"", 
   "due a problem in Maven's driver.jelly (jvz and I have discussed a", 
   "solution which he will implement).  Specifically, code from", 
   "driver.jelly (which is not yet part of a goal) is responsible for", 
   "setting the \"sourcesPresent\" property.  For Fulcrum, which uses a", 
   "\"pom.build.sourceDirectory\" directory which is created in its target/", 
   "dir, the directory is not present at the time driver.jelly is", 
   "executed, meaning that the \"sourcesPresent\" is not set, meaning that", 
   "Fulcrum's sources are not compiled the first time the build is run", 
   "after a \"clean\".  You can work around this manually by doing a `mkdir", 
   "-p target/src/`, or by executing Fulcrum's Maven build twice."
  ], 
  "revision_id": "222585"
 }
]