[
 {
  "author": "dlr", 
  "date": "2002-01-11T04:10:18.000000Z", 
  "msg": [
   "Corrected JavaDoc for map(String, String)."
  ], 
  "revision_id": "223349"
 }, 
 {
  "author": "dlr", 
  "date": "2002-01-11T03:34:39.000000Z", 
  "msg": [
   "o Added a note about the lack of thread safety in this class", 
   "(inconsequential, but perhaps worth noting).", 
   "o Taught map(String, String) to first try using getResourceAsStream()", 
   "to load the XML file from the classpath.", 
   "o Renamed baseDirectory to basePath, since this class now does loading", 
   "from the classpath as well as from the file system.", 
   "o If the inclusionRule for an element is empty, don't append / -- it", 
   "screws up getResourceAsStream() (and thus resource loading from the", 
   "classpath)."
  ], 
  "revision_id": "223348"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-01-05T03:22:59.000000Z", 
  "msg": [
   "- adding the following packages to stratum, they are still in rough form", 
   "but they need to be tossed into public view so we can move forward with", 
   "the release. i will put in what i know works and put in the prop/xml config", 
   "classes when they fully work. so here's a little breakdown.", 
   "configuration package:", 
   "hopefully this will give us the functionality of our ExtendedProperties", 
   "and hopefully also be compatible with the preferences API, if at all", 
   "possible. I'm working on a properties config by refactoring the", 
   "ExtendedProperties further to remove the i/o portions of the class and", 
   "offload the i/o operations to the resources package that will come in", 
   "Real Soon Now (c).", 
   "exception package:", 
   "this are the exception classes that dan worked on, the only think i can", 
   "think of here is make any changes that will allow easy use under 1.4", 
   "which supports chainable exceptions. the recommendation is in Effective", 
   "Java by Joshua Bloch and i put a note in the directory as a reminder.", 
   "lifecycle package:", 
   "this is all directly lifted from avalon but i put the configuration", 
   "interfaces in with the lifecycle stuff, everything is up for change as", 
   "we integrate things so if you don't like it speak up.", 
   "The remaining packages that i still have and am working on are", 
   "the factory, pool and resources packages which i will try to get in", 
   "place Real Soon Now (c) they actually work so i might just toss them", 
   "into the repository before i leave for Nevada on Sunday."
  ], 
  "revision_id": "223347"
 }, 
 {
  "author": "dlr", 
  "date": "2002-01-02T09:26:41.000000Z", 
  "msg": [
   "Minor clean up, including some tweaks to map() to move towards a more", 
   "streamy implementation (looking towards the day when class loading can", 
   "be used instead of file system access)."
  ], 
  "revision_id": "223346"
 }, 
 {
  "author": "dlr", 
  "date": "2001-12-31T22:19:37.000000Z", 
  "msg": [
   "o Minor formatting fixes.", 
   "o Added comments to isPlural(String) regarding I18N-ability and", 
   "default return value."
  ], 
  "revision_id": "223345"
 }
]