[
 {
  "author": "asmuts", 
  "date": "2002-01-20T01:48:06.000000Z", 
  "msg": [
   "Removed jetty since no one has the jar.", 
   "Replaced with tomcat wich is way too much.  Can't get it to work yet.  I'm geting a 'sealing exception' -- http://w4.metronet.com/~wjm/tomcat/2000/Nov/msg00329.html", 
   "Uncommented the rmic from the build.  This is crucial.", 
   "Turned off embedded server feature in remote.cache.ccf file.", 
   "Will try to get tomcat working later."
  ], 
  "revision_id": "223469"
 }, 
 {
  "author": "asmuts", 
  "date": "2002-01-20T01:47:37.000000Z", 
  "msg": [
   "Removed jetty sicne no one has the jar.", 
   "Replaced with tomcat wich is way too much.  Can't get it to work yet.  I'm geting a 'sealing exception' -- http://w4.metronet.com/~wjm/tomcat/2000/Nov/msg00329.html", 
   "Uncommented the rmic from the build.  This is crucial.", 
   "Turned off embedded server feature in remote.cache.ccf file.", 
   "Will try to get tomcat working later."
  ], 
  "revision_id": "223468"
 }, 
 {
  "author": "asmuts", 
  "date": "2002-01-19T06:27:13.000000Z", 
  "msg": [
   "Removed the set and get flag methods that are in the ocs4j. They are too inflexible.", 
   "Other ocs4j feature evaluations:", 
   "I'm going to set up the ability to add element event notificaiton.", 
   "See no need for sub regions.", 
   "See no need for pool objects, though this is simple.  Basically a pool is put in the cache.  Not sure if they distribute.  This would be  a disaster.", 
   "Stream objects may be nice, but they require some disk to be configured.  Makes the cache less pluggable.", 
   "Cache loaders seem to add little.  A normal cache user is a cache loader of sorts.", 
   "Remote synchronization or locking of elements looks nasty.  I don't want to go to this model.  It is too expensive and impossible to get right.  There is no way it works properly in osc4j.", 
   "Wait for response seems unnecessary as well.", 
   "osc4j got in the situation where an access object can't be shared.  Makes programming too combersome and they warn of memory leak dangers."
  ], 
  "revision_id": "223467"
 }, 
 {
  "author": "dlr", 
  "date": "2002-01-19T02:15:34.000000Z", 
  "msg": [
   "The need for Log4J is coming."
  ], 
  "revision_id": "223466"
 }, 
 {
  "author": "asmuts", 
  "date": "2002-01-18T22:40:13.000000Z", 
  "msg": [
   "testing disk and jisp, formatting.", 
   "jisp seems very slow for groups.  need to finish error file usage for jisp."
  ], 
  "revision_id": "223465"
 }
]