[
 {
  "author": "dlr", 
  "date": "2002-01-18T02:24:58.000000Z", 
  "msg": [
   "Achieved 2.3 Servlet API compatibility.", 
   "o Added DistSession(ServletContext) constructor, which should be used", 
   "in the future.", 
   "o Added getServletContext() accessor method."
  ], 
  "revision_id": "223449"
 }, 
 {
  "author": "dlr", 
  "date": "2002-01-18T02:22:06.000000Z", 
  "msg": [
   "Achieved compatibility with the 2.3 Servlet API.  Added", 
   "setCharacterEncoding(String) and getParameterMap() implementations.", 
   "The setCharacterEncoding() implementation does not modify the", 
   "underlying request (to preserve 2.2 compatibility)."
  ], 
  "revision_id": "223448"
 }, 
 {
  "author": "asmuts", 
  "date": "2002-01-18T02:11:32.000000Z", 
  "msg": [
   "Added teh ability to switch between caches in the tester interface.  If you start the tester and tester 2 you can switch 2 to move to testCache2.  i set up testCache2 to use the TCP lateral distribution.  It is very fast.  If you don't want a centralized remote, say if you have only 2 front end servers, then the TCP distribution would be a good choice.", 
   "It is also good if you have some background processes that need to expire data on the webservers.", 
   "I'm thinging about ading a get to the TCP lateral cache.  This is a major change.  Multiple lateral caches would result in several failures.  We could specify a maximium number of gets, a maximum time to search (requires some sophisticated monitoring), or some sort of simultaneous searching of multiple lateral caches (which may result in too much chatter).  The timeout seems best.  I'll look into it.", 
   "TCP failover and recovery is working fine.  May need to add some timeout to the connect, so it won't block if a firewall allows incoming but not outgoing connection to the port.  This is always tricky.", 
   "This is a very efficient means of keeping multiple caches in best-bet synchronization.", 
   "I'm also thinking of creating a socket remote cache."
  ], 
  "revision_id": "223447"
 }, 
 {
  "author": "dlr", 
  "date": "2002-01-18T02:02:44.000000Z", 
  "msg": [
   "Added a getRequestURL() instance method (using code borrow from", 
   "Catalina), step one of three for 2.3 compatibility for this class."
  ], 
  "revision_id": "223446"
 }, 
 {
  "author": "dlr", 
  "date": "2002-01-18T01:53:11.000000Z", 
  "msg": [
   "Fixed compilation warning."
  ], 
  "revision_id": "223445"
 }
]