[
 {
  "author": "mpoeschl", 
  "date": "2002-02-16T13:35:30.000000Z", 
  "msg": [
   "I just finished converting all of Aaron's JCS documents to xdoc format.", 
   "While doing this, I also created the start of a stratum xdoc hierarchy.", 
   "This includes Jason's description of stratum from last week's status", 
   "update, and all of the JCS documentation that I converted.", 
   "Attached to this email is a tarball of the xdoc directory I built and", 
   "patches for build.xml, deps.list, and default.properties.", 
   "The patch to build.xml adds the 'docs' target which has the DVSL task", 
   "that generates the docs and copy task to copy all images over to the", 
   "output directory.", 
   "The default.properties patch adds dvsl and velocity jars.  I used the", 
   "latest version of DVSL (0.40) so I could use the 'force' attribute in", 
   "the DVSL task which forces all of the docs to be built all of the time.", 
   "Unlike, Anakia, if you modify the project.xml file, the other pages are", 
   "not automatically regenerated.", 
   "pete@kazmier.com"
  ], 
  "revision_id": "223529"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-02-16T02:37:25.000000Z", 
  "msg": [
   "Another pass through jrefactory and a few perl scripts to clean up the javadoc", 
   "as much as possible. Another big patch but this one doesn't change any code.", 
   "Mainly I wanted to remove some of the useless javadoc ( undocumented blocks", 
   "sohuld now just have a one line placeholder ) and the ///////.... lines which", 
   "were used to break up the files before they were processed, but after the first", 
   "processing just seem to be wasteful. Hopefully this will be the last time this", 
   "is neccesary."
  ], 
  "revision_id": "223528"
 }, 
 {
  "author": "asmuts", 
  "date": "2002-02-15T16:09:14.000000Z", 
  "msg": [
   "some brief package documentation", 
   "i will add to this"
  ], 
  "revision_id": "223527"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-02-15T14:22:59.000000Z", 
  "msg": [
   "Removing some redundent log statements."
  ], 
  "revision_id": "223526"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-02-15T14:13:45.000000Z", 
  "msg": [
   "Fixed a class cast exception in DiskCacheManager. This is a bug that was not", 
   "occuring previously because it was wrapped in an if block that was disabled", 
   "by a static variable. Now that all the debug code can be enabled at runtime,", 
   "it surfaced. I suspect there will be more similar bugs, so don't be surprised."
  ], 
  "revision_id": "223525"
 }
]