[
 {
  "author": "jtaylor", 
  "date": "2002-02-14T00:57:41.000000Z", 
  "msg": [
   "Added a simple unit test for the JCS class. This includes simple cache and log", 
   "configuration files.", 
   "Added optional tracing aspects which are disabled by default. Everything should", 
   "still build and run fine without them. Everything also builds with them, but", 
   "there are still some problems to be worked out.", 
   "build.xml still needs some cleanup. Also, the test structure could be a little", 
   "better, a number of classes which are not Junit tests are getting included in", 
   "the run."
  ], 
  "revision_id": "223514"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-02-13T19:13:59.000000Z", 
  "msg": [
   "Converted Cache and GroupCache to use commons-logging wrapper to log4j. Also,", 
   "completed removal of 'debug' variable and p() method for those classes.", 
   "Many of the debug calls that were using that pattern ( and remain as calls to", 
   "log.isDebugEnabled / log.debug ) are just simple tracing calls. Specifically", 
   "method entries ( with params ) and exits. I believe the correct next step is", 
   "to remove those entirely and use aspectj to introduce tracing instead. This", 
   "will clean up the code signifigantly, and will have at least the performance", 
   "of using a static variable ( possibly better since instead of depending on the", 
   "compiler to optomize out those blocks, the code is never introduced ).", 
   "I also cleaned up the toString methods of a few classes so they print on one", 
   "line, better for logging. I removed one place where the entire cached data", 
   "object is written to the log, and instead have it log the type of the object.", 
   "I was caching some very large strings and other data objects, and having the", 
   "entire toString output in the logs made them much less clear. This is", 
   "especially a problem since some of my data objects have long and meaningfull", 
   "toString methods for use in velocity templates.", 
   "There is still a lot of style cleaning to be done in these classes, but I", 
   "wanted to get something in to give Aaron an example of how to use", 
   "commons-logging rather than log4j directly."
  ], 
  "revision_id": "223513"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-13T19:07:51.000000Z", 
  "msg": [
   "- add doug lea's concurrent package and commons-logging in prep for aaron and", 
   "james's conversion of the logging mechanism.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "223512"
 }, 
 {
  "author": "asmuts", 
  "date": "2002-02-13T04:45:26.000000Z", 
  "msg": [
   "testing log4j migration.  since the api changed it is much more difficult to migrate, but well worth the effort"
  ], 
  "revision_id": "223511"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-13T04:45:05.000000Z", 
  "msg": [
   "updating tool jar"
  ], 
  "revision_id": "223510"
 }
]