[
 {
  "author": "jtaylor", 
  "date": "2002-04-12T02:13:33.000000Z", 
  "msg": [
   "Component didn't make it into the last commit. Also, it works now, with a", 
   "change to how the properties are extracted from the configuration. Required", 
   "a cahnge in ConfigurationConverter in stratum, so that will need to be", 
   "updated."
  ], 
  "revision_id": "223919"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-04-12T01:39:57.000000Z", 
  "msg": [
   "- Implemented an internal queue for CacheEventQueue instead of the one from", 
   "util.concurrent. Looking at the unit tests this gets us a performance", 
   "increase from 25% ( for TestSimpleLoad ) to 75% ( The other two tests,", 
   "yes three times faster! ) More room for improvement I hope, but this", 
   "gets us back to where we were (it's actually a little faster then it", 
   "was when we were using JGL, but lots of other things have changed since", 
   "then. A big chunk of change came from moving the object creation for the", 
   "new node outside of the synchronized block -- who knew!", 
   "- Big changes to the way configuration works, trying to make things more", 
   "flexible, you can now get an unconfigured cache and configure it in a", 
   "couple different ways, possibly even more then once (that part is not", 
   "yet tested)", 
   "- Component wrapper for JCS! Still unsure about getting the properties", 
   "from the configuration, may just scrap it and move JCS to using the", 
   "configuration interfaces internally."
  ], 
  "revision_id": "223918"
 }, 
 {
  "author": "dlr", 
  "date": "2002-04-10T22:53:31.000000Z", 
  "msg": [
   "Best practices indicate that a list of constants are best defined in", 
   "an interface in Java, and that whitespace is always your friend."
  ], 
  "revision_id": "223917"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-04-10T15:01:02.000000Z", 
  "msg": [
   "- Removed extra put / get methods from ICache and all implementing classes", 
   "except Cache and GroupCache. Cache/GroupCache are a special case since the", 
   "responsibility for those methods is implemented both there and in", 
   "CacheAccess, need to rework that are, but I'm trying not to do too much in", 
   "one shot.", 
   "- Internally everything deals with cache elements (not serializable or object)", 
   "- Create AuxiliaryCache* interfaces", 
   "- Finished refactoring disk caches", 
   "The unit tests pass, FWIW. We _need_ unit tests for the GroupCache and the", 
   "RemoteCache if we are going to continue to claim they are usable =]"
  ], 
  "revision_id": "223916"
 }, 
 {
  "author": "jtaylor", 
  "date": "2002-04-09T00:32:45.000000Z", 
  "msg": [
   "Just cleaning up, mostly style things. Got rid of MemoryElement -- not used", 
   "anywhere, must have been replaced by MemoryElementDescriptor."
  ], 
  "revision_id": "223915"
 }
]