[
 {
  "author": "asmuts", 
  "date": "2005-01-13T09:12:58.000000Z", 
  "msg": [
   "Fixed a bug that caused remote push to fail.", 
   "The event queues have an isAlive and an isWorking status.  Originally isAlive meant that it hadn't died.  No isAlive means are there any threads that are running.  isWorking used to mean that there were threads working; now it means that the queue is in working order.  This terminology isn't clear and lead to a bug.  I will come up with new names.", 
   "The remote server used to check to see if a queue was alive before trying to send an update to a local.  When we made the queues shutdown from inactivity, they started setting the isAlive to false.  The remote server would then think they were bad and not try to add events.  I now made the remote server check to see if the queue is working.", 
   "updated to bug fix version 1.2.1"
  ], 
  "revision_id": "224194"
 }, 
 {
  "author": "asmuts", 
  "date": "2005-01-12T01:23:06.000000Z", 
  "msg": [
   "Optional, configurable thread pools can be set for all auxiliaries.  By default", 
   "the single queue is used. (Will document later.)", 
   "Shrinkers for all regions now share one thread and are executed by a Doug Lea", 
   "Clock Daemon.", 
   "The disk cache now has more configuration options exposed.  You can set the purgatory size,", 
   "recycle bin size, etc.  Alos, you can set a bound on the purgatory.  This solves the possibility", 
   "or an ever growing purgatory with a bounded queue.", 
   "Uped version to 1.2-dev to mark the changes.", 
   "Updated some documentation.  I need to rebuild the site.  I published the new", 
   "disk cache config page already.", 
   "The disk cache options are described on the web site.", 
   "jcs.auxiliary.DC.attributes.MaxPurgatorySize=10000", 
   "jcs.auxiliary.DC.attributes.MaxKeySize=10000", 
   "jcs.auxiliary.DC.attributes.MaxRecycleBinSize=5000", 
   "jcs.auxiliary.DC.attributes.OptimizeAtRemoveCount=300000"
  ], 
  "revision_id": "224193"
 }, 
 {
  "author": "asmuts", 
  "date": "2005-01-07T22:31:13.000000Z", 
  "msg": [
   "Added the ability to set auxiliaries to use a thread pools in the event queue.  By default none are used and no", 
   "threadpool configuration is necessary.  Everything is as is unless you configure it otherwise.", 
   "No version update.  I need to make sure the indexed disk cache can function", 
   "with more than one thread pulling out of the queue."
  ], 
  "revision_id": "224192"
 }, 
 {
  "author": "asmuts", 
  "date": "2005-01-06T04:44:28.000000Z", 
  "msg": [
   "Fixed bug in new code where the future result was not getting returned.", 
   "Added get statis method to CompositeCacheManager.", 
   "Added license to threadpool management classes.", 
   "Updated temp build jar, smae version as earlier."
  ], 
  "revision_id": "224191"
 }, 
 {
  "author": "asmuts", 
  "date": "2005-01-06T01:27:44.000000Z", 
  "msg": [
   "Put in a solution for the RMI bug.  Now, gets can be done asynchronously with a configurable timeout.", 
   "You can specify that your remote region should timeout gets.", 
   "see the cache.ccf in the src/conf for details"
  ], 
  "revision_id": "224190"
 }
]