[
 {
  "author": "jruzzi", 
  "date": "2005-07-22T23:00:27.569353Z", 
  "msg": [
   "updated example URL"
  ], 
  "revision_id": "224414"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-07-22T22:07:28.449431Z", 
  "msg": [
   "Working on MNG-607", 
   "o Changed MavenMetadataSource to a component, to avoid having to lookup artifactFactory and projectBuilder in order to", 
   "construct it.", 
   "o Added add(..) method to ScmBean in the release plugin to allow addition of release-pom.xml", 
   "o Changed the PrepareReleaseMojo to resolve ONLY version and parent-version for the normal pom.xml, and fully resolve all", 
   "artifacts used in the release-pom.xml, including version, parent-version, dependency closure (given by project.getArtifacts()), plugins, and reports. It will then add the release-pom.xml, and (attempt to) delete it before performing the final commit for next development version.", 
   "o Added some mapping methods to ArtifactUtils, to key by artifact.getId, and to create an Artifact.getId()-compatible string from parameters.", 
   "o Added TestProjectBuilder to remove the requirement in ProjectClasspathTest to modify the fields of the project builder directly.", 
   "o Cleaned up the AbstractReleaseMojo and PrepareReleaseMojo to avoid container lookups...they're now mojo parameters with the 'component.' prefix.", 
   "NOTE: Next step is to figure out how to use maven-scm to remove an SCM resource, to enable the prepare mojo to take the release-pom.xml back out of HEAD after the tag is complete."
  ], 
  "revision_id": "224413"
 }, 
 {
  "author": "djencks", 
  "date": "2005-07-22T21:56:20.119781Z", 
  "msg": [
   "GERONIMO-564 speling errosr"
  ], 
  "revision_id": "224412"
 }, 
 {
  "author": "rahul", 
  "date": "2005-07-22T21:55:50.401163Z", 
  "msg": [
   "Added the RDC Jakarta Taglib download section for a 1.0.0 release.", 
   "RESULT thread of 1.0 VOTE begins here [ http://marc.theaimsgroup.com/?l=taglibs-dev&m=112101824805166&w=2 ]."
  ], 
  "revision_id": "224411"
 }, 
 {
  "author": "djencks", 
  "date": "2005-07-22T21:54:47.050106Z", 
  "msg": [
   "GERONIMO-564 speling errosr"
  ], 
  "revision_id": "224410"
 }
]