[
 {
  "author": "snimalan", 
  "date": "2004-06-06T07:11:03.000000Z", 
  "msg": [
   "MessageInserter RMSequence classes modified so that, For all call.invke(), they will set the soap action.", 
   "For all call.invoke(), invokeMessage() function create and the fuction uses where ever needed"
  ], 
  "revision_id": "224784"
 }, 
 {
  "author": "snimalan", 
  "date": "2004-06-05T10:18:00.000000Z", 
  "msg": [
   "SequenceAcknowledgement, AckRequest classes Modified to send Header elements with mustunderstand = \"1\"", 
   "RMServerReuqestHandler modified so that, that will read every header elements and setProccessed to true."
  ], 
  "revision_id": "224783"
 }, 
 {
  "author": "snimalan", 
  "date": "2004-05-17T12:42:21.000000Z", 
  "msg": [
   "Step -By -Step configuration for sandesha and interop samples.", 
   "Please find the wsdd file that has mention in the document.", 
   "Please review the document.", 
   "Please send mail if you need more detail in the file", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "224782"
 }, 
 {
  "author": "dims", 
  "date": "2004-05-13T12:55:00.000000Z", 
  "msg": [
   "Update addressing jar and set must understand to true"
  ], 
  "revision_id": "224781"
 }, 
 {
  "author": "aslom", 
  "date": "2004-05-13T06:34:59.000000Z", 
  "msg": [
   "updated build.xml to do deploy and to run interop client scenario 1.1", 
   "updated axis.jar to ccode compield from current AXIS CVS"
  ], 
  "revision_id": "224780"
 }
]