[
 {
  "author": "ekoneil", 
  "date": "2005-07-25T15:54:25.661185Z", 
  "msg": [
   "Add commons-logging abstraction underneath the NetUI Logger.", 
   "This allows NetUI to be configured for more than just Log4J logging.  Configuration should be done using the instructions for commons-logging here:", 
   "http://jakarta.apache.org/commons/logging/guide.html", 
   "By default, the Log4J logger will still be used.", 
   "The original constructors for the o.a.b.n.u.l.Logger class are still around as well and just instantiate the new Log4JLogger class for back-compat.", 
   "One subtle change is that the \"commons-logging\" appender is no longer removed when using Log4J.  I don't think that this will be an issue, but if anyone has trouble with Struts spewing messages to the console, please file a JIRA issue.", 
   "BB: self", 
   "DRT: Beehive pass", 
   "BVT: NetUI pass"
  ], 
  "revision_id": "225144"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-07-25T15:54:20.191532Z", 
  "msg": [
   "Made Service a stand-alone class so it can be reused.", 
   "Made XMLHandler discoverable through the Service class.", 
   "Moved XMLHandler collection into new XMLHandlerRegistry class.", 
   "Adjusted the Renderers and XMLHandler to the above changes.", 
   "This should make it easier to write certain FOP extensions. The changes were triggered by my work on the FOP extension for Barcode4J for the FOP Trunk."
  ], 
  "revision_id": "225143"
 }, 
 {
  "author": "stefan", 
  "date": "2005-07-25T15:50:40.284084Z", 
  "msg": [
   "adding BerkeleyDb PersistenceManager contributed by Guillaume Bort", 
   "to contrib section"
  ], 
  "revision_id": "225142"
 }, 
 {
  "author": "geirm", 
  "date": "2005-07-25T15:47:16.858455Z", 
  "msg": [
   "these also :", 
   "these are the guidelines from HTTPD that I'm putting up as a", 
   "starting point of discussion.  I believe they are clearly marked", 
   "as proposed.", 
   "Please veto of this is unacceptable to someone"
  ], 
  "revision_id": "225141"
 }, 
 {
  "author": "geirm", 
  "date": "2005-07-25T15:46:13.756009Z", 
  "msg": [
   "1) Removed the ACon logo as ACon EU is over", 
   "2) added a \"proposed\" section and \"repurposed\" the HTTPD guidelines", 
   "there so we have a basis for discussion, based on dims start of discussion (again)"
  ], 
  "revision_id": "225140"
 }
]