[
 {
  "author": "wglass", 
  "date": "2005-07-26T04:25:45.241464Z", 
  "msg": [
   "remove build of outdated servlet examples"
  ], 
  "revision_id": "225229"
 }, 
 {
  "author": "bayard", 
  "date": "2005-07-26T04:21:59.242571Z", 
  "msg": [
   "added subnote to make sure PMCs do not think they are meant to do this stage"
  ], 
  "revision_id": "225228"
 }, 
 {
  "author": "wglass", 
  "date": "2005-07-26T04:16:20.417411Z", 
  "msg": [
   "Added documentation for property lookup.  Thanks to Bill Boland.", 
   "http://issues.apache.org/bugzilla/show_bug.cgi?id=10455"
  ], 
  "revision_id": "225227"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-07-26T03:55:37.192797Z", 
  "msg": [
   "Working on: MNG-607", 
   "o Added '-f' CLI option, to allow use of non-standard pom files, or spawning of a build from outside of the project dir.", 
   "o Added preferential processing of release-pom.xml over pom.xml if it exists (assumes that the current checkout is a release of the software)", 
   "o Moved all file discovery from MavenCli to DefaultMaven, to allow embedders to have access to this logic.", 
   "o Modified MavenExecutionRequest to add a flag for reactor-activation and the name of a non-standard pom to use, if appropriate.", 
   "o Removed getFiles() and getProjectFiles() from MavenExecutionRequest, since file discovery is now done in the DefaultMaven.", 
   "o Added integration tests to check preference of release-pom.xml in standalone and '-r' mode", 
   "o Added integration tests to check usage of '-f' option within and outside of the project directory", 
   "o Added processing for cli-options.txt to maven-core-it-verifier (Verifier.java) to allow specification of '-f' and '-r' in tests", 
   "NOTE: the release plugin still doesn't correctly remove the release-pom.xml from HEAD/trunk, since I don't have access to the SCM remove command from maven-scm. I'm waiting for Emmanuel to finish some API changes before moving to the new maven-scm version, and implementing this final step."
  ], 
  "revision_id": "225226"
 }, 
 {
  "author": "jmitchell", 
  "date": "2005-07-26T03:38:05.679331Z", 
  "msg": [
   "set returnNull to false to force ???local.missing???"
  ], 
  "revision_id": "225225"
 }
]