[
 {
  "author": "curcuru", 
  "date": "2002-01-11T16:27:23.000000Z", 
  "msg": [
   "Update docs for 1.0.b1 release"
  ], 
  "revision_id": "225944"
 }, 
 {
  "author": "curcuru", 
  "date": "2002-01-09T20:01:23.000000Z", 
  "msg": [
   "New build system for whole xml-commons project", 
   "Top-level xml-commons/build.xml creates distro out of all sub-sub-projects", 
   "README.html updated with forrest 1.5 look and more info", 
   "which.xml and external/build.xml simplified with minor updates; outputs are still the same"
  ], 
  "revision_id": "225943"
 }, 
 {
  "author": "jkesselm", 
  "date": "2002-01-04T20:20:52.000000Z", 
  "msg": [
   "Updating the W3C DOM documentation.", 
   "1) Added HTML Level 1. Xerces apparently wants this,", 
   "and there's certainly no reason not to have it in xml-commons.", 
   "2) Fixed the generated @param comments. The DOM WG's stylesheet", 
   "for producing Javadoc from their abstract XML markup had a glitch,", 
   "and did not reliably produce a space between the parameter name", 
   "and its description. I've submitted that as an erratum, to make sure", 
   "they fix it. Meanwhile, I've gone through and fixed them all manually.", 
   "(Not everything could be fixed by simply replacing \"The\" with \" The\";", 
   "some descriptions start with other words.)", 
   "I'm an ex-member of the DOM WG, and still on the IG, so feel free to", 
   "blame me for the fact that this wasn't caught before the DOM shipped", 
   "... and for making the change. The fact that these files are no", 
   "longer byte-for-byte identical with those supplied by the W3C will", 
   "annoy some folks, but I think it's fairly safe to assume that the DOM WG", 
   "will accept the erratum.", 
   "And we definitely want to fix it here rather than having each Apache", 
   "project patch their own copy."
  ], 
  "revision_id": "225942"
 }, 
 {
  "author": "curcuru", 
  "date": "2001-12-21T22:59:52.000000Z", 
  "msg": [
   "Add java.class.path to test/check targets; this allows users to manually", 
   "add items to their CLASSPATH and then have the test/check", 
   "target actually use that CLASSPATH"
  ], 
  "revision_id": "225941"
 }, 
 {
  "author": "curcuru", 
  "date": "2001-12-21T22:59:05.000000Z", 
  "msg": [
   "Make several useful methods static; makes it easier to call", 
   "them externally; note that someday we may want non-static methods in", 
   "case there are any detailed classloader issues that have different", 
   "behavior between static and instance methods."
  ], 
  "revision_id": "225940"
 }
]