[
 {
  "author": "mrglavas", 
  "date": "2005-06-17T19:50:14.000000Z", 
  "msg": [
   "Merge in a fix from the tck-jaxp-1_2_0 branch:", 
   "Under some JDK's (notably both Sun and IBM 1.4.0), getClassLoader(), when invoked", 
   "on the JAXP or SAX classes, it returns null.  This means that", 
   "the fallback mechanism in these APIs may not work correctly:  in", 
   "particular, when an attempt to invoke an unknown Parser/XMLReader", 
   "implementation is made in SAX, a NullPointerException rather than the correct", 
   "ClassNotFoundException results.  This patch fixes this problem,", 
   "by using Class.forName() in the event that the bootstrap", 
   "classloader is not returned in this particular situation."
  ], 
  "revision_id": "226239"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-17T19:32:50.000000Z", 
  "msg": [
   "Merge in a fix from the tck-jaxp-1_2_0 branch:", 
   "The reader used to read the service provider is never", 
   "closed if an IOException is thrown while reading from", 
   "it. Adding a finally block so that the reader will", 
   "always be closed."
  ], 
  "revision_id": "226238"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-17T19:26:53.000000Z", 
  "msg": [
   "Merge in Performance Fix from the tck-jaxp-1_2_0 branch:", 
   "When reading the service provider name from a jar", 
   "a BufferedReader is used to read the first line from the", 
   "file. BufferedReader's default buffer size is 8K chars. Since", 
   "we're only reading one line (the name of a class) this is pretty", 
   "excessive. Reducing this size significantly to 80 chars."
  ], 
  "revision_id": "226237"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-17T03:10:33.000000Z", 
  "msg": [
   "Javadoc fixes. End tags for <code> were missing. This caused the Javadoc for the methods", 
   "following the missing end tag to be formatted entirely in the \"code\" format. Fixed a few", 
   "instances where *s were inadverently included in the Javadoc text that should not have", 
   "been."
  ], 
  "revision_id": "226236"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-15T00:51:32.000000Z", 
  "msg": [
   "Suppress varargs call warning emitted from Java 5.0 compiler."
  ], 
  "revision_id": "226235"
 }
]