[
 {
  "author": "ggregory", 
  "date": "2005-08-03T02:50:53.543596Z", 
  "msg": [
   "Fixes and better unit test code coverage from Nathan Beyer [nbeyer@kc.rr.com]."
  ], 
  "revision_id": "227149"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-08-03T02:36:14.276263Z", 
  "msg": [
   "Working on: MNG-662", 
   "o Moved release.properties management to a helper class", 
   "o Created a helper class for caching/prompting for project-versions", 
   "o Created a helper class for managing SCM info updates during the release:prepare process", 
   "o Moved as many of the shared fields out of AbstractReleaseMojo as possible, given the refactor to reactorized processing", 
   "o Refactored the PrepareReleaseMojo to process a list of projects, and resolve inter-dependencies during transforms, etc.", 
   "o Refactored the PerformReleaseMojo to adjust to the new helper classes.", 
   "o Removed the old transformers, since MavenProject.writeOriginalModel() can be used instead, using the modello writer", 
   "o Bumped the maven-scm versions up to 1.0-alpha-2-SNAPSHOT, and added maven-scm-manager-plexus."
  ], 
  "revision_id": "227148"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-08-03T02:30:21.130227Z", 
  "msg": [
   "Working on: MNG-662", 
   "o Moved extension-artifact creation and caching to MavenProject, initialized by MavenProjectBuilder, just like plugin-artifacts is.", 
   "o Added extension-artifact and report-artifact creation (and initialization in MavenProject) to MavenProjectBuilder, for consistency with plugin-artifacts", 
   "o Removed dependency on ArtifactFactory in DefaultExtensionManager (extension artifacts are reachable from MavenProject now)", 
   "This makes the process of resolving all artifacts referenced by a project much simpler and more consistent (namely, for the release plugin)"
  ], 
  "revision_id": "227147"
 }, 
 {
  "author": "svieujot", 
  "date": "2005-08-03T02:01:33.925171Z", 
  "msg": [
   "When displayValueOnly='true', render selectOne* within a span tag instead of ul+li."
  ], 
  "revision_id": "227146"
 }, 
 {
  "author": "parker", 
  "date": "2005-08-03T01:29:56.912139Z", 
  "msg": [
   "Bug 4510: Add missing UNIQUE index for bayes_vars"
  ], 
  "revision_id": "227145"
 }
]