[
 {
  "author": "henning", 
  "date": "2005-08-02T19:46:41.000000Z", 
  "msg": [
   "-  Add some docs about how the site is built to the README.txt file. The site", 
   "is now self-contained, it is no longer necessary to check out all other", 
   "db projects.", 
   "- change the reactor build to run inside the projects directory.", 
   "- Add some sorting code making sure that the projects will always appear", 
   "in natural sorting order", 
   "- Read the committers (developers) from all the sub-projects, eliminating", 
   "duplicates for the whoweare.xml template"
  ], 
  "revision_id": "227389"
 }, 
 {
  "author": "henning", 
  "date": "2005-08-02T19:43:58.000000Z", 
  "msg": [
   "- Add a LICENSE.txt file and the maven-license-plugin to the project.xml", 
   "file. Now that the reports list is no longer empty, we don't run all", 
   "the (unnecessary) projects reports but just a (very short) license", 
   "plugin. Yes I don't understand either why you can't turn off all reports", 
   "by just leaving the reports list empty...", 
   "- Move our dependencies to released versions to avoid SNAPSHOT reloading", 
   "- Fix up lots of the references in the POM which has been obviously copied", 
   "over from the maven project", 
   "- Move the list of PMC members from the whoweare.xml file here (into", 
   "the \"developers\" list)"
  ], 
  "revision_id": "227388"
 }, 
 {
  "author": "henning", 
  "date": "2005-08-02T19:39:01.000000Z", 
  "msg": [
   "Add the mockup POMs for the various DB subprojects. For the projects", 
   "using maven _and_ subversion, this will become an external reference", 
   "once we move the site module to Subversion."
  ], 
  "revision_id": "227387"
 }, 
 {
  "author": "henning", 
  "date": "2005-08-02T19:36:46.000000Z", 
  "msg": [
   "Ignore all Velocity generated logs"
  ], 
  "revision_id": "227386"
 }, 
 {
  "author": "jmcnally", 
  "date": "2005-08-02T16:45:35.000000Z", 
  "msg": [
   "the chair is selected by the board"
  ], 
  "revision_id": "227385"
 }
]