[
 {
  "author": "scamp", 
  "date": "2005-08-04T19:50:07.159720Z", 
  "msg": [
   "adding missing imports"
  ], 
  "revision_id": "227459"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-08-04T19:46:13.794464Z", 
  "msg": [
   "Separate the site/ and release/ documentation.", 
   "This has been done by branching the docs in forrest/ into two sub-directories:", 
   "release/", 
   "site/", 
   "The former contains the documentation for the release that is currently maintained in the given source line (trunk/, in this case) and site/ contains Beehive's Apache website.", 
   "This is currently a little funky as the tabs on the release documentation and site contents are different, but they share the same look and feel and should be easily evolvable over time.  Also, there are some *hard* references from the site/ docs into the release/ docs that are done by URL as http://incubator.apache.og/beehive.  This needs to be fixed going forward, but it's a much easier problem to handle than the current one of having two release doc kits on the stie at once.  :)", 
   "Haven't published this new site yet -- will probably wait to do that until the infra folks have setup beehive.apache.org.", 
   "Also, this changes the documentation that's included in the distribution -- it's now just the docs for a specifc release as opposed to the entire Beehive website.", 
   "BB: self", 
   "DRT: Beehive / build.dist pass"
  ], 
  "revision_id": "227458"
 }, 
 {
  "author": "henning", 
  "date": "2005-08-04T19:44:34.781267Z", 
  "msg": [
   "Update a number of maven plugins for building to versions which can", 
   "handle Subversion. All versions should be available from ibiblio.", 
   "Add findbugs report."
  ], 
  "revision_id": "227457"
 }, 
 {
  "author": "henning", 
  "date": "2005-08-04T19:43:00.832954Z", 
  "msg": [
   "We are now deploying to the development branch of 2.3 on", 
   "people.apache.org"
  ], 
  "revision_id": "227456"
 }, 
 {
  "author": "ate", 
  "date": "2005-08-04T19:41:55.808010Z", 
  "msg": [
   "Removing portal-webapp project:", 
   "deploy-tool now hold the web-app_2_3.dtd itself (there was no other usage)"
  ], 
  "revision_id": "227455"
 }
]