[
 {
  "author": "dlr", 
  "date": "2001-10-23T21:19:52.000000Z", 
  "msg": [
   "Added maxColumnNameLength property."
  ], 
  "revision_id": "227794"
 }, 
 {
  "author": "dlr", 
  "date": "2001-10-22T23:05:59.000000Z", 
  "msg": [
   "Patch by Byron Foster <bfoster@base2.cc> to fix defect #3496 (reported", 
   "by Dave Hewitt <dhewitt@objectivity.co.uk>):", 
   "Here is a patch that fixes bug #3496:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=3496", 
   "In general ObjectKeys are no longer stored within a Torque OM object", 
   "with a value property of null, but are rather converted to null so", 
   "that the associated get call always return null for when an object is", 
   "not associated or defined.  I think this is intuitive behavior as", 
   "described in the bug.   This is consistent with what the current get", 
   "property method expects for how ObjectKey fields will be handled.", 
   "I removed code that previously did just the inverse so that when a", 
   "null value was passed to the set method a new ObjectKey was created", 
   "and set given a value of null. I did not find where this is necessary", 
   "or desirable, certainly since it breaks the associated get method.", 
   "This will change behavior slightly but I dont think it will affect", 
   "current code that calls Torque OM objects. Before the new changes if a", 
   "foreign key field is not required, then selecting an object out of the", 
   "database that does not have an associated object for the given foreign", 
   "key would create an ObjectKey with a null value property.  With this", 
   "patch this same case simply returns null.  But like the bug states", 
   "people should be testing this case currently with:", 
   "if (getXXX() != null || getXXX().getValue() != null)"
  ], 
  "revision_id": "227793"
 }, 
 {
  "author": "dlr", 
  "date": "2001-10-22T22:30:39.000000Z", 
  "msg": [
   "Patch by Byron Foster <bfoster@base2.cc>:", 
   "defaultNameConversion -> defaultJavaNamingMethod"
  ], 
  "revision_id": "227792"
 }, 
 {
  "author": "dlr", 
  "date": "2001-10-22T05:07:08.000000Z", 
  "msg": [
   "Pointlessly deprecated getDefaultMap()."
  ], 
  "revision_id": "227791"
 }, 
 {
  "author": "dlr", 
  "date": "2001-10-22T00:55:23.000000Z", 
  "msg": [
   "Patch by Peter Donald <donaldp@apache.org> to ignore local build", 
   "system overrides."
  ], 
  "revision_id": "227790"
 }
]