[
 {
  "author": "jmcnally", 
  "date": "2002-06-22T18:34:07.000000Z", 
  "msg": [
   "On second (actually third) thought, record the fact that the rollback", 
   "was attempted and failed.  This might be important in reconstructing a", 
   "corrupted db or at least pointing to the fact that it may have occured.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "228419"
 }, 
 {
  "author": "jmcnally", 
  "date": "2002-06-22T18:28:18.000000Z", 
  "msg": [
   "patch by Stephen Haberman <stephenh@chase3000.com>", 
   "In the generated save method, if an error occurs,", 
   "BasePeer.rollBackTransaction is called. However, if an error occurs in", 
   "the rollBackTransaction, the user loses anything about the original", 
   "error and only sees the rollBackEx.", 
   "Ignores the rollBackEx and just returns the", 
   "original exception from save", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "228418"
 }, 
 {
  "author": "jmcnally", 
  "date": "2002-06-22T18:20:35.000000Z", 
  "msg": [
   "patch by Derek Robert Price <oberon@umich.edu>", 
   "This patch fixes a NullPointerException in BasePeer which occurred when", 
   "inserting an entry into a table without a primary key."
  ], 
  "revision_id": "228417"
 }, 
 {
  "author": "jmcnally", 
  "date": "2002-06-20T23:55:14.000000Z", 
  "msg": [
   "added the ability to reference tables in a different schema.  The objects", 
   "defined in the referencing schema are aware of the objects in the", 
   "referenced schema.  But the object model in the referenced schema is", 
   "unaffected.  Does not currently handle a circular relationship.", 
   "The tables in the related schemas should be in the same database.", 
   "Useful for addons/optional components that should not affect the core object", 
   "model.  Might also be useful as a way to overcome the TurbineUser/security", 
   "tables problem that has confounded turbine users for years.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "228416"
 }, 
 {
  "author": "jmcnally", 
  "date": "2002-06-20T23:48:38.000000Z", 
  "msg": [
   "the addition of the .om is not making its way into the template because", 
   "all the properties are made available as is to the template and that", 
   "ends up overwriting the value put into the context by the task.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "228415"
 }
]