[
 {
  "author": "henning", 
  "date": "2003-01-09T15:39:35.000000Z", 
  "msg": [
   "Added the ability to supply \"default\" values for all data sources. This", 
   "is done by a \"defaults\" subsection in the Torque.properties. Put some", 
   "examples into the supplied Torque configuration files.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "228829"
 }, 
 {
  "author": "henning", 
  "date": "2003-01-09T15:25:59.000000Z", 
  "msg": [
   "Added yours truly to the list of torque developers."
  ], 
  "revision_id": "228828"
 }, 
 {
  "author": "henning", 
  "date": "2003-01-09T15:25:08.000000Z", 
  "msg": [
   "Moved the applyConfiguration Method into the Abstract base class.", 
   "Made the jdbc2 factory also use the applyConfiguration method.", 
   "Fixed the comment on TorqueDataSourceFactory.", 
   "Added yours truly to the authors list of some files.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "228827"
 }, 
 {
  "author": "henning", 
  "date": "2003-01-09T15:00:34.000000Z", 
  "msg": [
   "This fixes one of the most sucking bugs in the ConnectionPool handling...", 
   "When upgrading from older versions (and config files) to the current", 
   "torque, users might forget that they have to change their expiry timeouts", 
   "from millis to seconds. So we might get 3,600,000 passed along as maxExpiry", 
   "value. In an int. Then we blow it up by x 1000. In an int. Which overflows.", 
   "Which is < 0. Now you have a negative life time and every pool connection", 
   "expires immediately.", 
   "So you get lots and lots of new connections to your database. And", 
   "some, like MySQL have a ratio limiter which, at some point, kicks in", 
   "and your application dies with \"there seems to be no database running", 
   "on host <xxx>\". And it dies at random points without any real indication.", 
   "And (of course) only under load, so you don't find it in your testing.", 
   "Morale: Think long and hard about integer arithmetics. Better yet: Use longs."
  ], 
  "revision_id": "228826"
 }, 
 {
  "author": "henning", 
  "date": "2003-01-09T13:53:57.000000Z", 
  "msg": [
   "Make the monitor thread message easier to understand"
  ], 
  "revision_id": "228825"
 }
]