[
 {
  "author": "tfischer", 
  "date": "2005-03-09T15:43:05.000000Z", 
  "msg": [
   "TRQS263:", 
   "In Oracle:", 
   "schema type timestamp is now mapped to database type timestamp (and not to date anymore)", 
   "The number of digits used to store an integer is limited to 10", 
   "Thanks to Christoph Zenger for the patch"
  ], 
  "revision_id": "229679"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-03-09T14:17:32.000000Z", 
  "msg": [
   "Making the name attribute of the database #REQUIRED", 
   "See TRQS287"
  ], 
  "revision_id": "229678"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-03-04T06:38:54.000000Z", 
  "msg": [
   "added test for TRQS267"
  ], 
  "revision_id": "229677"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-03-04T06:37:02.000000Z", 
  "msg": [
   "TRQS267:  In the datasql task, single quotes in strings are escaped by doubling the single quote, not by a backslash.", 
   "I do not know any database where doubling the quotes do not work. If there is one, please let me know.", 
   "Thanks to Garth Fielding for the patch."
  ], 
  "revision_id": "229676"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-02-23T17:32:09.000000Z", 
  "msg": [
   "Added support for specifying database schema names at generate time, i.e. tablenames like \"my_schema.my_table\" can now be used in schema.xml", 
   "To do this, the java naming methods \"underscore\" and \"javaname\" in the generator were changed such that, in addition to removing underscores, they remove dots as well.", 
   "Also, a new java naming method called underscoreOmitSchema was introduced, which works like the underscore method but omits everything before the last dot.", 
   "As an example, the tablename \"my_schema.my_TABLE\" would produce the java name \"MySchemaMyTable\" with the method \"underscore\", \"MySchemaMyTABLE\" with the method \"javaName\", and \"MyTable\" with the method UnderscoreOmitSchema.", 
   "I did not know how to proceed with the \"nochange\" method, it will produce unvalid java names if schemata are used (java name \"my_schema.my_TABLE\").", 
   "Also some docs were added in the schema-howto.", 
   "The changes were tested for oracle, I will do tests for mysql and postgresql as well."
  ], 
  "revision_id": "229675"
 }
]