[
 {
  "author": "tfischer", 
  "date": "2005-02-18T10:06:22.000000Z", 
  "msg": [
   "oops, forgot to mention a change I did some time ago..."
  ], 
  "revision_id": "229674"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-02-18T10:04:37.000000Z", 
  "msg": [
   "allow dots in autogenerated table names", 
   "This is a first step towards support of fully qualified table names (<table name=\"schema_name.table_name\" ... >) in the generator.", 
   "I did not notice any further problems with such table names in the runtime.", 
   "The generator still produces invalid java names, but this can be overridden via the javaName attribute of the table tag."
  ], 
  "revision_id": "229673"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-02-18T09:26:03.000000Z", 
  "msg": [
   "corrected error message"
  ], 
  "revision_id": "229672"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-02-16T09:24:11.000000Z", 
  "msg": [
   "Fixed a problem that the Cache Manager misses saves. In Thomas Vandahl's words:", 
   "In ObjectWithManager.vm there is a problem in the line", 
   "#set ($tableHasPrimaryKey = $table.PrimaryKey.size() > 0)", 
   "Velocity barfs on this statement (\"rhs of #set statement is null\")", 
   "The generated save(Connection con) method misses the cache update call in this case.", 
   "The bug was introduced fairly recently in Rev 1.15 in an attempt to fix the generated code for tables without PKs. Torque 3.1.1 works fine.", 
   "PR: TRQS279", 
   "Submitted by:\tThomas Vandahl"
  ], 
  "revision_id": "229671"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-02-16T07:58:49.000000Z", 
  "msg": [
   "Avoid ConcurrentModificationException if data is inserted into the LargeSelect while the first page of data is already displayed.", 
   "Thanks to Gareth Boden and Thomas Vandahl", 
   "In Thomas Vandahl's words:", 
   "LargeSelect is made to retrieve a list of objects in the background", 
   "while the Velocity template already can display the first page of", 
   "results. This is very handy for paging through long lists of objects.", 
   "The said Exception occurs if the background thread still adds objects to", 
   "the result list while Velocity already uses an Iterator on the sublist", 
   "of the first page. This usually happens when selects take a while.", 
   "The patch simply copies the page of results instead of returning a", 
   "sublist. This avoids the problem described above and just needs a little", 
   "bit more memory.", 
   "I have this working in a production environment for almost a year with", 
   "no problems whatsoever.", 
   "Submitted by: Gareth Boden"
  ], 
  "revision_id": "229670"
 }
]