[
 {
  "author": "tfischer", 
  "date": "2005-05-08T16:14:07.000000Z", 
  "msg": [
   "Up to now, when inserting a BIT value, Torque gave village an integer value for the bit column. This caused a problem for HSQLDB (it inserted the value false for a boolean with value true)", 
   "This works if a boolean is given to village instead.", 
   "Tested also for mysql and postgresql."
  ], 
  "revision_id": "229709"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-05-08T15:56:49.000000Z", 
  "msg": [
   "Changed the handling of BIT columns in Postgres to use TRUE,FALSE instead of '1','0'.", 
   "The Postgresql Manual says for Boolean columns (BIT is mapped to Boolean in Postgres):", 
   "PostgreSQL provides the standard SQL type boolean. boolean can have one of only two states: \"true\" or \"false\". A third state, \"unknown\", is represented by the SQL null value.", 
   "Valid literal values for the \"true\" state are:", 
   "TRUE", 
   "'t'", 
   "'true'", 
   "'y'", 
   "'yes'", 
   "'1'", 
   "For the \"false\" state, the following values can be used:", 
   "FALSE", 
   "'f'", 
   "'false'", 
   "'n'", 
   "'no'", 
   "'0'", 
   "Using the key words TRUE and FALSE is preferred (and SQL-compliant).", 
   "Thanks to Tarlika Elisabeth Schmitz for pointing this out.", 
   "PR: TRQS221"
  ], 
  "revision_id": "229708"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-05-05T10:44:42.000000Z", 
  "msg": [
   "Gathered the code which deals with Booleans in criteria in an extra method.", 
   "This is no functional change, just a refactoring in order to have a central place where the boolean problem is dealt with."
  ], 
  "revision_id": "229707"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-05-05T09:07:23.000000Z", 
  "msg": [
   "removed all the try-catch blocks from the test case. The reasons are", 
   "- stack traces are printed by maven anyway. They are better to interpret if they are not caught and rethrown", 
   "- the code is much shorter now"
  ], 
  "revision_id": "229706"
 }, 
 {
  "author": "tfischer", 
  "date": "2005-05-05T08:17:11.000000Z", 
  "msg": [
   "added a test case to test primary keys which are also foreign keys", 
   "added a test to the orderByTest to check usage of sql functions in the order by clause"
  ], 
  "revision_id": "229705"
 }
]