[
 {
  "author": "dolander", 
  "date": "2004-07-17T19:32:39.145087Z", 
  "msg": [
   "Additional cleanup based to support the transition to JSP 2.0 EL.", 
   "Removed the language='netuiexpression' from all attributes that no longer support NetUI EL", 
   "Verify all attributes other than dataSource allow runtime expressions and that dataSource does not", 
   "Cleaned up the attribute types of tabindex and accessKey so they are consistent accross tags", 
   "Review: Eddie"
  ], 
  "revision_id": "23009"
 }, 
 {
  "author": "brondsem", 
  "date": "2004-07-17T18:53:47.664742Z", 
  "msg": [
   "descriptions for forrestbot targets; any thoughts on the 'FB:' prefixes?"
  ], 
  "revision_id": "23008"
 }, 
 {
  "author": "", 
  "date": "2004-07-17T18:13:53.222759Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "23007"
 }, 
 {
  "author": "ekoneil", 
  "date": "2004-07-17T16:37:39.265931Z", 
  "msg": [
   "Add the ability to pass the Locale to the type conversion infrastructure.", 
   "This is needed to be able to convert Date objects (and anything else needing a Locle) given a particular a Locale instance.", 
   "It's implemented as a new API method on TypeUtils as:", 
   "convertToObject(String value, Class type, Locale locale)", 
   "Type converter implementations are free to ignore the locale.", 
   "Added a BaseTypeConverter so that the TypeConverter interface doesn't break and switched the TypeUtils to talk to this base class.  TypeConverter implementations are called through the DelegatingTypeConverter extension of BaseTypeConverter.", 
   "Consider this a proposal for a way to handle Locales during conversion; this should just get the tests running for non-US locales in the short term.", 
   "BB: self", 
   "DRT: Controls / NetUI pass", 
   "BVT: NetUI pass"
  ], 
  "revision_id": "23006"
 }, 
 {
  "author": "crossley", 
  "date": "2004-07-17T13:55:28.136132Z", 
  "msg": [
   "Lots of good information about SVN at the ASF /dev/ pages."
  ], 
  "revision_id": "23005"
 }
]