[
 {
  "author": "rlubke", 
  "date": "2002-01-18T15:01:28.000000Z", 
  "msg": [
   "PR: 5913", 
   "Submitted by: Christopher St. John (cks@distributopia.com)", 
   "- patch allows the confuration of the location of the servlet.jar", 
   "via build.properties as described (somewhat inaccurately in BUILDING.txt).", 
   "Thanks Christopher."
  ], 
  "revision_id": "230184"
 }, 
 {
  "author": "djd", 
  "date": "2005-08-05T00:30:40.252606Z", 
  "msg": [
   "DERBY-485 Catch SecurityExceptions and LinkageExceptions consistently when loading application", 
   "classes (e.g. procedures, functions) and report as a ClassNotFoundException with the text of", 
   "the underlying exception. Enhance the test lang/dcl.jar to have a signed jar file as a database", 
   "jar, a hacked version of the jar file and a jar file with an invalid class (for a LinkageError)."
  ], 
  "revision_id": "230183"
 }, 
 {
  "author": "rlubke", 
  "date": "2002-01-17T14:18:46.000000Z", 
  "msg": [
   "Updated GTest per an issue reported on the tomcat-dev list.", 
   "- Added a flexible check for a response content-type header.", 
   "Before, if a server appended an encoding onto the content-type", 
   "and GTest wasn't expecting the encoding, the test would fail.", 
   "Now, if GTest is configured to look only for the content-type,", 
   "and it finds the server response contains the encoding, it will", 
   "match the header."
  ], 
  "revision_id": "230182"
 }, 
 {
  "author": "rlubke", 
  "date": "2002-01-15T16:19:16.000000Z", 
  "msg": [
   "- Modifed GetMethod_HEADTestServlet to set a header indicating", 
   "test success or failure instead of using sendError(int,String)."
  ], 
  "revision_id": "230181"
 }, 
 {
  "author": "rlubke", 
  "date": "2002-01-15T16:16:53.000000Z", 
  "msg": [
   "-Excluded HttpServletResponse and HttpServletResponseWrapper tests", 
   "for sendError(int,String).  These tests expect that the value passed", 
   "to msg should be used as the reason-phrase in the HTTP response status-line.", 
   "However, there is nothing in the spec that states this is the required", 
   "behavior.  This will be addressed in the next spec.", 
   "-Modified the gtest task for the HEAD test of HttpServletRequest to", 
   "expect a header indicating test success instead of relying on the current", 
   "behavior of sendError(int,String).  Also added an additional attribute to", 
   "assert that a response body is not returned when a client issues a HEAD", 
   "request to a target server."
  ], 
  "revision_id": "230180"
 }
]