[
 {
  "author": "leif", 
  "date": "2004-07-18T07:59:44.387698Z", 
  "msg": [
   "Correct the connector project name."
  ], 
  "revision_id": "23014"
 }, 
 {
  "author": "dolander", 
  "date": "2004-07-18T04:19:48.879436Z", 
  "msg": [
   "Updated a few tests with better documentation.  This is an ongoing effort to", 
   "clean up the netui BVT/DRT tests so they are understandable by the beehive community.  Most", 
   "of these tests were developed as dev examples and bug repos.  The documentation effort", 
   "is one to allow people to understand the tests without actually having to read", 
   "the code."
  ], 
  "revision_id": "23013"
 }, 
 {
  "author": "dolander", 
  "date": "2004-07-18T04:13:23.987194Z", 
  "msg": [
   "In the transition to JSP 2.0 EL, String properties don't come in as null when the object", 
   "bound to is null.  Instead they come in as the empty string so we were writting out invalid javascript.", 
   "This was reported by Eddie.  The test index pages demonstrated the error.", 
   "Eddie reviewed the diff."
  ], 
  "revision_id": "23012"
 }, 
 {
  "author": "brondsem", 
  "date": "2004-07-17T22:01:53.338347Z", 
  "msg": [
   "prompt for scp password if not set"
  ], 
  "revision_id": "23011"
 }, 
 {
  "author": "dolander", 
  "date": "2004-07-17T21:05:04.920038Z", 
  "msg": [
   "Remove the support for \"LegacyTags\".  This was in place when the beehive tags were", 
   "to maintain backward compatibility with the NetUI 8.1 tags.  This is no longer a", 
   "requirement so I've removed the support added to the tags.", 
   "The only remaining support was for writting out JavaScript before the HTML <head>", 
   "element which is not legal HTML but was how the 8.1 tags did it.", 
   "The LegacyTags element was not removed from the XML configuration file.  I marked this as a future todo.", 
   "This was not removed because I need support from Eddie for rebuilding the templates and some", 
   "remaining dependencies in the WLW source code.", 
   "Review: Eddie"
  ], 
  "revision_id": "23010"
 }
]