[
 {
  "author": "hrabago", 
  "date": "2005-08-06T21:44:05.624448Z", 
  "msg": [
   "Replace references to ActionError with ActionMessage.", 
   "Replace references to ActionErrors with ActionMessages."
  ], 
  "revision_id": "230594"
 }, 
 {
  "author": "hrabago", 
  "date": "2005-08-06T21:30:38.837876Z", 
  "msg": [
   "Replace references to ActionError with ActionMessage.", 
   "Replace most references to ActionErrors with ActionMessages."
  ], 
  "revision_id": "230593"
 }, 
 {
  "author": "wrowe", 
  "date": "2005-08-06T21:29:05.804271Z", 
  "msg": [
   "As much as it pains me, seriously, it seems that reviewing the re-backport", 
   "of this code was too illegible for review, so it seems we will need to", 
   "re-review a fresh backport from httpd trunk.", 
   "Vetoed this patch as it does not follow RFC 2616.  Specifically;", 
   "* it does not respect the T-E over the C-L header", 
   "* it introduces edge cases that allow the administrator to override the", 
   "C-L T-E elections, without enough information to prevent splitting the", 
   "request body due to misaligned C-L's", 
   "* it does not attempt to determine if there is a 'small request body'", 
   "to prefer a legitimate C-L when that option might be available to us", 
   "A revised patch combining Jeff's efforts and mine is available at:", 
   "http://people.apache.org/~wrowe/httpd-2.0.54-proxy-request.patch", 
   "for review, which can be applied to httpd-2.0.54 and now, branches/2.0.x,", 
   "which addresses all of the issues cited above.", 
   "Note that I do not consider the correction of protocol.c to strip the C-L", 
   "where T-E is present to fulfill the need for a correct implementation", 
   "in proxy_http.c; modules have too much flexibility to modify the headers", 
   "before they hit this logic in the proxy request body handling."
  ], 
  "revision_id": "230592"
 }, 
 {
  "author": "svieujot", 
  "date": "2005-08-06T21:27:07.859761Z", 
  "msg": [
   "Added forceIdIndexFormula attribute to x:dataTable ."
  ], 
  "revision_id": "230591"
 }, 
 {
  "author": "antonio", 
  "date": "2005-08-06T21:20:55.464558Z", 
  "msg": [
   "Fix missing sitemap component configuration for HTML-Transformer. HTML block samples works again."
  ], 
  "revision_id": "230590"
 }
]