[
 {
  "author": "jeremias", 
  "date": "2005-08-15T10:47:52.752502Z", 
  "msg": [
   "Aaargh. Imports again."
  ], 
  "revision_id": "232789"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-08-15T10:45:28.220508Z", 
  "msg": [
   "JUnit Test cases to test URI resolution using custom URIResolvers. They are not yet integrated into the test suite as the second test fails and the first test needs some changes in the code (see TODO)."
  ], 
  "revision_id": "232788"
 }, 
 {
  "author": "vmassol", 
  "date": "2005-08-15T10:37:30.251928Z", 
  "msg": [
   "MNG-736: Move ear source directory to comply with other plugin's structure. Applied on Stephane's behalf."
  ], 
  "revision_id": "232787"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-08-15T10:34:31.127998Z", 
  "msg": [
   "Bugzilla #36082", 
   "1. Addresses the URI resolving issue as discussed in this bug by providing a", 
   "FOP implementation of the URIResolver interface as well as the capabilities to", 
   "set a URIResolver on the FOUserAgent object.", 
   "2. Modifies the BMPReader to extract the resolution information.", 
   "3. Fixes a possible array bounds exception in BMPImage which can happen for BMP", 
   "images with extra bytes at the end.", 
   "4. Provides some infrastructure in ImageFactory in preparation of external", 
   "configuration of multiple prioritised image providers per mime type.", 
   "5. Sets a proper base URL in SVGElement.", 
   "6. Provides test cases and test images for the different formats and", 
   "resolutions.", 
   "Submitted by: Manuel Mall <mm.at.arcus.com.au>", 
   "Patch slightly modified:", 
   "- EPS sample graphic exchanged with a very simple and more importantly much smaller one generated by Barcode4J.", 
   "- Enabled resolution checking for some of the format-specific testcases (especially after working around resolution detection for PNG)"
  ], 
  "revision_id": "232786"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-08-15T10:28:32.410135Z", 
  "msg": [
   "javac source seems to be needed, too, when compiling under JDK 5."
  ], 
  "revision_id": "232785"
 }
]