[
 {
  "author": "cutting", 
  "date": "2005-08-16T16:40:18.588412Z", 
  "msg": [
   "Add task id to child logs entries, and remove repeated date."
  ], 
  "revision_id": "233014"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-08-16T16:31:02.804486Z", 
  "msg": [
   "Working on: MNG-483", 
   "Fixing profile application to separate profiles discovered in and around POM from those in settings.xml, and apply them separately in the order:", 
   "for-each-project-in-inheritance:{POM, profiles.xml}, settings.xml", 
   "Added common interface for accumulating, explicitly activating and deactivating, and retrieving profiles to be applied to a given project. This manager interface (ProfileManager) is general enough to be applicable to both the project-level and settings-level profiles.", 
   "Added 'performRelease'-keyed profile to super-POM which will be used by the release plugin and anyone using a parallel process, and which will enable '-DupdateReleaseInfo=true' for the deploy mojo, along with enabling the source attachment for the project.", 
   "Added 'attach' parameter to JarSourceMojo to allow local POM to turn off source attachments, overriding release profile in super-pom.", 
   "Updated the release:perform mojo to use '-DperformRelease=true' for switching on the new release profile, rather than just using '-DupdateReleaseInfo=true'..."
  ], 
  "revision_id": "233013"
 }, 
 {
  "author": "jdcasey", 
  "date": "2005-08-16T16:21:39.292319Z", 
  "msg": [
   "Applying patch from Jason Grant for unpacking assemblies and for attaching assemblies as attached artifacts - Thanks, Jason"
  ], 
  "revision_id": "233012"
 }, 
 {
  "author": "gangolli", 
  "date": "2005-08-16T16:05:41.958600Z", 
  "msg": [
   "Fixes for ROL-754.  Moved from trunk to Roller 2.0 branch.  This renames the column condition to conditioncode in the pingtarget table.  Added to existing db upgrade script; changed in full db build script; changed in doclet tag of PingTargetData.java."
  ], 
  "revision_id": "233011"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-08-16T15:53:40.012132Z", 
  "msg": [
   "Add additional tests for:", 
   "- formatting Date objects using the <netui:formatDate> tag", 
   "- using the new \"value\" attribute on the headerCell", 
   "BB: self", 
   "DRT: NetUI pass", 
   "BVT: NetUI pass"
  ], 
  "revision_id": "233010"
 }
]