[
 {
  "author": "dlr", 
  "date": "2002-02-25T17:09:52.000000Z", 
  "msg": [
   "Applied patch by Kristian Meier <kristianm@jentro.com>.  The following", 
   "two descriptions were supplied in different messages:", 
   "\"we are going to use the webserver in our new release. for this we need", 
   "SSL. there is a quite convinient tool for setting up the neccassary", 
   "ssl-system-properties, the SecurityTools. but unfortunatly there is no", 
   "setter-method for the TrustStorePassword and the getter uses the", 
   "DEFAULT_KEY_PASSWORD if not set.\"", 
   "\"there is no setter for the trustStorePassword, so I included it along", 
   "with javadocs.", 
   "the second one is just a typo, where the keyStorePassword is checked on", 
   "null, this check must be on the trustStorePassword, since we are in the", 
   "getTrustStorePassword-method.\""
  ], 
  "revision_id": "233694"
 }, 
 {
  "author": "dlr", 
  "date": "2002-02-22T16:08:42.000000Z", 
  "msg": [
   "Moved EMPTY_BYTE_ARRAY back to where Jon had put it in the first", 
   "place.  Rick Johnston <RRJohnston@symantec.com> indicates that javac", 
   "(perhaps incorrectly) does not allow it, and provides some information", 
   "from the JLS:", 
   "\"In compiling the latest version of XmlRpcServer.java with javac", 
   "(1.3.1), I got a compiler error because of the static member", 
   "'EMPTY_BYTE_ARRAY' in the inner 'Worker' class.  Section 8.1.2 of the", 
   "Java Language Spec 2nd ed. does specifically state that \"Inner classes", 
   "may not declare static members, unless they are compile-time constant", 
   "fields.\"  Since EMPTY_BYTE_ARRAY is defined as \"= new byte[0]\", this", 
   "is not a compile-time constant and is therefore invalid.", 
   "Interestingly, the Jikes compiler does not complain about this", 
   "(perhaps because it is also declared as final?).  Alternatively, if", 
   "the Worker class was a Nested class but not an Inner class (i.e.,", 
   "Worker is 'static' - which doesn't seem appropriate), this would be", 
   "legal.\""
  ], 
  "revision_id": "233693"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2002-02-22T13:36:15.000000Z", 
  "msg": [
   "- applying patch submitted by Martin Skopp <skopp@riege.de> that", 
   "clarifies the building procedure and that Ant is required.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "233692"
 }, 
 {
  "author": "dlr", 
  "date": "2002-02-21T21:51:38.000000Z", 
  "msg": [
   "Added change from Ashley L Raiteri <ashley.l.raiteri@boeing.com> which", 
   "calls \"Runners.run to make sure we don't end up trying to call", 
   "con.run() on a null Connection.  This could happen if a Runner is in", 
   "run on wait, and gets the interrupt from G.interrupt(); Instead of", 
   "getting from Runners.handle()'s call to notify (which instantiates a", 
   "new Con).\"", 
   "This is the rest of the fix for", 
   "<http://nagoya.apache.org/bugzilla/show_bug.cgi?id=6593>."
  ], 
  "revision_id": "233691"
 }, 
 {
  "author": "dlr", 
  "date": "2002-02-21T18:00:54.000000Z", 
  "msg": [
   "The Runners themselves aren't Thread objects -- they house Thread", 
   "objects based of themselves, however.  Clarified in impl. comment in", 
   "shutdown()."
  ], 
  "revision_id": "233690"
 }
]