[
 {
  "author": "jeremias", 
  "date": "2005-08-21T14:10:59.803386Z", 
  "msg": [
   "An attempt at helpful error output when the top/left/bottom/right properties on block-containers are not right."
  ], 
  "revision_id": "234204"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-08-21T14:09:25.279444Z", 
  "msg": [
   "Show and fix a bug where bottom/right positioning of block-containers didn't work properly when the block-container is nested in a block."
  ], 
  "revision_id": "234203"
 }, 
 {
  "author": "olegk", 
  "date": "2005-08-21T13:55:16.651328Z", 
  "msg": [
   "Removed option to override system RCV_BUFFER_SIZE and SND_BUFFER_SIZE parameters"
  ], 
  "revision_id": "234202"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-08-21T13:36:53.103949Z", 
  "msg": [
   "A big step towards a usable PostScript renderer.", 
   "Some code that can be used by both PS and PDF renderers factored out into a common base class (AbstractPathOrientedRenderer).", 
   "Coordinate system of PS renderer and PSGraphics2D changed to be based on points rather than millipoints to be the same as the PDFRenderer. This improves the chance to reuse code.", 
   "PSGenerator set to PostScript level 2 now, should later be configurable. There may still be some PS commands which should be changed from Level 2 to Level 1, just to be able to support Level 1 later should anyone ask for it.", 
   "Bitmap, EPS and SVG support should be mostly restored now.", 
   "PSState was extended to provide the same break-out mechanism for fixed b-cs. And it has better support for tracking the graphics state.", 
   "Added some FOP-specific comments to certain constructs for people who want to post-process the PS output.", 
   "BatchDiffer shows very few visual differences now on the layout engine test cases between PDF and PS."
  ], 
  "revision_id": "234201"
 }, 
 {
  "author": "snicoll", 
  "date": "2005-08-21T13:29:05.233657Z", 
  "msg": [
   "Removed excludedDependencySet as it has been implemented another way"
  ], 
  "revision_id": "234200"
 }
]