[
 {
  "author": "vmassol", 
  "date": "2002-07-20T10:31:04.000000Z", 
  "msg": [
   "Follow Peter Donald lead:", 
   "\"", 
   "I just made all the dependencies on jakarta-ant include the inherited runtime.", 
   "This is to facilitate ant having dependencies in the future without ant", 
   "\"users\" having such dependencies.", 
   "My question is, should the xerces project be included as a runtime library of", 
   "ant. It is not strictly a dependency because any jaxp parser will do. In", 
   "theory another parser could be substituted but in practice it does not seem", 
   "to be the case.", 
   "Adding it as a runtime dependency would have the following effects.", 
   "* Many projects depend on xerces for the sole reason of running ant. If the", 
   "project does not actually include any xml dependencies they can instead just", 
   "depend on ant and its runtime", 
   "* Projects that depend on ant but use a different parser (is there any of", 
   "these?) would have tonot depend on ant and runtime but on ant individually", 
   "and the parser individually. In effect there is no change for these projects.", 
   "\""
  ], 
  "revision_id": "235219"
 }, 
 {
  "author": "vmassol", 
  "date": "2002-07-18T19:45:27.000000Z", 
  "msg": [
   "revert my patch as Cactus was *not* creating an HTTP session when getting the test results"
  ], 
  "revision_id": "235218"
 }, 
 {
  "author": "vmassol", 
  "date": "2002-07-18T16:07:28.000000Z", 
  "msg": [
   "no HTTP session is created to get the test results (Thanks to Charles Massey)"
  ], 
  "revision_id": "235217"
 }, 
 {
  "author": "vmassol", 
  "date": "2002-07-18T15:36:04.000000Z", 
  "msg": [
   "no HTTP session is created to get the test results (Thanks to Charles Massey)"
  ], 
  "revision_id": "235216"
 }, 
 {
  "author": "vmassol", 
  "date": "2002-07-16T22:18:01.000000Z", 
  "msg": [
   "apparently that was a bug which was not caught by Ant 1.5beta but which is now caught by the released 1.5 version ..."
  ], 
  "revision_id": "235215"
 }
]