[
 {
  "author": "cmlenz", 
  "date": "2003-03-14T17:12:25.000000Z", 
  "msg": [
   "First cut of a <webxmlmerge> task, with very much the same goals as", 
   "Vincent's <webmerge> task. The good thing about this variant is that", 
   "it requires much more code to offer less features ;-)", 
   "But seriously: this task merges servlet and filter definitions from two", 
   "web deployment descriptors into a single descriptor. It takes the servlet", 
   "version into account, and will not add the same servlet/filter twice. It", 
   "can also merge the init-params of a servlet or filter that already exists", 
   "in the original descriptor, although uniqueness of parameters is", 
   "currently not checked.", 
   "The major increase in lines of code is because the task is more intelligent", 
   "about the descriptor, i.e. it knows the concepts of filters and servlets.", 
   "However, I really need to cut the code amount because there's currently", 
   "much duplication between the handling of filters and servlets.", 
   "This task uses the Ant <xmlcatalog> type to provide offline capabilities,", 
   "which I believe to be cleaner than the NoopResolver. It does not yet", 
   "merge stuff like <login-config> and <security-constraint>. I could go on,", 
   "but..."
  ], 
  "revision_id": "237409"
 }, 
 {
  "author": "jruaux", 
  "date": "2003-03-14T16:06:07.000000Z", 
  "msg": [
   "Corrected project name in release dependency"
  ], 
  "revision_id": "237408"
 }, 
 {
  "author": "jruaux", 
  "date": "2003-03-14T16:01:46.000000Z", 
  "msg": [
   "Added cactus-anttasks dependency for project webapp"
  ], 
  "revision_id": "237407"
 }, 
 {
  "author": "vmassol", 
  "date": "2003-03-14T15:29:27.000000Z", 
  "msg": [
   "Update after Chris' changes related to the updated jars"
  ], 
  "revision_id": "237406"
 }, 
 {
  "author": "cmlenz", 
  "date": "2003-03-14T15:14:16.000000Z", 
  "msg": [
   "Some updates to current stable versions of our dependancies.", 
   "Note that someone will need to upload Checkstyle 3.0 to the", 
   "Maven repo (Vincent?)"
  ], 
  "revision_id": "237405"
 }
]