[
 {
  "author": "gawor", 
  "date": "2004-04-12T23:40:32.000000Z", 
  "msg": [
   "don't generate the ws-addressing stubs"
  ], 
  "revision_id": "240499"
 }, 
 {
  "author": "gawor", 
  "date": "2004-04-09T18:32:25.000000Z", 
  "msg": [
   "changed so its functionality  be avaiable to subclasses"
  ], 
  "revision_id": "240498"
 }, 
 {
  "author": "dims", 
  "date": "2004-04-07T20:38:05.000000Z", 
  "msg": [
   "Mmmm...Forgot 2 files. Thanks Jarek."
  ], 
  "revision_id": "240497"
 }, 
 {
  "author": "dims", 
  "date": "2004-04-07T19:35:05.000000Z", 
  "msg": [
   "Patch from Jarek Gawor", 
   "Notes:", 
   "1) The patch includes WS-Addressing schema file. I hope that's ok.", 
   "2) The patch requires very latest Axis code from cvs (trunk). The snapshot", 
   "version of axis that maven downloads (at this point) will not work.", 
   "3) Some of the classes now contain some Axis specific bits so that they are", 
   "correctly serialized/deserialized to/from xml.", 
   "4) This patch changes the ReferencePropertiesType API quite a bit. The main", 
   "reason was to get Axis to properly and automatically serialize and", 
   "deserialize the properties. And the easiest way to get this with Axis is", 
   "have AnyContentType bean (a bean with array of arbitrary SOAPElement(s)).", 
   "Now, internally things in ReferencePropertiesType are stored as SOAPElements", 
   "and not as DOM Elements, however you can still add an DOM Element to the", 
   "ReferencePropertiesType and it will be converted (wrapped) into a", 
   "SOAPElement.", 
   "Another possible way to deal with 4) without changing things a lot is to", 
   "write a custom serializer and deserializer. Maybe something we can explore", 
   "in the future but for now I think this is ok."
  ], 
  "revision_id": "240496"
 }, 
 {
  "author": "dims", 
  "date": "2004-04-06T03:35:36.000000Z", 
  "msg": [
   "Patch from Shiva and Reddy", 
   "Notes:", 
   "- dont do anything and non wsa headers will be ignored", 
   "- specify a '*' value for the referencePropertyNames parameter in the handler and all non-wsa headers will be treated as ref props", 
   "- specify a comma separated list of QNames in the form {namespace}localpart for the property and only header elements with these QNames will be treated as ref props."
  ], 
  "revision_id": "240495"
 }
]