[
 {
  "author": "hship", 
  "date": "2001-05-26T13:59:15.000000Z", 
  "msg": [
   "Update Javadoc comments."
  ], 
  "revision_id": "242189"
 }, 
 {
  "author": "hship", 
  "date": "2001-05-25T21:47:51.000000Z", 
  "msg": [
   "Created the IAction interface so that the action service can ask components", 
   "whether they require a session or not.", 
   "Add a stateful parameter to Action and Direct.", 
   "Move the stale session check from the direct service to the Direct component.", 
   "Fix the action and direct services to handle cases where an InsertBlock has been", 
   "used to includes components from a page other than the render page.", 
   "[233087] direct service should not require a session (untested)", 
   "[4274322] Block from other page causes errors (untested)"
  ], 
  "revision_id": "242188"
 }, 
 {
  "author": "hship", 
  "date": "2001-05-24T20:08:23.000000Z", 
  "msg": [
   "Change the Inspector to show any properties associated with a component's", 
   "specification.  Also, change the Engine tab to show the Tapestry framework", 
   "version.  Have the specification parser reject specifications with", 
   "unknown public ids.", 
   "Add support for directly accessing public instance variables of classes", 
   "(that implement the IPublicBean marker interface).", 
   "Add a getName() method to IEngineService, and a getService() method to", 
   "IRequestCycle.", 
   "Remove the ChangeLog in framework; this ChangeLog will contain changes", 
   "to the framework going forward.", 
   "Add code to AbstractApplication to clear all cached pages, specifications and templates", 
   "at the end of the request cycle (if enabled by a JVM system property).", 
   "Upgrade to Log4J 1.1.1.", 
   "Revise the Script component and friends, allowing for conditionals, looping and", 
   "accessing of properties via property paths.", 
   "[417086] Tapestry inspector omits data", 
   "[411692] PropertyHelper for public instance vars", 
   "[406039] Determine service during request", 
   "[425107] Caching of component definition configurable as startup parameter", 
   "[426959] Decorator doesn't cache properly", 
   "[405517] Common interface for form elements"
  ], 
  "revision_id": "242187"
 }, 
 {
  "author": "hship", 
  "date": "2001-05-23T14:56:06.000000Z", 
  "msg": [
   "Update the developer's guide for the 1.1 DTD and make numerous other", 
   "tiny corrections."
  ], 
  "revision_id": "242186"
 }, 
 {
  "author": "hship", 
  "date": "2001-05-22T21:55:11.000000Z", 
  "msg": [
   "Begin updating the developers guide for latest changes (especially,", 
   "the Specification 1.1 DTD)."
  ], 
  "revision_id": "242185"
 }
]