[
 {
  "author": "gdaniels", 
  "date": "2001-05-06T15:59:50.000000Z", 
  "msg": [
   "Start writing tests for ID/HREFs.  This one checks to see if", 
   "we can get the correct string param value when the referenced", 
   "element is in several different places in the envelope."
  ], 
  "revision_id": "244809"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-05-06T15:57:20.000000Z", 
  "msg": [
   "Improvements to array serialization and ID/HREF handling.", 
   "We should now hopefully be able to pass all the interop echo tests", 
   "(including echoStructArray) even when getting results with arbitrary", 
   "usage of id/hrefs.", 
   "Some salient points about the changes:", 
   "* RPCParams now process their own startElement events,", 
   "and get pushed onto the element handler stack like anything", 
   "else.  This is a step towards cleaning up the handler", 
   "model, and allows us to much more simply process things", 
   "like the type attribute on the target of an href.", 
   "* Due to the above, I put in a replaceElementHandler()", 
   "method in SOAPSAXHandler.  This lets the RPCParam", 
   "put its deserializer at the top of the stack once it", 
   "starts getting content, without pushing an extra level.", 
   "* Create a new MessageContext in Message if we need", 
   "one and haven't had one assigned.  This was breaking", 
   "many of the tests that created Messages directly.", 
   "* Now that the basics are almost all there, it's time for", 
   "more tests and cleanup."
  ], 
  "revision_id": "244808"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-05-06T04:09:44.000000Z", 
  "msg": [
   "More progress on the deployment architecture... still not 100% yet.", 
   "Includes a more complete implementation for SOAP v2.x Deployment", 
   "Descriptors."
  ], 
  "revision_id": "244807"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-05-06T04:06:16.000000Z", 
  "msg": [
   "This is just a start.  I'll finish it later.  See the readme for details"
  ], 
  "revision_id": "244806"
 }, 
 {
  "author": "rubys", 
  "date": "2001-05-06T03:09:19.000000Z", 
  "msg": [
   "Echo interop client"
  ], 
  "revision_id": "244805"
 }
]