[
 {
  "author": "gdaniels", 
  "date": "2001-06-21T17:14:04.000000Z", 
  "msg": [
   "Clean out debugging printlns."
  ], 
  "revision_id": "244989"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-21T17:03:10.000000Z", 
  "msg": [
   "Rework the registries to be a) persisted as XML, and b) accessed through", 
   "the AxisEngine APIs instead of directly.", 
   "The Admin class is now a bunch of static utility methods which know how", 
   "to rip apart XML and turn it into calls to deploy things into AxisEngines.", 
   "As a result, the output of the Admin.list() routine is now in a much more", 
   "suitable form to store/run back through the admin process (and in fact", 
   "this is how we store stuff now).", 
   "Part of the above was adding accessors for getting/setting a Handler's", 
   "name (i.e. the name its registered under).", 
   "The Default* registries are gone, replaced by the AxisClient and", 
   "AxisServer having knowledge about their appropriate defaults, and", 
   "deploying them if there's a problem reading the registry files.", 
   "AxisEngine now init()s itself at construction time.", 
   "Notes:", 
   "* The Supplier pattern isn't really getting used right now.  Since we've", 
   "decided to make Handlers stateless in most/all cases, this doesn't", 
   "affect much at the moment, but it might warrant some more thought.", 
   "* TypeMappings still need working out.  Right now we're not serializing", 
   "service-specific type mappings at all, and still using Java", 
   "serialization for the engine mappings.  Also, we need a way of", 
   "expressing non-bean mappings.  All this is slated to come in the next", 
   "few days."
  ], 
  "revision_id": "244988"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-21T16:16:46.000000Z", 
  "msg": [
   "Fix pivot name bug."
  ], 
  "revision_id": "244987"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-21T15:06:28.000000Z", 
  "msg": [
   "Have RPCParam elements \"inherit\" the namespace from their parent.", 
   "At this point, Axis will successfully generate requests that MS.Net", 
   "beta 2 will process.", 
   "***ALL*** IMHO, namespace should be in the ServiceDescription, not", 
   "merely as a parameter on the call.invoke."
  ], 
  "revision_id": "244986"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-21T14:57:19.000000Z", 
  "msg": [
   "Insert code to default SOAPAction, and convert the StockQuote service to", 
   "start exploiting the ability to name input parameters and not care about", 
   "the name of the output parameters.", 
   "***ALL*** I realized I started this with my performance profiling changes,", 
   "but we need to start considering the samples as educational materials,", 
   "so we need to resist the temptation to put TESTING HACKS in such places."
  ], 
  "revision_id": "244985"
 }
]