[
 {
  "author": "gdaniels", 
  "date": "2001-06-14T16:10:38.000000Z", 
  "msg": [
   "Get JWS working for SimpleAxisServer - right now just assumes the", 
   "requested filename is relative from the startup directory of the server."
  ], 
  "revision_id": "244954"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-14T13:00:11.000000Z", 
  "msg": [
   "Remove unneeded static SOAPTypeMappingRegistry.", 
   "We may even be able to remove the setParent() call entirely, since", 
   "a service will always exist within an engine, and we can therefore", 
   "assume the engine will set the parent...."
  ], 
  "revision_id": "244953"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-14T12:39:02.000000Z", 
  "msg": [
   "More ripple effect from the elimination of the per-messageContext", 
   "typemapping registry... however, this change represents a big", 
   "improvement; instead of making guesses as to which typemap registry", 
   "is the engine's, now we can locate the engine and get the right one.", 
   "Also eliminates some hacky statics...  ;-)"
  ], 
  "revision_id": "244952"
 }, 
 {
  "author": "robj", 
  "date": "2001-06-14T07:04:17.000000Z", 
  "msg": [
   "Added first pass session support.", 
   "- HTTPDispatchHandler extended to send & receive cookie headers.", 
   "- ServiceClient's messageContext saves cookie values if any are placed there by HTTPDispatchHandler.", 
   "- SimpleAxisServer keeps simple session table, and sends / receives rudimentary cookies.", 
   "- JavaProvider looks in Session object to find service objects with session scope.", 
   "- Address book sample (addressbook2) ported from Apache SOAP", 
   "- Added functional test for address book sample", 
   "Still to do:", 
   "- example of application scope (blocked on some oddness deploying multiple services)", 
   "- verify that this all works with AxisServlet", 
   "- make client side clean up cookie state if session maintenance turned off in messageContext"
  ], 
  "revision_id": "244951"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-14T01:43:11.000000Z", 
  "msg": [
   "It seems that not everybody sets deserializationContext..."
  ], 
  "revision_id": "244950"
 }
]