[
 {
  "author": "gdaniels", 
  "date": "2001-09-16T19:58:46.000000Z", 
  "msg": [
   "Fix a bunch of bugs/issues that have been hanging around:", 
   "* MessageContext now gets reset() each time invoke() in the ServiceClient", 
   "is called.  This makes sure to clear out transient properties -", 
   "MessageContext is per message, not per session/connection.  In concert", 
   "with this, we now keep a hash of properties in the ServiceClient which", 
   "are copied into the freshly reset MessageContext on each request, which is", 
   "how we persist things.  Timeout and maintainSession have been moved up", 
   "into the ServiceClient as members, and are set accordingly.", 
   "* We needed a way to retrieve transport-specific things such as cookie", 
   "headers from a returned MessageContext.  The Transport class now has a", 
   "processReturnedMessageContext() method, defined as a no-op in the base", 
   "class.  If you override it, you can get access to the MessageContext", 
   "which comes back just like setupMessageContext() can get to the one", 
   "that's about to go out.  See HTTPTransport for an example of how to", 
   "use this - this is how we get back the session cookies and store them", 
   "so they get set next time through setupMessageContext().", 
   "* Add a little more debugging stuff to RPCProvider", 
   "* Remove erroneous setting of HTTP transport from within LocalSender", 
   "* Copy users.lst into build dir so that functional stock test works", 
   "* Add the beginnings of HTTP GET functionality (i.e. use a browser", 
   "to access http://localhost/axis/Calculator.jws?method=add&arg0=1&arg1=23", 
   "and get back the result).  This is not clean / finished yet."
  ], 
  "revision_id": "245329"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-09-14T21:13:42.000000Z", 
  "msg": [
   "Beginnings of alpha-2 doc edits - checking in so I can finish this from", 
   "home later."
  ], 
  "revision_id": "245328"
 }, 
 {
  "author": "tomj", 
  "date": "2001-09-14T20:08:09.000000Z", 
  "msg": [
   "Add WSDL attribute class to help track meta data.", 
   "Add code to handle use=\"literal\" soap body.", 
   "Do not emit code for non-Soap bindings.", 
   "Do not emit code for portTypes not mentioned in Soap bindings.", 
   "Output WSDL documentation nodes where appropirate.", 
   "Fix other various emitter issues."
  ], 
  "revision_id": "245327"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-09-14T19:13:32.000000Z", 
  "msg": [
   "Remove out-of-sync tests."
  ], 
  "revision_id": "245326"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-09-14T19:12:54.000000Z", 
  "msg": [
   "Make HTTP authentication info available by default."
  ], 
  "revision_id": "245325"
 }
]