[
 {
  "author": "dims", 
  "date": "2001-11-27T14:41:22.000000Z", 
  "msg": [
   "Added 2 wsdl's for UDDI 1.0  (BUTcommented out for now)."
  ], 
  "revision_id": "245844"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-11-27T12:04:30.000000Z", 
  "msg": [
   "Add AxisServerFactory to do default server creation pattern, incl. JNDI", 
   "lookup + binding.", 
   "Revamp AxisServlet to use AxisServerFactory (see comments in there", 
   "regarding the name passed).", 
   "Remove debugging println from AxisClientFactory."
  ], 
  "revision_id": "245843"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-11-27T04:18:52.000000Z", 
  "msg": [
   "Fix logic in isRPC to really default to true."
  ], 
  "revision_id": "245842"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-11-27T04:08:59.000000Z", 
  "msg": [
   "* Introduce AxisClientFactory, a helper class which shields Service", 
   "from the details of locating and initializing an appropriate AxisClient.", 
   "If JNDI is available, the AxisClientFactory will look for a name passed", 
   "to its getClient() method, hoping to find an AxisClient there.  If it doesn't", 
   "find one, it creates one (using either an explicit ConfigurationProvider or", 
   "going through a short default configuration algorithm) and binds it to the", 
   "given name so it can be found next time.", 
   "Right now Service uses a hardcoded (and rather silly) name.  We need", 
   "to figure out an appropriate way to generate names, and how to deal if", 
   "we don't pass a name at all (skip the JNDI steps?).  For EJB clients, it", 
   "might be feasible to use the EJB name here, but we need some more", 
   "input from the EJB experts on this pattern.", 
   "* Fix bug where no one was setting the ISRPC property on MessageContext,", 
   "even though it was getting checked.  Now we appropriately create plain", 
   "SOAPBodyElements for document-oriented services"
  ], 
  "revision_id": "245841"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-11-27T03:35:30.000000Z", 
  "msg": [
   "Don't try to prettify DOM elements."
  ], 
  "revision_id": "245840"
 }
]