[
 {
  "author": "butek", 
  "date": "2001-12-13T19:24:00.000000Z", 
  "msg": [
   "Added a test of legal XML types that don't work yet with WSDL2Java:", 
   "- xsd:any", 
   "- xsd:group", 
   "- simpleTypes other than enumerations", 
   "contributed by Thomas Sandholm (sandholm@mcs.anl.gov)."
  ], 
  "revision_id": "246094"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-13T19:07:40.000000Z", 
  "msg": [
   "According to the latest JAX-RPC spec, holder instance variables must be named", 
   "\"value\".  An older version of the spec, which our code still followed, dictated", 
   "\"_value'."
  ], 
  "revision_id": "246093"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-13T18:25:48.000000Z", 
  "msg": [
   "Removed the hated shouldEmit flag from the TypeEntry.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "246092"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-13T18:13:38.000000Z", 
  "msg": [
   "I did a little analysis on the WSDL that our tests fail with and added some comments.", 
   "Dims, you added most of these.  If you'd like them to be part of our tests, perhaps", 
   "you could let the owners know that they have to change."
  ], 
  "revision_id": "246091"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-13T17:33:19.000000Z", 
  "msg": [
   "Significant changes were made to the SymbolTable.", 
   "1) The Type class hierarchy has been replaced with", 
   "SymTabEntry", 
   "|", 
   "TypeEntry", 
   "/           \\", 
   "Type                Element", 
   "|                     |", 
   "(BaseJavaType,                (DefinedElement,", 
   "CollectionType                UndefinedElement)", 
   "DefinedType,", 
   "UndefinedType)", 
   "This was done to more accurately reflect that a QName can be", 
   "either an Element or a Type.  See TypeEntry.java for more details.", 
   "2) The SymbolTable processing has been changed to more thoroughly support", 
   "forward references of types and elements.  This involves deferring some", 
   "of the initialization of a TypeEntry (like the java name) until the", 
   "undefined type/elements are defined.  See TypeEntry.java and Undefined.java.", 
   "3) TypeEntry objects now have a refType field which locates a dependent type.", 
   "(For example a TypeEntry for an array will have a refType that locates the", 
   "TypeEntry for the array element.)  This extra information is reflected in the", 
   "symbol table dump, and is necessary for proper forward reference resolution.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "246090"
 }
]