[
 {
  "author": "butek", 
  "date": "2001-12-14T20:01:16.000000Z", 
  "msg": [
   "Moving a step closer to a usable framework.  Java names only belong in the writers,", 
   "but the idea of a java name is in SymbolTable and many of the SymTabEntry's.  This", 
   "step moves the creation of the java name (SymTabEntry.name) to the writers and", 
   "removes the java name from Type constructors.  There's still", 
   "SymbolTable.getJavaName and the Namespaces class, which should also move,", 
   "but one thing at a time."
  ], 
  "revision_id": "246099"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-14T18:48:31.000000Z", 
  "msg": [
   "Added the support in ArraySerializer for arrays of arrays.", 
   "This required the following changes:", 
   "a) When serializing an array, need to set the arrayType to the full array name", 
   "(i.e. int[][] not Array[]).", 
   "b) During deserialization, need to recognize an array of arrays and", 
   "use an ArrayList (disabled the \"not supported\" message).", 
   "c) JavaUtils.convert does the proper assignment conversion between", 
   "List objects and arrays.  This was improved to properly consider", 
   "component types which may be arrays/lists.  In such cases the convert", 
   "method is invoked recursively to deal with the component arrays.", 
   "Updated the arrays test and the comprehensive test to verify.", 
   "Also verified by viewing the wire format using tcpmon.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "246098"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-14T17:31:19.000000Z", 
  "msg": [
   "Some mindless cleanup (it's Friday; I'm feeling mindless):", 
   "- SymbolTable.map isn't needed", 
   "- TypeEntry.getJavaName does the same as getName; no need to have both."
  ], 
  "revision_id": "246097"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-14T17:20:16.000000Z", 
  "msg": [
   "Fix (hopefully) an intermittent build failure."
  ], 
  "revision_id": "246096"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-13T20:54:01.000000Z", 
  "msg": [
   "Added more complicated forward reference testing to Comprehensive Tests.", 
   "This resulted in a couple of fixes to WSDL2Java.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "246095"
 }
]