[
 {
  "author": "butek", 
  "date": "2001-12-19T14:57:41.000000Z", 
  "msg": [
   "This fixes a couple import problems reported by Thomas Sandholm", 
   "(sandholm@mcs.anl.gov)", 
   "- relative import file names were relative to the command line directory, not relative", 
   "to the file from which they were imported.", 
   "- faults appearing in imported files weren't generated.", 
   "Along with this fix I did 2 things:", 
   "- changed the import test to test these new conditions", 
   "- added a main to Emitter.java so that I can create the symbol table without generating", 
   "code.  This is a useful debugging tool, but I don't think we want this to be a documented", 
   "feature of AXIS."
  ], 
  "revision_id": "246114"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-19T14:30:59.000000Z", 
  "msg": [
   "Some fixes to the user's guide.  Found by Jeff Barret (barrettj@us.ibm.com)."
  ], 
  "revision_id": "246113"
 }, 
 {
  "author": "tomj", 
  "date": "2001-12-18T21:59:38.000000Z", 
  "msg": [
   "Revise properties so we just set the Call properties directly.", 
   "Removing the special case code for http user/password (it get handled in Call)."
  ], 
  "revision_id": "246112"
 }, 
 {
  "author": "tomj", 
  "date": "2001-12-18T21:34:15.000000Z", 
  "msg": [
   "Update the JAX-RPC Call API to support some of the properties specified in the spec.", 
   "Specifically, http.auth.user and http.auth.password are now set correctly in the Call object in the stub.", 
   "This allows users of the stubs to set username and password.", 
   "The Call api will set the correct messageContext properties.", 
   "In addition, we support the soap.http.soapaction.uri and soap.http.soapaction.use properties.", 
   "This is kind of tricky since the default in JAX-RPC is to NOT use the soapaction property unless", 
   "the \"use\" flag is set to true.  I modified the stubs to set the use flag and soapaction if it is non-null.", 
   "TBD is support for:  security.auth.subject, soap.operation.style and encodingstyle.namespace.uri", 
   "Probably the right thing is to have MessageContext support these properties directly."
  ], 
  "revision_id": "246111"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-18T21:29:04.000000Z", 
  "msg": [
   "new testcase files"
  ], 
  "revision_id": "246110"
 }
]