[
 {
  "author": "scheu", 
  "date": "2002-01-12T16:31:37.000000Z", 
  "msg": [
   "The following changes are made to support \"lightweight\" skeletons and \"no skeletons\":", 
   "1) The runtime automatically does the conversion between Holders <-> Held values.", 
   "2) The java RPCProvider runtime automatically constructs Holders for methods that specify", 
   "Holder parameter types prior to invoking the web service method", 
   "3) The java RPCProvider runtime automatically constructs response messages by querying", 
   "the Holder arguments after invoking the web service method.", 
   "4) The skeleton generated by WSDL2Java is much less complex:", 
   "i) It implements the port type interface.  Thus the port type interface, stub, skeleton, and", 
   "implementation all have the same operation signatures.", 
   "ii) The skeleton operations simply invoke the implementation and return.", 
   "iii) The skeletons also implement the new org.apache.axis.wsdl.Skeleton interface, which", 
   "provides the skeleton with the parameter part name mappings.  The RPCProvider invokes", 
   "the skeleton to get these names.", 
   "5) The new WSDL2Java option -S <true-or-false> indicates whether to deploy the skeleton or impl."
  ], 
  "revision_id": "246174"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-01-11T21:42:11.000000Z", 
  "msg": [
   "Remove Call.NAMESPACE property, and replace it with the more compact", 
   "and standard (?) pattern of simply setting the correct namespace in", 
   "the operationName QName.", 
   "Correct the Stub generator to write out appropriate stuff.", 
   "Correct the Stub generator to use the target namespace of the WSDL as its", 
   "default.", 
   "Also add a real test for QName(String, Element)"
  ], 
  "revision_id": "246173"
 }, 
 {
  "author": "butek", 
  "date": "2002-01-11T21:28:23.000000Z", 
  "msg": [
   "This is the final step in making stubs thread safe.", 
   "1.  Move setMaintainSession from Call object to Service object. (did yesterday)", 
   "2.  Each stub method must instantiate a new Call object (done here).", 
   "One question left.  Should the transport info stay in the Call object?  Or should it", 
   "move to the Server object?  (It's the transport that keeps the session.)  Since users", 
   "can call Call.setTargetEndpointAddress, the transport info should probably stay in", 
   "Call, but that's just my opinion."
  ], 
  "revision_id": "246172"
 }, 
 {
  "author": "tomj", 
  "date": "2002-01-11T21:01:48.000000Z", 
  "msg": [
   "Set the namespace URI to \"\" when contructing with only a localname.", 
   "When trying to resolve a qname string with an element,", 
   "get the default namespace from an Element instead of setting it to null."
  ], 
  "revision_id": "246171"
 }, 
 {
  "author": "dims", 
  "date": "2002-01-11T18:44:06.000000Z", 
  "msg": [
   "Initial checkin of a sample for Signed SOAP Messages. (uses xml-security)"
  ], 
  "revision_id": "246170"
 }
]