[
 {
  "author": "tomj", 
  "date": "2002-01-25T17:48:54.000000Z", 
  "msg": [
   "Handle literal message elements of the form", 
   "<element name=\"foo\" type=\"foo_type\"/>", 
   "Insure the referenced types aren't emitted if not used.", 
   "Pass literal flag to recursive calls to setTypeReferences()"
  ], 
  "revision_id": "246249"
 }, 
 {
  "author": "dims", 
  "date": "2002-01-25T16:30:08.000000Z", 
  "msg": [
   "First cut of javax.xml.soap package from JAXM Spec.", 
   "- This is a subset of the classes from JAXM that we need for JAX-RPC 0.6", 
   "- Had to check in 2 classes in javax.xml.messaging that were referenced from javax.xml.soap package.", 
   "- Had to check in 1 class in javax.xml.transform that was referenced from javax.xml.soap package.", 
   "- Needs \"attachments.present\" to compile. Does not compile if attachments.present is false.", 
   "- Javadocs were hand-copied from JAXM Spec's Javadocs (JAX Winter Pack)", 
   "- As soon as we get an official copy we can replace this code with the \"official\" copy."
  ], 
  "revision_id": "246248"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-01-25T15:26:32.000000Z", 
  "msg": [
   "A few edits"
  ], 
  "revision_id": "246247"
 }, 
 {
  "author": "glyn", 
  "date": "2002-01-25T14:55:48.000000Z", 
  "msg": [
   "Introduce an EngineConfiguration interface into the 'engine' subsystem", 
   "and a BasicEngineConfiguration class into the 'admin' subsystem which", 
   "acts as a facade for DeploymentRegistry and a replacement for", 
   "ConfigurationProvider."
  ], 
  "revision_id": "246246"
 }, 
 {
  "author": "tomj", 
  "date": "2002-01-24T23:13:00.000000Z", 
  "msg": [
   "Refactoring of parameter generation in the Symbol table.", 
   "- The parameters for each operation in a portType are generated after the", 
   "entire symbol table has been populated.", 
   "- The parameters now live in the BindingEntry instead of the PortTypeEntry.", 
   "- The interface class is now generated from the JavaBindingWriter and", 
   "the JavaPortTypeWriter has gone away, as there is nothing for it to write.", 
   "- We now warn instead of fail if their are multiple bindings referencing a", 
   "single portType.  We do not try to generate multiple interface classes.", 
   "Still TBD - 0.6 of JAX-RPC seems to indicate that the interface class should", 
   "be named using the binding name \"if the mapping to a service definition", 
   "interface uses elements of the wsdl:binding\" (section 4.3.3).  If we do this,", 
   "then we wont have collisions when two bindings use the same portType."
  ], 
  "revision_id": "246245"
 }
]