[
 {
  "author": "butek", 
  "date": "2002-01-17T17:20:37.000000Z", 
  "msg": [
   "Silly me!", 
   "(strange leftover from various testing iterations)"
  ], 
  "revision_id": "246209"
 }, 
 {
  "author": "butek", 
  "date": "2002-01-17T16:18:28.000000Z", 
  "msg": [
   "Generated code now handles anyType.  Note that anyType maps to java.lang.Object.", 
   "This is only a limited mapping - primitive xml types can be sent as anyType, but", 
   "primitive Java types can't be converted to java.lang.Object - so we may want to", 
   "revisit this in the future."
  ], 
  "revision_id": "246208"
 }, 
 {
  "author": "dug", 
  "date": "2002-01-17T16:14:10.000000Z", 
  "msg": [
   "Fix some NPEs when args is empty"
  ], 
  "revision_id": "246207"
 }, 
 {
  "author": "butek", 
  "date": "2002-01-16T20:53:31.000000Z", 
  "msg": [
   "Some more WSDL2Java to-do's."
  ], 
  "revision_id": "246206"
 }, 
 {
  "author": "tomj", 
  "date": "2002-01-16T19:14:03.000000Z", 
  "msg": [
   "A first step toward creating usingable Java stubs with .NET WSDL.", 
   "Process the use=literal attribute for operation parameters by examine the Scheme", 
   "type and using the types in the elements as operation parameters.", 
   "With these changes, WSDL2Java emits stubs that will work with default .NET services.", 
   "There is a large list of issues and things to do:", 
   "- Need a test case, preferably one against a .NET web service.", 
   "- The message type files are still emitted and they should not be.", 
   "- We do not even try to emit faults differently if they have literal use", 
   "- The operation parameter generation needs to be moved out of populatePortTypes", 
   "in the symbol table and moved to JavaWriter.", 
   "- If we discover a portType has multiple bindings, we abort.", 
   "Since interfaces are generated from portTypes, and the literal/encoded", 
   "switch is in the binding, we must have the binding todecide what the", 
   "interface will look like.", 
   "- We do not emit SOAPElement arguments per JAX-RPC yet."
  ], 
  "revision_id": "246205"
 }
]