[
 {
  "author": "", 
  "date": "2002-01-28T06:43:08.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'config-work-2'."
  ], 
  "revision_id": "246264"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-01-28T06:43:08.000000Z", 
  "msg": [
   "Next round of updates for config-work.  There are a lot of changes here", 
   "because I merged in Rich's encoding stuff at the same time I was working", 
   "on the engine configuration to avoid duplicating work.  Some cleanup", 
   "still needs doing.", 
   "The main substantive changes are as follows:", 
   "1) a WSDDDeployment is now an EngineConfiguration, and FileProvider", 
   "is a thin shim which now just delegates to the deployment.  The only", 
   "bits of code which care about the WSDD specific aspects are now", 
   "the admin service and people directly using the WSDD classes.", 
   "2) the DeploymentRegistry is mostly gone, replaced with direct", 
   "references to EngineConfigurations, which act as suppliers for", 
   "components.", 
   "3) introduced a \"SimpleProvider\" for programatically dropping Handlers/", 
   "Services/Transports into an engine, and use this several times in the", 
   "tests.", 
   "4) removed a bunch of unused code, and as we continue we may end up", 
   "pulling a bunch of the stuff at the org.apache.axis.deployment level", 
   "(DeploymentItem, etc) if we maintain the abstraction boundary between", 
   "the different kinds of EngineConfiguration.", 
   "5) remove the direct config/deployment APIs from the AxisEngine, in favor", 
   "of using the interface to your EngineConfiguration to do config and", 
   "deployment.  We need to decide what the relationship is here - should", 
   "we be able to modify the configuration of a running engine while it's", 
   "in use, or do we provide a way to simply change out the entire", 
   "EngineConfiguration wholesale?", 
   "We also need to decide if we like this approach.  As it stands, we can't", 
   "use WSDD to deploy into a non-WSDD EngineConfiguration.  The other", 
   "alternative seems to be to introduce \"generic\" descriptors for handlers/", 
   "chains/etc. and make the WSDD subsystem simply a serialization mechanism", 
   "for those.  That way you could squirt components into the AdminService", 
   "using WSDD, and still write out the configuration in some other format.", 
   "All the tests run with this codebase.  Ideally, I'd like us to merge", 
   "this stuff back onto the main branch as soon as we're feeling mostly", 
   "comfortable with the direction, especially in light of the ongoing work", 
   "on other parts of the package.  Glyn, let's try to talk about this on", 
   "Monday?"
  ], 
  "revision_id": "246263"
 }, 
 {
  "author": "dims", 
  "date": "2002-01-27T03:42:02.000000Z", 
  "msg": [
   "Move from DeserializationContext to DeserializationContextImpl for Security Sample."
  ], 
  "revision_id": "246262"
 }, 
 {
  "author": "scheu", 
  "date": "2002-01-27T02:43:35.000000Z", 
  "msg": [
   "Comment out wsdl4j verbose setting due to abend"
  ], 
  "revision_id": "246261"
 }, 
 {
  "author": "scheu", 
  "date": "2002-01-26T14:40:51.000000Z", 
  "msg": [
   "Made changes to output a one line message indicating", 
   "which emitter is running.  This does not add too much to the output", 
   "and makes it easier to discern messages.", 
   "Plus the http wsdl sites are often down or slow. This allows me to", 
   "see which sites are having problems."
  ], 
  "revision_id": "246260"
 }
]