[
 {
  "author": "gdaniels", 
  "date": "2002-02-08T03:18:48.000000Z", 
  "msg": [
   "Missed a couple of static refs."
  ], 
  "revision_id": "246369"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-02-08T03:09:26.000000Z", 
  "msg": [
   "Get rid of AxisClassLoader, which was trying to wear too many hats.", 
   "Split the code functionality into JWSClassLoader, a simple ClassLoader", 
   "extension which allows us to reload JWS classes easily, and ClassCache,", 
   "a repository for JavaClass objects.", 
   "MessageContext.getClassLoader() now always returns the thread's", 
   "contextClassLoader EXCEPT when that has been replaced by the", 
   "JWSProcessor with a JWSClassLoader.", 
   "So... 1) our code is simpler, and 2) changing a JWS file now actually", 
   "causes the class to reload on the next hit (this hadn't been working for", 
   "some time now).", 
   "NOTES:", 
   "I've left the AxisClassLoader class for now, although the only thing that", 
   "references it is the JUnit test which tests that class.  I plan to delete it", 
   "entirely if people are happy with these changes.", 
   "I'm a little dubious about the lookups in JavaMethod, which seem to be the", 
   "only real reason for having the ClassCache around in the first place.  Do", 
   "these really improve performance that much?"
  ], 
  "revision_id": "246368"
 }, 
 {
  "author": "", 
  "date": "2002-02-07T23:47:40.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'pre-classloader-mods'."
  ], 
  "revision_id": "246367"
 }, 
 {
  "author": "scheu", 
  "date": "2002-02-07T23:47:40.000000Z", 
  "msg": [
   "Following changes were made per Request from Greg Truty:", 
   "1) Added WSDDTypeMapping.setSerializer(String) and WSDDTypeMapping.setDeserializer(String)", 
   "so that the WSDDTypeMapping can be built without loading the", 
   "serializer/deserializer factory classes.", 
   "2) Changed the WSDDService so that it remembers all deployed typeMappings.", 
   "This is necessary to get all the typeMappings correctly written", 
   "to the context."
  ], 
  "revision_id": "246366"
 }, 
 {
  "author": "scheu", 
  "date": "2002-02-07T23:23:12.000000Z", 
  "msg": [
   "The following changes are made to improve interoperability.", 
   "- The ArrayDeserializer has been upgraded to use the", 
   "specific type= information if passed.  For example", 
   "if a specific type is set (not soapenc:Array) and", 
   "the arrayType attribute is missing, the deserializer", 
   "has enough information to continue.  See the comment", 
   "in the code.", 
   "- The ArrayDeserializer also sets a destinatation class", 
   "\"hint\" in the ArrayListExtension object.  This \"hint\"", 
   "can be used by the JavaUtils:convert() routine to", 
   "instantiate a more specific array.", 
   "- Added 12 more tests to test.encoding.TestDeser to", 
   "make sure Axis correctly deserializes xml array", 
   "messages that have missing attributes, etc.", 
   "Also included a test which deserializes an Object array", 
   "which has mixed elements (String and Integer).", 
   "- The getTypeFromAttributes routine in DeserializationContextImpl", 
   "has been extended to attempt to use the name qname as the", 
   "type if the type attribute is missing", 
   "(it already did this for soapenc primitives).", 
   "The .Net services sometimes don't set the type= attribute,", 
   "but the name of the", 
   "element is the name of the type.", 
   "- minor changes to the test client to more accurately reflect", 
   "the expected return types for arrays of xsd:int and xsd:float.", 
   "I ran the interop tests and we are still just as interoperable", 
   "(HP site was down). (I also ran the interop tests with Axis", 
   "passing the specific array type.  In these", 
   "tests Axis was slightly better than the last time.)"
  ], 
  "revision_id": "246365"
 }
]