[
 {
  "author": "dims", 
  "date": "2002-03-05T14:19:57.000000Z", 
  "msg": [
   "adding support for \"http://www.w3.org/2001/XMLSchema:date\". \"date\" is a perfectly valid XML Schema data type and .NET and other WS frameworks handle it. Also see", 
   "http://www.w3.org/2001/XMLSchema.xsd."
  ], 
  "revision_id": "246604"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-05T14:02:13.000000Z", 
  "msg": [
   "More motion towards a common concept of abstract ServiceDescription", 
   "(org.apache.axis.description.*).", 
   "* Start to remove some of the functionally redundant code which used things", 
   "like the service style or MessageContext.isRPC() or encoding style checks to", 
   "do the same thing.  Replace with common lookups of OperationDescs, where the", 
   "style there tells us how to deal.", 
   "* Move style constants from SOAPService to ServiceDesc", 
   "* Do a somewhat better job with default namespaces in RPCElement.outputImpl()", 
   "* Store style in the Call as an int (quicker + smaller)", 
   "* Introduce the \"wrapped\" style.  I'm imagining a service can be \"rpc\"", 
   "(encoded), \"document\" (not encoded, but using 'rpc-style' invocations", 
   "accepting Java types which correspond to the XML types involved - no outer", 
   "method 'wrapper' element), \"wrapped\" (similar to document but with an", 
   "automatic method 'wrapper' element around the args), and \"message\" (no", 
   "encoding, service methods take and return SOAPBodyElements).", 
   "* Removed a bunch of unused code/vars."
  ], 
  "revision_id": "246603"
 }, 
 {
  "author": "rubys", 
  "date": "2002-03-05T10:00:51.000000Z", 
  "msg": [
   "> I run into 2 small bugs - the diff solves the problem for me,", 
   "> maybe for others :-)", 
   ">", 
   "> First, on some VMs the SocketRR will hung for a very long time.", 
   "> That's because even if close() is called on the socket, the", 
   "> read() will remain blocked. Adding a soTimeout and", 
   "> checking for done solves this.", 
   ">", 
   "> The other - with some servers, if available() returns", 
   "> 0 we read a single byte, and then send it. Then we'll", 
   "> send a second packet with the rest of the request.", 
   "> That will confuse at least apache  (who would see", 
   "> OST instead of POST - still trying to figure out why ).", 
   "> I see no reason to read a single byte - we'll block", 
   "> anyway.", 
   "Submitted by Costin Manolache"
  ], 
  "revision_id": "246602"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-05T01:05:24.000000Z", 
  "msg": [
   "Move data objects to the correct package."
  ], 
  "revision_id": "246601"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-05T01:05:04.000000Z", 
  "msg": [
   "Add xsd mapping."
  ], 
  "revision_id": "246600"
 }
]