[
 {
  "author": "butek", 
  "date": "2002-03-21T14:28:53.000000Z", 
  "msg": [
   "Added getPort(Class) to generated Services.  (one more step toward", 
   "JAX-RPC)  Note:  this is still unimplemented in org.apache.axis.client.Service,", 
   "but that work is probably part of the dynamic proxy work."
  ], 
  "revision_id": "246754"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-21T14:13:17.000000Z", 
  "msg": [
   "Remove deprecation warning."
  ], 
  "revision_id": "246753"
 }, 
 {
  "author": "dims", 
  "date": "2002-03-20T21:52:23.000000Z", 
  "msg": [
   "- Adding support in Stub to keep track of the last \"call\".", 
   "- Using TLS to avoid threading problems.", 
   "- Stub's getCall() can be used to get the last \"call\"", 
   "- Renaming getCall() in generated code to createCall() as a new call is created everytime."
  ], 
  "revision_id": "246752"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-20T21:43:52.000000Z", 
  "msg": [
   "Added support for the abstract attribute (optional requirement of JSR 101).", 
   "1) An abstract=true on a complexType causes the generation of an abstract class.", 
   "2) An abstract class causes an abstract=true on the complexType.", 
   "3) Changed the roundtrip test slightly to test this behavior."
  ], 
  "revision_id": "246751"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-20T20:53:57.000000Z", 
  "msg": [
   "Cool changes to more fully support derived type usage!", 
   "Changes made to support:", 
   "1) Marking derived types as referenced if base type is referenced.", 
   "2) Missing type attribute (and no other type info) should be accepted as an xsd:anyType.", 
   "3) Mark all types as referenced if anyType is referenced.", 
   "Details:", 
   "1) Added Utils.getDerivedTypes method that gets the derived types of", 
   "the indicated TypeEntry type. If the indicated type is an xsd:anyType, then", 
   "all the TypeEntries in the symbol table are returned.  I also", 
   "added some code to getDerivedTypes and getNestedTypes to check the size", 
   "of the current set versus the size of the symbol table.  Obviously if the", 
   "sizes are the same, no more processing needs to be performed.", 
   "2) Changed Utils.getNestedTypes to use a TypeEntry parameters instead of a Node parameters.", 
   "Also added a derivedFlag parameter.  If this flag is set, the nested and", 
   "derived types are returned.", 
   "3) Changed setTypeReferences to consider derived types.", 
   "4) Changed Utils.getNodeTypeRefQName to handle defaulting of type attribute", 
   "on an element/attribute.", 
   "5) Changed comprehensive test to test these new features."
  ], 
  "revision_id": "246750"
 }
]