[
 {
  "author": "butek", 
  "date": "2002-03-22T20:41:48.000000Z", 
  "msg": [
   "Updated the samples addr readme file.  Actually, this is a rather lazy update.", 
   "Since the list of files in the lib dir keep changing, it's easiest to simply say", 
   "\"all the jars in the lib directory\" without listing them all."
  ], 
  "revision_id": "246774"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-22T17:21:25.000000Z", 
  "msg": [
   "Added the following options to WSDL2Java", 
   "-F (-factory) <className>", 
   "This option will use the indicated class as the", 
   "JavaWriterFactory.", 
   "-H (-helperGen)", 
   "This option will cause separate Helper classes", 
   "for the bean meta data (the default is to", 
   "embed the data in the bean classes).", 
   "Changed the comprehensive test case to", 
   "use the -H option."
  ], 
  "revision_id": "246773"
 }, 
 {
  "author": "glyn", 
  "date": "2002-03-22T16:28:48.000000Z", 
  "msg": [
   "Make factories use their own constants.", 
   "Note: to be useful in Axis, the default factory class names should refer to", 
   "Axis classes rather than Sun classes."
  ], 
  "revision_id": "246772"
 }, 
 {
  "author": "glyn", 
  "date": "2002-03-22T16:20:15.000000Z", 
  "msg": [
   "Add file close and give local variables meaningful names.", 
   "Note: this class is not defined by JAXM and so has package scope."
  ], 
  "revision_id": "246771"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-22T16:08:32.000000Z", 
  "msg": [
   "Metadata improvements, moving towards a more integrated/streamlined model.", 
   "* Replace Call's internal vectors of param names/types with an OperationDesc", 
   "* Flesh out OperationDesc/ParameterDesc/ServiceDesc to provide more of", 
   "what we need", 
   "* We now try to match parameters by name FIRST, and only then fall back to", 
   "position if we can't get a match.", 
   "* Add a test of sending reversed parameters in TestSerializedRPC to make", 
   "sure this works.", 
   "* Introspection is now (almost) centralized in ServiceDesc.  Next step is", 
   "to get the RPCProvider fully using the OperationDescs instead of", 
   "introspecting itself.", 
   "* Implement <wsdlFile> element for WSDD services, which allows the deployer", 
   "to specify a static WSDL file which should be returned instead of", 
   "dynamically creating one.", 
   "* Clean up TestArrayListConversions - since all introspection now takes place", 
   "once the first time it's needed, this means all typemappings must be set", 
   "up before that point.  Move typemapping set up into the test constructor.", 
   "I'm inclined to make adding typemappings after a service has been called", 
   "a fault, but this is open for discussion.", 
   "* Update TODO list a bit - clean out finished items", 
   "* Add WSDDParameter to enable WSDD specification of parameters:", 
   "<service name=\"foo\" ...>", 
   "<operation name=\"testMe\">", 
   "<parameter qname=\"foo:Bar\" xmlns:foo=\"myNS\" type=\"xsd:string\"/>", 
   "...", 
   "</operation>", 
   "</service>", 
   "This will all be cleaner and better integrated in the next round, but I need", 
   "to get to work and this version gets us part way there and passes all the", 
   "tests.  Next steps are to get rid of Skeletons, and have the deploywriter", 
   "emit WSDD metadata for the operations on generated services."
  ], 
  "revision_id": "246770"
 }
]