[
 {
  "author": "glyn", 
  "date": "2002-03-18T10:28:08.000000Z", 
  "msg": [
   "Update jars in step 6 too."
  ], 
  "revision_id": "246714"
 }, 
 {
  "author": "glyn", 
  "date": "2002-03-18T10:20:36.000000Z", 
  "msg": [
   "Fix install doc. problems reported by Simon Fell."
  ], 
  "revision_id": "246713"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-18T04:03:36.000000Z", 
  "msg": [
   "* Flesh out the scoped properties pattern some.  Now we always set the", 
   "MC's property parent to the service if we set one.  The Call object", 
   "now takes care of making sure that the client-side service has the Call", 
   "as it's property parent.", 
   "* Introduce APIs on Call to make setting up client-side Handlers/services", 
   "easier.  This is really handy for hard-coding client usage of Handlers.", 
   "* Unit tests for scoped properties", 
   "* Introduce BasicServerConfig and BasicClientConfig, which are essentially", 
   "SimpleProviders which are pre-configured with hardcoded transports (local", 
   "for both, and HTTP as well for the client side)", 
   "* Clean up AxisClient handling of service handlers, use what is in the", 
   "MessageContext, since Call now sets it if necessary."
  ], 
  "revision_id": "246712"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-18T04:01:48.000000Z", 
  "msg": [
   "Fix test to match current code, and add new case for completeness."
  ], 
  "revision_id": "246711"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-17T16:25:08.000000Z", 
  "msg": [
   "Fix naming confusion (hopefully for the last time) with xml -> Java property", 
   "names and metadata.", 
   "1) Don't try to uppercase the first char of field names when dealing with", 
   "metadata descriptors, so now the names match what the Property", 
   "Descriptors tell us in the BeanSerializer/Deserializer.", 
   "2) Follow the bean Introspector pattern for naming properties in", 
   "xmlNameToJava() - if the first char is uppercase and the second", 
   "char is ALSO uppercase, leave it alone.  In other words:", 
   "MyID -> myID", 
   "ID -> ID", 
   "3) Deal with boolean types and null obj values in the generated equals()", 
   "methods correctly", 
   "We might want to merge these changes over to beta1 and refresh the bits,", 
   "since this fixes potentially major problems with literal XML.", 
   "Also exclude Interop3TestCase from the func tests since it's not really", 
   "a TestCase and it was breaking my build - this should either be called", 
   "something else or turned into a real test case - Russell, what was your", 
   "intent here?"
  ], 
  "revision_id": "246710"
 }
]