[
 {
  "author": "gdaniels", 
  "date": "2002-04-03T06:09:56.000000Z", 
  "msg": [
   "* Make TypeDescs handle inheritance.  Next step is to make this more", 
   "efficient (only look for the parent TypeDesc once).", 
   "* TypeDescs now require a Class in the constructor", 
   "* Introduce a ParentBean to the attributes test to test this functionality.", 
   "* Pass allowedMethods down into the ServiceDesc."
  ], 
  "revision_id": "246844"
 }, 
 {
  "author": "rubys", 
  "date": "2002-04-03T01:23:58.000000Z", 
  "msg": [
   "Restore interop with 1999 and 2000 schema based clients.  This includes", 
   "early versions of WebSphere with Apache SOAP.  I thought we had agreed", 
   "to not lose precision on xsd:Date, but if not, the DATE1 change will need", 
   "to be undone."
  ], 
  "revision_id": "246843"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-02T23:09:46.000000Z", 
  "msg": [
   "Added minOccursIs0 property to ElementDecl and changed SchemaUtils", 
   "to set this property to true if a contained element has maxOccurs=\"0\".", 
   "This information is useful for the subtle distinction between nillable=\"true\"", 
   "and maxOccurs=\"0\".  Currently the runtime assumes nillable=\"true\" and", 
   "sends null values as", 
   "<someItem xsi:nill=\"true\" />", 
   "But if maxOccurs=\"0\" is defined for the element, the element should not be", 
   "serialized at all.", 
   "Glen/Tom: You may want to change JavaBeanHelperWriter to store meta data", 
   "for this case, add this information to the meta data model and change", 
   "the BeanSerializer."
  ], 
  "revision_id": "246842"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-02T22:05:19.000000Z", 
  "msg": [
   "I just wanted to do a simple task!  But nothing's been simple for me lately!", 
   "All I wanted to do was get our QName in line with JAX-RPC.  This meant:", 
   "- remove the default ctor", 
   "- remove the Element ctor", 
   "- remove the setters", 
   "This alone rippled through a number of files.  But THEN I found that we", 
   "were serializing the primitive type QName as a bean, so I had to add", 
   "QName serialization code, too.  AND change/add tests.  And I'm not even", 
   "done, yet!  \"new QName(null, null)\" is supposed to throw IllegalArgumentException", 
   "but we just convert this to \"\", \"\". I'm going to have to make another pass", 
   "through the code to fix THAT one!  (whinewhine)"
  ], 
  "revision_id": "246841"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-02T21:52:32.000000Z", 
  "msg": [
   "Changed privacy of default constructor to public"
  ], 
  "revision_id": "246840"
 }
]