[
 {
  "author": "tomj", 
  "date": "2002-04-05T21:24:33.000000Z", 
  "msg": [
   "Change to deal with namespace qualification better and fix several bugs.", 
   "Add qualify test to WSDL test suite.", 
   "This tests the form=\"qualified/unqualified\" and", 
   "defaultFormElement=\"qualified/unqualified\" schema attributes.", 
   "Fix a bug in WSDDService that was always setting the", 
   "encoding style for type mappings to RPC encoded.", 
   "In the WSDD operation element:", 
   "- the <elementMapping> tag has been removed.  The code", 
   "to read it is still there, but commented out.", 
   "- A \"qname\" attribute for the operation was added to provide", 
   "the element name/qname to operation description mapping.", 
   "For Anonymous type QNames:", 
   "The \">\" is retained on all QNames since they are only used", 
   "internally.  Put a check in Serialization content to prevent", 
   "writing xsi:types that are anonymous types.", 
   "Lookup allowed methods by method name instead of XML name.", 
   "Add a routine genQNameAttributeString() in toJava.Utils to", 
   "generate an attribute value string that is a valid QName,", 
   "including any necessary prefix mapping.", 
   "In the SymbolTable, set the refType of elements with", 
   "anonymous types under them to point to the anonymous", 
   "types. Added a setRefType() setter to TypeElement for", 
   "this.  Modified JavaTypeWriter to handle the change when", 
   "javafying names.", 
   "In the ServiceDescription, added a getOperationsByQName() function", 
   "which is used to lookup potentially overloaded operations by QName.", 
   "Improved the structure of how RPCElements/RPCHandler deals with", 
   "operation descriptors.  RPCHandler now contains the operation", 
   "instead od RPCElement.  Still some work to be done here, but", 
   "we now lookup operaions by QName and deal with overrides much better.", 
   "Fix a serious bug in NSStack having to do with prefix mappings.", 
   "See comment in getPrefixForURI() for details.", 
   "JavaDeployWriter now emits the new qname attribute of <operation>.", 
   "This replaces elementMapping subtag.", 
   "Fix a bug in Allowed methods that was using the wrong operaion names", 
   "(XML instead of Javafied)."
  ], 
  "revision_id": "246864"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-05T18:08:14.000000Z", 
  "msg": [
   "Changed the checked in stub to reflect the recent changes", 
   "to the emitter to set addParameter.  See my recent note to", 
   "axis-dev about changing this test to be gen'd from wsdl."
  ], 
  "revision_id": "246863"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-05T17:51:30.000000Z", 
  "msg": [
   "I did three things wrt JAX-RPC", 
   "- implemented a ServiceFactory.createService method", 
   "- implemented the first of several JAX-RPC compliance samples (GetQuote1)", 
   "- fixed the original samples.stock.GetQuote1 so it would work (and I tidied", 
   "it up a bit)."
  ], 
  "revision_id": "246862"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-05T17:38:40.000000Z", 
  "msg": [
   "Changed the stub to specify both xmlType and javaType in the call to Call.addParameter."
  ], 
  "revision_id": "246861"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-05T16:16:53.000000Z", 
  "msg": [
   "Added a soapenc:int element to one of the complexTypes"
  ], 
  "revision_id": "246860"
 }
]