[
 {
  "author": "glyn", 
  "date": "2002-04-09T10:36:45.000000Z", 
  "msg": [
   "Add JAXM item."
  ], 
  "revision_id": "246874"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-08T23:18:45.000000Z", 
  "msg": [
   "Bugzilla 7577 said:  \"[wsdl2java] - Impl class do not compile when having", 
   "array inout parameters.\"", 
   "Bugzilla 7577 showed a hole in our test suite that I filled - the types test", 
   "had in/inout/out tests of various types, but the out tests were really return", 
   "tests, not out parameter tests, so I added the real out tests (and kept the", 
   "old out tests as XXXReturn tests).  Once I updated the test, I fixed a few", 
   "problems that had fallen through this hole."
  ], 
  "revision_id": "246873"
 }, 
 {
  "author": "igors", 
  "date": "2002-04-08T22:37:56.000000Z", 
  "msg": [
   "Separated out validateDescriptors method on WSDDService to enable", 
   "dynamic deployment. This became necessary with recent addition of ServiceDescr.", 
   "It is now safely possible to", 
   "WSDDServive servive = new WSDDService();", 
   "service.set...", 
   "service.validateDescriptors();", 
   "deployment.deployService(service);", 
   "Note: without this change I always had to restart server to validate service", 
   "descriptor with necessary information or, alternatively, duplicate", 
   "whole piece of code in my server app."
  ], 
  "revision_id": "246872"
 }, 
 {
  "author": "igors", 
  "date": "2002-04-08T22:15:00.000000Z", 
  "msg": [
   "Sometimes service name has to be exact.", 
   "Added parameter \"alias\" that can be set on the WSDDService", 
   "element at the deployment time to indicate what service name", 
   "should be used by JavaProvider when generating WSDL", 
   "contract.", 
   "If alias is not provided the current behavior is preserved."
  ], 
  "revision_id": "246871"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-08T17:33:53.000000Z", 
  "msg": [
   "Fixed Bugzilla bug #7744:  WSDL2Java does not work properly if xsd:import", 
   "is used.  And added a test for the fix."
  ], 
  "revision_id": "246870"
 }
]