[
 {
  "author": "scheu", 
  "date": "2002-05-22T15:30:48.000000Z", 
  "msg": [
   "Changed the operation input/output element names so that they are", 
   "unique per portType.  This is a requirement of WSDL (section 2.4.5).", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "247104"
 }, 
 {
  "author": "dug", 
  "date": "2002-05-22T12:37:53.000000Z", 
  "msg": [
   "Put back in Tom's change (plus some fixes) to change the Host: header", 
   "to have the correct hostname."
  ], 
  "revision_id": "247103"
 }, 
 {
  "author": "scheu", 
  "date": "2002-05-21T17:15:50.000000Z", 
  "msg": [
   "I moved the addrNoImplSEI testcase to the wsdl section of the testcase bucket.", 
   "This testcase tests whether it is possible to have an implementation class", 
   "that does not implement the web service interface (the SEI).", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "247102"
 }, 
 {
  "author": "butek", 
  "date": "2002-05-21T15:43:02.000000Z", 
  "msg": [
   "I've added a bit of JAX-RPC implementation.  JAX-RPC says getPort can", 
   "return either a generated stub or a dynamic proxy.  We just returned the", 
   "dyamic proxy.  But sometimes we have enough info to return a generated", 
   "stub, if it's available.  So now we try to return the generated stub where", 
   "we can and, if it fails, only then return the dynamic proxy.", 
   "This change needed a utility-like method that was in JavaServiceImplWriter:", 
   "getAddressFromPort.  This method doesn't quite fit into any utility class we", 
   "have, so I created a new one - WSDLUtils - for WSDL4J utility methods.  A", 
   "fair bit of what's in the Java writers COULD be put into this class, but for", 
   "now getAddressFromPort is the only thing in there.", 
   "I've also written a simple test to make sure the generated stub is returned", 
   "when it's available."
  ], 
  "revision_id": "247101"
 }, 
 {
  "author": "glyn", 
  "date": "2002-05-21T14:50:50.000000Z", 
  "msg": [
   "Merge in patch provided by Thomas Sandholm to allow a configuration", 
   "file to be placed in the classpath outside of the Axis engine package."
  ], 
  "revision_id": "247100"
 }
]