[
 {
  "author": "tomj", 
  "date": "2002-06-07T16:46:23.000000Z", 
  "msg": [
   "Turn off skeleton generation for the interop tests.", 
   "NOTE: The WSDL generated from skeletons includes the", 
   "getOperationDesc APIs, which should be filtered out."
  ], 
  "revision_id": "247214"
 }, 
 {
  "author": "dims", 
  "date": "2002-06-07T16:14:43.000000Z", 
  "msg": [
   "remove(1) throws NullPointerExceptions under heavy load."
  ], 
  "revision_id": "247213"
 }, 
 {
  "author": "dims", 
  "date": "2002-06-07T16:12:20.000000Z", 
  "msg": [
   "Strengthen the if conditions to avoid possible problems."
  ], 
  "revision_id": "247212"
 }, 
 {
  "author": "butek", 
  "date": "2002-06-07T13:14:34.000000Z", 
  "msg": [
   "The multithread test sometimes failed on JDK 1.4.  dims provided this fix.", 
   "We've added a synchronized block in generated stubs and, since it's only", 
   "called within this block, removed the synchronization in Stub.firstCall().", 
   "With this fix I'll close bugzilla 8631:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=8631"
  ], 
  "revision_id": "247211"
 }, 
 {
  "author": "butek", 
  "date": "2002-06-07T12:45:08.000000Z", 
  "msg": [
   "My next step in revamping WSDL2Java was rewriting JavaWriter (and", 
   "consequently all its subclasses).  Primarily, the changes are:", 
   "1. JavaWriter is broken into two abstract classes:  JavaWriter and", 
   "subclass JavaClassWriter.  JavaDeployWriter and JavaUndeployWriter", 
   "extend JavaWriter directly.  The rest, since they all generate Java classes,", 
   "extend JavaClassWriter.  In the old version, JavaDeployWriter and", 
   "JavaUndeployWriter did some hokey things to fit into the class model.", 
   "2. The constructors are simpler:  JavaWriter(Emitter e),", 
   "JavaClassWriter(Emitter e, String filename, String type).  Less has to be", 
   "known/calculated in the constructor.", 
   "3. Most write methods now take a PrintWriter parameter instead of", 
   "assuming the superclass has a PrintWriter.  This makes it easy to embed", 
   "one generated class inside another (JavaBeanHelperWriter).", 
   "4. There is now behaviour on JavaWriter and JavaClassWriter.  This", 
   "behavior makes it easier to do piecemeal extensions.", 
   "See the javadoc comments for JavaWriter and JavaClassWriter for details."
  ], 
  "revision_id": "247210"
 }
]