[
 {
  "author": "butek", 
  "date": "2002-07-22T20:14:25.000000Z", 
  "msg": [
   "Phase I of Matt Seibert's test rearchitecture."
  ], 
  "revision_id": "247544"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-07-22T20:10:05.000000Z", 
  "msg": [
   "Refactoring for cleanliness and efficiency.", 
   "Remove javaType arguments from serializationContext methods,", 
   "since we're either a) passing null, in which case the sendNull argument", 
   "tells us how to behave, or b) passing a value, in which case getClass()", 
   "works just fine (and notice how many instances of getClass() are now", 
   "unnecessary which were being used before).", 
   "Still more cleanup to do, but this removes a bunch of code and passes", 
   "all the tests."
  ], 
  "revision_id": "247543"
 }, 
 {
  "author": "rineholt", 
  "date": "2002-07-22T20:00:35.000000Z", 
  "msg": [
   "By specifying the Expect 100-continue HTTP header wait to process this", 
   "response.  Ultimately, we should also handle the case were we don't", 
   "explicitly set this-- but that's a bit harder to handle.  This was needed", 
   "not require getting the content size.  I beleive this *should* remedy the", 
   "case for servers that *may* send this anyway in http 1.1. :-("
  ], 
  "revision_id": "247542"
 }, 
 {
  "author": "scheu", 
  "date": "2002-07-22T19:15:59.000000Z", 
  "msg": [
   "JSR 101 4.3.11 says that the generated service interface interface", 
   "must have methods named get<Name_of_wsdl:port>.", 
   "The TCK tests this behavior.  So if the wsdl:port is named \"foo\",", 
   "a \"getfoo\" method is expected.", 
   "Problem:", 
   "Axis always converts the <Name_of_wsdl:port> into a java class name.", 
   "Thus Axis generates a \"getFoo\" method for example above.", 
   "Axis also has some interop testcases that have wsdl:port names", 
   "that are not valid java identifier names.  So simply", 
   "change the code to do get<Name_of_wsdl:port> will not work.", 
   "Solution:", 
   "The Axis code now determines if the wsdl:port name is a valid", 
   "java identifier.  If it is, the wsdl:port name is used (which satisfies the TCK).", 
   "If the wsd:port name is not a valid java identifier, the xmlNameToJavaClass()", 
   "code is used to create a proper name (which satisfies the interop tests).", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "247541"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-07-22T19:09:04.000000Z", 
  "msg": [
   "Update polymorphism test to include a test of sending back a \"C\", which", 
   "ISA \"A\" but has no explicit type mapping registered.   Make sure we get", 
   "it on the other side as an \"A\"."
  ], 
  "revision_id": "247540"
 }
]