[
 {
  "author": "seibert", 
  "date": "2002-07-30T15:41:15.000000Z", 
  "msg": [
   "Have moved the build.xml file to use the xmls/ fragments for properties,", 
   "classpath, and common targets \"setenv\" and \"printEnv\".", 
   "This drop also \"officially\" moves the AXIS project up to ant 1.5  New", 
   "versions of the ant binaries can be found at", 
   "http://jakarta.apache.org/builds/jakarta-ant/release/v1.5/", 
   "for all of you late comers......", 
   "A quick work on \"setenv\" versus \"printEnv\":", 
   "These are designed for two different purposes.  Many operations need the", 
   "variables set up, but you don't neccessarilly want the full output shown each", 
   "time.  So I split the PRINTING into the printEnv target, which, when called,", 
   "loads up the environment AS WELL AS prints out the data.", 
   "Once this is done (and you are satisfied with the output) you can just call", 
   "\"setenv\" in any given sub-process to load up the environment, without having to", 
   "parse through all of the output from the printing.", 
   "Other than these changes, the build.xml still functions as it always has (i.e. I", 
   "have NOT merged in my buildTest and buildSamples changes with this defect)"
  ], 
  "revision_id": "247609"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T15:35:09.000000Z", 
  "msg": [
   "Added the obligatory copyright and \"love me\" tags to the top of the files to", 
   "establish their purpose, origin, and author."
  ], 
  "revision_id": "247608"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T15:34:19.000000Z", 
  "msg": [
   "Updated to reflect the most current version of the properties and the setenv target", 
   "from the production build.xml file"
  ], 
  "revision_id": "247607"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T15:15:48.000000Z", 
  "msg": [
   "Added Ant 1.5 check.  I check both of the following:", 
   "1) The actual ant.version property", 
   "2) The Ability of Ant to execute a 1.5 conditional statement", 
   "Look in xmls/targets.xml in the \"setenv\" target at the very first two stanzas", 
   "(the condition and subsequent fail) for more information"
  ], 
  "revision_id": "247606"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-07-30T13:41:59.000000Z", 
  "msg": [
   "Few TODO updates.", 
   "Tom, didn't you already do qual/unqual for attributes?"
  ], 
  "revision_id": "247605"
 }
]