[
 {
  "author": "rineholt", 
  "date": "2002-08-03T21:52:06.000000Z", 
  "msg": [
   "An example of sending an attachment via messages.", 
   "The main purpose is to validate the different types of attachment references", 
   "by content Id, content location both absolute and relative.", 
   "Creates 5 separate attachments referenced  differently by a SOAP document.", 
   "Each attachment contains a string that is assembled and tested to see if", 
   "if the attachments are correctly sent and referenced.  Each attachment also", 
   "contains a mime header indicating its position and validated on the server", 
   "to see if mime headers are correctly sent with attachments.", 
   "Sends the same message again however the second attachments are placed in the", 
   "stream in reverse to see if they are still referenced ok.", 
   "The return SOAP document references a single attachment which is the a Java", 
   "serialized vector holding strings to the individual attachments sent.", 
   "Demos using attachments directly."
  ], 
  "revision_id": "247639"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-08-03T21:25:25.000000Z", 
  "msg": [
   "Revamp a few routines for consistency.  Our routines (startElement, the", 
   "MessageElement constructor, etc.) now ALL expect a prefix, not a", 
   "QName.", 
   "Fixes bug #11315:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=11315"
  ], 
  "revision_id": "247638"
 }, 
 {
  "author": "rsitze", 
  "date": "2002-08-02T22:12:48.000000Z", 
  "msg": [
   "Replace DiscoveryException in generated code with (original) ServiceException."
  ], 
  "revision_id": "247637"
 }, 
 {
  "author": "tomj", 
  "date": "2002-08-02T20:49:14.000000Z", 
  "msg": [
   "Fix up build.xml so we exclude things that need servlet.jar when its not around"
  ], 
  "revision_id": "247636"
 }, 
 {
  "author": "tomj", 
  "date": "2002-08-02T20:46:56.000000Z", 
  "msg": [
   "Implement the ServletEndpointContext interface from JAX-RPC.", 
   "Create an implementation class in org.apache.axis.transport.http", 
   "(Is there a better place for this?)", 
   "Create a S.E.C. in the AxisServlet and stash it in the message context", 
   "for later.", 
   "When we call the init() method of the ServiceLifeCycle, pass the S.E.C", 
   "in to the function instead of null."
  ], 
  "revision_id": "247635"
 }
]