[
 {
  "author": "tomj", 
  "date": "2002-08-16T15:31:29.000000Z", 
  "msg": [
   "Fix from Thomas Sandholm <sandholm@mcs.anl.gov>", 
   "The fix I put in a while back to FileProvider to work with web start was", 
   "factored out into ClassUtils. However, in that process a bug was introduced", 
   "that disables resource loading from the classpath. I have fixed that bug in", 
   "the attached diff."
  ], 
  "revision_id": "247769"
 }, 
 {
  "author": "butek", 
  "date": "2002-08-16T15:19:57.000000Z", 
  "msg": [
   "Some more attachments stuff, significantly, Images now work (yay).", 
   "But along with Images working, we now have a new dependency:  JIMI.", 
   "It's an optional dependency.  If you don't have it AXIS will still build, but if", 
   "you want to send Images as attachments, you'll need it.", 
   "I don't have an image test, yet, but the TCK tests it, so I'm in no hurry."
  ], 
  "revision_id": "247768"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-08-16T11:07:38.000000Z", 
  "msg": [
   "1) Use new getValueAsString() method to serialize simple values into", 
   "strings suitable for attribute usage.  This method comes out of the", 
   "SimpleValueSerializer interface, which serializers that can produce", 
   "attribute-happy values should implement.", 
   "2) Some general work on the serialization system.  Still needs a bit more", 
   "cleanup,"
  ], 
  "revision_id": "247767"
 }, 
 {
  "author": "scheu", 
  "date": "2002-08-15T23:39:54.000000Z", 
  "msg": [
   "Fix for Bugzilla defect:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=10290", 
   "The generated java classes do not fully qualify classes such as String, Class, Object.", 
   "This is now corrected, and additional xml types are added to the comprehensive test", 
   "to ensure compliance.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "247766"
 }, 
 {
  "author": "scheu", 
  "date": "2002-08-15T21:27:48.000000Z", 
  "msg": [
   "Fix for Bugzilla http://nagoya.apache.org/bugzilla/show_bug.cgi?id=9665", 
   "Problem:", 
   "Constructs with a combination of ref and maxOccurs are not supported.", 
   "For example:", 
   "<element ref=\"Z\" minOccurs=0 maxOccurs=\"unbounded\"/>", 
   "Solution:", 
   "Added a CollectionElement symbolTable entry that is", 
   "similar to the CollectionType symbolTable entry.", 
   "Changes were necessary in SymbolTable to recognize", 
   "this case and add a CollectionElement to the symbol table.", 
   "Other minor changes were made, and a test of this construct", 
   "was added to the comprehensive types test.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "247765"
 }
]