[
 {
  "author": "dims", 
  "date": "2002-08-15T12:50:11.000000Z", 
  "msg": [
   "Fix for Bug 11695 - java message provider return serialization error from mark.sullivan@nav-international.com (Mark Sullivan)"
  ], 
  "revision_id": "247759"
 }, 
 {
  "author": "dims", 
  "date": "2002-08-15T11:50:09.000000Z", 
  "msg": [
   "\"Minor patches to SOAPHeader processing\" from \"Thomas Sandholm\" <sandholm@mcs.anl.gov>", 
   "Details from Thomas:", 
   "If getHeaderByName was called on the client side when SOAPService was not", 
   "set, this code threw a null pointer exception."
  ], 
  "revision_id": "247758"
 }, 
 {
  "author": "dims", 
  "date": "2002-08-15T11:49:25.000000Z", 
  "msg": [
   "\"Minor patches to send XSI type\" from \"Thomas Sandholm\" <sandholm@mcs.anl.gov>", 
   "Details from Thomas:", 
   "I sent in a mail about this problem earlier. Basically we use a literal", 
   "binding and we want to force XSI type not to be sent. However, even if the", 
   "SEND_TYPE_ATTR property is turned off in the stubs the serializeActual", 
   "method overrides it. The patch I added seems to comply to the commit log", 
   "message:", 
   "\"Change SerializationContext to take a Boolean instead of a boolean", 
   "for the \"sendTypes\" argument.", 
   "This allows three values:", 
   "true - force sending xsi:type regardless of configuration", 
   "false - force no xsi:type regardless of configuration", 
   "null - respect configuration (sendXsiTypes option, etc)\""
  ], 
  "revision_id": "247757"
 }, 
 {
  "author": "stevel", 
  "date": "2002-08-15T06:59:55.000000Z", 
  "msg": [
   "1. refactor the getOption method into the base class", 
   "2. use that to set an isProduction flag to indicate the deployment system should be more secure.", 
   "3. admin page logs commands and their origins", 
   "4. admin page only displays/enables commands when not on a production box", 
   "5. tests written for development config; production is a TODO item. Plan woul d be to pass a setting down to the test suite, or have it work out from the initial web page."
  ], 
  "revision_id": "247756"
 }, 
 {
  "author": "stevel", 
  "date": "2002-08-15T06:56:32.000000Z", 
  "msg": [
   "status message and three logging messages for the admin page: no anonymous actions here."
  ], 
  "revision_id": "247755"
 }
]