[
 {
  "author": "rubys", 
  "date": "2002-08-24T18:18:18.000000Z", 
  "msg": [
   "SOAP 1.2 fixes:", 
   "1) style is not particularly SOAP version aware: compensate", 
   "2) encodingStyle is not legal on the envelope in 1.2, and not", 
   "required there in 1.1", 
   "3) reduce the number of places the default version appears"
  ], 
  "revision_id": "247854"
 }, 
 {
  "author": "rubys", 
  "date": "2002-08-24T15:20:14.000000Z", 
  "msg": [
   "Class name changes"
  ], 
  "revision_id": "247853"
 }, 
 {
  "author": "rubys", 
  "date": "2002-08-24T02:22:37.000000Z", 
  "msg": [
   "String compare instead of QName compare"
  ], 
  "revision_id": "247852"
 }, 
 {
  "author": "rubys", 
  "date": "2002-08-24T02:20:29.000000Z", 
  "msg": [
   "Avoid over/underflow by using bitwise XOR instead of addition"
  ], 
  "revision_id": "247851"
 }, 
 {
  "author": "scheu", 
  "date": "2002-08-24T01:25:19.000000Z", 
  "msg": [
   "Some changes made to help performance.", 
   "1) Speed up of the Pair class in TypeMappingImpl.  May need some more improvement later.", 
   "2) DeserializationContestImpl.getTypeFromAttributes is called for every element.", 
   "If the request does not have an xsi:type, a high performance penalty is incurred", 
   "constructing a QName and doing a series of if tests.  This is now improved, and", 
   "BeanDeserializer now calls getTypeFromXSITypeAttr for its children", 
   "3) BeanDeserializer onStartChild constructs a default DeserializerImpl if no", 
   "Deserializer is found for the child element.  This is a major performance penalty if", 
   "the request does not have xsi:types.  In such cases a DeserializerImpl is created", 
   "to simply find the right Deserializer down stream.  Added a short circuit to see", 
   "if the child element is a simple primitive type (most cases) and create the proper", 
   "deserializer directly.  A similar change is made in the array deserializer.", 
   "Ultimately I think that DeserializationImpl should have a static createDeserializer(...)", 
   "method instead of having hard-coded calls to new DeserializerImpl().  Thus extra", 
   "logic (like the short circuit in (3) could be applied in all situations).", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "247850"
 }
]