[
 {
  "author": "scheu", 
  "date": "2002-09-24T23:27:36.000000Z", 
  "msg": [
   "Fix for \"Must Fix\" Bugzilla Defect 12867.", 
   "Summary of problem:  Axis Service expected a series of elements in", 
   "the maxOccurs=\"unbounded\" form.  A .Net client sent an array containing", 
   "the elements instead.  This falls under the \"be flexible in what you accept\" rule.", 
   "Solution: The BeanPropertyDescriptor.set() method can recognize this situation", 
   "and set the indexed properties from the items in the deserialized array.", 
   "I also added Tests to TestDeser for both situations.", 
   "The test exposed a minor flaw in the BeanDeserializer associated with", 
   "getting the child deserializers.", 
   "All is well."
  ], 
  "revision_id": "248219"
 }, 
 {
  "author": "tomj", 
  "date": "2002-09-24T21:06:09.000000Z", 
  "msg": [
   "Fix bug 12969 - UnsignedLong doesn't format correctly", 
   "Remove code that was chopping off thenumber after the decimal for string", 
   "formatting as this is bad when the number is 1.234567E7.", 
   "Add a test case for the problem, and enhance test which exposed", 
   "more limits of precision."
  ], 
  "revision_id": "248218"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-09-24T21:02:23.000000Z", 
  "msg": [
   "Also support Document method(Document)", 
   "(this is needed for the attachments sample right now, will probably go away becuase it's not really an adequate API)"
  ], 
  "revision_id": "248217"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-09-24T20:45:20.000000Z", 
  "msg": [
   "* Fix bug http://nagoya.apache.org/bugzilla/show_bug.cgi?id=12923", 
   "* We now dispatch to methods for MsgProvider services based on", 
   "the QName of the first body element.  If you've specified an", 
   "OperationDesc for your method, the QName in there will be used", 
   "for dispatch, otherwise we'll use the namespace of the service", 
   "and look up the localPart of the XML QName as the method name.", 
   "If you don't specify a <namespace> for your service (in the", 
   "WSDD), we'll match just on local name.  (NOTE: I disagree with", 
   "this, because I think it's not precise enough for the XML world.", 
   "We'll need to produce schemas for this stuff eventually, and", 
   "mapping random namespaces seems dangerously lax to me.", 
   "However, it was the way it used to work, and there was agitation", 
   "to keep it this way, so I did.)", 
   "* Rationalize MsgProvider's accepted signatures.  We now accept:", 
   "SOAPBodyElement [] method(SOAPBodyElement [])", 
   "Element [] method(Element [])", 
   "void method(SOAPEnvelope reqest, SOAPEnvelope response)", 
   "A nice side effect of this is that we only introspect once (in", 
   "ServiceDesc), not on every call in MsgProvider as we used to.", 
   "* Add tests to confirm that we can dispatch to multiple methods,", 
   "and that each of the valid signatures works as expected."
  ], 
  "revision_id": "248216"
 }, 
 {
  "author": "butek", 
  "date": "2002-09-24T20:29:18.000000Z", 
  "msg": [
   "Fixed http://nagoya.apache.org/bugzilla/show_bug.cgi?id=10365.", 
   "If a binding operation doesn't match a portType operation, we now fail.", 
   "We used to generate sort-of-duplicate operations."
  ], 
  "revision_id": "248215"
 }
]