[
 {
  "author": "dims", 
  "date": "2003-01-03T13:56:09.000000Z", 
  "msg": [
   "Fixes for Bug 15724 - WSDL2Java takes hours on large files", 
   "from Eric.D.Friedman@wellsfargo.com (Eric Friedman)", 
   "Notes:", 
   "- attribute-qualify.wsdl had a small bug it was not using xsd:attribute for phone complextype"
  ], 
  "revision_id": "248769"
 }, 
 {
  "author": "stevel", 
  "date": "2003-01-03T08:22:56.000000Z", 
  "msg": [
   "docs on logging in axis"
  ], 
  "revision_id": "248768"
 }, 
 {
  "author": "stevel", 
  "date": "2003-01-03T08:19:38.000000Z", 
  "msg": [
   "Big changes to servlet fault handing", 
   "0. exceptions are logged to their own log, for easier config", 
   "1. AxisFaults are logged at debug level only", 
   "2. AxisFaults get their stack trace stripped out on response messages by default", 
   "3. Exceptions get logged to the new log, at info level", 
   "4. All the above are in methods subclasses can override", 
   "5. Where exceptions are caught in GET has been moved up, so that all exceptions get caught...previously ConfigurationExceptions were being missed in places", 
   "6. reportAvailableServices catches ConfigurationExceptions and if they were AxisFaults underfoot, rethrow them as such, and (5) will catch and display these.", 
   "End result: stack traces don't go over the wire by default no more, and we have better reporting of trouble in things like listing available services, subclasses and log4j can control output better, etc etc."
  ], 
  "revision_id": "248767"
 }, 
 {
  "author": "stevel", 
  "date": "2003-01-03T07:38:12.000000Z", 
  "msg": [
   "Retain the underlying exception *and* keep the stack trace slightly separate from the base message, with an overridden toString() method to bring the stack out with the message.", 
   "Reason: lets AxisFaults be pulled out at a higher level, and allows the caller to bypass the stack info, even if it is carried around server-side."
  ], 
  "revision_id": "248766"
 }, 
 {
  "author": "stevel", 
  "date": "2003-01-03T07:35:24.000000Z", 
  "msg": [
   "work out where the XML parser is and state that too"
  ], 
  "revision_id": "248765"
 }
]