[
 {
  "author": "dug", 
  "date": "2001-02-17T18:02:17.000000Z", 
  "msg": [
   "Promote TargetService to the same level as the incoming and outgoing", 
   "messages in the MessageContext object."
  ], 
  "revision_id": "251689"
 }, 
 {
  "author": "dug", 
  "date": "2001-02-17T16:44:02.000000Z", 
  "msg": [
   "Added a doLocal opt to all samples (-t)", 
   "Removed the test client stuff from .../axis/client and created", 
   "a samples/misc/TestClient instead", 
   "Made HTTPCall use HTTPMessage", 
   "Fixed a bug in the RPCBody stuff"
  ], 
  "revision_id": "251688"
 }, 
 {
  "author": "dug", 
  "date": "2001-02-16T22:50:44.000000Z", 
  "msg": [
   "Added a generic options processing class (Options).", 
   "Need to think about whether the algorithm used is", 
   "the right one, but boy does it make the code in", 
   "the samples a lot cleaner and now they'll all support", 
   "the same options."
  ], 
  "revision_id": "251687"
 }, 
 {
  "author": "dug", 
  "date": "2001-02-15T13:30:01.000000Z", 
  "msg": [
   "Fixing compile bug and added a few more Debug lines"
  ], 
  "revision_id": "251686"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-02-14T21:35:28.000000Z", 
  "msg": [
   "Fix up a few things, and implement SupplierRegistries.", 
   "1) Make SupplierRegistry.  This guy actually holds Suppliers,", 
   "not Handlers, and when he's asked for a Handler he looks", 
   "up the Supplier and calls its getHandler().", 
   "2) Merge SimpleHandlerRegistry and SimpleServiceRegistry into", 
   "SimpleRegistry, which takes a constructor argument pointing", 
   "to the .reg file to use.", 
   "3) Use SupplierRegistries as demonstrations in the Admin", 
   "utility and the SimpleAxisEngine class.  Admin parses a", 
   "\"lifecycle\" attribute on Handler deployments, and creates", 
   "either a SimpleSupplier or a FactorySupplier as", 
   "appropriate.", 
   "4) Fix TransportRoutingClient to use TARGET_SERVICE instead", 
   "of TRANS_ID.", 
   "5) Fix Router to use generic HandlerRegistry, so it doesn't", 
   "care if it's a SimpleRegistry or a SupplierRegistry.", 
   "6) Add a little debugging info to Suppliers."
  ], 
  "revision_id": "251685"
 }
]