[
 {
  "author": "gdaniels", 
  "date": "2001-05-05T13:47:13.000000Z", 
  "msg": [
   "Rough in support for Arrays.", 
   "We don't yet automatically detect arrays, or serialize them, but", 
   "deserialization (including arrays of structs, with ID/HREFs) works", 
   "fine if you manually map the ArraySerializer to your type.", 
   "This required a change to the TypeMappingRegistry (sorry, Sam -", 
   "I should think this will merge easily, though) to allow looking", 
   "up a Class using a QName as a key - so now both addSerializer() and", 
   "addDeserializer() need both QName and Class.  We should add a", 
   "convenience function registerTypes(QName, Class, Serializer,", 
   "Deserializer) at some point.", 
   "Also added a new way for deserializers to get their values back", 
   "to interested parties, namely a callback to a ValueReceiver.", 
   "Array deserialization uses this technique to plug values into", 
   "the array.", 
   "Still need to handle typing better, deal with the position", 
   "attribute, deal with variably-sized arrays, deal with multi-", 
   "dimensional arrays, serialize, and auto-detect arrays."
  ], 
  "revision_id": "251869"
 }, 
 {
  "author": "dug", 
  "date": "2001-05-05T11:44:32.000000Z", 
  "msg": [
   "With Debug turned on we didn't get back any xml because \"available\"", 
   "should not be used to get the full length of the data - it returns", 
   "just wants available at that moment - and at the moment it was returning", 
   "zero.  We need to loop until we hit EOF. This will only work on", 
   "input streams that close their connection when done (ie. not on the", 
   "incoming side of the server socket) but we're assuming he have content-", 
   "length for those cases.  This looks like it's only a bug when debug", 
   "is turned on because I believe when its not the input stream is passed", 
   "directly to the xml parser who doesn't have this problem."
  ], 
  "revision_id": "251868"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-05-05T09:24:40.000000Z", 
  "msg": [
   "Updated documentation and a DTD for WSDD"
  ], 
  "revision_id": "251867"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-05-05T09:18:43.000000Z", 
  "msg": [
   "Created an XML Schema and DTD for Apache SOAP 2.x Deployment Descriptors"
  ], 
  "revision_id": "251866"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-05-05T09:06:29.000000Z", 
  "msg": [
   "Slight modifications made to support the changes made to the deployment registry classes"
  ], 
  "revision_id": "251865"
 }
]