[
 {
  "author": "gdaniels", 
  "date": "2001-05-04T19:27:52.000000Z", 
  "msg": [
   "Clean up a bit, and support for ID/HREFs."
  ], 
  "revision_id": "251859"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-05-04T19:24:47.000000Z", 
  "msg": [
   "ID/HREF support.  Once again, needs some cleanup, but I've put it", 
   "through some fairly nasty tests and it works.", 
   "Basic pattern is when you start deserializing an element with an", 
   "HREF on it, check to see if we have that ID in our table already.", 
   "If we do, there should be either an ElementRecorder or a Deserializer", 
   "in the table.  In the former case, we play the recorded events to our", 
   "Deserializer, and in the latter, we just go grab the value.", 
   "If we DON'T already have the ID, we add this deserializer to a", 
   "fixup table in the DeserializationContext.  After that, whenever the", 
   "SOAPSAXHandler encounters an element with an ID, it checks", 
   "against the pending fixups before deciding to just record it.  If there", 
   "is a waiting deserializer, it uses that instead.", 
   "Deserializers have now changed to \"push\" their values once they", 
   "have them to a set of \"targets\", which are right now target Fields", 
   "of Objects, using the reflection API.  So we can do things like we", 
   "do in DataSer (samples/encoding) to fixup a complete structure", 
   "made up of parts which themselves need fixups.", 
   "This all assumes local refs right now, next step is to abstract out the", 
   "HREF dereferencing mechanism to be able to plug in arbitrary handlers", 
   "for different types of references (cid:, http:, etc...).", 
   "Tests are also a-coming."
  ], 
  "revision_id": "251858"
 }, 
 {
  "author": "dug", 
  "date": "2001-05-04T19:20:14.000000Z", 
  "msg": [
   "Handle extra spaces in HTTP response code"
  ], 
  "revision_id": "251857"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-05-04T19:00:30.000000Z", 
  "msg": [
   "Small change to the WSDD schema to incorporate some of Glen's suggestions"
  ], 
  "revision_id": "251856"
 }, 
 {
  "author": "rubys", 
  "date": "2001-05-04T11:59:19.000000Z", 
  "msg": [
   "TypeMappingRegistry performance improvements"
  ], 
  "revision_id": "251855"
 }
]