[
 {
  "author": "gdaniels", 
  "date": "2001-05-23T17:26:37.000000Z", 
  "msg": [
   "Use the system line separator char instead of \"\\n\".", 
   "I'm not sure if this is correct.  Either we should be testing like this, OR", 
   "we should be somehow telling the JAXP Transformer to output \"\\n\" as", 
   "its line separator instead of the system one.  Opinions are welcome, but", 
   "for now this should pass on any system."
  ], 
  "revision_id": "251939"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-05-23T17:24:44.000000Z", 
  "msg": [
   "Omit the XML declaration when outputting Elements."
  ], 
  "revision_id": "251938"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-05-23T16:15:34.000000Z", 
  "msg": [
   "JAXP!", 
   "Remove all Xerces dependencies, and start using JAXP.  JAXP version", 
   "1.1 is required (for SAX-2 support).", 
   "The main changes are in XMLUtils, SAXAdapter, and ThreadedSAXAdapter.", 
   "The external interface to the SAXAdapters no longer takes a parser, so", 
   "it's easier to use them.", 
   "XMLUtils now does all of its XML serialization using JAXP Transformers, which", 
   "I'm assuming is the right way to do it - any JAXP experts out there?"
  ], 
  "revision_id": "251937"
 }, 
 {
  "author": "rubys", 
  "date": "2001-05-22T23:52:22.000000Z", 
  "msg": [
   "Scott's intuition was correct, I changed the test case to match the", 
   "way it supposed to work, and then corrected the code to match."
  ], 
  "revision_id": "251936"
 }, 
 {
  "author": "rubys", 
  "date": "2001-05-22T23:32:47.000000Z", 
  "msg": [
   "Tracked down the test failure - it failed because the test case was", 
   "written to the current behavior of the method, and not to the correct", 
   "behavior.", 
   "Rewrote the test case to parse REAL xml namespace desclarations, not", 
   "the pseudo attributes that the code was currently looking for.  Once", 
   "the test case was corrected, it passed.", 
   "Note: I suspect that there is likely a similar problem with testGetPrefix.", 
   "I'm also checking in a build.xml which halts on failures...."
  ], 
  "revision_id": "251935"
 }
]