[
 {
  "author": "rubys", 
  "date": "2001-06-11T10:51:55.000000Z", 
  "msg": [
   "Fix regression tests:", 
   "msgContext.axisEngine is not always set", 
   "inconsistent access to registries: bags vs real properties", 
   "Distinguish between client and server", 
   "Remove debug statements", 
   "Temporarily comment out \"real\" stock quote"
  ], 
  "revision_id": "251994"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-10T20:00:33.000000Z", 
  "msg": [
   "Fix email addr."
  ], 
  "revision_id": "251993"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-10T19:57:24.000000Z", 
  "msg": [
   "* First cut at the AxisEngine hierarchy", 
   "Introduce an abstract AxisEngine base class, from which both AxisClient", 
   "and AxisServer inherit.  The AxisEngine handles the registries and loading", 
   "engine-wide properties from a properties file (this should migrate to", 
   "XML at some point).  init() has been factored out of both AxisClient and", 
   "AxisServer.", 
   "Enable setting default debug level via the properties file.", 
   "The AxisEngine class also has the handler and service registries as first-", 
   "class member vars, with getters and setters, rather than using the", 
   "option bag for this.  This required various tweaks to classes that wanted", 
   "to use the option bag.", 
   "* Add a test to TestRPC to verify that dispatching off the RPC body", 
   "element QName works", 
   "* Fix a potential NPE bug in AxisServlet", 
   "* Pull AxisEngine out into a member variable in MessageContext", 
   "* Remove the static SOAPTypeMappingRegistry from MessageContext, replace", 
   "with SOAPTypeMappingRegistry.getSingleton()"
  ], 
  "revision_id": "251992"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-08T02:18:48.000000Z", 
  "msg": [
   "xalan no longer required, admin client moved."
  ], 
  "revision_id": "251991"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-08T00:12:00.000000Z", 
  "msg": [
   "Change the default to 2001 schema.  No other code changes were required", 
   "in order to keep the unit and functional tests running (I like it when", 
   "that happens!).  One set of functional tests has been added.", 
   "This actually is per the request of the people at the soap interop", 
   "event, and was discussed and agreed upon at a weekly IRC, but if", 
   "there are any concerns let me know and I will back it out.", 
   "I actually like the progression.  Apache SOAP 2.1 only generated 1999.", 
   "Apache SOAP 2.2 generates 1999, but will accept 2000/10 and 2001.", 
   "Apache Axis 3.0 will generate 2001, but will accept 1999 and 2000/10.", 
   "Each release will interop with its predecessor.", 
   "At some future release, we can hopefully can drop schemas prior to 2001", 
   "entirely."
  ], 
  "revision_id": "251990"
 }
]