[
 {
  "author": "rubys", 
  "date": "2001-06-13T20:48:48.000000Z", 
  "msg": [
   "Add support for LocalDispatch of jws.  Essentially this involves setting", 
   "a single property and fixing it so that urls of the file:///name format", 
   "are handled properly.  Also added a \"-f\" option as a shorthand for file.", 
   "Shortly a unit test will appear, but I wanted to commit this first.", 
   "Longer term, we should allow the protocol specified in the URL to influence", 
   "the selection of transport..."
  ], 
  "revision_id": "252014"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-13T17:53:26.000000Z", 
  "msg": [
   "Remove vestigal doLocal support"
  ], 
  "revision_id": "252013"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-13T15:39:14.000000Z", 
  "msg": [
   "Make JWSProcessor a global handler.", 
   "Notes: I called the property name REALPATH as that is what the servlet", 
   "API calls it.  At the moment you will want to deploy this hander before", 
   "the debug one as the debug handler will cause the message to be parsed", 
   "and therefore may set the service based on the body (I still think we", 
   "need to fix this).  And while the handler itself is global, the only", 
   "code that sets the necessary property (yet) is the AxisServlet -", 
   "LocalDispatchHandler and SimpleAxisServer are on the near term todo list."
  ], 
  "revision_id": "252012"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-13T11:37:24.000000Z", 
  "msg": [
   "Search for a service handler should continue until a match on a deployed", 
   "service is found - i.e., it is not an error for an individual handler to", 
   "not find a match, and the search should continue until a match is found", 
   "(not merely a service registry lookup)"
  ], 
  "revision_id": "252011"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-13T00:25:45.000000Z", 
  "msg": [
   "Cure premature deserialization.", 
   "Note: test changed to (1) provide required DeserializationContext and", 
   "(2) set EITHER the methodNS or the SOAPAction, but not both."
  ], 
  "revision_id": "252010"
 }
]