[
 {
  "author": "gdaniels", 
  "date": "2001-06-21T16:16:46.000000Z", 
  "msg": [
   "Fix pivot name bug."
  ], 
  "revision_id": "252059"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-21T15:06:28.000000Z", 
  "msg": [
   "Have RPCParam elements \"inherit\" the namespace from their parent.", 
   "At this point, Axis will successfully generate requests that MS.Net", 
   "beta 2 will process.", 
   "***ALL*** IMHO, namespace should be in the ServiceDescription, not", 
   "merely as a parameter on the call.invoke."
  ], 
  "revision_id": "252058"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-21T14:57:19.000000Z", 
  "msg": [
   "Insert code to default SOAPAction, and convert the StockQuote service to", 
   "start exploiting the ability to name input parameters and not care about", 
   "the name of the output parameters.", 
   "***ALL*** I realized I started this with my performance profiling changes,", 
   "but we need to start considering the samples as educational materials,", 
   "so we need to resist the temptation to put TESTING HACKS in such places."
  ], 
  "revision_id": "252057"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-21T14:27:18.000000Z", 
  "msg": [
   "Fix a number of ArrayOutOfBounds and NullPointerExceptions primarily due", 
   "to the values of RPCElement and namespace being either never set or set", 
   "late.", 
   "Additionally, support the serviceDescription for setting the names of", 
   "input parameters.", 
   "***ALL*** normally the server is pretty much content to ignore the name", 
   "of the individual params, but this is not the currently the case for the", 
   "client.  However, I will contend that a fairly common case is that there", 
   "is a single output parameter, and we can easily provide the ability to", 
   "be insensitive to the name returned in that case.  From the interop tests,", 
   "this makes the client able to talk to more servers who have their own", 
   "preference for naming conventions.  I welcome criticism of both the overall", 
   "idea, and the way in which I chose to implement it at this time."
  ], 
  "revision_id": "252056"
 }, 
 {
  "author": "rubys", 
  "date": "2001-06-21T13:33:53.000000Z", 
  "msg": [
   "Fix bug whereby the AdminClient would cause NullPointerExceptions in", 
   "any call which attempted to read from a URL.  Note: no unit or", 
   "function tests were affected by the removal of the offending function,", 
   "so ***GLEN*** please review this change.", 
   "Re-introduced the function test, but treat the fault generated by being", 
   "off the net as a success (Note: this surfaced another bug, so adding", 
   "intentional fault tests is on my todo list)."
  ], 
  "revision_id": "252055"
 }
]