[
 {
  "author": "dug", 
  "date": "2001-06-29T11:47:14.000000Z", 
  "msg": [
   "Renamed the addressbook sample to addr", 
   "ALL: PLEASE DO NOT use the same package names in the Axis samples as", 
   "the SOAP samples - it can cause people to load the wrong classes", 
   "when both products are in use at the same time."
  ], 
  "revision_id": "252084"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-29T05:17:40.000000Z", 
  "msg": [
   "Add a little more error checking."
  ], 
  "revision_id": "252083"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-29T05:17:14.000000Z", 
  "msg": [
   "Local transport doesn't make sense on server side..."
  ], 
  "revision_id": "252082"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-29T04:52:15.000000Z", 
  "msg": [
   "Include the default engine configuration files in axis.jar, so the code", 
   "will pick them up."
  ], 
  "revision_id": "252081"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-06-29T04:51:37.000000Z", 
  "msg": [
   "Deployment changes.  Remove all default configuration from the", 
   "code, and check in two default \"engine-config.xml\" files which get", 
   "included in the axis.jar.", 
   "When the engine starts up, it now checks for an appropriate config", 
   "file.  First it looks in the working directory, and if it doesn't find a", 
   "file there, it looks for one on the classpath.  For the server, this is:", 
   "org/apache/axis/server/engine-config.xml", 
   "I combined the whole server configuration (right now Handlers, Services,", 
   "and Transports) into this single file, which is in the same format returned", 
   "by the AdminClient's \"list\" command.", 
   "I removed the engine's ability to save its registries to persistent storage", 
   "itself.  So to save an active configuration, you should do something like:", 
   "java org.apache.client.AdminClient list > engine-config.xml", 
   "(I changed the printing of \"Doing a list\" to go to stderr so this works)", 
   "This is open for debate, and certainly not the final form of this stuff.", 
   "We need to have some conversations about how this is really going", 
   "to work.  For now this is a solution which removes a lot of complexity", 
   "from the client/server classes, and pulls all the initial configuration", 
   "metadata out of the code.", 
   "I think this is a good step, and it gets us that much closer to a place", 
   "where we could plug in WSDD."
  ], 
  "revision_id": "252080"
 }
]