[
 {
  "author": "gdaniels", 
  "date": "2001-08-17T20:44:01.000000Z", 
  "msg": [
   "Enable auto-gen of WSDL (for JWS files only at the moment).", 
   "Also revamp XMLUtils to enable sending documents to Writers", 
   "as well as OutputStreams.", 
   "Doing an HTTP GET on a JWS url will now return a little test page.", 
   "Adding ?WSDL to the query string will cause the automatic", 
   "generation of a WSDL file for the service, determined by introspection.", 
   "This is a first cut, and I haven't tested the resultant WSDL against", 
   "any clients yet.  There's a lot left to do, I just want to get this version", 
   "checked in so I can continue work from home.", 
   "Obvious things which need doing:", 
   "- Support for non-JWS services (via URLMapper)", 
   "- A more general framework for generating this data, which will", 
   "allow handlers in a service's deployed processing path to", 
   "influence the WSDL, indicating headers, encoding styles,", 
   "etc...", 
   "- Support deployment info for methods - right now we assume", 
   "all methods are available."
  ], 
  "revision_id": "252289"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-17T18:56:16.000000Z", 
  "msg": [
   "Test echoMapArray"
  ], 
  "revision_id": "252288"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-17T18:55:15.000000Z", 
  "msg": [
   "Fix typo"
  ], 
  "revision_id": "252287"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-17T18:51:57.000000Z", 
  "msg": [
   "Add echoMapArray() method"
  ], 
  "revision_id": "252286"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-15T21:30:17.000000Z", 
  "msg": [
   "1st cut ConfigurationProvider API.", 
   "The specifics of configuring the engine, dealing with persistent storage", 
   "or XML parsing, etc., are now abstracted away behind the", 
   "ConfigurationProvider interface, which provides for bidirectional", 
   "configuration persistence.", 
   "I've provided two concrete ConfigurationProviders:", 
   "* FileProvider - works just like the old code did, reading/writing", 
   "[client/server]-config.xml.  This is the default behavior for now.", 
   "* XMLStringProvider - you can pass a string containing an", 
   "engine configuration to this supplier, and it will configure", 
   "things from that.  The writeEngineConfig() method on this", 
   "provider is a no-op, as there's nowhere to persist to.", 
   "Other providers can easily be written to access databases,", 
   "to spawn threads and auto-restart the engine on changes,", 
   "etc...", 
   "TODO : Enable the user/developer to change the default", 
   "behavior by setting a system property, in much the same", 
   "way log4j works."
  ], 
  "revision_id": "252285"
 }
]