[
 {
  "author": "gdaniels", 
  "date": "2001-08-14T19:02:33.000000Z", 
  "msg": [
   "It's nice if the examples actually work the way they're supposed to.", 
   "Exclude example2/ from the samples build, and allow Calculator", 
   "to be used as a JWS (i.e. remove the package declaration)."
  ], 
  "revision_id": "252274"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-14T13:10:32.000000Z", 
  "msg": [
   "Check for null namespaces collection, and fix a few long lines", 
   "while in there."
  ], 
  "revision_id": "252273"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-14T13:06:35.000000Z", 
  "msg": [
   "Fix namespace mapping problem - use the right collection, get rid of", 
   "the old one."
  ], 
  "revision_id": "252272"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-14T03:49:19.000000Z", 
  "msg": [
   "Now that the alpha has been branched.....", 
   "Some fairly major changes to the parsing/deserialization code.", 
   "The main thrust is decoupling deserialization from the creation of", 
   "a MessageElement-based object model for the XML.", 
   "*  MessageElements are now created for every XML element, and", 
   "they keep track of their namespace mappings.  The", 
   "functionality that was only in NSStack before is now replicated", 
   "in MessageElement, with the elements searching local mappings", 
   "for a prefix/URI, and asking their parent if it's not found.", 
   "*  Keep track of the \"current element\" in DeserializationContext,", 
   "and look for namespace mappings from there.", 
   "*  Deserialization is no longer automatic during the initial", 
   "parse - rather we can parse into MessageElements, record the", 
   "whole message, and then deserialize at the point someone asks", 
   "for an RPCElement's params.  This should help the digsig guys,", 
   "although the general architecture needs another cleaning /", 
   "optimization pass.", 
   "*  SAX2Recorder now records a \"dummy\" event, which indicates", 
   "when the \"current element\" in a DeserializationContext should", 
   "change.  If the record is playing the events back, it checks", 
   "to see if the target handler is a DeserializationContext, and", 
   "if so, it feeds it the current element events, so it can", 
   "correctly accomplish namespace mappings during deserialization", 
   "after the \"normal\" NSStack is long empty.", 
   "*  Default SOAPHandler behaviour is to make MessageElements,", 
   "assuming we're in the middle of a parse.", 
   "*  Pull out Mapping into its own class (used to be inside", 
   "NSSTack)", 
   "*  Use DeserializationContext.parse() in Message.java"
  ], 
  "revision_id": "252271"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-08-14T00:03:06.000000Z", 
  "msg": [
   "merging changes from main branch"
  ], 
  "revision_id": "252270"
 }
]