[
 {
  "author": "butek", 
  "date": "2001-09-18T21:01:43.000000Z", 
  "msg": [
   "Submitted by Ravi Kumar (rkumar@borland.com) and modified a bit by me:", 
   "1. Add an output directory option", 
   "2. Fix a bug in WriteType to avoid creating duplicate constructors, when", 
   "elements size is 0", 
   "3. Emit a dummy impl class if one doesn't already exist. The idea is that", 
   "as soon as generation is done the src will build without any compile errors", 
   "4. Emit classes to the appropriate directory based on package name", 
   "5. Added more type mappings for standard xsd to java"
  ], 
  "revision_id": "252404"
 }, 
 {
  "author": "butek", 
  "date": "2001-09-18T13:46:53.000000Z", 
  "msg": [
   "Fixed some output parameter bugs.  I've got an output parameter test that was failing in spots.  I'll be checking this test in soon."
  ], 
  "revision_id": "252403"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-09-17T20:44:58.000000Z", 
  "msg": [
   "Deal with deserializing null arrays, and fix a bug when serializing", 
   "empty arrays."
  ], 
  "revision_id": "252402"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-09-16T19:58:46.000000Z", 
  "msg": [
   "Fix a bunch of bugs/issues that have been hanging around:", 
   "* MessageContext now gets reset() each time invoke() in the ServiceClient", 
   "is called.  This makes sure to clear out transient properties -", 
   "MessageContext is per message, not per session/connection.  In concert", 
   "with this, we now keep a hash of properties in the ServiceClient which", 
   "are copied into the freshly reset MessageContext on each request, which is", 
   "how we persist things.  Timeout and maintainSession have been moved up", 
   "into the ServiceClient as members, and are set accordingly.", 
   "* We needed a way to retrieve transport-specific things such as cookie", 
   "headers from a returned MessageContext.  The Transport class now has a", 
   "processReturnedMessageContext() method, defined as a no-op in the base", 
   "class.  If you override it, you can get access to the MessageContext", 
   "which comes back just like setupMessageContext() can get to the one", 
   "that's about to go out.  See HTTPTransport for an example of how to", 
   "use this - this is how we get back the session cookies and store them", 
   "so they get set next time through setupMessageContext().", 
   "* Add a little more debugging stuff to RPCProvider", 
   "* Remove erroneous setting of HTTP transport from within LocalSender", 
   "* Copy users.lst into build dir so that functional stock test works", 
   "* Add the beginnings of HTTP GET functionality (i.e. use a browser", 
   "to access http://localhost/axis/Calculator.jws?method=add&arg0=1&arg1=23", 
   "and get back the result).  This is not clean / finished yet."
  ], 
  "revision_id": "252401"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-09-14T21:13:42.000000Z", 
  "msg": [
   "Beginnings of alpha-2 doc edits - checking in so I can finish this from", 
   "home later."
  ], 
  "revision_id": "252400"
 }
]