[
 {
  "author": "rubys", 
  "date": "2001-12-15T21:37:53.000000Z", 
  "msg": [
   "Don't mark wsdl2java tests as failures if the wsdl is from an external", 
   "site and either an error occurs while trying to retrive the document,", 
   "or the document returned is not well formed XML.", 
   "This is to permit disconnected execution of the tests."
  ], 
  "revision_id": "253174"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-12-14T21:11:52.000000Z", 
  "msg": [
   "Correctly set the name of deployed Handlers/Services.", 
   "Submitted by Igor Sedukhin <Igor.Sedukhin@ca.com>."
  ], 
  "revision_id": "253173"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-12-14T20:48:52.000000Z", 
  "msg": [
   "Changes submitted by Glyn Normington (glyn_normington@uk.ibm.com)"
  ], 
  "revision_id": "253172"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-14T20:01:16.000000Z", 
  "msg": [
   "Moving a step closer to a usable framework.  Java names only belong in the writers,", 
   "but the idea of a java name is in SymbolTable and many of the SymTabEntry's.  This", 
   "step moves the creation of the java name (SymTabEntry.name) to the writers and", 
   "removes the java name from Type constructors.  There's still", 
   "SymbolTable.getJavaName and the Namespaces class, which should also move,", 
   "but one thing at a time."
  ], 
  "revision_id": "253171"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-14T18:48:31.000000Z", 
  "msg": [
   "Added the support in ArraySerializer for arrays of arrays.", 
   "This required the following changes:", 
   "a) When serializing an array, need to set the arrayType to the full array name", 
   "(i.e. int[][] not Array[]).", 
   "b) During deserialization, need to recognize an array of arrays and", 
   "use an ArrayList (disabled the \"not supported\" message).", 
   "c) JavaUtils.convert does the proper assignment conversion between", 
   "List objects and arrays.  This was improved to properly consider", 
   "component types which may be arrays/lists.  In such cases the convert", 
   "method is invoked recursively to deal with the component arrays.", 
   "Updated the arrays test and the comprehensive test to verify.", 
   "Also verified by viewing the wire format using tcpmon.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "253170"
 }
]