[
 {
  "author": "scheu", 
  "date": "2001-12-19T21:08:22.000000Z", 
  "msg": [
   "Added the changes to support the new JSR 101 v0.6 Enumeration code", 
   "for both Java2WSDL and WSDL2Java:", 
   "- base types other than String now work.", 
   "- changes to the EnumSerializer to deal with nil=true", 
   "- changes to the EnumSerializer to use new Enumeration methods", 
   "- added a isJavaID(...) method to JavaUtils which determines if a name can", 
   "be a valid java name (i.e. does not collide with keywords and has", 
   "appropriate characters)", 
   "- additional types added to the comprehensive types test.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "253189"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-19T15:30:08.000000Z", 
  "msg": [
   "Added Java2WSDL section, change tool names to WSDL2Java/Java2WSDL, Added links to the tool sections"
  ], 
  "revision_id": "253188"
 }, 
 {
  "author": "scheu", 
  "date": "2001-12-19T15:05:31.000000Z", 
  "msg": [
   "Some cleanup.  JavaUtils.convert recognizes new ConvertCache interface to retrieve previously converted objects"
  ], 
  "revision_id": "253187"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-19T14:57:41.000000Z", 
  "msg": [
   "This fixes a couple import problems reported by Thomas Sandholm", 
   "(sandholm@mcs.anl.gov)", 
   "- relative import file names were relative to the command line directory, not relative", 
   "to the file from which they were imported.", 
   "- faults appearing in imported files weren't generated.", 
   "Along with this fix I did 2 things:", 
   "- changed the import test to test these new conditions", 
   "- added a main to Emitter.java so that I can create the symbol table without generating", 
   "code.  This is a useful debugging tool, but I don't think we want this to be a documented", 
   "feature of AXIS."
  ], 
  "revision_id": "253186"
 }, 
 {
  "author": "butek", 
  "date": "2001-12-19T14:30:59.000000Z", 
  "msg": [
   "Some fixes to the user's guide.  Found by Jeff Barret (barrettj@us.ibm.com)."
  ], 
  "revision_id": "253185"
 }
]