[
 {
  "author": "tomj", 
  "date": "2002-02-01T22:46:13.000000Z", 
  "msg": [
   "Add some new features to JAva2WSDL to help control methods and inheritance.", 
   "Do not emit methods of java.lang.Object when -all switch is given.", 
   "Two new Emitter APIs and corresponding command line switches:", 
   "- setDisallowedMethods(Vector disallowedMethods), command line switch: -x, --exclude", 
   "A list of methods that are explicitly NOT published in the WSDL", 
   "- setStopClasses(Vector stopClasses), command line switch: -c, --stopClasses", 
   "A list of class names which will halt the walk up class heirachy for both types and methods.", 
   "Example:", 
   "class Parent {}", 
   "class Child extends parent {}", 
   "class Baby extends child {}", 
   "Running 'Java2WSDL -all -c Parent Baby' will emit all methods in Child and Baby", 
   "but no methods in 'parent'.  If these were JavaBeans, no member from parent", 
   "would be included in the XML Schema types, and the child type will not extend", 
   "parent."
  ], 
  "revision_id": "253394"
 }, 
 {
  "author": "scheu", 
  "date": "2002-02-01T22:08:26.000000Z", 
  "msg": [
   "The following TypeMapping related changes were made:", 
   "- Changed the TypeMapping interfaces to match new signatures/semantics", 
   "of JSR 101 version 0.7.", 
   "- The DefaultTypeMappingImpl contains the xsd/soap mappings to", 
   "serialize and deserialize SOAP 1.1 types.  In addition it", 
   "contains enough information to deserialize SOAP 1.2 items", 
   "that may come off the wire.", 
   "Added the DefaultSOAP12TypeMappingImpl.java which supports", 
   "serializing and deserializing SOAP 1.2 types over the wire (for example", 
   "will flow a soapenc:int over the wire if the class is a java.lang.Integer).", 
   "This new type mapping contains only the new mappings and", 
   "delegates to DefaultTypeMappingImpl to get the SOAP 1.1 stuff.", 
   "(Note that the Axis runtime uses the DefaultTypeMapping because", 
   "it needs to flow SOAP 1.1 over the wire.  The DefaultSOA12TypeMappingImpl", 
   "is needed by the emitters.)", 
   "- Updated the TypeMappingRegistryImpl to make it more flexible", 
   "for delegation purposes.", 
   "- The Default TypeMappings are singletons and should not", 
   "be changed after construction.  Now these objects throw exceptions", 
   "if an attempt is made to change them.  Found a couple testcases", 
   "that were doing the wrong thing and changed them.", 
   "- Changed Java2WSDL to generate JAX-RPC soapenc primitives for", 
   "wrapper class references.  This is done by using the", 
   "DefaultSOAP12TypeMappingRegistry during processing. (This problem", 
   "was discovered by Russell Butek.)  Made a slight change to", 
   "the sequence test to ensure that a soapenc:int roundtrips correctly.", 
   "- Made changes to reduce line length to 79 characters or less."
  ], 
  "revision_id": "253393"
 }, 
 {
  "author": "butek", 
  "date": "2002-02-01T19:58:46.000000Z", 
  "msg": [
   "Use the thread-safe Hashtable instead of the unsafe HashMap so that the", 
   "multithread test doesn't intermittently fail."
  ], 
  "revision_id": "253392"
 }, 
 {
  "author": "butek", 
  "date": "2002-02-01T18:04:09.000000Z", 
  "msg": [
   "According to JAX-RPC, the Service Definition Interface name MIGHT come from", 
   "the binding instead of the portType.  I've made this fix and the test to prove it."
  ], 
  "revision_id": "253391"
 }, 
 {
  "author": "tomj", 
  "date": "2002-02-01T16:48:12.000000Z", 
  "msg": [
   "Get the SalesRankNPrice .NET service from the net,", 
   "not from local file."
  ], 
  "revision_id": "253390"
 }
]