[
 {
  "author": "butek", 
  "date": "2002-02-05T21:53:49.000000Z", 
  "msg": [
   "Fixed a bug found by Thomas Sandholm.  \"new String[][i+1]\" was being generated.", 
   "This should be \"new String[i+1][]\"."
  ], 
  "revision_id": "253414"
 }, 
 {
  "author": "butek", 
  "date": "2002-02-05T19:37:48.000000Z", 
  "msg": [
   "JAXRPCException now extends RuntimeException, so it doesn't have to be", 
   "explicitly caught or in the throws clause.  This particularly cleans up stub code.", 
   "NOTE:  I didn't exhaustively go through our runtime removing", 
   "\"throws JAXRPCException\".  That's still legal code.  I simply removed it from", 
   "JAX-RPC classes since they've been removed in the spec."
  ], 
  "revision_id": "253413"
 }, 
 {
  "author": "tomj", 
  "date": "2002-02-05T19:36:31.000000Z", 
  "msg": [
   "Test case for Java2WSDL options stopClasses and exclude.", 
   "The test validates the generated  WSDL file to insure methods are excluded,", 
   "and the methods and member data in a stop class are not emitted."
  ], 
  "revision_id": "253412"
 }, 
 {
  "author": "glyn", 
  "date": "2002-02-05T16:25:39.000000Z", 
  "msg": [
   "Introduce an EngineConfigurationFactory interface with a", 
   "DefaultEngineConfigurationFactory implementation which may be overridden via", 
   "a system property. The default engine config. factory produces client", 
   "engine configurations based on a WSDD configuration file with filename", 
   "specifiable in a system property (axis.ClientConfigFile) but with default", 
   "value as today (Constants.CLIENT_CONFIG_FILE) and server side configurations", 
   "similarly configurable via a system property (axis.ServerConfigFile) but", 
   "defaulting to the file with name Constants.SERVER_CONFIG_FILE.", 
   "The factory interface and default implementation also have helper methods", 
   "which create an engine configuration based on the appropriate file (as above)", 
   "but with a specific Handler added, which removes some more duplicated code", 
   "from various testcases.", 
   "(AxisServlet and AdminServlet should probably be folded into the above", 
   "scheme in the fulness of time.)"
  ], 
  "revision_id": "253411"
 }, 
 {
  "author": "butek", 
  "date": "2002-02-05T16:22:41.000000Z", 
  "msg": [
   "I changed a few things on the Service to bring it up to JAX-RPC 0.7 standards:", 
   "1.  org.apache.axis.client.Service is required to implement Serializable and", 
   "Referenceable.", 
   "2.  Service methods now throw ServiceException rather than JAXRPCException.", 
   "3.  JAXRPCException now extends RuntimeException.", 
   "4.  WSDL2Java now generates both a Service impl and a Service interface.", 
   "5.  2-4 caused lots of other changes, particularly to tests."
  ], 
  "revision_id": "253410"
 }
]