[
 {
  "author": "rsitze", 
  "date": "2002-03-11T22:07:18.000000Z", 
  "msg": [
   "reformatted"
  ], 
  "revision_id": "253729"
 }, 
 {
  "author": "dims", 
  "date": "2002-03-11T19:41:24.000000Z", 
  "msg": [
   "Updated version of fix for \"Proposed change for RPCProvider.java for Beta 1\" from Thomas \"<tb@ap-ag.com>\".", 
   "- added MessageContext parameter to getMethod()", 
   "- added method invokeMethod()", 
   "- added method checkMethodName()"
  ], 
  "revision_id": "253728"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-11T17:18:33.000000Z", 
  "msg": [
   "The generated code for the equals method should check for nulls."
  ], 
  "revision_id": "253727"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-11T16:25:32.000000Z", 
  "msg": [
   "Added extended support for simpleTypes.  Pretty cool!", 
   "1) Added \"Derivation of complexType from a simpleType\"", 
   "which is an optional support feature in Table 18-1 of", 
   "JSR 101.", 
   "Example:", 
   "<complexType name=\"stringWLength\" >", 
   "<simpleContent>", 
   "<extension base=\"xsd:string\" />", 
   "<attribute name=\"length\" type=\"xsd:int\" />", 
   "</simpleContent>", 
   "</complexType>", 
   "This allows the creation of a type that can be", 
   "referenced in an attribute or an element.", 
   "When referenced as an attribute type only the value is", 
   "passed.  When referenced as an element type, the", 
   "value is passed plus attributes may be set.", 
   "2) Fixed up the isReferenced support for attribute types", 
   "in the symbol table.  This was hard-coded as true...tisk tisk.", 
   "Also changed getNestedTypes to consider the", 
   "nested attributes.", 
   "3) Fixed up the setting of the isSimpleType flag on", 
   "the TypeEntry.  Now it is set for any Defined type entry", 
   "which has a simpleType or simpleContent node.  The", 
   "isSimpleType flag is reported in the debug information.", 
   "4) Fixed up the way attribute types are added to the symbol table.", 
   "Now a call to createTypeFromRef is called ....synonymous", 
   "with the processing for elements.  This may result in", 
   "a Undefined type.  In such cases the isSimpleType flag is", 
   "set on the Undefined type to indicate that it was ref'd in", 
   "a simpleContext.  Later when the Defined type is encountered", 
   "a check is performed to ensure that it is a simple type.  Thus", 
   "the checking of simple types should now work for forward", 
   "references.", 
   "5) Added some wsdl types (from Jeff Lee) to comprehensive tests", 
   "to illustrate the newly supported syntax.", 
   "6) Other minor changes."
  ], 
  "revision_id": "253726"
 }, 
 {
  "author": "rubys", 
  "date": "2002-03-11T15:38:24.000000Z", 
  "msg": [
   "Split the jaxrpc interfaces out into a separate jar"
  ], 
  "revision_id": "253725"
 }
]