[
 {
  "author": "gdaniels", 
  "date": "2002-03-18T04:01:48.000000Z", 
  "msg": [
   "Fix test to match current code, and add new case for completeness."
  ], 
  "revision_id": "253784"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-17T16:25:08.000000Z", 
  "msg": [
   "Fix naming confusion (hopefully for the last time) with xml -> Java property", 
   "names and metadata.", 
   "1) Don't try to uppercase the first char of field names when dealing with", 
   "metadata descriptors, so now the names match what the Property", 
   "Descriptors tell us in the BeanSerializer/Deserializer.", 
   "2) Follow the bean Introspector pattern for naming properties in", 
   "xmlNameToJava() - if the first char is uppercase and the second", 
   "char is ALSO uppercase, leave it alone.  In other words:", 
   "MyID -> myID", 
   "ID -> ID", 
   "3) Deal with boolean types and null obj values in the generated equals()", 
   "methods correctly", 
   "We might want to merge these changes over to beta1 and refresh the bits,", 
   "since this fixes potentially major problems with literal XML.", 
   "Also exclude Interop3TestCase from the func tests since it's not really", 
   "a TestCase and it was breaking my build - this should either be called", 
   "something else or turned into a real test case - Russell, what was your", 
   "intent here?"
  ], 
  "revision_id": "253783"
 }, 
 {
  "author": "", 
  "date": "2002-03-15T17:35:50.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch 'Beta1'."
  ], 
  "revision_id": "253782"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-15T17:35:50.000000Z", 
  "msg": [
   "I'm about to create Beta 1, so build.xml should reflect that..."
  ], 
  "revision_id": "253781"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-15T17:15:52.000000Z", 
  "msg": [
   "An addendum to Glen's change which was:  if addParameters was called", 
   "but setReturnType was not, an exception is thrown.  But AXIS was not", 
   "doing the converse:  if setReturnType was called but addParameter was", 
   "not.  It's not QUITE that simple because if there are no parameters there's", 
   "no need to call addParameter, so a check against the actual parameters", 
   "also has to be made."
  ], 
  "revision_id": "253780"
 }
]