[
 {
  "author": "glyn", 
  "date": "2002-03-13T15:20:03.000000Z", 
  "msg": [
   "Make MessageElement implement JAXM SOAPElement.", 
   "Remove getValue method from SOAPHeader and re-introduce as getObjectValue", 
   "(to avoid clash with SOAPElement.getValue) in MessageElement. This was", 
   "derived from code submitted by Taras Shkvarchuk and addresses one of the", 
   "beta 'must do' items."
  ], 
  "revision_id": "253749"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-13T15:19:27.000000Z", 
  "msg": [
   "Changes for anonymous type processing in WSDL2Java Symbol Table.", 
   "Problem Description:", 
   "--------------------", 
   "An anonymous type is a type (simpleType or complexType) that does not", 
   "have a name.  Here is an example:", 
   "...", 
   "<element name=\"foo\">", 
   "<complexType>", 
   "....", 
   "</complexType>", 
   "The WSDL2Java symbol table uses the QName as the key to access a", 
   "symbol table entry.  Since an anonymous type does not have a qname,", 
   "the qname of the containing element is used.  Unfortunately it is", 
   "possible that the element is not unique, which results in a symbol", 
   "table collision.  (As reported by Tom Jordahl.)", 
   "Solution:", 
   "---------", 
   "1) The first change is to give anonymous type elements unique names", 
   "to avoid symbol table collisions.  The unique name must be something", 
   "that can be determined by examining the dom tree.  I chose to use", 
   "the following format for the local name:", 
   "<qname-of-containing-simple/compleType>.<qname-of-element>", 
   "If the anonymous type is used to define a global element, its local name is:", 
   ".<qname-of-element>", 
   "2) Change to the SchemaUtils code that queries the qname of an anon type.", 
   "3) Change to the JavaWriterFactory.javifyNames method.  This method is", 
   "enhanced to ensure that anonymous java type name collisions don't occur.", 
   "If a name collision is detected, the suffix ANON### is appended to the name", 
   "of the anonymous class java name to prevent the collision (### is a unique number).", 
   "4) Changed the refattr.wsdl to have a anonymous type collision similar to the", 
   "one submitted to axis-dev by Tom Jordahl.", 
   "Phase 2:", 
   "--------", 
   "Anonymous types for root elements are not put into the symbol table.  Instead", 
   "the emitter writer classes use the DefinedElement information when generating code.  This", 
   "can lead to some fuzzy logic and subtle bugs. (I promised Glen last week that", 
   "I would look at changing this code.)", 
   "Solution:", 
   "1) Anonymous types for root elements are added to the symbol table just like", 
   "all other anonymous types.", 
   "2) The JavaWriterFactory.resolve() method is modified to ensure that", 
   "the java name of the root DefinedElement matches the java name of its anonymous DefinedType.", 
   "3) Changed Utils.getNested to get the anonymous DefinedType.", 
   "4) Changed the emitter writeTypes() method to only process Type entries", 
   "(not Element entries).  This is an improvement, writeTypes only deals with types!", 
   "5) Changed the deploy and stub writers to not register type mappings for", 
   "Elements.  (Before the deploy and stub writers had to examine the Element", 
   "to see if it had an anonymous type...)", 
   "* There are a number of existing testcases that use anonymous types", 
   "for root elements.  All of the tests passed."
  ], 
  "revision_id": "253748"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-13T06:02:46.000000Z", 
  "msg": [
   "Add a convenience API to Call to allow specifying a desired return type", 
   "(i.e. Java class) to which we will attempt to convert the result, and a", 
   "unit test which exercises it."
  ], 
  "revision_id": "253747"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-13T05:18:06.000000Z", 
  "msg": [
   "Introduce a timeout (defaulted to 45 seconds) on the WSDL2Java", 
   "emitter.  This is exposed as a \"timeout\" option in the WSDL2Java ant", 
   "task, but not yet as a command-line option for WSDL2Java."
  ], 
  "revision_id": "253746"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-12T21:29:15.000000Z", 
  "msg": [
   "Doug's issue #2 is fixed."
  ], 
  "revision_id": "253745"
 }
]