[
 {
  "author": "glyn", 
  "date": "2002-03-22T16:20:15.000000Z", 
  "msg": [
   "Add file close and give local variables meaningful names.", 
   "Note: this class is not defined by JAXM and so has package scope."
  ], 
  "revision_id": "253844"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-22T16:08:32.000000Z", 
  "msg": [
   "Metadata improvements, moving towards a more integrated/streamlined model.", 
   "* Replace Call's internal vectors of param names/types with an OperationDesc", 
   "* Flesh out OperationDesc/ParameterDesc/ServiceDesc to provide more of", 
   "what we need", 
   "* We now try to match parameters by name FIRST, and only then fall back to", 
   "position if we can't get a match.", 
   "* Add a test of sending reversed parameters in TestSerializedRPC to make", 
   "sure this works.", 
   "* Introspection is now (almost) centralized in ServiceDesc.  Next step is", 
   "to get the RPCProvider fully using the OperationDescs instead of", 
   "introspecting itself.", 
   "* Implement <wsdlFile> element for WSDD services, which allows the deployer", 
   "to specify a static WSDL file which should be returned instead of", 
   "dynamically creating one.", 
   "* Clean up TestArrayListConversions - since all introspection now takes place", 
   "once the first time it's needed, this means all typemappings must be set", 
   "up before that point.  Move typemapping set up into the test constructor.", 
   "I'm inclined to make adding typemappings after a service has been called", 
   "a fault, but this is open for discussion.", 
   "* Update TODO list a bit - clean out finished items", 
   "* Add WSDDParameter to enable WSDD specification of parameters:", 
   "<service name=\"foo\" ...>", 
   "<operation name=\"testMe\">", 
   "<parameter qname=\"foo:Bar\" xmlns:foo=\"myNS\" type=\"xsd:string\"/>", 
   "...", 
   "</operation>", 
   "</service>", 
   "This will all be cleaner and better integrated in the next round, but I need", 
   "to get to work and this version gets us part way there and passes all the", 
   "tests.  Next steps are to get rid of Skeletons, and have the deploywriter", 
   "emit WSDD metadata for the operations on generated services."
  ], 
  "revision_id": "253843"
 }, 
 {
  "author": "rineholt", 
  "date": "2002-03-22T15:29:51.000000Z", 
  "msg": [
   "Make certain that boundary array is never tampered with."
  ], 
  "revision_id": "253842"
 }, 
 {
  "author": "scheu", 
  "date": "2002-03-22T14:38:46.000000Z", 
  "msg": [
   "Added the JavaBeanHelperWriter.java class...duh", 
   "Added some more scaffolding code."
  ], 
  "revision_id": "253841"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-22T05:19:39.000000Z", 
  "msg": [
   "Correct problem with boolean array accessor naming.  Woops - always", 
   "read code completely before you uncomment it.", 
   "Thanks to Sylvain St-Germain for catching this one!"
  ], 
  "revision_id": "253840"
 }
]