[
 {
  "author": "butek", 
  "date": "2002-03-27T20:24:06.000000Z", 
  "msg": [
   "Updated TypeMapping and TypeMappingRegistry interfaces (still have to", 
   "make sure our implementation is updated with these).", 
   "Since we voted to just get rid of old stuff, rather than keep them around", 
   "and deprecating them, I've also removed a few of the deprecation", 
   "leftovers I already added."
  ], 
  "revision_id": "253879"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-27T20:16:25.000000Z", 
  "msg": [
   "Two small bugs.", 
   "* Make sure to check the in-scope namespace mappings *before* asking", 
   "the current element in DeserializationContextImpl.  This is because we", 
   "end up calling getNamespaceURI() during the string->QName conversion", 
   "for xsi:types in the constructor of MessageElement, when the element", 
   "being built is not actually (yet) the current element of the DeserContext.", 
   "* Parameters have been added in Call when getNumParams() is > 0, not", 
   "when operation == null."
  ], 
  "revision_id": "253878"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-03-27T19:27:47.000000Z", 
  "msg": [
   "Don't send xsi:types/multirefs for wrapped services.", 
   "This brought to light a problem in Call where the returnType wasn't getting", 
   "propagated to the Operation if it was set before other parameters were", 
   "added.  We now ALWAYS have an OperationDesc available in the Call.", 
   "Also set a couple of options which might be useful later (when cleaning", 
   "up the option-getting code in SerializationContextImpl) in WSDDService."
  ], 
  "revision_id": "253877"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-27T18:57:22.000000Z", 
  "msg": [
   "FaultException is really old.  No one should have been using it for months,", 
   "so it's gone."
  ], 
  "revision_id": "253876"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-27T18:36:48.000000Z", 
  "msg": [
   "ServiceException/JAXRPCException.getCause changed to", 
   "getLinkedCause.  I've kept the old stuff around and deprecated it."
  ], 
  "revision_id": "253875"
 }
]