[
 {
  "author": "gdaniels", 
  "date": "2002-04-01T20:29:40.000000Z", 
  "msg": [
   "This should be a little better, though perhaps", 
   "still not perfect."
  ], 
  "revision_id": "253904"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-04-01T20:12:17.000000Z", 
  "msg": [
   "* Most of the switchover for the Java2WSDL Emitter to use org.apache.axis.", 
   "description.* metadata has been done and works.", 
   "* Skeletons are now emitted using org.apache.axis.description.* metadata,", 
   "and the runtime updated to use that information if available.", 
   "* Added FaultDesc for faults, disallowedMethods, SOAPAction, and stopClasses to", 
   "metadata.", 
   "* When we're using an implementation class, all the methods that could possibly", 
   "be available will be in ancestor classes (since they must implement all the", 
   "appropriate interfaces).  If we're using Java2WSDL to point at an Interface,", 
   "however, we need to walk the interface's interfaces to correctly catch all", 
   "the parental methods.  Revamp the inheritance code to handle this, as well as", 
   "being more correct about superclasses.", 
   "* We need the ServiceDesc to \"resolve\" completely at various points, for", 
   "instance:", 
   "1) When a listing of ServiceDescs is requested from an EngineConfiguration", 
   "2) When a service is instantiated in the engine, either for a call or", 
   "for automatic WSDL generation", 
   "3) When Java2WSDL is used", 
   "Basically the only variable in these situations is what classloader to use", 
   "to resolve the class name.  I'd like to have a single place where we do this,", 
   "but it should be the RIGHT place.", 
   "WARNING : Right now the Class.forName() call in WSDDService is probably NOT", 
   "going to work in servlet engines.  I'd like to get this resolved ASAP.", 
   "* Clean up various JavaDoc inconsistencies (go IDEA!)", 
   "* Print TypeMapping, not SerializationContextImpl, in debug message", 
   "* Count successful invocations for the multi-threaded test case, so we can see", 
   "what's going on.  Also put the number of threads into a variable to make it", 
   "easier to tweak.  I think the very low # of successes (for me anyway)", 
   "warrants some investigation."
  ], 
  "revision_id": "253903"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-01T20:11:00.000000Z", 
  "msg": [
   "Fixed TestDeser2001 so that it works in any time zone."
  ], 
  "revision_id": "253902"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-01T14:42:18.000000Z", 
  "msg": [
   "Oops!  When I changed the mapping of xsd:dateTime from java.util.Date to", 
   "java.util.Calendar, I left the echo sample with the Date type rather than", 
   "change it to the Calendar type.  This broke interoperability."
  ], 
  "revision_id": "253901"
 }, 
 {
  "author": "butek", 
  "date": "2002-03-31T23:09:34.000000Z", 
  "msg": [
   "Changed mapping of xsd:dateTime from java.util.Date to java.util.Calendar", 
   "according to JAX-RPC.  JAX-RPC doesn't have the mapping of xsd:Date", 
   "but I think it's reasonable to map it to java.util.Date.  This required the", 
   "following changes:", 
   "1.  Changed Date(De)Serializer & Factories", 
   "2.  Added Calendar(De)Serializer & Factories", 
   "3.  Changed some tests/samples to use Calendar for dateTime", 
   "4.  Added xsd:date to some tests (comprehensive types & roundtrip)"
  ], 
  "revision_id": "253900"
 }
]