[
 {
  "author": "glyn", 
  "date": "2002-04-11T15:50:40.000000Z", 
  "msg": [
   "Support JAXM technique of using detachNode to remove an empty SOAPHeader from", 
   "a SOAPEnvelope. This requires a SOAPHeader to be a *child* of its SOAPEnvelope", 
   "resulting in some extra SOAPException propagation on creation of SOAPHeader", 
   "and consequent try/catching."
  ], 
  "revision_id": "253969"
 }, 
 {
  "author": "tomj", 
  "date": "2002-04-11T15:45:09.000000Z", 
  "msg": [
   "Username and password on WSDL URL did not work.", 
   "- Add the -U/--user and -P/-password options to WSDL2Java command line", 
   "- Parse the URL and extract the userInfo to get username/password", 
   "- Register a default Authenticator to use when the URL is resolved,", 
   "to provide login info.  This will fall back to http.ProxyUser and", 
   "http.proxyPassword properties if user or password is not found via switch or", 
   "the URI.", 
   "- Check for a null document and print a error instead of NPE when we", 
   "fail to get the WSDL", 
   "- Update the use-guide with new -U/-P switch info."
  ], 
  "revision_id": "253968"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-11T14:57:23.000000Z", 
  "msg": [
   "A couple simple fixes provided by Didier Guillon (Didier.Guillon@agduc.com)."
  ], 
  "revision_id": "253967"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-11T13:30:55.000000Z", 
  "msg": [
   "Move checkForUndefined so that it checks each imported WSDL file for", 
   "things undefined within it.  We used to get a NullPointerException for a", 
   "sample that Sam had.  Now it generates a reasonable error.  Sam's sample", 
   "was:", 
   "X.WSDL", 
   "Y.WSDL - depends on stuff from X but doesn't import X (bad wsdl)", 
   "Z.WSDL - imports X.WSDL and Y.WSDL.", 
   "We used to call checkForUndefined after processing all files.  Because of", 
   "a quirk within WSDL4J, none of the types in Z are undefined, so we have", 
   "to check each imported file."
  ], 
  "revision_id": "253966"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-10T18:49:40.000000Z", 
  "msg": [
   "Changed QName to final, intern'd NamespaceURI and LocalPart.", 
   "Changed PrefixedQName so that it no longer extends QName."
  ], 
  "revision_id": "253965"
 }
]