[
 {
  "author": "gdaniels", 
  "date": "2002-04-03T16:14:11.000000Z", 
  "msg": [
   "Add schema support section"
  ], 
  "revision_id": "253919"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-03T15:28:36.000000Z", 
  "msg": [
   "I've removed the mapping of xsd:date to java.util.Date (Sam started this", 
   "yesterday, but it broke the build).  This mapping isn't part of JAX-RPC and", 
   "it kept us from some backward interoperability.", 
   "Doing this work I also discovered one sample - bidbuy - that still used the", 
   "old mapping of xsd:dateTime to Date which I changed to Calendar."
  ], 
  "revision_id": "253918"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-04-03T06:09:56.000000Z", 
  "msg": [
   "* Make TypeDescs handle inheritance.  Next step is to make this more", 
   "efficient (only look for the parent TypeDesc once).", 
   "* TypeDescs now require a Class in the constructor", 
   "* Introduce a ParentBean to the attributes test to test this functionality.", 
   "* Pass allowedMethods down into the ServiceDesc."
  ], 
  "revision_id": "253917"
 }, 
 {
  "author": "rubys", 
  "date": "2002-04-03T01:23:58.000000Z", 
  "msg": [
   "Restore interop with 1999 and 2000 schema based clients.  This includes", 
   "early versions of WebSphere with Apache SOAP.  I thought we had agreed", 
   "to not lose precision on xsd:Date, but if not, the DATE1 change will need", 
   "to be undone."
  ], 
  "revision_id": "253916"
 }, 
 {
  "author": "scheu", 
  "date": "2002-04-02T23:09:46.000000Z", 
  "msg": [
   "Added minOccursIs0 property to ElementDecl and changed SchemaUtils", 
   "to set this property to true if a contained element has maxOccurs=\"0\".", 
   "This information is useful for the subtle distinction between nillable=\"true\"", 
   "and maxOccurs=\"0\".  Currently the runtime assumes nillable=\"true\" and", 
   "sends null values as", 
   "<someItem xsi:nill=\"true\" />", 
   "But if maxOccurs=\"0\" is defined for the element, the element should not be", 
   "serialized at all.", 
   "Glen/Tom: You may want to change JavaBeanHelperWriter to store meta data", 
   "for this case, add this information to the meta data model and change", 
   "the BeanSerializer."
  ], 
  "revision_id": "253915"
 }
]