[
 {
  "author": "gdaniels", 
  "date": "2002-04-30T15:16:44.000000Z", 
  "msg": [
   "Remove old-style admin parsing code"
  ], 
  "revision_id": "254069"
 }, 
 {
  "author": "dims", 
  "date": "2002-04-30T12:16:12.000000Z", 
  "msg": [
   "Proposed Contribution to Apache - WSIF from Paul Fremantle, WebServices Architect, IBM Hursley (pzf@hursley.ibm.com)", 
   "-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------", 
   "Here's the attached note from Paul:", 
   "IBM has developed a codebase called WSIF (WebServices Invocation Framework) which has been available on alphaWorks for some time now (www.alphaworks.ibm.com/tech/wsif). WSIF provides two main things: an SPI or pluggable provider model that matches the extensibility of WSDL - so if new ports and bindings are developed, WSIF allows existing clients to access services without changes to the code. Also WSIF supports a Dynamic Invocation Interface (DII) that is very closely modelled on WSDL, which is useful in building dynamic tools, such as flow engines. We have done a considerable amount of work on WSIF since the alphaWorks release, and we would like to propose contributing this to Apache. We are interested in your feedback on this proposal - including where it should be posted, proposed package names, and how we could work to use this in an Apache WebServices context. I have attached a couple of files - the source code and a brief overview of WSIF. There are also two good articles on WSIF on developerWorks", 
   "Introduction          : http://www-106.ibm.com/developerworks/library/ws-wsif.html", 
   "Architecture & Details: http://www-106.ibm.com/developerworks/webservices/library/ws-wsif2/index.html", 
   "(please note the APIs have changed since those articles were published).", 
   "Thanks", 
   "Paul Fremantle, WebServices Architect, IBM Hursley", 
   "pzf@hursley.ibm.com"
  ], 
  "revision_id": "254068"
 }, 
 {
  "author": "", 
  "date": "2002-04-29T20:17:15.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch", 
   "'Beta2-patches'."
  ], 
  "revision_id": "254067"
 }, 
 {
  "author": "butek", 
  "date": "2002-04-29T20:17:15.000000Z", 
  "msg": [
   "xsd:date should map to java.util.Date.  The registration of the (de)serialier", 
   "mixed up Date and Calendar - fix needed for beta 2."
  ], 
  "revision_id": "254066"
 }, 
 {
  "author": "rineholt", 
  "date": "2002-04-29T19:41:17.000000Z", 
  "msg": [
   "Fixed a boundary type problem with attachemnts.", 
   "Added axis_nojavadocs environment varible setting to true will never build javadocs", 
   "Added some debug logging for OperationDesc, ParamterDesc for stuff I'm still looking into."
  ], 
  "revision_id": "254065"
 }
]