[
 {
  "author": "butek", 
  "date": "2002-05-20T20:07:29.000000Z", 
  "msg": [
   "JavaWriter has become too brittle for good extensibility.  It assumes that", 
   "each extension writes ONE file (extensions may not write any file at all);", 
   "it's geared toward writing .java files and gets ugly when we write other", 
   "things (like deploy.wsdd).", 
   "This is only the first step in cleaning up JavaWriter.  In this step, I simply", 
   "move the utility-like methods from JavaWriter to Utils so future work isn't", 
   "cluttered and confused by this stuff:", 
   "fileExists,", 
   "isPrimitiveType,", 
   "getResponseString,", 
   "wrapPrimitiveType.", 
   "A future step will place more behavior on extensions.  Right now", 
   "JavaWriter places a very simple behavior on extensions:  it calls", 
   "writeFileHeader and writeFileBody.  That's it.  This is not sufficient (though", 
   "I'm still trying to figure out what is).  I'll probably pull a lot of the ugliness", 
   "out of constructor calls into another method.  And revamp some of the", 
   "javaisms (should JavaWriter really have the variables:  classname?", 
   "packageName?  qname?  type?)"
  ], 
  "revision_id": "254169"
 }, 
 {
  "author": "rsitze", 
  "date": "2002-05-20T17:59:42.000000Z", 
  "msg": [
   "private to public string constants: someone somewhere will be setting these.. so expose them"
  ], 
  "revision_id": "254168"
 }, 
 {
  "author": "dug", 
  "date": "2002-05-20T17:36:00.000000Z", 
  "msg": [
   "Make resend work when xml formatting is on.  Needed to recalc", 
   "content-length header"
  ], 
  "revision_id": "254167"
 }, 
 {
  "author": "dug", 
  "date": "2002-05-20T14:24:39.000000Z", 
  "msg": [
   "getting closer", 
   "- 'resend' now works w/o XML format on", 
   "- pickup a change from Edward Pring to the XML formatting - much nicer looking now"
  ], 
  "revision_id": "254166"
 }, 
 {
  "author": "dug", 
  "date": "2002-05-20T12:18:34.000000Z", 
  "msg": [
   "Get tcpmon working again", 
   "- resend will now work again (not all cases yet but at least some)", 
   "- remove some error message (exceptions) that get thrown"
  ], 
  "revision_id": "254165"
 }
]