[
 {
  "author": "scheu", 
  "date": "2002-06-21T18:37:48.000000Z", 
  "msg": [
   "Based on input from Doug Davis and discussions on the chat,", 
   "we decided to allow modification of any Call object.", 
   "The addParameter, setReturnType, and removeAllParameters methods", 
   "will now modify the Call object (without throwing a JAXRPCException)", 
   "regardless of the setting of the parmAndRetReq flag.", 
   "Note that invoking these methods also causes the parmAndRetReq flag to be", 
   "set to true.", 
   "Added the GetQuote1 method that was removed by my last commit.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "254394"
 }, 
 {
  "author": "butek", 
  "date": "2002-06-21T18:28:35.000000Z", 
  "msg": [
   "TCK issue:  bring Service.getPorts up to snuff."
  ], 
  "revision_id": "254393"
 }, 
 {
  "author": "scheu", 
  "date": "2002-06-21T16:49:00.000000Z", 
  "msg": [
   "This fix is required for TCK compliance (Service Test).", 
   "Problem:", 
   "When the Call object is set up via the setOperation(...) method, the", 
   "parmAndRetReq flag was not being set to false.  This caused the", 
   "TCK client to illegally addParameters to an already initialized", 
   "OperationDesc...ultimately causing Call.invoke to thrown an exception.", 
   "Solution:", 
   "When the Call object is set up via the setOperation(...) method, the", 
   "parmAndRetReq flag is now set to false to indicate that the parameters", 
   "and return have been set up.", 
   "This caused a problem in one of the getQuote samples which was attempting", 
   "to reuse a call object (set up via setOperation(...)) to invoke a", 
   "different operation.  Russell and I agreed that this sample method should be", 
   "removed since it is trying to change a Call object which was created", 
   "as immutable.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "254392"
 }, 
 {
  "author": "dims", 
  "date": "2002-06-21T16:35:16.000000Z", 
  "msg": [
   "- Fix for \"all-tests\" failure when xml-security is present.", 
   "- Ability to run just the security tests."
  ], 
  "revision_id": "254391"
 }, 
 {
  "author": "butek", 
  "date": "2002-06-21T14:48:38.000000Z", 
  "msg": [
   "Fixed http://nagoya.apache.org/bugzilla/show_bug.cgi?id=10103", 
   "Java2WSDL didn't work with Holders.  It used to.  It now does again.  And", 
   "this time I've added a method to the roundtrip test to make sure it continues", 
   "to work."
  ], 
  "revision_id": "254390"
 }
]