[
 {
  "author": "butek", 
  "date": "2002-07-31T16:35:57.000000Z", 
  "msg": [
   "Here are the results of the first AXIS 1.0 bugzilla scrub.", 
   "(sorry, Tom, I didn't bother prettying it up with the abstracts.)"
  ], 
  "revision_id": "254684"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T16:26:45.000000Z", 
  "msg": [
   "For the sake of strengthening the ANT checks, I have changed the check.", 
   "In fact, as I thought about it, the REAL check is the ability to run the", 
   "nested <condition> statements, which fails in pre-1.5...."
  ], 
  "revision_id": "254683"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T16:01:17.000000Z", 
  "msg": [
   "Needed to relax the ANT checking", 
   "As it turns out, since version 1.5, the version string contains", 
   "\"Apache Ant version\"", 
   "whereas at the 1.4 level it returned", 
   "\"Ant version\"", 
   "so I checking for this text string, instead of a specific version...."
  ], 
  "revision_id": "254682"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T15:41:15.000000Z", 
  "msg": [
   "Have moved the build.xml file to use the xmls/ fragments for properties,", 
   "classpath, and common targets \"setenv\" and \"printEnv\".", 
   "This drop also \"officially\" moves the AXIS project up to ant 1.5  New", 
   "versions of the ant binaries can be found at", 
   "http://jakarta.apache.org/builds/jakarta-ant/release/v1.5/", 
   "for all of you late comers......", 
   "A quick work on \"setenv\" versus \"printEnv\":", 
   "These are designed for two different purposes.  Many operations need the", 
   "variables set up, but you don't neccessarilly want the full output shown each", 
   "time.  So I split the PRINTING into the printEnv target, which, when called,", 
   "loads up the environment AS WELL AS prints out the data.", 
   "Once this is done (and you are satisfied with the output) you can just call", 
   "\"setenv\" in any given sub-process to load up the environment, without having to", 
   "parse through all of the output from the printing.", 
   "Other than these changes, the build.xml still functions as it always has (i.e. I", 
   "have NOT merged in my buildTest and buildSamples changes with this defect)"
  ], 
  "revision_id": "254681"
 }, 
 {
  "author": "seibert", 
  "date": "2002-07-30T15:35:09.000000Z", 
  "msg": [
   "Added the obligatory copyright and \"love me\" tags to the top of the files to", 
   "establish their purpose, origin, and author."
  ], 
  "revision_id": "254680"
 }
]