[
 {
  "author": "", 
  "date": "2002-07-22T12:43:49.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'pre-javaType-removal'."
  ], 
  "revision_id": "254609"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-07-22T12:43:49.000000Z", 
  "msg": [
   "Fix build, and one of the TODOs.", 
   "Change SerializationContext to take a Boolean instead of a boolean", 
   "for the \"sendTypes\" argument.  This allows three values:", 
   "true - force sending xsi:type regardless of configuration", 
   "false - force no xsi:type regardless of configuration", 
   "null - respect configuration (sendXsiTypes option, etc)"
  ], 
  "revision_id": "254608"
 }, 
 {
  "author": "glyn", 
  "date": "2002-07-22T12:28:47.000000Z", 
  "msg": [
   "Further serialization fixes as provided in Beta2-patches branch."
  ], 
  "revision_id": "254607"
 }, 
 {
  "author": "glyn", 
  "date": "2002-07-22T11:16:28.000000Z", 
  "msg": [
   "Back-port some java serialization changes to ease migration from Apache", 
   "SOAP to Axis beta 2."
  ], 
  "revision_id": "254606"
 }, 
 {
  "author": "gdaniels", 
  "date": "2002-07-22T06:23:02.000000Z", 
  "msg": [
   "Support polymorphic types, which wasn't working.  Fixes:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=9818", 
   "* In SerializationContextImpl, two changes to setTypeAttribute().  First,", 
   "all calls to this are now wrapped with \"if (sendType)\", so assume if", 
   "we're being called at all, we need the type - remove check for", 
   "shouldSendXSIType().  Second, the type is an attribute QName, and", 
   "should thus always be qualified - use attributeQName2String().", 
   "* In RPCParam, don't override the javaType of the actual value unless", 
   "it's null - we want to serialize as the actual type whenever", 
   "possible.  When serializing something that's not an exact match", 
   "for the ParamDesc javaType, *always* send xsi:type, since it's", 
   "a polymorphic overload.", 
   "* Add polymorphism test case (needs a bit of fleshing out, see TODO)", 
   "* Fix ExtensibilityQuery test a bit; we now deserialize without passing", 
   "through an Element stage - don't know why this was the other way,", 
   "but it works now.  This test should be cleaned up and documented.", 
   "* A little cleanup (remove unused imports, etc)", 
   "TODOs for Monday :", 
   "1) Confirm that sendType option works in all cases", 
   "2) Make sure we can serialize child types as the parent type if", 
   "there is NO specific mapping for the child type.", 
   "3) Remove \"deserialize any\" option completely - this functionality", 
   "should just work", 
   "4) Remove dead superclass-walking code in BeanDeserializer"
  ], 
  "revision_id": "254605"
 }
]