[
 {
  "author": "gdaniels", 
  "date": "2002-08-23T23:50:31.000000Z", 
  "msg": [
   "Use MessageElement.getType() to get the type, because...", 
   "1) It automatically searches through to the referent element in case", 
   "this is an href.", 
   "2) It avoids a bug - we used to call getTypeFromAttributes() using", 
   "the current context's namespace mappings and the attributes", 
   "gotten from the referent element, if any.  Well, since our position", 
   "in the XML was that of the href, not the referent, any NS", 
   "mappings in the referent element were NOT in scope, and therefore", 
   "we'd get a null type.", 
   "This allows the namespaces.pop() to go back in, but this system", 
   "in general needs another look in the near future.  For one thing,", 
   "streaming no longer seems to work when switched on, which", 
   "is problematic."
  ], 
  "revision_id": "254919"
 }, 
 {
  "author": "rsitze", 
  "date": "2002-08-23T22:22:30.000000Z", 
  "msg": [
   "New and improved discovery.  Functions to be used in AXIS in near future..."
  ], 
  "revision_id": "254918"
 }, 
 {
  "author": "tomj", 
  "date": "2002-08-23T21:50:48.000000Z", 
  "msg": [
   "Update the wrapped literal logic when creating parameters for stubs to", 
   "match the JAX-RPC RI way of doing things.  In a nutshell:", 
   "If we are dealing with output parameters:", 
   "- wrapped operations \"dig into\" the structure of the returned element", 
   "and return the inner element type IF:", 
   "1) there are no attributes on the \"wrapper\" element", 
   "2) there is a single element inside the \"wrapper\" (the return type)", 
   "- wrapped operations return a bean mapped to the entire return", 
   "element otherwise", 
   "We need tests that test wrapped document/literal services, because I", 
   "don't believe the functional tests cover this area at all.  Since the .NET", 
   "SalesRankAndPrice test went away, we don't test this stuff.. :-("
  ], 
  "revision_id": "254917"
 }, 
 {
  "author": "rubys", 
  "date": "2002-08-23T21:10:54.000000Z", 
  "msg": [
   "Save the JVM the trouble of counting the number of characters in one", 
   "character strings and flushing StringWriters (to where?)"
  ], 
  "revision_id": "254916"
 }, 
 {
  "author": "rubys", 
  "date": "2002-08-23T19:07:19.000000Z", 
  "msg": [
   "Support the new SOAP 1.2 encoding type"
  ], 
  "revision_id": "254915"
 }
]