[
 {
  "author": "dims", 
  "date": "2003-01-02T00:02:42.000000Z", 
  "msg": [
   "Initial check-in for dime/doc Interop GroupG test case.", 
   "Notes:", 
   "- EchoAttachments has the same problem as mime/doc's EchoAttachments."
  ], 
  "revision_id": "255829"
 }, 
 {
  "author": "haddadc", 
  "date": "2003-01-01T22:29:14.000000Z", 
  "msg": [
   "Fix for Bug# 15752.  TypeEntry QName for elements below anonymous elements were being assigned a QName that did not match the QName associated with deserialized elements.  The two lines modified have been in place since the file was created, but this change does not break any functional tests.", 
   "Phase II is to check in a test case that exposes the bugfix.  The test relies on a .NET based service and wsdl definition.  Also, an example of how to deserialize the contents of a strongly typed .NET dataset will be demonstrated."
  ], 
  "revision_id": "255828"
 }, 
 {
  "author": "gdaniels", 
  "date": "2003-01-01T22:21:43.000000Z", 
  "msg": [
   "Don't repeat overloaded method names in allowedMethods"
  ], 
  "revision_id": "255827"
 }, 
 {
  "author": "gdaniels", 
  "date": "2003-01-01T17:45:52.000000Z", 
  "msg": [
   "Fix bugs:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=13146", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=11766", 
   "Be more careful about matching overloaded methods with operations.", 
   "Now if we find a method which works, but only by using conversion,", 
   "we continue scanning to try and find a better match.  This seems to", 
   "clear up the overloaded WSDL generation problems that James Black", 
   "was seeing, and since we only need to do it once, the performance hit", 
   "won't be very noticeable."
  ], 
  "revision_id": "255826"
 }, 
 {
  "author": "haddadc", 
  "date": "2003-01-01T06:19:26.000000Z", 
  "msg": [
   "Tomcat was not loading Axis.jar due to a dependancy on log4j.  Updated the happiness file to check for the existence of the log4j class referenced when Axis is loaded."
  ], 
  "revision_id": "255825"
 }
]