[
 {
  "author": "susantha", 
  "date": "2003-07-21T14:21:09.000000Z", 
  "msg": [
   "Introduced Interfaces to AccessBean, ArrayBean and Param classes for", 
   "1. Making wrapper class API simple", 
   "2. Avoid code duplication in Webservice DLLs (Web service DLLs having its own copy of linked code)"
  ], 
  "revision_id": "256439"
 }, 
 {
  "author": "susantha", 
  "date": "2003-07-21T14:13:30.000000Z", 
  "msg": [
   "Introduced Interfaces to AccessBean, ArrayBean and Param classes for", 
   "1. Making wrapper class API simple", 
   "2. Avoid code duplication in Webservice DLLs (Web service DLLs having its own copy of linked code)"
  ], 
  "revision_id": "256438"
 }, 
 {
  "author": "ericf", 
  "date": "2003-07-20T23:58:37.000000Z", 
  "msg": [
   "Added configuration support to CommonsHTTPSender, making it possible", 
   "to set the size of the connection pool, the number of connections", 
   "allowed per host by the pool, and the timeout on allocating a", 
   "connection from the pool.  All values are identical to the defaults", 
   "of Commons HTTP Client, so there is no change to the existing", 
   "behavior.  The default implementation of the new interface for", 
   "configuring these values reads them from AxisProperties, which fall", 
   "back to system properties, making it possible to configure these", 
   "settings through that mechanism as well.  Connection timeout --", 
   "both in creating the connection and in blocking for socket reads", 
   "-- is derived from the Axis message for a specific request, just", 
   "as it is in the \"regular\" http transport.  This preserves the", 
   "transparent pluggability of the commons http transport option and", 
   "separates the concern of connection timeouts from that of pooled", 
   "resource management.", 
   "None of these files are compiled unless commons-httpclient is present;", 
   "hence the modifications to build.xml", 
   "This enhancement was built against Commons HTTPClient 2.0 beta 2"
  ], 
  "revision_id": "256437"
 }, 
 {
  "author": "ericf", 
  "date": "2003-07-20T23:23:55.000000Z", 
  "msg": [
   "reduced number of threads created in test from 100 to 50;", 
   "at 100 threads, this test fails on a G4 due to socket", 
   "ConnectExceptions that aren't part of what's being tested."
  ], 
  "revision_id": "256436"
 }, 
 {
  "author": "stevel", 
  "date": "2003-07-18T18:13:33.000000Z", 
  "msg": [
   "updating the reference w/ info on encoding"
  ], 
  "revision_id": "256435"
 }
]