[
 {
  "author": "gdaniels", 
  "date": "2003-11-25T07:06:08.000000Z", 
  "msg": [
   "Fix bug 13979.", 
   "Factor out array type configuration for both return and normal ParamDescs.", 
   "When not encoded, default to the base type so wrapped arrays work."
  ], 
  "revision_id": "256994"
 }, 
 {
  "author": "jkumaran", 
  "date": "2003-11-25T06:48:19.000000Z", 
  "msg": [
   "Fixed the bug in the batch file", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "256993"
 }, 
 {
  "author": "gdaniels", 
  "date": "2003-11-25T06:07:03.000000Z", 
  "msg": [
   "Some work on doc/lit array handling, which wasn't working very well.", 
   "Probably needs a bit more work, which I'll do as I work through bugs.", 
   "This improves matters, but in looking at the type mapping code", 
   "and how it has evolved there are some major issues that I think", 
   "we should resolve with a refactoring pass after 1.2....", 
   "* ArraySerializer now keeps track of whether it's currently in", 
   "an encoded context or not (default is yes), and saves a bunch", 
   "of work (figuring out arrayType, etc) if not.  Also, if not", 
   "encoded, we will no longer generate encoded schema!", 
   "* Round4XsdTest was checking exact toString() equivalence when", 
   "QName equivalence is the really important part.", 
   "* Introduce getTypeQNameExact() into TypeMapping, which looks", 
   "through the mapping hierarchy for a deployed type mapping,", 
   "but does NOT do any of the funky array / autoType checking.", 
   "* When generating the return type descriptor in JavaServiceDesc,", 
   "set the XML type to match the component type if the return", 
   "type is a non-encoded array (we end up checking this later in", 
   "ArraySerializer).", 
   "* Comment out autoTyping test checking that the array type", 
   "returned from getTypeQName() was an encoded array type.", 
   "* Allow exceptions to be bubbled up from CityBBBTestCase,", 
   "which lets us actually see any problems instead of masking", 
   "them."
  ], 
  "revision_id": "256992"
 }, 
 {
  "author": "dims", 
  "date": "2003-11-24T21:50:18.000000Z", 
  "msg": [
   "Added test for french accents as well."
  ], 
  "revision_id": "256991"
 }, 
 {
  "author": "gdaniels", 
  "date": "2003-11-24T21:15:16.000000Z", 
  "msg": [
   "Fix a few issues with the last commit  / merge.", 
   "Make FAULT_ON_NO_RESPONSE a property per Steve's suggestion,", 
   "correct a cast, fix copyright statement."
  ], 
  "revision_id": "256990"
 }
]