[
 {
  "author": "tomj", 
  "date": "2004-12-17T19:17:21.000000Z", 
  "msg": [
   "Fix logic error when checking to see if an explicit type mapping has been", 
   "set in the service description that resulted in the default type mapping", 
   "being used instead of the one set explicitly!", 
   "Clean up some unnecessary assignments."
  ], 
  "revision_id": "260139"
 }, 
 {
  "author": "tomj", 
  "date": "2004-12-17T17:34:01.000000Z", 
  "msg": [
   "Update the reference page with the correct dotNetSoapEncFix switch case", 
   "and mention the static variable that can be set via Java.", 
   "Curses to editors that don't automatically save!"
  ], 
  "revision_id": "260138"
 }, 
 {
  "author": "tomj", 
  "date": "2004-12-17T17:00:46.000000Z", 
  "msg": [
   "Add a switch to turn on a preference for XML Schema types: \"dotNetSoapEncFix\"", 
   "This addresses Axis-1467:  http://nagoya.apache.org/jira/browse/AXIS-1467", 
   "This is a global switch which sets a static flag in the TypeMappingImpl class", 
   "and causes it to skip over SOAP encoded types when looking for the QName", 
   "of a Java class.", 
   "Updated the reference guide with the new switch.", 
   "Fix a problem in the JavaServiceDesc class where the type mapping", 
   "used by default (for .JWS files for instance) was not the SOAP encoding", 
   "mapping when use=encoded.  For deployed services, we did use the soapenc", 
   "types if they were encoded.  If someone explicitly sets a type mapping, we", 
   "don't mess around with that."
  ], 
  "revision_id": "260137"
 }, 
 {
  "author": "dicka", 
  "date": "2004-12-17T15:23:27.000000Z", 
  "msg": [
   "Small adjustment to ANT initializing script, to allow the use of \"-Ddir.properties=[...]\" to point at a seperate set of properties outside the CVS tree.  Allowing developers to keep their machine specific property files seperately.", 
   "Submitted by: Adrian Dick"
  ], 
  "revision_id": "260136"
 }, 
 {
  "author": "hawkeye", 
  "date": "2004-12-17T13:29:33.000000Z", 
  "msg": [
   "Created this build file which keeps ws-axis/site, ws-site and ws-axis/c/docs in-step"
  ], 
  "revision_id": "260135"
 }
]