[
 {
  "author": "dims", 
  "date": "2005-02-25T03:28:01.000000Z", 
  "msg": [
   "remove unnecessary typecasting"
  ], 
  "revision_id": "260809"
 }, 
 {
  "author": "cblecken", 
  "date": "2005-02-25T02:18:48.000000Z", 
  "msg": [
   "Complex Array was only returning one element. The logic removed", 
   "will advance the node one too much and will close out the array", 
   "detection logic leaving only one element of the array.", 
   "PR: AXISCPP-197", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:\tS.Cherukuri"
  ], 
  "revision_id": "260808"
 }, 
 {
  "author": "gdaniels", 
  "date": "2005-02-24T21:59:56.000000Z", 
  "msg": [
   "* Re-do delegation logic.  There were various problems as a result", 
   "of TypeMappingImpls being both the repository for mappings and", 
   "also the links on delegation chains themselves.  Now TypeMappingImpl", 
   "is purely an internal functional class, and all accesses to", 
   "TypeMappings from the outside use TypeMappingDelegates (which", 
   "might now be better named TypeMappingProxy).  A TypeMappingDelegate", 
   "is responsible for a) delegating all functionality to the", 
   "TypeMappingImpl it points to, and b) maintaining the link to the", 
   "next TypeMappingDelegate in a scoping chain.  This lets us be", 
   "more flexible about connecting them together.  If I have", 
   "SOAPENC and default mappings in TMR1 and delegate to TMR2, the", 
   "order is TMR1[soapenc]->TMR2[soapenc]->TMR1[default]->tmr2[default]", 
   "* Create TypeMappingDelegates not TypeMappingImpls wherever needed", 
   "* Centralize all the type mapping version code in the TMR.", 
   "* Rejigger the Emitters (from/to Java) - instead of having a separate", 
   "default type mapping, just use a TypeMappingRegistry which", 
   "will have its own defaults built in.  This means that the TM we", 
   "use will be able to do defaulting itself.", 
   "* Use consistent type mapping versions in addrImplNoSEI/build.xml", 
   "* Use consistent type mapping versions in roundtrip2/build.xml", 
   "(wsdl2java needs to be consistent with java2wsdl)", 
   "* Various tweaks to tests to accommodate above changes", 
   "* Don't block exceptions in JAXRPCSamples test", 
   "* Still have some cleanup to do, and right now we're creating way", 
   "too many instances of TypeMappingImpls.  Next step is to change", 
   "it so that only the engine-level TMRs contain the SOAP encoding", 
   "mappings, and subsidiary TMRs (for services) only contain default", 
   "mappings if they specify a \"typeMappingVersion\" different from", 
   "that of the engine."
  ], 
  "revision_id": "260807"
 }, 
 {
  "author": "perryan", 
  "date": "2005-02-24T21:18:33.000000Z", 
  "msg": [
   "New test to test serialization and deserialization of xsd types as attributes"
  ], 
  "revision_id": "260806"
 }, 
 {
  "author": "prestonf", 
  "date": "2005-02-24T17:02:33.000000Z", 
  "msg": [
   "Hi All,", 
   "I think this will complete what needs to be done for AXISCPP-478.", 
   "Regards,", 
   "Fred Preston."
  ], 
  "revision_id": "260805"
 }
]