[
 {
  "author": "dicka", 
  "date": "2005-06-17T08:11:16.000000Z", 
  "msg": [
   "Resolve problem in WSDL2Ws causing NullPointerExceptions when processing XSDAttribute testcase.", 
   "Also fix small problem this uncovered in InOut client testcase.", 
   "PR: AXISCPP-701", 
   "Submitted by: Adrian Dick"
  ], 
  "revision_id": "261544"
 }, 
 {
  "author": "prestonf", 
  "date": "2005-06-16T16:26:06.000000Z", 
  "msg": [
   "This cures AXISCPP-697"
  ], 
  "revision_id": "261543"
 }, 
 {
  "author": "whitlock", 
  "date": "2005-06-16T15:59:44.000000Z", 
  "msg": [
   "More attachments fixes.", 
   "Add two dashes to the start of each mime boundary and to the end of the last mime boundary.", 
   "Add in dummy DynamicAttachment unit test", 
   "Test request message for the DynUnrefAttachmentTest"
  ], 
  "revision_id": "261542"
 }, 
 {
  "author": "jayachandra", 
  "date": "2005-06-16T15:48:52.000000Z", 
  "msg": [
   "This is with reference to jira issue 2059. Please once see http://issues.apache.org/jira/browse/AXIS-2059.", 
   "Looks like in the resolveNameClashes method of JavaGeneratorFactory, there is a mention of this particular common special case. By and large, things are taken care of but... when two names are clashing (note v.size() == 2 in line#1031 of JavaGeneratorFactory.java) and they correspond to the names of a type and an element, before deciding if resolution is not needed currently a check is performed if both the *qnames* of colliding element and type are equal or not. This QName exact match forces that, if same names are being used, an element can reference a type present only in its namespace. However as long as there is overall uniqueness amongst all the existing wsdl types, a type with the same name as that of element but from a different schema namespace can also be used as a reference for the element (as is the case described in the sample.wsdl provided here). Hence, I believe, this qname check should not be present.", 
   "ant all-tests is verified before committing the patch."
  ], 
  "revision_id": "261541"
 }, 
 {
  "author": "whitlock", 
  "date": "2005-06-16T15:06:09.000000Z", 
  "msg": [
   "Create expected request message for DynUnrefAttachmentTest"
  ], 
  "revision_id": "261540"
 }
]