[
 {
  "author": "whitlock", 
  "date": "2005-07-08T10:56:18.000000Z", 
  "msg": [
   "Avoid using memset on an array of objects. Instead create a vanilla object initialised to its default values and assign each object in this array to this vanilla object."
  ], 
  "revision_id": "261654"
 }, 
 {
  "author": "whitlock", 
  "date": "2005-07-08T09:57:57.000000Z", 
  "msg": [
   "when deserializing a field that's a complex array, in the code that copies the array, memset the old array to zero before deleting it, otherwise the referenced complex type's destructor will free it's strings causing AxisBench and others to fail."
  ], 
  "revision_id": "261653"
 }, 
 {
  "author": "cdinapala", 
  "date": "2005-07-08T08:50:17.000000Z", 
  "msg": [
   "Add new test for unit test suit."
  ], 
  "revision_id": "261652"
 }, 
 {
  "author": "cdinapala", 
  "date": "2005-07-08T07:34:46.000000Z", 
  "msg": [
   "Add new test for unit test suit."
  ], 
  "revision_id": "261651"
 }, 
 {
  "author": "cblecken", 
  "date": "2005-07-08T00:54:33.000000Z", 
  "msg": [
   "Make memory deallocation consistent with other base types.", 
   "(not here but in the stub/client program)", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tC.Blecken", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "261650"
 }
]