[
 {
  "author": "venkat", 
  "date": "2005-07-13T06:05:11.000000Z", 
  "msg": [
   "Fix for AXIS-1667 - Minor changes for making the multi-line comments for member fields and accessor methods pretty and aligned."
  ], 
  "revision_id": "261694"
 }, 
 {
  "author": "cblecken", 
  "date": "2005-07-12T22:17:16.000000Z", 
  "msg": [
   "Suppress irrelevant warning on MSVC7", 
   "PR:", 
   "Obtained from: John Kelly", 
   "Submitted by:\tCarsten Blecken", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "261693"
 }, 
 {
  "author": "dicka", 
  "date": "2005-07-12T18:10:06.000000Z", 
  "msg": [
   "Resolve problems being seen on AIX with xsd:byte.", 
   "Also found a small problem in the testcase, which has incorrect value in server response and expected output.", 
   "Submitted by: Adrian Dick"
  ], 
  "revision_id": "261692"
 }, 
 {
  "author": "dicka", 
  "date": "2005-07-12T17:45:37.000000Z", 
  "msg": [
   "Resolve problem with incorrect output for unsignedLong when on AIX.", 
   "Submitted by: Adrian Dick"
  ], 
  "revision_id": "261691"
 }, 
 {
  "author": "dims", 
  "date": "2005-07-12T14:04:40.000000Z", 
  "msg": [
   "Fix for AXIS-2084 - Dime attachements: Type_Length of the final record chunk must be zero"
  ], 
  "revision_id": "261690"
 }
]