[
 {
  "author": "duftler", 
  "date": "2001-02-10T14:51:27.000000Z", 
  "msg": [
   "Notes from Bill's email to the list:", 
   "Hi guys.  I've run into a problem with the SOAP code during the", 
   "dynamic loading of classes for providers and service implementations.", 
   "If the soap.jar file is loaded with the default classloader (such as", 
   "by being specified on the CLASSPATH) but the execution environment has", 
   "a different classloader, the SOAP code won't be able to load user", 
   "classes which implement providers and services.  I've run into the", 
   "same problem before with other code based upon reflection and", 
   "environments like the Java plugin which have their own classloaders,", 
   "and the simple fix has always been to modify the code to use the", 
   "classloader that the operational portion was loaded with.  In the SOAP", 
   "case, this means that the classloader which loaded the servlets (in", 
   "the case of HTTP) should be used to load any additional classes as", 
   "well.  I've made the necessary fixes to my version, tested everything", 
   "out, and it seems to work fine.  I've included the patches below, and", 
   "would appreciate it, assuming that no one has any complaints, if", 
   "someone would check them in.", 
   "Submitted by:\tBill Nagy"
  ], 
  "revision_id": "262164"
 }, 
 {
  "author": "duftler", 
  "date": "2001-02-09T14:26:46.000000Z", 
  "msg": [
   "Added leading slashes to <url-pattern>s in web.xml"
  ], 
  "revision_id": "262163"
 }, 
 {
  "author": "duftler", 
  "date": "2001-02-08T23:00:38.000000Z", 
  "msg": [
   "Further cleanup to toXML():", 
   "The closing '>' of <isd:mappings> was being printed on the next line."
  ], 
  "revision_id": "262162"
 }, 
 {
  "author": "duftler", 
  "date": "2001-02-08T22:09:41.000000Z", 
  "msg": [
   "Changed printing of <isd:faultListener> in toXML(...) to look like the", 
   "rest of the deployment descriptor."
  ], 
  "revision_id": "262161"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-02-06T16:19:30.000000Z", 
  "msg": [
   "Avoid NullPointerException when passing a null to the serializer.", 
   "Fix submitted by: Andrzej Bialecki [abial@webgiro.com]"
  ], 
  "revision_id": "262160"
 }
]