[
 {
  "author": "duftler", 
  "date": "2001-05-23T15:38:30.000000Z", 
  "msg": [
   "Moved the FAQs back to the web-site. This way, they can be kept up to date.", 
   "There will be links added to the documentation pointing back to the", 
   "web-site."
  ], 
  "revision_id": "262299"
 }, 
 {
  "author": "duftler", 
  "date": "2001-05-23T14:57:04.000000Z", 
  "msg": [
   "More updates from Bill, and an additional SMTP FAQ from Jonathan Chawke.", 
   "Submitted by: Bill Nagy and Jonathan Chawke", 
   "Reviewed by: Matthew J. Duftler"
  ], 
  "revision_id": "262298"
 }, 
 {
  "author": "duftler", 
  "date": "2001-05-22T22:24:52.000000Z", 
  "msg": [
   "Added a few changes."
  ], 
  "revision_id": "262297"
 }, 
 {
  "author": "duftler", 
  "date": "2001-05-22T21:59:16.000000Z", 
  "msg": [
   "Removed patch that was intended to get this code to work with Xerces 1.3.1.", 
   "The code still doesn't work with 1.3.1. Xerces 1.3.1 has known", 
   "bugs which cause it to return \"\", instead of null, when a namespace", 
   "is not specified for an element (or an attribute). This change to", 
   "the code caused the client to accept a fault coming back from the", 
   "server, but did nothing to address the reason for the fault. The", 
   "reason the server threw the fault to begin with is because Xerces", 
   "wasn't handling namespaces properly. Once the fault was accepted, you", 
   "would see its content, which was usually something like: Unable to resolve", 
   "namespaceURI for 'ns2'. Since both the non-acceptance of the fault,", 
   "and the cause of the fault in the first place, are related to the same", 
   "Xerces bug(s), if we are going to do a workaround to enable this code", 
   "to work with Xerces 1.3.1, we need to do it everywhere; there are 9", 
   "places where we call getNamespaceURI(...). The code works with a nightly", 
   "build of Xerces (since they fixed the bug), so there is no reason to", 
   "keep this change in there. I posted a message asking if anybody actually has", 
   "Xerces 1.3.1 working with any version of Apache SOAP v2.1 or higher", 
   "(nightly builds included), and only one person responded that he does.", 
   "After some more checking, it was determined that a different", 
   "JAXP-compliant parser was actually being used. So, I can't find anybody", 
   "who actually has Xerces v1.3.1 and Apache SOAP working together, on both", 
   "the client and the server. If somebody can show that that patch really", 
   "let them get the two working, then we can address it further."
  ], 
  "revision_id": "262296"
 }, 
 {
  "author": "duftler", 
  "date": "2001-05-22T20:03:20.000000Z", 
  "msg": [
   "Added one extra step to SOAPContext.setClassLoader(ClassLoader) method."
  ], 
  "revision_id": "262295"
 }
]