[
 {
  "author": "dug", 
  "date": "2001-03-22T18:18:23.000000Z", 
  "msg": [
   "Updating the com provider sample", 
   "Submitted by Rick Rineholt: rineholt@us.ibm.com"
  ], 
  "revision_id": "262204"
 }, 
 {
  "author": "dug", 
  "date": "2001-03-20T18:39:48.000000Z", 
  "msg": [
   "Update tomcat install doc", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "262203"
 }, 
 {
  "author": "jmsnell", 
  "date": "2001-03-19T17:16:13.000000Z", 
  "msg": [
   "Fixing the build"
  ], 
  "revision_id": "262202"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-03-19T06:47:43.000000Z", 
  "msg": [
   "Fix path typo, and a few readability updates."
  ], 
  "revision_id": "262201"
 }, 
 {
  "author": "gdaniels", 
  "date": "2001-03-19T06:20:52.000000Z", 
  "msg": [
   "A few changes to interop better with Microsoft SOAP stacks,", 
   "and also heading towards friendlier behaviour in general.", 
   "* We now deserialize (but don't generate) multi-ref accessors.", 
   "Check for the \"href\" attribute in a number of places, and", 
   "deserialize the referenced element instead of the ref", 
   "itself.  This required putting in DOMUtils.getElementByID(),", 
   "which really should be dealt with by Xerces, but wasn't", 
   "working.  If we can get the DOM version working, we can lose", 
   "the DOMUtils one, but this works for now, and we'll get", 
   "this nailed for Axis anyhow.", 
   "* First slice at dealing with multiple Schema URIs.  Mostly", 
   "changes to Constants and SOAPMappingRegistry - we now will", 
   "happily ACCEPT schema types with either the 1999 schema", 
   "URIs or the 2000/10 ones.  We SEND by default whatever the", 
   "Constants.NS_URI_CURRENT_SCHEMA values say.  In the future", 
   "we should a) be able to set our \"default\" schema on the fly,", 
   "b) correctly respond with whatever schema URIs we were", 
   "called with (for the server side), and c) easily deal with", 
   "new schema revs if they happen.  NOTE: this needs to be", 
   "consistency-checked with the 1999 and 2000 XSD specs.", 
   "* There is now a new optional attribute in the deployment", 
   "descriptor XML - if \"checkMustUnderstands='true'\" in the", 
   "isd:service element, we are being told by the deployer", 
   "that no header processing is done by this service.  In", 
   "this case, to be a good SOAP citizen, we do a quick check", 
   "for any headers marked \"mustUnderstand='1'\" in any messages", 
   "we receive, and throw a MustUnderstand fault if we find any.", 
   "* Add a read(String sourceDesc, InputStream inStream) method", 
   "to XMLParserLiason and XercesParserLiason.  This can be used", 
   "to hand an InputStream directly to the parser, which will", 
   "then happily consume byte-order marks; this is currently", 
   "not the case with the Reader-based system.  I did not check", 
   "in the actual code to use this yet, as I don't fully grok its", 
   "effect on the MIME processing code.", 
   "* Add a default encoding style to the SOAPMappingRegistry.  If", 
   "the query*() methods are called with a null encodingStyle", 
   "(you aren't technically required to send one), we'll try", 
   "whatever this is set to.  Right now the RPC code sets this", 
   "to SOAP_ENC."
  ], 
  "revision_id": "262200"
 }
]