[
 {
  "author": "snichol", 
  "date": "2002-07-26T04:48:29.000000Z", 
  "msg": [
   "Based on a submission by Raj Yellapragada (rajaism@yahoo.com).", 
   "Add the ability to select between parsing XML using a", 
   "DocumentBuilder versus a Transform from a SAXSource to a", 
   "DOMResult on a per-Call basis.  This is on the client only.", 
   "While I have used the basic method provided by Raj, I made", 
   "two changes:", 
   "1. Rather than always using the Transform, I have made it selectable.", 
   "I am hoping this will encourage experimentation while providing a", 
   "known stable base for the more risk-averse.", 
   "2. Use reflection to access the JAXP classes not in javax.xml.parsers.", 
   "This means the code will not break in environments where folks have,", 
   "e.g., Xerces in their CLASSPATH, but not Xalan.", 
   "If this technique proves to improve performance, it would make sense", 
   "to have it available on the server side as well, possibly moving code", 
   "into XMLParserUtils."
  ], 
  "revision_id": "262449"
 }, 
 {
  "author": "snichol", 
  "date": "2002-07-22T21:20:39.000000Z", 
  "msg": [
   "Use just the local part of the XML element name as the parameter name and", 
   "for lookups, rather than the full tag name."
  ], 
  "revision_id": "262448"
 }, 
 {
  "author": "sanjiva", 
  "date": "2002-07-22T17:59:06.000000Z", 
  "msg": [
   "made it so that a parser is created only when needed. The Call() object", 
   "was creating a parser even when the Call was being used on the server", 
   "side."
  ], 
  "revision_id": "262447"
 }, 
 {
  "author": "snichol", 
  "date": "2002-07-11T22:03:11.000000Z", 
  "msg": [
   "Check for the use of the Netscape Expires attribute which is *not* in any RFC", 
   "and does not escape its embedded comma by using quotes.  (Presumably,", 
   "any Set-Cookie header that includes this attribute contains only one", 
   "cookie.)"
  ], 
  "revision_id": "262446"
 }, 
 {
  "author": "snichol", 
  "date": "2002-07-11T15:45:54.000000Z", 
  "msg": [
   "Remove deadlock for a service that in the constructor invokes", 
   "another service when both services are at application scope.  The", 
   "deadlock still occurs if both services are at session scope.", 
   "Based on a technique submitted by Adam Moore (moore@ipsi.fhg.de)."
  ], 
  "revision_id": "262445"
 }
]