[
 {
  "author": "snichol", 
  "date": "2002-06-28T02:33:17.000000Z", 
  "msg": [
   "Enhance multi-reference deserialization by only deserializing", 
   "the object once, regardless of the number of references.  Provide", 
   "initial support for multi-reference serialization.  The new", 
   "BeanMultiRefSerializer is the only serializer for which", 
   "multi-reference serialization is supported.  Added a sample to", 
   "demonstrate serialization and deserialization of a cyclic graph", 
   "of beans."
  ], 
  "revision_id": "262439"
 }, 
 {
  "author": "snichol", 
  "date": "2002-06-26T11:39:52.000000Z", 
  "msg": [
   "In the absence of an xsi:type attribute, check the element", 
   "namespace URI for SOAP-ENC to imply a type.  For now, just", 
   "support SOAP-ENC:Array.  This allows interop with .NET arrays", 
   "without a type mapping."
  ], 
  "revision_id": "262438"
 }, 
 {
  "author": "snichol", 
  "date": "2002-06-25T21:23:53.000000Z", 
  "msg": [
   "As submitted by Arek Wnukowski (apache@wnuko.demon.co.uk):", 
   "Allows the caller to provide buffers in which to capture", 
   "request and response data.  This is useful when debugging SSL, as", 
   "wire dumps are not very useful in that case.  However, it is important", 
   "to note that the bytes send or received are optimistically handled", 
   "with the default encoding, much as TcpTunnelGui treats everything", 
   "as iso-8859-1."
  ], 
  "revision_id": "262437"
 }, 
 {
  "author": "snichol", 
  "date": "2002-06-25T05:29:19.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "Add a paragraph about the new service configuration capability to the docs."
  ], 
  "revision_id": "262436"
 }, 
 {
  "author": "snichol", 
  "date": "2002-06-25T05:16:27.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "Provide an interface, such that if a service implements it, the service will", 
   "have an interface method called upon instantiation to enable the service to", 
   "configure itself.  This was a TODO list item.  A sample tests and demonstrates", 
   "the use of this feature.  Two minor doc changes made along the way are here, too."
  ], 
  "revision_id": "262435"
 }
]