[
 {
  "author": "snichol", 
  "date": "2002-12-10T17:33:40.000000Z", 
  "msg": [
   "Submitted by: Leif Nilsson TACMa <leni@tac.se>", 
   "We send XML-files through Apache Soap.", 
   "There is a COM-server accessed via Apaches COMProvider.", 
   "The best way to send files as discussed is through attachments.", 
   "The only way I have figured out to do this via the ComProvider is to alter", 
   "the", 
   "org.apache.soap.providers.com.RPCProvider.java code.", 
   "I'm sure there is a better way but I will explain what I have done.", 
   "I have added an option for the COmProvider DeploymentDescriptor", 
   "(AttachString), which if present and set to true will cause", 
   "Strings returned from COM-servers to be packaged in a DataHandler object", 
   "using UTF-8 coding.", 
   "Scott Nichol added a few mods, including changing the option name to have", 
   "a leading Upper case character."
  ], 
  "revision_id": "262569"
 }, 
 {
  "author": "snichol", 
  "date": "2002-12-04T03:33:01.000000Z", 
  "msg": [
   "Serialize method return values using their actual type rather than", 
   "the declared type when the declared type is not a primitive.  This may", 
   "break existing services, e.g. where methods return subclasses of the", 
   "declared return type, but a serializer is registered only for the", 
   "declared return type."
  ], 
  "revision_id": "262568"
 }, 
 {
  "author": "snichol", 
  "date": "2002-12-03T21:16:52.000000Z", 
  "msg": [
   "Add use of request/response copy buffers."
  ], 
  "revision_id": "262567"
 }, 
 {
  "author": "snichol", 
  "date": "2002-12-03T21:16:08.000000Z", 
  "msg": [
   "Fix bug in one of the post methods in which the copy buffers were not being", 
   "passed along."
  ], 
  "revision_id": "262566"
 }, 
 {
  "author": "snichol", 
  "date": "2002-12-03T17:45:11.000000Z", 
  "msg": [
   "Only set Xerces-specific features if we believe we are using a Xerces", 
   "factory.  Rather than throwing an exception when a feature is set on the", 
   "factory, parsers throw when a parser is actually instantiated, which is", 
   "a problem.", 
   "Thanks to Pavel for finding this problem and suggesting the fix."
  ], 
  "revision_id": "262565"
 }
]