[
 {
  "author": "snichol", 
  "date": "2002-11-27T02:49:30.000000Z", 
  "msg": [
   "Use Envelope.LINE_SEPARATOR for all line separators in XML serialization of", 
   "SOAP envelope, including XML declaration."
  ], 
  "revision_id": "262559"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-27T02:39:56.000000Z", 
  "msg": [
   "Add -9 and -0 options to PropertyBagClient to specify the use of 1999 or", 
   "2000 schemas.", 
   "Fix misspelling in configure deployment descriptor."
  ], 
  "revision_id": "262558"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-27T02:36:08.000000Z", 
  "msg": [
   "Where possible, use SOAPMappingRegistry#getSchemaURI rather than", 
   "Constants#NS_URI_CURRENT_SCHEMA_XSD, so that, e.g., a Call serialized", 
   "using a SOAPMappingRegistry based on the 1999 schema will serialize", 
   "properly."
  ], 
  "revision_id": "262557"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-21T16:45:08.000000Z", 
  "msg": [
   "Provide more feedback."
  ], 
  "revision_id": "262556"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-21T16:36:58.000000Z", 
  "msg": [
   "1. Disable lazy expansion of DOM nodes for Xerces.", 
   "2. Push XML parsing into XMLParserUtils, so that clients (a) need not be", 
   "aware of pooling, (b) don't carry around their own DocumentBuilder", 
   "instances (which affects which pooling algorithms can be used), and (c)", 
   "can benefit from any parsing improvements, such as the use of transforms", 
   "or parser-specific options.  The servlets still get and return instances", 
   "from the pools, but that may be removed with time, as well.", 
   "3. Use more restrictive import statements for the util.xml package as part", 
   "of the general move toward explicit specification of which classes are", 
   "imported.", 
   "4. Add comments in the servlets regarding how \"optimistic\" it is to think", 
   "that the parser specified in the servlet config will be the one actually", 
   "used, since this can be set from any piece of code.  It is currently set", 
   "up as \"last servlet to load wins\" if only servlet loading sets this."
  ], 
  "revision_id": "262555"
 }
]