[
 {
  "author": "snichol", 
  "date": "2002-11-20T22:27:10.000000Z", 
  "msg": [
   "Remove get/setDocLitSerialization from Call.  Clients should just set", 
   "this directly on SOAPContext."
  ], 
  "revision_id": "262554"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-20T21:54:25.000000Z", 
  "msg": [
   "Submitted by: Pavel Ausianik <Pavel_Ausianik@epam.com>", 
   "Please see what I propose to solve problem with many allocated", 
   "DocumentBuilders.", 
   "Other classes were DocumentBuilder is used can be easily adopted in the same", 
   "way as Call is.", 
   "See thread at http://marc.theaimsgroup.com/?l=soap-dev&m=103582304223623&w=2", 
   "for discussion of document builder pooling."
  ], 
  "revision_id": "262553"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-20T21:34:42.000000Z", 
  "msg": [
   "Submitted by: Pavel Ausianik <Pavel_Ausianik@epam.com>", 
   "thinking more on the current code I have found interesting", 
   "thing. Most requests we have a simple, straight SOAP envelopes, without any", 
   "attachments. Looking how it is processed I have found  following (traced", 
   "from httpconnection):", 
   "In SOAPHTTPConnection.send() we call TransportMessage.save().", 
   "Let's look into it (see my comment how I understand it...", 
   "Seems like we are doing wonderful job of running a lot unnecessary", 
   "operations,  involving a lot of memory allocations... It could be most", 
   "advanced improvement we ever done!", 
   "I think I managed make it compatible to existing code and yet still", 
   "much faster (8-10 sec of 60 I had in the morning ). The Mime", 
   "part will be created as soon as it requested, otherwise plain Envelope used", 
   "Also I set up initial buffer in couple of classes..."
  ], 
  "revision_id": "262552"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-20T07:56:02.000000Z", 
  "msg": [
   "Add type mappings for a <Result> element.  I don't know whether the round 2", 
   "WSDL has changed or some implementers are changing their round 2 endpoints", 
   "according to WSDL for later rounds, but several implementations now do this", 
   "for at least some of the methods."
  ], 
  "revision_id": "262551"
 }, 
 {
  "author": "snichol", 
  "date": "2002-11-20T07:29:32.000000Z", 
  "msg": [
   "Fix reading of message for which no content length is specified."
  ], 
  "revision_id": "262550"
 }
]