[
 {
  "author": "cziegeler", 
  "date": "2003-11-12T10:39:06.000000Z", 
  "msg": [
   "Adding some info about the new portal"
  ], 
  "revision_id": "26344"
 }, 
 {
  "author": "sylvain", 
  "date": "2003-11-11T21:57:18.000000Z", 
  "msg": [
   "Consider as an error calls not sending a response + some code cleanup"
  ], 
  "revision_id": "26343"
 }, 
 {
  "author": "joerg", 
  "date": "2003-11-11T17:49:01.000000Z", 
  "msg": [
   "fixed formatting issues after applying bug 24463: the prices must not be formatted by JEXL or JXPath, but only in the stylesheet"
  ], 
  "revision_id": "26342"
 }, 
 {
  "author": "crossley", 
  "date": "2003-11-11T12:15:30.000000Z", 
  "msg": [
   "Complete overhaul of the Petstore sample. Adding Woody form processing Flow,", 
   "and dealing with persistent data. Implementation of missing or unfinished parts.", 
   "See the the bug report and its attached notes.", 
   "PR: 24463", 
   "Submitted by: Leo Leonid tek<AT>leonid.de"
  ], 
  "revision_id": "26341"
 }, 
 {
  "author": "crossley", 
  "date": "2003-11-11T12:09:53.000000Z", 
  "msg": [
   "* All form processing is now done by Woody.", 
   "* Removed all unused stuff and all traces of previous form handling attempts.", 
   "* Major concerns of this update have been Woody form processing Flow, and also", 
   "dealing with persistent data.", 
   "* Added Implementations of missing or unfinished parts: user registration,", 
   "sign in, edit account data, commit new orders, view all orders that they ever", 
   "committed...", 
   "* Main menu fixed. Category names are now correctly displayed by using images.", 
   "* Created missing error pages for jexl-, jxpath- and xsp-view (sent when", 
   "searching without a keyword).", 
   "* Improved view-selector. Indicates (read only) also when woody is active", 
   "presenting the view.", 
   "* Welcome [user] message is now displayed correctly in all views when a user", 
   "has logged in.", 
   "* Added a reader for jpeg images.", 
   "* Fixed the problem with escaped HTML markup from the DB: Images of the", 
   "item- and search-screens show up properly now.", 
   "* Fixed omitted productId in jexl and jxpath views.", 
   "* Added new column 'Total Cost' to all Carts displaying", 
   "quantity * Unitprice of an Item.", 
   "* Description fields now show up correctly when searching with jexl view.", 
   "* Fixed a problem with JXPathException on some pages e.g. searchProducts when", 
   "complaining about having no value for xpath accountForm/signOn", 
   "* Fixed bug with <<Previous | Next>> navigation of the search page, where", 
   "clicking \"next\" always resent you the same results.", 
   "* See other notes at the Bugzilla report.", 
   "* Now depends on blocks: hsqldb, velocity, woody", 
   "PR: 24463", 
   "Submitted by: Leo Leonid tek<AT>leonid.de"
  ], 
  "revision_id": "26340"
 }
]