[
 {
  "author": "jmitchell", 
  "date": "2005-08-30T23:45:58.849923Z", 
  "msg": [
   "With this commit, we pretty much have a descent multiproject Maven build to work with.", 
   "I don't know everyone's routine (code/deploy/test cycle), but I think I've encapsulated most of what everyone wants.", 
   "Here are my changes:", 
   "* Add a few entries to the ignore prop", 
   "* Fix maven includes/excludes to correctly ignore the example sub directory (can we just remove it?)", 
   "* Reorder and (somewhat) label the build dependencies", 
   "* Complete many of the typical targets needed for code/test development", 
   "* Add example tomcat.home entry required for running cactus tests (none created yet, but that'll change shortly)", 
   "All of the targets in maven.xml have been tested, cleaned and checked for completeness.", 
   "The only issues I can think of now are how we deal with allowing 1.4 and 1.5 to build this thing.", 
   "Also, the Maven cactus plugin is having an issue with the fact that I want the cactus test to run on Tomcat 5.5.11.  I'm getting an error saying \"jakarta-tomcat-5.5.11 not recognized as a Tomcat 4.x installation\".", 
   "With the exception of the velocity log and the jcoverage serialized file (jcoverage.ser), all directories and files that are created during any of the build targets are correctly cleaned.  If you add targets or enhance the current ones, please verify this still works."
  ], 
  "revision_id": "264894"
 }, 
 {
  "author": "rgardler", 
  "date": "2005-08-30T23:33:03.510381Z", 
  "msg": [
   "add some div id's so we can use forrest:templates to display info"
  ], 
  "revision_id": "264893"
 }, 
 {
  "author": "rgardler", 
  "date": "2005-08-30T23:32:25.444685Z", 
  "msg": [
   "add a couple of forrest:templates to display sections of the resumes"
  ], 
  "revision_id": "264892"
 }, 
 {
  "author": "ammulder", 
  "date": "2005-08-30T23:25:18.139032Z", 
  "msg": [
   "List the publisher, same as the others"
  ], 
  "revision_id": "264891"
 }, 
 {
  "author": "bckfnn", 
  "date": "2005-08-30T23:03:19.164472Z", 
  "msg": [
   "Fixed the use of Length property for baseline-shift."
  ], 
  "revision_id": "264890"
 }
]