[
 {
  "author": "ate", 
  "date": "2005-08-31T19:55:50.397772Z", 
  "msg": [
   "Gridsphere 2.0.5 provides Struts Bridge natively"
  ], 
  "revision_id": "265564"
 }, 
 {
  "author": "dolander", 
  "date": "2005-08-31T19:47:22.099721Z", 
  "msg": [
   "Finish up the Repeating Form Controls topic"
  ], 
  "revision_id": "265563"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-08-31T19:37:55.035524Z", 
  "msg": [
   "Implement a JavaBean replacement for the XMLBean Document based NetuiConfigDocument model for turning knobs in Beehive.", 
   "This change just adds the JavaBeans that are used for configuration but leaves in place the XMLBeans so that it's possible to make this change in two parts.  The JavaBean layer isn't used for anything now but a JUnit test that ensures the correct application of default values.", 
   "The conventions followed here are:", 
   "- o.a.b.n.u.c.bean package contains *Config classes that have two constructors.  A default, no-args constructor for those JavaBeans that must *always* be available for configuration because they provide some sort of default value.  And, a constructor that takes all of the property values available through the JavaBean.", 
   "- XSD enums have been replaced with JDK 5 / XMLBean like enumeration types, for example PreventCache, DocType, etc.", 
   "- the ConfigUtil class has been changed to allow for a pluggable ConfigFactory class.  There is an XmlBeanConfigFactory class that provides an implementation to convert the XMLBean to the NetUIConfig JavaBean.", 
   "Also included here are changes that:", 
   "- rename netui-config.xsd to beehive-netui-config.xsd.  This was just an addition of \"beehive-\" to the file's name", 
   "- move all of the source files in src/core, src/tags, src/pageflow off of the old XMLBean package and onto the new package", 
   "- repackage the generated XMLBean from o.a.b.n.u.c.bean.* to o.a.b.n.u.c.internal.xmlbean.generated.*.  This better isolates the XMLBean dependencies.", 
   "- add an XmlBeanConfigFactory class that creates a NetUIConfig object from the XMLBean", 
   "- there are also some cosmetic changes that remove some of the hierarchy necessitated by XMLBeans to accurately represent XML.  For example, an array of TypeConverter objects is directly available from the NetUIConfig object now.", 
   "And, of course, a JUnit test that just makes sure the basics work:", 
   "- netui/test/src/junitTests in o.a.b.n.t.u.c.ConfigBeanTest", 
   "Once we've agreed that this is a good approach, we can start migrating off of NetuiConfig and onto the new JavaBeans.  In doing that, we'll need to remove some of the APIs on ConfigUtil and ConfigFactory that support fetching both the XMLBean and the JavaBean.", 
   "BB: self", 
   "DRT: NetUI pass"
  ], 
  "revision_id": "265562"
 }, 
 {
  "author": "sgala", 
  "date": "2005-08-31T19:34:56.714284Z", 
  "msg": [
   "more well-formedness stuff"
  ], 
  "revision_id": "265561"
 }, 
 {
  "author": "rdonkin", 
  "date": "2005-08-31T19:33:44.088161Z", 
  "msg": [
   "Added redirect for old axis releases"
  ], 
  "revision_id": "265560"
 }
]