[
 {
  "author": "jeremias", 
  "date": "2005-09-02T14:26:31.018103Z", 
  "msg": [
   "Initial work on enhancing the extension facilities to register special extensions which create so-called ExtensionAttachment objects which are attached to the formatting object they are attached to. These objects can be evaluated by standard or custom layout managers or simply passed through to the area tree (the latter is NYI). The AreaTreeHandler currently takes ExtensionAttachment objects from fo:root and fo:declarations and wraps them in OffDocumentItems that Renderers can react on to provide additional functionality on document-level (like PDF metadata or PostScript media dictionaries). Since the simple-page-master is available directly from the PageViewport the renderer can take ExtensionAttachment objects directly from there (see PSRenderer.renderPage()).", 
   "Extension Elements that provide ExtensionAttachments are not added as such to the child element list of a formatting object since they work a little differently and should free memory as soon as possible.", 
   "The PostScript extension described in http://wiki.apache.org/xmlgraphics-fop/ExtensionsForPostScript are now fully implemented but under the namespace URI \"http://xmlgraphics.apache.org/fop/postscript\", not \"http://xml.apache.org/fop/extensions\". I'll need to look at namespaces again separately, later.", 
   "The new PSExtensionElementMapping is currently hard-coded into FOTreeBuilder as are the other ElementMapping classes.", 
   "OffDocumentItem is now an interface, AbstractOffDocumentItem now providing the base functionality of the former OffDocumentItem class.", 
   "Lots of clean-up and javadocs while working through this, for example: FObj.childNodes is not public anymore. Instead a special method on fo.flow.InstreamForeignObject provides the child in the one case childNodes was directly accessed. PropertyMaker access in FObj is also done through a method now, propertyListTable is now private."
  ], 
  "revision_id": "267209"
 }, 
 {
  "author": "mbr", 
  "date": "2005-09-02T14:20:32.014421Z", 
  "msg": [
   "quick fix to make HEAD compile"
  ], 
  "revision_id": "267208"
 }, 
 {
  "author": "tripod", 
  "date": "2005-09-02T14:18:34.526868Z", 
  "msg": [
   "- seperating VersionManagerImpl from ItemStateProvider to avoid potential deadlocks during checkin.", 
   "- VersionItemStateProvider returns now shared item states", 
   "- Node References handling adjusted"
  ], 
  "revision_id": "267207"
 }, 
 {
  "author": "tomdz", 
  "date": "2005-09-02T14:18:37.265235Z", 
  "msg": [
   "Fix for DDLUTILS-6 as provided by Christoffer Hammarström"
  ], 
  "revision_id": "267206"
 }, 
 {
  "author": "tomdz", 
  "date": "2005-09-02T14:10:26.095365Z", 
  "msg": [
   "Fix for DDLUTILS-7"
  ], 
  "revision_id": "267205"
 }
]