[
 {
  "author": "conor", 
  "date": "2000-06-24T10:55:45.000000Z", 
  "msg": [
   "Add BuildEvents to Ant", 
   "The basic idea is to keep the core build engine \"clean\" and free of any", 
   "presentation logic, and to make it easier to extend Ant with other features", 
   "without cluttering up the core. To do this, I've defined a BuildListener", 
   "interface and added an \"addBuildListener\" method to Project that can be", 
   "used to register listener objects. Listeners could be implemented to", 
   "generate reports, send out emails when the build is complete, create a", 
   "bill of materials, etc...", 
   "The only new functionality visible to the end-user is a \"-listener\" option", 
   "on the command line that will let you specify the name of a class. An", 
   "instance of this class will be added as a listener to the project. I've", 
   "included a listener that will generate an XML log file, which you can use", 
   "by typing the command below.", 
   "build -listener org.apache.tools.ant.XmlLogger", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tMatt Foemmel <mpfoemme@ThoughtWorks.com>", 
   "Reviewed by:"
  ], 
  "revision_id": "267694"
 }, 
 {
  "author": "jhunter", 
  "date": "2000-06-24T02:46:17.000000Z", 
  "msg": [
   "Added MailMessage.  Hope people don't mind that I left it in", 
   "com.oreilly.servlet.  I did that since it's going to be a mirror", 
   "of what's in the larger com.oreilly.servlet package.  I put", 
   "it under the Apache license of course, and added the ASF as an", 
   "additional copyright holder.  Code can have two copyright holders,", 
   "meaning either party can do as they wish with the code.  This lets", 
   "the ASF upgrade to Apache License 1.2 sometime in the future, and", 
   "lets me be able to use the code without thanking the ASF for code", 
   "I wrote.  :-)  Updated build.xml to handle the new package."
  ], 
  "revision_id": "267693"
 }, 
 {
  "author": "rubys", 
  "date": "2000-06-23T21:18:07.000000Z", 
  "msg": [
   "Fine tune startup (handle liaison being present but processor not in", 
   "classpath)"
  ], 
  "revision_id": "267692"
 }, 
 {
  "author": "rubys", 
  "date": "2000-06-23T21:00:51.000000Z", 
  "msg": [
   "Now, commit something that works..."
  ], 
  "revision_id": "267691"
 }, 
 {
  "author": "rubys", 
  "date": "2000-06-23T16:47:11.000000Z", 
  "msg": [
   "Add an XSLT (style) task.  Based on code from Assaf Arkin."
  ], 
  "revision_id": "267690"
 }
]