[
 {
  "author": "costin", 
  "date": "2000-02-23T21:54:32.000000Z", 
  "msg": [
   "Use createProperty instead of addProperty.", 
   "(Thanks Sam )"
  ], 
  "revision_id": "267614"
 }, 
 {
  "author": "rubys", 
  "date": "2000-02-23T21:11:17.000000Z", 
  "msg": [
   "Change design pattern for nested elements from \"addBar\" to \"createBar\"", 
   "based on a suggestion by Costin."
  ], 
  "revision_id": "267613"
 }, 
 {
  "author": "costin", 
  "date": "2000-02-23T20:46:53.000000Z", 
  "msg": [
   "- added \"deep\" properties to <ant> - you can now set properties for the", 
   "called antfile", 
   "- build.xml: read ~/.ant.properties if exist, it will allow override of local", 
   "properties ( you don't have to type -Dfoo=bar each time you run ant )", 
   "-  changed dist.dir to ant.dist.dir ( to allow users to set the destinations", 
   "per project in ant.properties )"
  ], 
  "revision_id": "267612"
 }, 
 {
  "author": "rubys", 
  "date": "2000-02-16T14:31:45.000000Z", 
  "msg": [
   "This is a simple patch which adds an attribute \"classname\" as an alias for", 
   "the \"class\" attribute in various taskdefs. This is required for use under", 
   "JDK 1.3 (RC1) due to changes in the way introspection works. Don't know", 
   "about the final version of 1.3 but changing to \"classname\" is probably a", 
   "good idea in any case. By leaving the setClass method in place, current", 
   "build files can continue to be used under JDKs prior to 1.3. It also allows", 
   "time for build files to be migrated. Eventually setClass should be removed.", 
   "Note: I added a deprecation warning to the output whenever the class", 
   "attribute is used.", 
   "Submitted by: Conor MacNeill <conor@m64.com>"
  ], 
  "revision_id": "267611"
 }, 
 {
  "author": "rubys", 
  "date": "2000-02-16T03:24:44.000000Z", 
  "msg": [
   "Accept include and exclude nested XML elements.  Also allows for the", 
   "conditional inclusion/exclusion of paths based on the absence/presence", 
   "of specified classes in the class path.", 
   "If anybody has any better suggestions for the names of the attributes,", 
   "please let me know."
  ], 
  "revision_id": "267610"
 }
]