[
 {
  "author": "metasim", 
  "date": "2000-11-11T15:16:47.000000Z", 
  "msg": [
   "Icons replaced due to restriction on outside copyright ownership"
  ], 
  "revision_id": "268174"
 }, 
 {
  "author": "conor", 
  "date": "2000-11-11T15:11:41.000000Z", 
  "msg": [
   "EJBJar changes", 
   "1. Change EJBJar so that super classes and super interfaces are included in", 
   "bean jar file. For this to work, the classpath can be specified at the", 
   "ejbjar level. This will be used for the weblogic nested element if it", 
   "is specified. If a classpath is also provided on the weblogic", 
   "nested element, it is concatenated with the task level classpath. Since", 
   "the processing is done in the nested element in any case, current usage", 
   "where the classpath is specified in the nested element is sufficient", 
   "for these checks to work.", 
   "2. Allow <classpath> nested elements to be used to specify the classpath. This can", 
   "be used for both the task level and nested element level classpaths.", 
   "3. Change the weblogic jar generation to run ejbc only if the interfaces have", 
   "changed. Changes to the bean classes will not cause ejbc to run. This behaviour", 
   "must be enabled by setting the attribute rebuild=\"false\" in the weblogic", 
   "element.", 
   "Submitted by:\tBrian Towles <brian@towles.com>"
  ], 
  "revision_id": "268173"
 }, 
 {
  "author": "metasim", 
  "date": "2000-11-11T14:58:54.000000Z", 
  "msg": [
   "Dialog window for changing the current Look and Feel.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tErik Meade", 
   "Reviewed by:\tSimeon Fitch"
  ], 
  "revision_id": "268172"
 }, 
 {
  "author": "metasim", 
  "date": "2000-11-11T04:54:05.000000Z", 
  "msg": [
   "Geatly enhanced the property editor, adding new bean info for the", 
   "element types and an additional property editor. The navigator now shows", 
   "project, property, target and task nodes.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "268171"
 }, 
 {
  "author": "metasim", 
  "date": "2000-11-11T04:52:21.000000Z", 
  "msg": [
   "Greatly enhanced the property editor, adding new bean info for the", 
   "element types and an additional property editor. The navigator now shows", 
   "project, property, target and task nodes.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "268170"
 }
]