[
 {
  "author": "conor", 
  "date": "2001-08-04T14:37:40.000000Z", 
  "msg": [
   "Initial implementation of FilterSets. I've done some major surgery on the", 
   "patch from PR1545. There is also more to come.", 
   "PR:\t1545", 
   "Submitted by:\tMichael McCallum <gholam@xtra.co.nz>"
  ], 
  "revision_id": "269459"
 }, 
 {
  "author": "conor", 
  "date": "2001-08-04T14:30:36.000000Z", 
  "msg": [
   "Give data types some of the capabailities of Tasks, namely access", 
   "to the project object and the ability to log messages through that", 
   "project. The IntrospectionHelper cooperates to ensure DataTypes", 
   "created as nested elements are correctly setup"
  ], 
  "revision_id": "269458"
 }, 
 {
  "author": "sbailliez", 
  "date": "2001-08-03T20:47:33.000000Z", 
  "msg": [
   "Fixed the stupid mistake I did when merging my last changes.", 
   "I mistakenly removed part of a previous patch. Shame on me."
  ], 
  "revision_id": "269457"
 }, 
 {
  "author": "bodewig", 
  "date": "2001-08-03T16:38:21.000000Z", 
  "msg": [
   "New task <condition>.", 
   "This is a first cut of the generalization of <available> and", 
   "<uptodate> that is on the list for Ant2. This task supports a single", 
   "condition and sets a property if it holds true - conditions can be", 
   "containers for other conditions in turn, giving it the opportunity to", 
   "support boolean logic.", 
   "Built in conditions as of now:", 
   "* <available> and <uptodate> (slightly modified the tasks to allow them to", 
   "be used as conditions)", 
   "* containers <and>, <or> and <not>", 
   "* New conditions <equals> (compares to Strings) and <os> which should", 
   "give easier access to os.name.", 
   "More extensive documentation to follow.  Take a look at Ant's build", 
   "file, it uses the task to detect whether javamail is available now.", 
   "I had to perform some ugly tricks to make sure that project gets", 
   "passed to every object that will need it - this will be very different", 
   "in the future I hope."
  ], 
  "revision_id": "269456"
 }, 
 {
  "author": "conor", 
  "date": "2001-08-03T16:15:16.000000Z", 
  "msg": [
   "Pesky windows locking", 
   "Can't rename a file that is open or where the destination exists"
  ], 
  "revision_id": "269455"
 }
]