[
 {
  "author": "costin", 
  "date": "2002-02-22T23:28:31.000000Z", 
  "msg": [
   "Checking in the modified ( and new ) files.", 
   "Most of the functionality in Main is moved into AntBean ( all public/protected", 
   "methods are now wrappers around AntBean's functionality, for backward compat).", 
   "Same in ProjectHelper - again, for backward compat the public/protected functions", 
   "are unchanged, old code can still call the old methods and get similar behavior.", 
   "In TaskAdapter - few improvements ( still more to go ) to allow a program", 
   "to control tasks that are in a child loader. That's extremely important to", 
   "get ant embeded and controlled in a programatic way ( Project may create", 
   "tasks in a child class loader, so casting will fail - the only way", 
   "to use them is by using introspection ). I've also added the ability", 
   "to 'adapt' beans that have multiple methods, not only execute()", 
   "Please review, try, let me know when I can commit it."
  ], 
  "revision_id": "271514"
 }, 
 {
  "author": "stevel", 
  "date": "2002-02-22T18:00:21.000000Z", 
  "msg": [
   "info on loadfile and echoproperties"
  ], 
  "revision_id": "271513"
 }, 
 {
  "author": "bodewig", 
  "date": "2002-02-22T15:38:03.000000Z", 
  "msg": [
   "Move the <exclude> patterns for <javac> and <junit> to external", 
   "patternsets so that they are in one place instead of repeated up to", 
   "three time.", 
   "update link for BSF.", 
   "Add pointer to JDepend in the Library Dependencies section."
  ], 
  "revision_id": "271512"
 }, 
 {
  "author": "bodewig", 
  "date": "2002-02-22T13:33:58.000000Z", 
  "msg": [
   "jdk 1.1 compatibility"
  ], 
  "revision_id": "271511"
 }, 
 {
  "author": "conor", 
  "date": "2002-02-22T13:01:59.000000Z", 
  "msg": [
   "Do not require tar files to be in ustar format. Old V7 format should now", 
   "be handled. The main difference is in the handling of uid vs uname which", 
   "isn't that relevant to Ant anyhow.", 
   "PR:\t6634"
  ], 
  "revision_id": "271510"
 }
]