[
 {
  "author": "jskeet", 
  "date": "2002-02-27T09:26:31.000000Z", 
  "msg": [
   "Temporary zip files used for update weren't being deleted, as doUpdate is reset during cleanUp."
  ], 
  "revision_id": "271574"
 }, 
 {
  "author": "stevel", 
  "date": "2002-02-27T09:02:40.000000Z", 
  "msg": [
   "time checking on gzip, with tests.", 
   "submitted by Jeff Martin <jeff@custommonkey.org>"
  ], 
  "revision_id": "271573"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-27T06:56:01.000000Z", 
  "msg": [
   "Added the TaskFactory and modified Project.", 
   "This is not organized as a 'project' - the files here needs to replace", 
   "the ones in the main tree. I'll probably import the rest of the core", 
   "and make it a standalone replacement, so it's easy to review.", 
   "The goals are to:", 
   "- make ant more 'embeddable'", 
   "- integrate it better in other tools", 
   "- support SAX2 and namespaces", 
   "- support pluggable behavior for the XML reader", 
   "- support pluggable task factories - the factory will have full control", 
   "over the class loader", 
   "- better support and integration with existing java beans.", 
   "All that while maintaining full compatibility with ant1.4 - all", 
   "the code here is just an additional set of hooks, with the previous", 
   "behavior preserved and remaining as default.", 
   "Eventually this can be refactored into a standalone component", 
   "that will implement a task engine for ant1.x."
  ], 
  "revision_id": "271572"
 }, 
 {
  "author": "ehatcher", 
  "date": "2002-02-27T05:30:00.000000Z", 
  "msg": [
   "Simple harmless change to demonstrate the xdocs proposal.  Sorry, Jon, if this causes javadoc warnings.", 
   "Many other tasks have been modified similarly (only ones with different task names than classnames have the name=\"...\") - but only committing this one until full approval."
  ], 
  "revision_id": "271571"
 }, 
 {
  "author": "ehatcher", 
  "date": "2002-02-27T05:26:41.000000Z", 
  "msg": [
   "First pass at XDoclet generation of Ant task documentation.", 
   "(sorry for the multiple commits, still getting a lock error on big commit attempts)"
  ], 
  "revision_id": "271570"
 }
]