[
 {
  "author": "adammurdoch", 
  "date": "2002-02-25T10:42:45.000000Z", 
  "msg": [
   "Replaced usage of Avalon Context with Myrmidon specific Context:", 
   "* Moved read-only property and resolve methods from TaskContext to new Context", 
   "interface.  TaskContext now extends the new Context interface.", 
   "* Changed the Configurer methods to use the new Context.  Both implementations", 
   "use the supplied Context to do property resolution.", 
   "* Renamed TaskContext.getPropertys() -> getProperties().", 
   "* Moved PropertyUtil from configurer to workspace package, as that is now", 
   "the only place it is used.", 
   "* Changed PropertyUtil to work with the new Context.", 
   "RoleManager:", 
   "* A default implementation for a role can now be specified.  Currently", 
   "can only do this programatically.", 
   "DefaultMasterConverter:", 
   "* Removed MasterConverter interface.  It is now identified by the Converter", 
   "role.", 
   "* Now caches the converter instances.", 
   "* Changed the converter search algorithm to traverse the *source* class", 
   "hierarchy, including all interfaces.  Chooses the most specialised", 
   "conversion, and fails if there is more than one such choice.", 
   "DefaultConfigurer:", 
   "* Attempts to convert references, if the type does not match the expected type.", 
   "* Changed handling of nested elements, for named adders/setters:", 
   "* If the method type can be mapped to a role, and that role has a default", 
   "implementation, then use that default implementation.", 
   "* Otherwise, if the method type is an interface, fail.", 
   "* Otherwise, create an instance using no-args constructor.", 
   "* Changed handling of nested elements, for typed adders/setters:", 
   "* If the method type can be mapped to a role, and the element name is", 
   "a type of that role, then use that role to create the instance.", 
   "* Otherwise, use the type factory for the generic data-type role.", 
   "* Attempt to convert the instance if it is not of the expected type.", 
   "* Added a bunch of test cases for new functionality.", 
   "* Renamed all the ConfigTest classes to have descriptive names.", 
   "Misc:", 
   "* Renamed package framework.factorys -> framework.factories.", 
   "* Made tests work when fork = false."
  ], 
  "revision_id": "271539"
 }, 
 {
  "author": "adammurdoch", 
  "date": "2002-02-25T09:47:19.000000Z", 
  "msg": [
   "Get rid of unused import."
  ], 
  "revision_id": "271538"
 }, 
 {
  "author": "jskeet", 
  "date": "2002-02-25T08:27:26.000000Z", 
  "msg": [
   "Removed redundant static method which caused compilation failure."
  ], 
  "revision_id": "271537"
 }, 
 {
  "author": "conor", 
  "date": "2002-02-25T04:33:25.000000Z", 
  "msg": [
   "Make ParallelTest work on Windows"
  ], 
  "revision_id": "271536"
 }, 
 {
  "author": "conor", 
  "date": "2002-02-25T04:32:36.000000Z", 
  "msg": [
   "Allow tests to be run behind a firewall by specifying -Doffline=true"
  ], 
  "revision_id": "271535"
 }
]