[
 {
  "author": "bodewig", 
  "date": "2002-03-05T07:57:52.000000Z", 
  "msg": [
   "Add \"DO NOT EDIT\" warning to the generated HTML files.", 
   "Suggested by:\tDiane Holt <holtdl@yahoo.com>"
  ], 
  "revision_id": "271739"
 }, 
 {
  "author": "", 
  "date": "2002-03-05T07:54:00.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'MYRMIDON_PRE_CONF_MUNGE'."
  ], 
  "revision_id": "271738"
 }, 
 {
  "author": "donaldp", 
  "date": "2002-03-05T07:54:00.000000Z", 
  "msg": [
   "no message"
  ], 
  "revision_id": "271737"
 }, 
 {
  "author": "costin", 
  "date": "2002-03-05T06:46:00.000000Z", 
  "msg": [
   "Quick change to ProjectHelperImpl to use SAX2.", 
   "Note that it already had dependencies on SAX2 interfaces, but the original", 
   "helper worked with SAX1 parsers too. This one will only work with SAX2.", 
   "IMHO SAX2 should be the default, and the old one should be kept", 
   "around for backward compat or special cases.", 
   "The parser is not using the namespace in any way - it'll use the", 
   "RoleFactory plugin to allow use of the namespace in task creation."
  ], 
  "revision_id": "271736"
 }, 
 {
  "author": "costin", 
  "date": "2002-03-05T05:50:09.000000Z", 
  "msg": [
   "Updated ProjectHelper.", 
   "I used the current sources ( with the new comments), and reimplemented", 
   "all changes.", 
   "The current version doesn't have anything related with the other proposals,", 
   "and is functionally equivalent with the old ProjectHelper - except it's", 
   "cleaner ( all private and SAX code moved to the helper imple ).", 
   "I created a new package, o.a.t.ant.helper to keep the core cleaner -", 
   "other helpers may be commited.", 
   "The SAX2 based helper is easy to write, but depends on few improvements", 
   "on RoleFactory ( createTask with namespace support, etc ).", 
   "I'm working on a new implementation of the task factory, with support", 
   "for data types and other roles - but that's another story."
  ], 
  "revision_id": "271735"
 }
]