[
 {
  "author": "conor", 
  "date": "2002-04-09T03:51:19.000000Z", 
  "msg": [
   "Test depend cache"
  ], 
  "revision_id": "272304"
 }, 
 {
  "author": "conor", 
  "date": "2002-04-09T02:37:54.000000Z", 
  "msg": [
   "<depend> task does not handle case where an inner and outer class are written at", 
   "different times since they have a mutual dependency. I have introduced a 100", 
   "millisecond tolerance to catch this situation", 
   "PR:\t7529"
  ], 
  "revision_id": "272303"
 }, 
 {
  "author": "adammurdoch", 
  "date": "2002-04-09T02:26:35.000000Z", 
  "msg": [
   "* Rolled back change to PropertyResolver.resolveProperties(), so that it", 
   "uses a TaskContext again.  Added some regression tests.", 
   "* Changed Embeddor.createWorkspace() to use a Map, rather than a Parameters,", 
   "to supply initial workspace properties.  Initial properties can be Objects,", 
   "rather than only Strings.  Got rid of the Object -> String convertion from", 
   "<ant> and <antcall>.", 
   "* Generalised ExecutionFrame, so that it can represent any execution scope", 
   "(root, workspace, project, task, inherited, etc), rather than just task scope:", 
   "- Replaced getTaskContext() with getPropertyStore().", 
   "- Replaced getTypeManager() with getServiceManager().", 
   "* Executor is now responsible for creating TaskContext.", 
   "* Changed DefaultExecutor to use the configurer provided by the execution frame.", 
   "* Added ExecutionContainer, a lifecycle interface which is used to supply the", 
   "root execution frame to a service which executes tasks (directly or indirectly).", 
   "* Changed interaction between DefaultEmbeddor and workspaces.  Embeddor is now", 
   "responsible for creating the base property store for workspaces.  ExecutionContainer", 
   "is used to pass this to workspaces.  Parameterizable is now used to pass", 
   "container params to workspaces (which matches how it is used with all the", 
   "other services)."
  ], 
  "revision_id": "272302"
 }, 
 {
  "author": "umagesh", 
  "date": "2002-04-08T18:08:08.000000Z", 
  "msg": [
   "Move assertion statement inside try block and make the testcase pass on Windows environments with dubious java.home"
  ], 
  "revision_id": "272301"
 }, 
 {
  "author": "umagesh", 
  "date": "2002-04-08T17:45:41.000000Z", 
  "msg": [
   "Close PrintStreams if logfile is being used.  Leaving the streams open causes test case failures on Windows."
  ], 
  "revision_id": "272300"
 }
]