[
 {
  "author": "costin", 
  "date": "2003-05-05T02:20:25.000000Z", 
  "msg": [
   "ComponentHelper has been checked in for some time - and I don't know", 
   "any -1 or major complain.", 
   "This removes the duplicated code and switches the component creation", 
   "to component helper.", 
   "I used it in my workspace for a long time without problem - and the gump", 
   "seems to work just like before."
  ], 
  "revision_id": "274549"
 }, 
 {
  "author": "costin", 
  "date": "2003-05-05T02:17:28.000000Z", 
  "msg": [
   "Remove one method - it wasn't used, and it seems it's not powerfull enough for", 
   "all cases discussed. The method that takes UnknownElement, ns, tag should", 
   "be able to cover everything ( by having access to UE you get access to parent", 
   "and all the tree - so any kind of policy can be implemented )", 
   "Of course - nothing calls this method yet. Switching UnknwonElement and the", 
   "normal component creation is easy - but there are many pieces of code that", 
   "call the old method."
  ], 
  "revision_id": "274548"
 }, 
 {
  "author": "costin", 
  "date": "2003-05-03T14:30:26.000000Z", 
  "msg": [
   "Plug the namespace uri. One way or another - we'll need it.", 
   "Also fix the qname - we need to use the localname.", 
   "Originally used qname to avoid breaking build files that used : ( they still", 
   "needed to declare a namespace for that previx - otherwise SAX would complain ).", 
   "( not sure about the last part - I think some parsers, when validation is off, will", 
   "allow : to be used and pass whatever was used as qname )."
  ], 
  "revision_id": "274547"
 }, 
 {
  "author": "costin", 
  "date": "2003-05-03T06:27:00.000000Z", 
  "msg": [
   "The ctor takes Project as param.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "274546"
 }, 
 {
  "author": "costin", 
  "date": "2003-05-03T05:59:35.000000Z", 
  "msg": [
   "Update with the changes in Project.", 
   "This makes ComponentHelper the almost exact duplication of the task creation", 
   "code in Project.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "274545"
 }
]