[
 {
  "author": "peterreilly", 
  "date": "2003-08-01T08:34:00.000000Z", 
  "msg": [
   "Fix location when error occurs in running antlib"
  ], 
  "revision_id": "275004"
 }, 
 {
  "author": "bodewig", 
  "date": "2003-08-01T06:45:01.000000Z", 
  "msg": [
   "Upgrade to Xerces-J 2.5.0"
  ], 
  "revision_id": "275003"
 }, 
 {
  "author": "stevel", 
  "date": "2003-08-01T06:44:36.000000Z", 
  "msg": [
   "I always worry when I change something fundamental, and the amount of refactoring here to get assertions in 'cleanly' means the change here is larger than one would expect. The key problem is that the existing code created presized arrays, but sizing these arrays meant resolving every single option and counting the #of commands -effectively creating the command line twice. Once to size it, once to save the results. this was silly and unwieldy, though it made sense given how this command grew and grew.", 
   "Most of the diff is changing CommandLine and CommmandLineJava to append their info to a supplied ListIterator, so that we dont need to create string arrays and keep on appending them. All the old stuff is still there, but used less -certainly not used at all by CommandLineJava.", 
   "No assertion tests yet..."
  ], 
  "revision_id": "275002"
 }, 
 {
  "author": "stevel", 
  "date": "2003-08-01T06:30:01.000000Z", 
  "msg": [
   "bug #20735 \"Resource\" is not explained;", 
   "explained what a resource is, clarified what property files do, to field off recurrent bugreps and show property expansion."
  ], 
  "revision_id": "275001"
 }, 
 {
  "author": "stevel", 
  "date": "2003-08-01T05:55:16.000000Z", 
  "msg": [
   "add the ability to set the executable used in .net tasks. Why do this", 
   "(a) so you can refer to versions off the path (useful for multiple versions)", 
   "(b) so you can use other implementations than the windows one.", 
   "Specifically, Mono Csharp compiler, msc, apparently uses the same syntax as csc if desired. We will have to test this... I suppose we could test Rotor too, but I cant be bothered"
  ], 
  "revision_id": "275000"
 }
]