[
 {
  "author": "jochen", 
  "date": "2005-09-06T20:23:34.919330Z", 
  "msg": [
   "Fixed use of the JAXME_FORMAT_* attributes.", 
   "Submitted by: David Gilliland, dgilliland62 at users.sourceforge.net"
  ], 
  "revision_id": "279089"
 }, 
 {
  "author": "mharwood", 
  "date": "2005-09-06T20:19:50.854157Z", 
  "msg": [
   "Added fix to QueryScorer - if a query has multiple WeightedTerms with different weights for the same term the highest weight is used for scoring that term (previously selected last weight in list)", 
   "SimpleHTMLEncoder now encodes characters outside of ASCII range as character entities as per suggestion here: http://issues.apache.org/bugzilla/show_bug.cgi?id=36333"
  ], 
  "revision_id": "279088"
 }, 
 {
  "author": "djd", 
  "date": "2005-09-06T20:16:24.818281Z", 
  "msg": [
   "DERBY-421 This patch gets the isolation level state information in BrokeredConnection in sync with", 
   "the Real Connection's isolation level state. This is necessary because any isolation level changes using SQL", 
   "do not get to BrokeredConnection and hence BrokeredConnection can end with the incorrect isolation level state.", 
   "The change adds a new flag in GenericLanguageConnectionContext, namely isolationLevelSetUsingSQLorJDBC.", 
   "This flag gets set to true anytime isolation level is changed using JDBC or SQL. Later, at the start and end of a", 
   "global transaction, EmbedXAConnection checks if the flag is set to true and if yes, it puts the real connection's", 
   "isolation level into into BrokeredConnection and then resets the flag in GenericLanguageConnectionContext.", 
   "The reason for adding methods for this flag maintenance in both BrokeredConnection and EmbedPooledConnection", 
   "is that BrokeredConnection does not have access to GenericeLanguageConnectionContext which has the flag.", 
   "EmbedPooledConnection does have access to GenericLanguageConnectionContext and hence the methods in", 
   "BrokeredConnection have to go through EmbedPooledConnection.", 
   "Patch contributed by Mamta A. Satoor msatoor@gmail.com"
  ], 
  "revision_id": "279087"
 }, 
 {
  "author": "sebor", 
  "date": "2005-09-06T20:16:09.534041Z", 
  "msg": [
   "2005-09-06  Martin Sebor  <sebor@roguewave.com>", 
   "* index.html: Corrected a couple of typos."
  ], 
  "revision_id": "279086"
 }, 
 {
  "author": "sebor", 
  "date": "2005-09-06T20:14:46.537095Z", 
  "msg": [
   "2005-09-06  Martin Sebor  <sebor@roguewave.com>", 
   "* stdcxx.html: Added a news item.", 
   "Added the PPMC mailing list.", 
   "Added previously unlisted committers."
  ], 
  "revision_id": "279085"
 }
]