[
 {
  "author": "wglass", 
  "date": "2005-09-11T22:45:19.844772Z", 
  "msg": [
   "Fix to bad regular expression in test"
  ], 
  "revision_id": "280194"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-09-11T22:38:28.993126Z", 
  "msg": [
   "Change the structure of netui-blank to reflect the web project layout guidelines described in the Tomcat docs.  In short, this turns a structure like:", 
   "fooWeb/", 
   "index.jsp", 
   "WEB-INF/", 
   "web.xml", 
   "src/", 
   "Foo.java", 
   "into something like:", 
   "fooWeb/", 
   "src/", 
   "Foo.java", 
   "web/", 
   "index.jsp", 
   "WEB-INF/", 
   "web.xml", 
   "with the exception of Page Flow source files which are often left in web/ for convenience.  The Ant build support for netui-blank is provided here as well as tweaks to the documentation to reflect this change (and a complete rewrite of sample_netui-blank.xml).", 
   "This brings the NetUI web project model into line with the conventions followed in many IDEs and existing web project builds.", 
   "Other changes:", 
   "- add a \"new.netui.webapp\" target that acts as a mini command-line wizard for creating a new NetUI web project.  It lives in <dist-root>/beehive-imports.xml.", 
   "- add flags for disabling the documentation and samples builds when creating a distribution.  These shouldn't be used when committing changes that could break a distribution, but they're convenient for making \"quick\" distributions that contain just the runtime without verifying the samples builds or building all of the doc kit / API Javadocs.", 
   "BB: self", 
   "Test: all DRTs / distribution tests pass / ran clean / build / war on netui-blank in the distribution"
  ], 
  "revision_id": "280193"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-09-11T22:37:48.418947Z", 
  "msg": [
   "Added a TODO : add a parameter to play an XML file, allowing to use the proxy without any user interaction."
  ], 
  "revision_id": "280192"
 }, 
 {
  "author": "brett", 
  "date": "2005-09-11T22:37:26.603192Z", 
  "msg": [
   "PR: MNG-613", 
   "fix the location of the metadata update check"
  ], 
  "revision_id": "280191"
 }, 
 {
  "author": "brett", 
  "date": "2005-09-11T22:25:32.805836Z", 
  "msg": [
   "docs for release"
  ], 
  "revision_id": "280190"
 }
]