[
 {
  "author": "brett", 
  "date": "2005-09-12T05:27:40.454033Z", 
  "msg": [
   "PR: MNG-760", 
   "Submitted by: Fabrizio Giustina", 
   "Reviewed by:  Brett Porter", 
   "m2 eclipse plugin improvements (source download and attachment, customization of natures/builders/conclasspath, flexible project dupport) and refactoring", 
   "(applied with modifications)"
  ], 
  "revision_id": "280259"
 }, 
 {
  "author": "crossley", 
  "date": "2005-09-12T05:22:53.300067Z", 
  "msg": [
   "Enable to see raw data for each component."
  ], 
  "revision_id": "280258"
 }, 
 {
  "author": "crossley", 
  "date": "2005-09-12T05:18:16.771515Z", 
  "msg": [
   "Add basic explanation of the front table."
  ], 
  "revision_id": "280257"
 }, 
 {
  "author": "otis", 
  "date": "2005-09-12T04:50:12.113182Z", 
  "msg": [
   "- Moved general@ to the botton, to encourage more specific subscriptions"
  ], 
  "revision_id": "280256"
 }, 
 {
  "author": "asmuts", 
  "date": "2005-09-12T04:29:12.996908Z", 
  "msg": [
   "Refactoring lateral manager and factory.  The old model was to have one factory", 
   "and mananger know about all types of lateral.  This created too many dependencies", 
   "and forced lots of ad hoc logic into the managers.  The new model will have", 
   "each lateral responsible for its own factory and manager.  This keeps things clean", 
   "and will allow laterals to ahve their own configuration settings.  The old", 
   "attributes object had stuff for every lateral, but only a small subset applied", 
   "to any given lateral.  This is a work in progress but it is almost done.", 
   "The new cache.ccf config for laterals will not be backward compatible, but the", 
   "changes will be minor.  When it is done the version will be 1.3.  After more", 
   "testing, this will be the release candidate major version.", 
   "I'm moving the javagroups stuff into to jdk1.4 specific jar.", 
   "The refactoring should be done in a few days.  This will allow us to release a 1.3 core library", 
   "and a 1.4 extension jar."
  ], 
  "revision_id": "280255"
 }
]