[
 {
  "author": "kenney", 
  "date": "2005-09-13T11:41:52.950659Z", 
  "msg": [
   "o Put  modello-maven-plugin under dependencyManagement and chose version", 
   "1.0-alpha-5-SNAPSHOT for all so they're all the same.", 
   "o Updated modello plugin invocations in all poms to by adding execution elements", 
   "and fixing goals section to get rid of deprecated notation.", 
   "o Removed dependency on modello-core in maven-plugin-tools; it seems it", 
   "was there because maven-plugin-tools-java used StringUtils from modello -", 
   "changed that to use the plexus-utils version.", 
   "o Reversed commons-cli version back to 1.0 (brett asked me to, a few days back).", 
   "o Updated all models to use fully qualified classnames - do not assume", 
   "java.util.* is included! (it won't be anymore from modello", 
   "1.0-alpha-5-SNAPSHOT onward).", 
   "o Added some <?xml processing instructions to some models that didn't have them", 
   "- vim now recognizes these files as XML (so I get syntax highlighting :))"
  ], 
  "revision_id": "280539"
 }, 
 {
  "author": "deepal", 
  "date": "2005-09-13T11:29:19.990226Z", 
  "msg": [
   "fixing Configurable dispatching order (Axis2 154)"
  ], 
  "revision_id": "280538"
 }, 
 {
  "author": "kenney", 
  "date": "2005-09-13T11:22:39.134026Z", 
  "msg": [
   "Fix missing 'groupId' tag in parent model, for instance", 
   "when the parent model also has a <parent> and doesn't specify a groupId.", 
   "This would also be resolved if maven-model would just have getVersion", 
   "and getGroupId implementations that check for the <parent> tag's", 
   "versions of these attributes when the current ones are null."
  ], 
  "revision_id": "280537"
 }, 
 {
  "author": "", 
  "date": "2005-09-13T11:00:03.877884Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "280536"
 }, 
 {
  "author": "saminda", 
  "date": "2005-09-13T10:47:35.679230Z", 
  "msg": [
   "Resources for MTOM interop tests with white mesa end point"
  ], 
  "revision_id": "280535"
 }
]