[
 {
  "author": "harishp", 
  "date": "1999-11-26T16:01:47.000000Z", 
  "msg": [
   "Removed a System.out.println", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281254"
 }, 
 {
  "author": "harishp", 
  "date": "1999-11-26T09:03:46.000000Z", 
  "msg": [
   "Added a new ServletClassLoader that is a lot meaner and cleaner than the", 
   "earlier one. The previous one is still called ServletLoder, while this one", 
   "is called ServletClassLoader. After a few weeks, once this class loader", 
   "settles in, I will remove the old one (ServletLoader) from the core package.", 
   "Also added NetworkClassLoader, I recommend that JspLoader (& any other", 
   "class loaders) extend from this class loader. Firstly, it can load classes", 
   "off any URL. Secondly, it is modelled after JDK 1.2 style class loader.", 
   "Modified the servlet container to use this class loader instead of an", 
   "earlier one.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281253"
 }, 
 {
  "author": "harishp", 
  "date": "1999-11-25T20:42:21.000000Z", 
  "msg": [
   "Added 2 new scripts. One for unix and another for windoz.", 
   "Why?. startup and shutdown pretty much do the same thing..... Everytime", 
   "there is a change in the classpath/environment etc. we would need to", 
   "change both the scripts... Which is a drag..  \"if-then-else\"", 
   "statements are for exactly this purpose.....", 
   "These script are intended to replace startup and shutdown scripts.", 
   "You can now use:", 
   "./tomcat.sh -start", 
   "./tomcat.sh -stop", 
   "instead.", 
   "I don't have a windoz machine so, I could not test the tomcat.bat", 
   "script. It should work. Can someone verify it for me?", 
   "Once everyone moves over to the new script, the intent is to remove", 
   "startup and shutdown scripts.", 
   "I have changed the build.sh to give execute permission to all shell", 
   "script after building. I got tired to doing chmod +x startup.sh", 
   "everytime I did a clean build.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281252"
 }, 
 {
  "author": "costin", 
  "date": "1999-11-25T01:29:57.000000Z", 
  "msg": [
   "Added files from jserv's cvs - I'll keep the files in sync", 
   "by merging any changes/fixes in jserv.", 
   "This is the original code - no change to integrate it with", 
   "tomcat for now.", 
   "Mod_jserv will be used as the default adapter, since it is", 
   "stable and well tested - the bidirectional protocol will replace", 
   "it when ready.", 
   "Obtained from: java.apache.org"
  ], 
  "revision_id": "281251"
 }, 
 {
  "author": "mandar", 
  "date": "1999-11-24T01:11:00.000000Z", 
  "msg": [
   "merging changes from J2EE branch to the main branch.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281250"
 }
]