[
 {
  "author": "craigmcc", 
  "date": "2000-01-09T04:54:28.000000Z", 
  "msg": [
   "Initial check-in of the component interface for a Store component, to be used", 
   "for persistent storage across server and/or context (when auto-reloading is", 
   "enabled) restarts.", 
   "Implementations of Store will be utilized by implementations of Manager for", 
   "persistent storage, and for swapping active (but idle) sessions."
  ], 
  "revision_id": "281359"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-01-09T03:26:09.000000Z", 
  "msg": [
   "This is the patch that enables use of the new Tomcat.Next session", 
   "management implementation.  If you need to return to the original", 
   "implementation, simply reverse this patch.", 
   "Once we are satisfied that the new session management code works,", 
   "we can refactor out the extra \"SessionManager\" layer.  The part of a", 
   "session manager that knows about the semantics of session management", 
   "should be returned to the core package, leaving the \"Manager\"", 
   "implementation as an intelligent database of active sessions."
  ], 
  "revision_id": "281358"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-01-09T03:23:22.000000Z", 
  "msg": [
   "Implementation of the Tomcat.Next \"Manager\" and \"Session\" interfaces,", 
   "plus an adapter class (StandardSessionManager) that implements the", 
   "interim SessionManager interface that Costin created when refactoring", 
   "the session management stuff.", 
   "The new implementation passes all the tests I have run, but needs to be", 
   "tested by others as well.  It will be enabled by the next check-in, a", 
   "one-line patch to org.apache.tomcat.core.Context."
  ], 
  "revision_id": "281357"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-01-09T03:21:16.000000Z", 
  "msg": [
   "Abstract the session identifier parsing and encoding methods that were", 
   "originally in the Manager interface of Tomcat.Next into a support module."
  ], 
  "revision_id": "281356"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-01-09T03:20:02.000000Z", 
  "msg": [
   "Initial checkin of the \"Tomcat.Next\" component interfaces in the main", 
   "source tree.  At this point, only Manager and Session will be used, but", 
   "the interfaces have mutual interdependencies that require all of them", 
   "to be compiled together."
  ], 
  "revision_id": "281355"
 }
]