[
 {
  "author": "costin", 
  "date": "2000-01-10T19:23:57.000000Z", 
  "msg": [
   "Removed defaultContext from ContextManager and all other classes.", 
   "We use getContext(\"\") - it is the root context as defined in the spec,", 
   "no need to introduce another notion ( defaultContext)."
  ], 
  "revision_id": "281369"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-10T19:13:36.000000Z", 
  "msg": [
   "Replaced Constants.Context.Default.Name with it's value ( \"\" ),", 
   "removed defaultContext from ContextManager - the code uses", 
   "now cm.getContext(\"\").", 
   "This is the start of ContextManager cleanup.", 
   "( it wasn't easy to follow the defaultContext logic, while the root", 
   "context with \"\" path is part of the spec )", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281368"
 }, 
 {
  "author": "rubys", 
  "date": "2000-01-10T09:09:57.000000Z", 
  "msg": [
   "allow JSPs to be loaded from WAR files", 
   "Submitted by: Bradley Neuberg <bneuberg@randomwalk.com>"
  ], 
  "revision_id": "281367"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-01-10T05:02:54.000000Z", 
  "msg": [
   "Change the default \"maximum inactive interval\" for new sessions from", 
   "-1 (unlimited) to 60 seconds.  As a side effect, this makes the last", 
   "failing Watchdog test (SessionTimeOutTest) pass, but this is really", 
   "bogus -- it just happens to be the value that the test is looking for.", 
   "(As such, that particular test does not have a lot of value IMHO.)", 
   "Added an XXX note pointing out that, at present, there is no way for", 
   "the Context to tell the Manager (via the SessionManager interface) what", 
   "the default timeout should be.  This will be fixed once we commit to", 
   "the new Manager/Session paradigm."
  ], 
  "revision_id": "281366"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-01-10T02:52:38.000000Z", 
  "msg": [
   "Complete the implementation of IllegalStateException checks for various", 
   "method calls of the HttpSession() interface, and implement a dummy", 
   "HttpSessionContext object -- the previous application was returning null.", 
   "This cleans up seven of the eight Watchdog tests that were failing with", 
   "the initial implementation.  The last one will require an extension to", 
   "Costin's SessionManager interface, to allow the Context to tell the", 
   "SessionManager what the default session timeout (from the deployment", 
   "descriptor) should be."
  ], 
  "revision_id": "281365"
 }
]