[
 {
  "author": "costin", 
  "date": "2000-01-12T19:54:03.000000Z", 
  "msg": [
   "Cleaned-up RequestDispatcher !", 
   "I don't know if the previous model was better or not, but it was _very_ hard to", 
   "follow it.", 
   "When you call getRequestDispatcher a new Request ( used to be LookupResult, but it behaved the", 
   "same way ) is created. Now this request is used when invoking the included servlet,", 
   "instead of setting the old request with some of the parameters in the new request.", 
   "While the old way was probably faster, it required a number of hacks ( the included", 
   "request had special \"magic\" in it in form of special attributes).", 
   "Feel free to find a better way to implement include().", 
   "This will also clean up most of InvokerServlet ( which can move to a normal interceptor)", 
   "It seems all test are passing ( even with the incomplete implementation we have - that means", 
   "we need more tests, since the code is obviously broken !)"
  ], 
  "revision_id": "281384"
 }, 
 {
  "author": "rubys", 
  "date": "2000-01-12T13:55:03.000000Z", 
  "msg": [
   "Add -nospawn option on Win32 platforms", 
   "Submitted by: Conor MacNeill <conor@m64.com>"
  ], 
  "revision_id": "281383"
 }, 
 {
  "author": "shemnon", 
  "date": "2000-01-12T07:11:15.000000Z", 
  "msg": [
   "* Use java.beans.Introspector rathe than default design patterns in", 
   "getProperty code", 
   "* Fix the example this change breaks", 
   "* Improve error messageing for non-existant or read/write-only props", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281382"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-12T06:35:21.000000Z", 
  "msg": [
   "Cleaned up getResource() - will create a subrequest, pass it to the mapping stage,", 
   "get the translated result.", 
   "Minor cleanup in Request ( eliminate duplicated code, eliminate unused public methods )", 
   "Added some comments in DefaultServlet - someone needs to rewrite it from 0, but", 
   "it's not in core :-)"
  ], 
  "revision_id": "281381"
 }, 
 {
  "author": "rubys", 
  "date": "2000-01-12T04:10:40.000000Z", 
  "msg": [
   "run the jsp tests one at a time"
  ], 
  "revision_id": "281380"
 }
]