[
 {
  "author": "shemnon", 
  "date": "2000-01-15T08:20:44.000000Z", 
  "msg": [
   "Fix breakage,", 
   "put out tree fire,", 
   "make the tomcat tests work completely again"
  ], 
  "revision_id": "281404"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-15T07:18:32.000000Z", 
  "msg": [
   "- fixed Ajp12 - it now implements the shutdown function the same way as JServ.", 
   "That means starting and _stoping_ tomcat via mod_jserv wrapper should", 
   "work ( and you can do automatic startup - apachectl stop will also bring down", 
   "tomcat)", 
   "- Added code to the new starter to shut down tomcat ( using Ajp12). In order", 
   "for this to work you need to have the ajp12 adaper running. Same security", 
   "implications ( but it's easy to deny access to a port !). ( nothing new,", 
   "RMI had the same problems).", 
   "This give some time to think the RMI componenets."
  ], 
  "revision_id": "281403"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-15T06:45:47.000000Z", 
  "msg": [
   "- The new starter can now parse the old server.xml", 
   "It is still not equivalent - we still need to start the admin interface", 
   "using RMI. In the new model it will be just a normal component ( like", 
   "ant tasks ), but it has to be changed a bit before.", 
   "That means shutdown doesn't work with the new startup.Tomcat", 
   "- XmlHelper supports now few more mappings between xml tags and java", 
   "names ( in order to map server.xml to the existing java objects )", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281402"
 }, 
 {
  "author": "shemnon", 
  "date": "2000-01-15T06:16:20.000000Z", 
  "msg": [
   "Added deliverable for milestone 2"
  ], 
  "revision_id": "281401"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-15T03:52:58.000000Z", 
  "msg": [
   "- Added more debug messages where something was/is probably broken.", 
   "- Replaced the Mapper with a simplified one. It passes the test suite,", 
   "but it may miss something. It's one of the most importants things in the", 
   "lodo list - and probably the most critical component.", 
   "- Added the experimental startup, can be used to easily turn on", 
   "debug or test other combinations of interceptors/etc.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281400"
 }
]