[
 {
  "author": "costin", 
  "date": "2000-01-29T05:52:33.000000Z", 
  "msg": [
   "No need to define contexts in server.xml."
  ], 
  "revision_id": "281444"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-29T05:51:32.000000Z", 
  "msg": [
   "\"Automatic\" configuration for tomcat. Any war file in webapps/ will be", 
   "automatically expanded and added to contexts. Any directory in webapps", 
   "will be automatically added too.", 
   "It's not completed - need to figure an encoding to allow deeper paths", 
   "( now the name of the war/directory will be the name of the path).", 
   "Also, it would be nice to have the install path in web.xml, but that's a spec", 
   "problem.", 
   "Right now you shouldn't need to touch server.xml unless you want to do", 
   "advanced settings.", 
   "Deploy == cp WarFile.war tomcat/webapps/path.war", 
   "( or create a directory in webapps/ and set up your application", 
   "inside)", 
   "Remove == rm -rf tomcat/webapps/path tomcat/webapps/path.war", 
   "No dependency check is done - if both directory and war exists, directory will", 
   "be used ( Q: should we remove the war after expand and if a war file is found,", 
   "assume it's update? )", 
   "Also:", 
   "- Moved \"default\" settings for ContextManager in interceptor", 
   "( it can be replaced by improved versions - config using JNDI, etc)", 
   "- Made ResponseImpl cookies available - thanks Ana von Klopp", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281443"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-27T04:45:31.000000Z", 
  "msg": [
   "Removed dependency on Ant.", 
   "( but of course, you need to update ant in order to use it :-)"
  ], 
  "revision_id": "281442"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-27T01:24:51.000000Z", 
  "msg": [
   "Another big change - use the new Tomcat starter ( still using server.xml )", 
   "This change is required in order to allow adding of new \"modules\"", 
   "( interceptors, adapters, etc) at config time, and uses ant-like", 
   "\"patterns\" to configure independent components. It is not final,", 
   "but it's better to do the move now in order to \"burn\" it and to", 
   "allow development of adapters. ( and also get feedback on the", 
   "\"hierarchy\" patterns - which is an extension to ant )", 
   "Note that stoping tomcat is done using one of the existing adapters", 
   "( Ajp12), which has a \"stop\" command inside (used by Apache to", 
   "restart jserv). We will add RMI later,", 
   "after more admin methods will be added ( that also mean you need", 
   "to start ajp12 instead of RMI !). It no longer use a log file,", 
   "but you need to specify the same server.xml when you start and", 
   "stop.", 
   "Again - it probably brake something, but that's good because we'll", 
   "get a chance to fix it, and we can discover more things to do!"
  ], 
  "revision_id": "281441"
 }, 
 {
  "author": "costin", 
  "date": "2000-01-26T22:59:59.000000Z", 
  "msg": [
   "Fix to add the golden files and a test script to the", 
   "main tomcat build.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281440"
 }
]