[
 {
  "author": "costin", 
  "date": "2000-02-11T00:23:04.000000Z", 
  "msg": [
   "Moved J2EE code into jakarta-tomcat/src/j2ee.", 
   "There is no difference in the build result - all files are compiled and", 
   "everything is the same as before this move ( except adding Interceptors,", 
   "see previous commit)", 
   "Please work on jakarta-tomcat/src/share, any change is ok and probably will", 
   "have no impact on j2ee integration code ( unless you change an interface ).", 
   "There are still some classes that are not used by tomcat, we will move them to", 
   "j2ee or remove if no longer needed, this is just the first step."
  ], 
  "revision_id": "281494"
 }, 
 {
  "author": "costin", 
  "date": "2000-02-10T23:49:58.000000Z", 
  "msg": [
   "Added InterceptorAdapter. It will allow the use of J2EE interceptors with", 
   "tomcat interceptors, and separation of J2ee integration code from core.", 
   "The only change is that instead of adding Service and Lifecycle Interceptors", 
   "using", 
   "context.addInitInterceptor(interceptor)", 
   "it need to use:", 
   "InterceptorAdapter.addInitInterceptor(context, interceptor);"
  ], 
  "revision_id": "281493"
 }, 
 {
  "author": "costin", 
  "date": "2000-02-10T22:28:24.000000Z", 
  "msg": [
   "- Added servlet init and destroy notification in ContextInterceptor", 
   "- Context.getMimeMap() will return java.net.FileNameMap instead of internal", 
   "MimeMap", 
   "- added ServletMap - all maps will be in one hashtable, and the", 
   "request interceptor will manage it's internal representation ( prefix, etc)", 
   "- small change in MimeMap ( reduce GC: -1 string allocation )"
  ], 
  "revision_id": "281492"
 }, 
 {
  "author": "costin", 
  "date": "2000-02-10T18:55:55.000000Z", 
  "msg": [
   "- Removed ServletClassLoader and changed everything to use ServletLoader.", 
   "- removed all \"class path\" methods from context, the call getServletLoader()", 
   "to access the class path.", 
   "ServletClassLoader was added as part of the clean up ( in 3.1M1 ) to allow the", 
   "move of the loader in a separate package and make it plug-able.", 
   "ServletLoader is the second attempt - it's still not final, we  need to", 
   "implement servlet reloading and that will probably affect the interface too."
  ], 
  "revision_id": "281491"
 }, 
 {
  "author": "rubys", 
  "date": "2000-02-10T09:32:22.000000Z", 
  "msg": [
   "message cleanup"
  ], 
  "revision_id": "281490"
 }
]