[
 {
  "author": "costin", 
  "date": "2000-02-22T21:44:29.000000Z", 
  "msg": [
   "Changed XmlMapper - it no longer ignores errors.", 
   "If any error happens in configuration it will report the line number", 
   "( if Locator is set and working ) and the xml path / attributes for the", 
   "ofending element, and stop parsing.", 
   "The caller should handle any recovery or report the error.", 
   "This is the same behavior as in the case of a XML error or", 
   "DTD violation."
  ], 
  "revision_id": "281554"
 }, 
 {
  "author": "costin", 
  "date": "2000-02-22T21:06:47.000000Z", 
  "msg": [
   "- Moved the thread pooling endpoint in PoolTcpEndpoint, the original", 
   "in SimpleTcpEndpoint. TcpEndpoint is now an abstract class, you need to", 
   "use one subclass.", 
   "- made SimpleTcpEndpoint the default, there are some problems with Pool on", 
   "JDK1.2/Linux and it's safer to use the simpler ( Pool is much faster and should", 
   "be used in production mode )", 
   "- Removed HttpAdapter, use the TcpEndpoint with http adapter. ( HttpAdapter", 
   "was a shortcut for that, we want to be able to fine tune http endpoint", 
   "and connector )", 
   "- Logger - added a \"customOutput\" property, don't try to do any formatting", 
   "if it is set ( no timestamp, no prefix or suffix ).", 
   "- Changed \"visible\" log messages to use the xml style. This will allow", 
   "easy post-processing of logs, nice HTML display, filtering, etc."
  ], 
  "revision_id": "281553"
 }, 
 {
  "author": "arun", 
  "date": "2000-02-18T22:45:00.000000Z", 
  "msg": [
   "Launch watchdog tests from tomcat/bin directory.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281552"
 }, 
 {
  "author": "arun", 
  "date": "2000-02-18T21:04:15.000000Z", 
  "msg": [
   "Script for executing watchdog tests.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281551"
 }, 
 {
  "author": "costin", 
  "date": "2000-02-18T18:33:03.000000Z", 
  "msg": [
   "Added the admin context - it will be the web-based tomcat admin tool.", 
   "Thanks Justyna. The admin context revealed many internal problems,", 
   "we are now able to add and remove contexts at runtime without restarting", 
   "the server.", 
   "Submitted by: Justyna Horwat <Justyna.Horwat@eng.sun.com>"
  ], 
  "revision_id": "281550"
 }
]