[
 {
  "author": "costin", 
  "date": "2000-04-06T21:14:46.000000Z", 
  "msg": [
   "Removed XML formating from log messages. This is not complete - but the", 
   "messages that show up when debug is disabled are now plain text.", 
   "For debug messages - they are intended for debugging. In time I'll remove", 
   "or change more messages - but I don't think it's a show stopper.", 
   "I made an attempt to implement something that ( IMHO ) was usefull, but", 
   "since most people disagreed - I'm looking forward to see better code/solutions.", 
   "It seems XML doesn't apply to log messages - we want \"portable\" config, but", 
   "not portable logs."
  ], 
  "revision_id": "281759"
 }, 
 {
  "author": "mandar", 
  "date": "2000-04-06T21:05:22.000000Z", 
  "msg": [
   "Bug Fix for #96", 
   "TagData is reporting REQUEST_TIME_VALUE even for a", 
   "constant expression.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281758"
 }, 
 {
  "author": "mandar", 
  "date": "2000-04-06T18:29:00.000000Z", 
  "msg": [
   "Fix for bug #109.", 
   "JspRuntimeLibrary breaks taglibs with multiple property setters.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281757"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-06T17:54:33.000000Z", 
  "msg": [
   "I forgot to log the changes to the release notes file (src/doc/readme) in the", 
   "previous check-in.", 
   "- Added list of new features and enhancements in this release, primarily", 
   "from the RELEASE-PLAN list.  Feel free to add any others that you think", 
   "are important enough to mention.", 
   "- Added a subsection on container managed security to the KNOWN BUGS AND ISSUES", 
   "section, describing the fact that the support is experimental, and that there", 
   "are definite issues with form-based authentication.  We shall see if this", 
   "is enough to minimize user bug reports (as opposed to developers helping", 
   "to fix it) with this stuff."
  ], 
  "revision_id": "281756"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-06T17:49:22.000000Z", 
  "msg": [
   "Added more example users to the tomcat-users file to demonstrate the", 
   "syntax options.", 
   "Modified the examples web application so that BASIC authentication is the", 
   "default, but left notes in web.xml about how to easily switch to form", 
   "based authentication.  No changes to the protected application itself", 
   "are required when you switch -- one of the really nice things about", 
   "container managed security :-).", 
   "Enhanced the page displayed inside the protected area to confirm the", 
   "user's remote username and principal username, as well as allowing the", 
   "lookup of roles assigned to this user.  (You wouldn't do this in a", 
   "real application, but it is quite useful for debugging your", 
   "tomcat-users.xml file contents.)", 
   "Removed a debugging output statement from SecurityCheck.java."
  ], 
  "revision_id": "281755"
 }
]