[
 {
  "author": "akv", 
  "date": "2000-04-07T00:12:30.000000Z", 
  "msg": [
   "I'm a volunteer for all JSP-related work."
  ], 
  "revision_id": "281764"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-06T23:13:34.000000Z", 
  "msg": [
   "Add initial cracks at two new documents -- nothing here is authoritative", 
   "until discussed and agreed to by the TOMCAT-DEV community.", 
   "\"RELEASE-PLAN-3.2\" is a prototype document for the release plan (schedule)", 
   "for the next version.  It will be renamed RELEASE-PLAN once we are through", 
   "with the current one, which is (naturally enough) for 3.1.  You can see", 
   "that I have not tried to identify any specific functionality to be", 
   "scheduled for particular releases, but I've laid out a proposed schedule", 
   "that gets us to final release by JavaOne 2000.", 
   "\"STATUS.html\" is an accumulation of action items that I've heard, or", 
   "talked to people about, that might be interested to add to Tomcat in", 
   "version 3.2 or some later version.  The idea is that people volunteer", 
   "to work on one or more of these items, and the interested parties discuss", 
   "how to do it (on TOMCAT-DEV so other folks can see what's being thought of", 
   "and discussed), and then perform the changes.", 
   "A TOMCAT-DEV announcement about these two files will be sent in a couple", 
   "of minutes."
  ], 
  "revision_id": "281763"
 }, 
 {
  "author": "jluc", 
  "date": "2000-04-06T23:11:36.000000Z", 
  "msg": [
   "bug fix. prevents exceptions with ajpv12 \"pings\".", 
   "This happened only in \"automatic\" startup, which is not the default.", 
   "Submitted by:\tJun Inamori j-office@osa.att.ne.jp"
  ], 
  "revision_id": "281762"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-06T22:31:04.000000Z", 
  "msg": [
   "Correct the number of 'y' characters in the date pattern."
  ], 
  "revision_id": "281761"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-06T21:18:21.000000Z", 
  "msg": [
   "Updated README file to Tomcat 3.1 file organization and scripts."
  ], 
  "revision_id": "281760"
 }
]