[
 {
  "author": "craigmcc", 
  "date": "2000-04-26T17:24:05.000000Z", 
  "msg": [
   "Add a flush() in two places to the DefaultErrorPage servlet, to avoid", 
   "potential hang problems on IE due to the fact that the content length was", 
   "getting set.", 
   "IMHO it should never be necessary for a servlet to call flush on the", 
   "output stream or writer -- that should be the container's responsibility.", 
   "But this fix doesn't hurt anything.  Further investigation is appropriate.", 
   "Thanks for the investigation and the patch!", 
   "PR: 284", 
   "Submitted by:\tcarsonm@missiondata.com", 
   "Reviewed by:"
  ], 
  "revision_id": "281844"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-26T16:15:15.000000Z", 
  "msg": [
   "Fix for a spec compliance bug -- the output buffer on the response stream", 
   "was not getting reset when RequestDispatcher.forward() is called.", 
   "However, two issues remain:", 
   "* The spec is not crystal clear here (and a couple of other places)", 
   "whether headers and cookies should get erased as well (i.e. call", 
   "response.reset()), or just the data buffer.  A clarification question", 
   "is in order.", 
   "* The fix doesn't seem to be completely effective.  One of the Watchdog", 
   "tests for this fails because it outputs the contents of the forwarded-to", 
   "page, followed by the contents of the original page -- which appear to", 
   "have gotten buffered someplace.", 
   "More work is required to track this down."
  ], 
  "revision_id": "281843"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-25T22:07:04.000000Z", 
  "msg": [
   "- Added comments to ServerConnector.", 
   "- Removed unused methods ( used before <connector> tag was introduced )"
  ], 
  "revision_id": "281842"
 }, 
 {
  "author": "mandar", 
  "date": "2000-04-25T21:10:05.000000Z", 
  "msg": [
   "Custom-tag fix."
  ], 
  "revision_id": "281841"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-25T19:01:08.000000Z", 
  "msg": [
   "Create a variant of the readXml() method that takes an InputStream, rather", 
   "than a File, as the source of the XML data file.  The common code should", 
   "probably be factored out and shared, but that can be done when we migrate to", 
   "a JAXP-based parser selection mechanism."
  ], 
  "revision_id": "281840"
 }
]