[
 {
  "author": "costin", 
  "date": "2000-04-26T22:50:36.000000Z", 
  "msg": [
   "Added servletapi to the build system. ( need to check if it works", 
   "in the next build )"
  ], 
  "revision_id": "281849"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-26T22:49:49.000000Z", 
  "msg": [
   "Added comments to container, review of Context.", 
   "It seems the getResource and getRealPath still have problems,", 
   "and the implementation can be greatly simplified given the current", 
   "spec ( i.e. can't go outside the webapp box). That will turn both", 
   "of them to O(1), with Context.getContext() remaining the only method", 
   "that can cross webapps. That will also simplify non-file-based cases,", 
   "and allow us to re-add the war servlet in a better form."
  ], 
  "revision_id": "281848"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-04-26T20:26:27.000000Z", 
  "msg": [
   "Remove a deprecation warning when compiling XmlWrapper.", 
   "PR: 295", 
   "Submitted by:\tauthor@philhanna.com"
  ], 
  "revision_id": "281847"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-26T19:01:52.000000Z", 
  "msg": [
   "Ops, removed the Reader code from the Writer.", 
   "( I try to port some optimizations from XML to tomcat, fast", 
   "ASCII byte/char will help tomcat too, but it's not ready yet )"
  ], 
  "revision_id": "281846"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-26T18:57:36.000000Z", 
  "msg": [
   "- Renamed TomcatHome to InstallDir in ContextManager ( it generates", 
   "a lot of confusion ). Old methods still exist, but will be removed if", 
   "nobody is using them.", 
   "- moved deprecated methods at the end, preparing for removal.", 
   "- Added comments in ContextManager and more comments in package.html about", 
   "how it works.", 
   "Problem to be resolved:", 
   "Port/HostName do not belong here - tomcat can't guess what is the real", 
   "name and port for the default server ( unless it's working as a standalone", 
   "http server).  The only use for those properties is in generating the", 
   "temp. work dir name. I think we should remove them ( the adapter will provide", 
   "the real values for request )."
  ], 
  "revision_id": "281845"
 }
]