[
 {
  "author": "mandar", 
  "date": "2000-04-17T22:17:45.000000Z", 
  "msg": [
   "removing the discrepancies in the javax classes bet. spec", 
   "and tomcat."
  ], 
  "revision_id": "281819"
 }, 
 {
  "author": "mandar", 
  "date": "2000-04-17T21:42:08.000000Z", 
  "msg": [
   "javax fixes into the branch latest_TOMCAT_30.", 
   "Fixes into 3.1 are coming next...."
  ], 
  "revision_id": "281818"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-17T21:28:55.000000Z", 
  "msg": [
   "Fix for destroy() - note that even with this fix, reloading is _not_", 
   "production ready and is _not_ a \"supported\" feature of tomcat 3.1.", 
   "It is a new piece of code, added recently with little review ( 2-3 people),", 
   "and almost no testing besides trivial cases. Do not expect it to work -", 
   "it's checked in to enable simple development and get feedback for", 
   "next release ( if someone will have the time/wish to complete this feature).", 
   "( it's 2-3 hours of hacking, plus the excelent class loader from jserv )"
  ], 
  "revision_id": "281817"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-17T21:03:37.000000Z", 
  "msg": [
   "Accounting intercetor - will time the request and create a trace file."
  ], 
  "revision_id": "281816"
 }, 
 {
  "author": "costin", 
  "date": "2000-04-17T21:02:30.000000Z", 
  "msg": [
   "- the code to recycle object and use only one Request/Response/BufferedOS", 
   "per thread is back in. It was removed because it created some problems", 
   "( I think in 3.0 ), now it's time to fix the real problems and remove the", 
   "workaround.", 
   "- request/response initialization is now in contextManager.initRequest().", 
   "That method must be called from interceptors to make sure the new objects", 
   "are \"wired-in\".", 
   "- Added ServletOutputStreamFacade - it's not yet used, but it contains the", 
   "right implementation(s) for print() ( with real encoding ), and it's cleaned", 
   "up of any \"internal\" methods. The Facade is important to isolate tomcat", 
   "from the servlets.", 
   "- Added ServletWriterFacade - it's a facade for the PrintWriter and will be", 
   "used to enhance object reusing and better buffer support. Right now it contains", 
   "only some accounting code.", 
   "- Added a number of counters in request to allow request timing. There is no", 
   "overhead in normal operation - but if you plug in the AccountingInterceptor", 
   "you can get a trace of execution times.", 
   "- moved servlet-api-specific logic from ResponseImpl to ResponseFacade. That", 
   "will allow us to respect the spec restrictions even if a different Response", 
   "implementation is used."
  ], 
  "revision_id": "281815"
 }
]