[
 {
  "author": "shachor", 
  "date": "2000-06-06T07:13:43.000000Z", 
  "msg": [
   "Add HTTPS support in the scheme. Now all we need is that the", 
   "plugins provide some SSL indication"
  ], 
  "revision_id": "281974"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-03T06:35:24.000000Z", 
  "msg": [
   "A number of changes:", 
   "- PoolTcpConnector - a bit of code move, but very little change. We now treat setProperty", 
   "and setAttribute the same, and we have a cleaner set of properties.", 
   "- Pass all the properties/attributes to the ConnectionHandler and SocketFactory - this", 
   "way you can configure all the connector components in the same way.", 
   "- That includes creation of a SocketFactory by passing the name of the class. Not tested,", 
   "I'll do that when we have SSLFactory ready", 
   "- added an option to validate ( by default on ) - some parsers have problems,", 
   "and we want to be able to turn it off if we want ( and it's faster without )", 
   "- fall back to old sax parser if jaxp is not available. Default is crimson, see next.", 
   "- I still can't use it with Xerces - at least if I'm not connected, it seems to", 
   "be a bug in the way it handles external entities. Crimson and the old sun parser", 
   "work fine, I'll try to find a workaround in xerces.", 
   "- in ContextManager, few debug messages ( I want to know exactly who needs tomcat home, and", 
   "minimize the need for it - for embeding tomcat ), plus set the CM in interceptors ( it", 
   "works fine if server.xml is used, but have problems if \"programatic\" startup is used )", 
   "- ServerSocketFactory - add a setAttribute() method, a simple way to pass info from", 
   "Connector ( like keystore ). The preffered method is still \"bean-like\" setters, but sometimes", 
   "it's good to have a backup."
  ], 
  "revision_id": "281973"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-02T18:17:10.000000Z", 
  "msg": [
   "Added the RPM files - thanks to GOMEZ Henri <hgomez@slib.fr>.", 
   "Binaries build using the RPMs can be found at:", 
   "ftp://ftp.falsehope.com/home/gomez/jakarta/3.1/", 
   "This replace an old RPM spec with a much better version.", 
   "Submitted by: GOMEZ Henri <hgomez@slib.fr>"
  ], 
  "revision_id": "281972"
 }, 
 {
  "author": "shachor", 
  "date": "2000-06-02T11:12:54.000000Z", 
  "msg": [
   "Auto generation of configuration files for", 
   "Apache - mod_jk.config", 
   "IIS - .reg file for Tomcat registry entries and uri to worker map", 
   "Netscape - The mising portions in obj.conf"
  ], 
  "revision_id": "281971"
 }, 
 {
  "author": "shachor", 
  "date": "2000-06-02T11:10:44.000000Z", 
  "msg": [
   "A much improved workers definition file with support for ajp12", 
   "ajp13 and inprocess-jni  workers. The JNI worker should", 
   "work almost out-of-the box (with minor updates)"
  ], 
  "revision_id": "281970"
 }
]