[
 {
  "author": "costin", 
  "date": "2000-05-26T18:55:33.000000Z", 
  "msg": [
   "Added the security patch from Glenn Nielsen (glenn@more.net).", 
   "I did few changes and made it work with jdk1.1.8 - of course security will not", 
   "be available, but you can still use all other features.", 
   "A new server2.xml file will be used for all the JDK1.2-specific components. The old server.xml", 
   "will keep all stable and JDK1.1.8 components. IF you use JDK1.1 you'll need to", 
   "specifiy -f server.xml flag.", 
   "You should be able now to run \"untrusted\" code in tomcat. Please note that this is NOT", 
   "a supported feature - security is a long process and needs a LOT of review. There are still", 
   "few components that have no facade ( class loader, the I/O streams), that will", 
   "be fixed soon, and also core will be made more restrictive to prevent access.", 
   "There are many things to do in this are - but most important is to read the code and", 
   "understand how it works, and make sure we're safer than a browser running applets.", 
   "Submitted by:\tGlenn Nielsen (glenn@more.net)"
  ], 
  "revision_id": "281944"
 }, 
 {
  "author": "costin", 
  "date": "2000-05-26T17:32:17.000000Z", 
  "msg": [
   "Preparing for ProtocolAdapter and IO fixes.", 
   "- Removed deprecated and unused readLine method in BufferedServletInputStream", 
   "- added missing setters in Request ( every getter has now a setter, there is no", 
   "need to extend RequestImpl )", 
   "- added get/setLocalHost - it's the local host name, it may be different from", 
   "Host header. That simplifies getServerName and the protocol adapters", 
   "- added doRead(), doWrite() to Request/Response interfaces  - the methods are the", 
   "prefered way to implement in/out ( will move to ProtocolAdapter soon )", 
   "- removed printFast from ServletOS - the char-byte conversion will be fixed soon, no", 
   "need for hacks.", 
   "- Jdk12Interceptor - remove the introspection hack - if you use JDK11 just remove it,", 
   "it can't do anything. If you use JDK12 - direct call is much faster.", 
   "- TcpConnectionHandlers: add setServer( ), remove the attribute hack used to set the", 
   "server. Note that we don't use ContextManager type but object - the interface is not", 
   "tomcat specific.", 
   "- all attributes that are not interpreted by the TcpConnector ( ip, etc) are passed to", 
   "TcpConnectionHandlers. This allows better tuning and is the original purpose of setAtt().", 
   "- small fix in ajp12connectiohandler - the facade is not available till after context map.", 
   "- small change in notes - we keep a number of reserved Ids", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281943"
 }, 
 {
  "author": "costin", 
  "date": "2000-05-26T17:05:04.000000Z", 
  "msg": [
   "Added a simple makefile for apache1.3 on linux.", 
   "We need to create a better makefile, but this is a start."
  ], 
  "revision_id": "281942"
 }, 
 {
  "author": "nacho", 
  "date": "2000-05-25T16:29:37.000000Z", 
  "msg": [
   "Added Spanish Locale to Servlet examples"
  ], 
  "revision_id": "281941"
 }, 
 {
  "author": "shemnon", 
  "date": "2000-05-25T15:57:42.000000Z", 
  "msg": [
   "Fixed a nullpointer exception thrown when a jsp pages is compiled", 
   "outside of a webapp tree.", 
   "bug reported by Kevin Jones", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "281940"
 }
]