[
 {
  "author": "shachor", 
  "date": "2000-05-29T12:17:22.000000Z", 
  "msg": [
   "Move the worker factory array to a header file and", 
   "Including this header file in jk_worker.c", 
   "The reason: This simplifies removing unwanted workers", 
   "from the generated jk modules. For example in apache1.3", 
   "we may not want to have the jni worker and commenting it", 
   "out of the C file required too much."
  ], 
  "revision_id": "281949"
 }, 
 {
  "author": "costin", 
  "date": "2000-05-26T23:55:55.000000Z", 
  "msg": [
   "Initial check in for new buffer classes.", 
   "The code is factored out from existing buffers, and will replace MessageBytes,", 
   "MsgBuffer, will allow better buffering for the Input/Output streams, and will", 
   "be used in char->byte conversions.", 
   "One of the goals is to minimize the number of copy operations ( from servlet to", 
   "Writer to BufferedOutputStream to Adapter ), reduce the memory usage ( each request", 
   "will have 2 buffers for in/out and few additional buffers used by adapter ),", 
   "simplify the design ( only one type of buffer instead of 3 or 4 )."
  ], 
  "revision_id": "281948"
 }, 
 {
  "author": "costin", 
  "date": "2000-05-26T23:18:22.000000Z", 
  "msg": [
   "\"Revived\" the Reaper, it can be used to schedule periodic actions.", 
   "This is usefull to avoid the current one thread per context, will", 
   "save resources and allow better control."
  ], 
  "revision_id": "281947"
 }, 
 {
  "author": "costin", 
  "date": "2000-05-26T23:06:39.000000Z", 
  "msg": [
   "Small changes to the ThreadPool - it seems the thread data mechanism didn't worked", 
   "as expected.", 
   "Changed the name of the object encapsulating the action to ThreadPoolRunnable - to", 
   "avoid confusions.", 
   "What happens is the runIt() method ( or run() as it was before ) is executed and", 
   "then the thread keeps running.", 
   "This threadData mechanism is supposed to be faster than using pools - but I don't have enough", 
   "data about how much faster. Based on real numbers we can either drop this mechanism", 
   "and just use pools or enhance it to support a mix of actions ( since a running thread has", 
   "only one thread data object ).", 
   "Gal, please let me know if you find anything wrong in this patch, I can roll it back."
  ], 
  "revision_id": "281946"
 }, 
 {
  "author": "costin", 
  "date": "2000-05-26T21:45:24.000000Z", 
  "msg": [
   "Fix building problem ( after a cleanup )"
  ], 
  "revision_id": "281945"
 }
]