[
 {
  "author": "shachor", 
  "date": "2000-06-15T10:14:44.000000Z", 
  "msg": [
   "Closing a socket when reusing it. Fix that."
  ], 
  "revision_id": "282009"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-15T00:26:50.000000Z", 
  "msg": [
   "Fixed the JDK1.1 compiler problem, build.xml and all related files.", 
   "Right now it should compile and run fine with JDK1.1 - at least it does for me with 1.1.8", 
   "All 1.2 code is confined in modules that can be configured out.", 
   "I think the Policy-based security should still work, but I have to test it out", 
   "and verify it. I simplified the configuration and moved everything in modules,", 
   "but I need Glenn to check that and make any adjustments if needed ( now that he's", 
   "a voted commiter :-)."
  ], 
  "revision_id": "282008"
 }, 
 {
  "author": "mandar", 
  "date": "2000-06-14T22:51:53.000000Z", 
  "msg": [
   "Allow custom implementation of TagLibraryInfo."
  ], 
  "revision_id": "282007"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-14T19:07:23.000000Z", 
  "msg": [
   "- Finally, SSL support for standalone tomcat ( still need to extract the certificates", 
   "and do mutual auth, but basic SSL works )", 
   "- conditional compilation - started to add back support for 1.1 compiler", 
   "- removed policy config from server.xml. The webapps will have a codebase== docRoot,", 
   "and you can use that in the normal tomcat.policy. It is too much to try to document", 
   "and support a different policy file format.", 
   "- comments, clean up server.xml", 
   "- build.xml - added back the j2ee target to compile the j2ee integration code."
  ], 
  "revision_id": "282006"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-13T00:35:10.000000Z", 
  "msg": [
   "Added another starter for tomcat - this one allows you to easily embed tomcat", 
   "in your application.", 
   "All you need is EmbededTomcat and a RequestInterceptor that will integrate your", 
   "application auth, log and transactions.", 
   "The RequestInterceptor is specific to tomcat and your application."
  ], 
  "revision_id": "282005"
 }
]