[
 {
  "author": "costin", 
  "date": "2000-06-27T22:29:50.000000Z", 
  "msg": [
   "- removed debug=0 from SimpleMapper. Thanks Carlos Pita <carlos@aper.net>", 
   "- added back the \"secure\" in addSecureEndpoint. You need JSSE in classpath to", 
   "use the method.", 
   "Submitted by:\tCarlos Pita <carlos@aper.net>"
  ], 
  "revision_id": "282079"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-27T22:24:33.000000Z", 
  "msg": [
   "Added the new ( and cleaned up ) J2EE - tomcat adapters. ( you need to override the old", 
   "adapter !). This replaces the old adapter."
  ], 
  "revision_id": "282078"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-27T20:59:40.000000Z", 
  "msg": [
   "More jasper changes:", 
   "- Removed the dependency of Jasper to JspLoader - any class loader can be used", 
   "( I have a prototype using AdaptiveClassLoader, probably will not go in for", 
   "this release )", 
   "- The only \"feature\" that is needed by jasper is to add a jar to classpath. Instead", 
   "of creating a new interface, addJar() method is part of JspCompilationContext - where", 
   "all \"context\" methods are defined ( i.e. methods that have to be implemented by the", 
   "jasper container )", 
   "- JspC and JspServlet both (happen to ) use JasperLoader. Made this explicit.", 
   "Probably JspC can use any other class loader, but right now it uses JasperLoader.", 
   "I think this is my last change to jasper ( for this release ). For tomcat 3.3 we should", 
   "review the JspCompilationContext, Mangler and Options - many methods are not needed", 
   "and everything can probably be simplified a lot.", 
   "The 3 classes plus Compiler is all that's needed to interface with Jasper to translate", 
   "from jsp to java.", 
   "We should also create a separate package for jspC, make a new package for JavaCompiler", 
   "( since it's orthogonal and useable outside jasper ) and document the compiler's interfaces."
  ], 
  "revision_id": "282077"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-27T17:16:25.000000Z", 
  "msg": [
   "Few more cosmetic changes. The goal is to simplify jasper and clarify the interfaces.", 
   "- Compiler is now a normal class instead of abstract. The only abstract method is", 
   "isOutDated, and it can be overrident if needed - but the outdated check can be made outside", 
   "compiler. That will also allow to have the mangler as a separate class( simpler) .", 
   "- in JspServlet, there is no need to keep 2 hashtable keyed by JspURI, one containing", 
   "the classes and one containing a struct. We can just keep the class in the struct.", 
   "- in JspServlet, copied the isOutDated check - it will be invoked early, before the", 
   "compiler is created - thus avoid a lot of allocation if the class is not outdated.", 
   "None of the changes should have negative impact - if it does then probably it's better", 
   "to fix ( and understand what happens - I think it's better to have a bug we can fix than", 
   "code that works but we don't know why )", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "282076"
 }, 
 {
  "author": "costin", 
  "date": "2000-06-26T23:20:49.000000Z", 
  "msg": [
   "Fix for welcome-file bug - redirect to the welcome file."
  ], 
  "revision_id": "282075"
 }
]