[
 {
  "author": "costin", 
  "date": "2000-07-27T19:02:33.000000Z", 
  "msg": [
   "Added SimpleClassLoader to util. This is a general-purpose class loader,", 
   "with nothing specific to tomcat. It tries to provide the same features", 
   "and behavior with the standard URLClassLoader. Use it only in", 
   "JDK1.1 - for 1.2 you can use the real thing.", 
   "Added LoaderInterceptor1 - it will configure and use URLClassLoader.", 
   "No reloading supported yet ( it will be added as a separate component )."
  ], 
  "revision_id": "282224"
 }, 
 {
  "author": "costin", 
  "date": "2000-07-27T18:47:52.000000Z", 
  "msg": [
   "Few changes in ClassLoading and reloading ( mostly cosmetic, preparing for", 
   "the real fix ).", 
   "- context will know about it's own class path directly and maintian the", 
   "list", 
   "- use URL, same conventions as in JDK1.2 URLClassLoader ( no need to invent", 
   "something else).", 
   "- context will deal with reloading himself, he need to clean up, etc.", 
   "- ServletLoader is deprecated, same for AdaptiveClassLoader and all the", 
   "class loading components. That means only a comment !! - everything will still", 
   "work until the replacement is done, tested and stable.", 
   "- replaced calls to ServletLoader and all dependencies.", 
   "The deprecation of ServletLoader simplifies a bit everything - class loaders", 
   "will just deal with class loading, and we can move dependencies in a separate", 
   "component.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "282223"
 }, 
 {
  "author": "costin", 
  "date": "2000-07-27T18:43:07.000000Z", 
  "msg": [
   "Removed duplicated  log - the exception is thrown and will be logged."
  ], 
  "revision_id": "282222"
 }, 
 {
  "author": "costin", 
  "date": "2000-07-27T18:40:57.000000Z", 
  "msg": [
   "Merge from 3.2 - do not log 302 ( it's a normal event, not an error )"
  ], 
  "revision_id": "282221"
 }, 
 {
  "author": "costin", 
  "date": "2000-07-27T18:16:23.000000Z", 
  "msg": [
   "4 old files added back - note that no existing file or functionality", 
   "is affected by this addition.", 
   "It's the old non-thread pool connector. I run into very strange problems", 
   "that seems to be related with the thread pooling on buggy VMs running", 
   "on special servers ( multiple processors, BSD ).", 
   "The old connector should be used as a last-resort workaround."
  ], 
  "revision_id": "282220"
 }
]