[
 {
  "author": "costin", 
  "date": "2000-08-22T03:25:55.000000Z", 
  "msg": [
   "- Start on the new build scripts that will allow implementation of", 
   "servlet 2.3 specs ( as an add-on module ).", 
   "The main change is that you need to have both servletapi 2.2 and", 
   "servletapi 2.3. Read the comments on how to do that.", 
   "- a small change in build.xml ( since many changes will need to happen", 
   "in this area) - added an ant.dtd ( generated by latest ant's antstructure ),", 
   "now emacs can indent and fill the right attribute names.", 
   "This doesn't work yet - still need to do few more changes. The first step", 
   "will be conditional compilation ( you'll be able to build tomcat", 
   "with support for 2.2 or 2.3, but not at the same time ), then", 
   "the loading will be fixed to allow both ( and other ) \"profiles\".", 
   "( even for same API level we may have multiple implementation", 
   "strategies - that will hopefully encourage experimentation without", 
   "affecting the stability ).", 
   "So far 2.3 is compatible with 2.2 ( i.e. no methods removed), so the", 
   "conditional compilation will be ok soon. I don't know about various", 
   "interpretations ( buffering, etc).", 
   "( this is also a great way to test and increase the modularity of tomcat)"
  ], 
  "revision_id": "282299"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-19T23:53:57.000000Z", 
  "msg": [
   "Remove a couple of more cases where the Sun license was left on files", 
   "when originally contributed."
  ], 
  "revision_id": "282298"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-19T19:20:38.000000Z", 
  "msg": [
   "Remove Sun Microsystems copyright notices that were mistakenly left", 
   "in during the initial code contribution."
  ], 
  "revision_id": "282297"
 }, 
 {
  "author": "alex", 
  "date": "2000-08-19T01:16:48.000000Z", 
  "msg": [
   "fixed FAQ href"
  ], 
  "revision_id": "282296"
 }, 
 {
  "author": "costin", 
  "date": "2000-08-18T17:31:44.000000Z", 
  "msg": [
   "Missing piece in PolicyInterceptor - set the policy file.", 
   "No longer need to add java options ( -Djava.security.manager and", 
   "-Djava.security.policy), all you need to do for security is insert", 
   "the policy interceptr.", 
   "You can set alternate policy files using normal server.xml (", 
   "policyFile attribute of PolicyInterceptor ).", 
   "That also means \"java -jar\" makes one step forward ( no need for .sh or", 
   ".bat files to worry about that )"
  ], 
  "revision_id": "282295"
 }
]