[
 {
  "author": "craigmcc", 
  "date": "2000-07-28T18:55:25.000000Z", 
  "msg": [
   "Copy the local DTD resources (in package org.apache.jasper.resources) to the", 
   "${tomcat.build}/classes directory.  This was probably causing some of the", 
   "recent spate of issues with XML parsers wanting to access the Internet because", 
   "the local copy of the DTD could not be found."
  ], 
  "revision_id": "282229"
 }, 
 {
  "author": "costin", 
  "date": "2000-07-28T17:21:40.000000Z", 
  "msg": [
   "- Context.reload() will invalidate all user servlets ( defined in", 
   "web.xml or loaded by interceptors) ( it's a start, I haven't tested all", 
   "cases).", 
   "- Added \"full\" reload - equivalent with a server restart. This is the cleanest", 
   "form of restart.", 
   "- Added dependency check for web.xml. JspInterceptor can also add deps on tag", 
   "lib descriptors and use the DependManager to detect changes in jsp files."
  ], 
  "revision_id": "282228"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-28T16:30:59.000000Z", 
  "msg": [
   "When accessing a particular request URL triggers form based authentication,", 
   "save any query string that was specified for the later redirect.  Note that", 
   "this does not solve every problem with form-based login, but this is a", 
   "frequently encountered case.", 
   "Submitted by: Willie Wheeler <andrew.cmu.edu>"
  ], 
  "revision_id": "282227"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-28T02:32:04.000000Z", 
  "msg": [
   "Correct a compile error that breaks \"./build.sh dist\".  This should probably", 
   "be rolled into TOMCAT_32 as well."
  ], 
  "revision_id": "282226"
 }, 
 {
  "author": "costin", 
  "date": "2000-07-27T23:08:20.000000Z", 
  "msg": [
   "- Added ReloadInterceptor. As promised, the reloading will be re-written", 
   "and improved, and this is the first step. Right now we implement almost", 
   "the same scheme as before ( so it's not a fix ), but we can move the", 
   "whole mess in a repaceable component.", 
   "- Added DependManager. It is a (stand-alone) component, with no deps on", 
   "tomcat that is able to detect a change in a set of files. It will be", 
   "improved in time, but so far it provides enough for tomcat.", 
   "It is able to minimize the number of file accesses and perform good", 
   "enough.", 
   "- Context: on reload, all servlets will be cleaned up.", 
   "- started to phase out ServletLoader. AdaptiveServletLoader will still", 
   "be around ( to ensure continuity and stability ). The interface will be", 
   "removed in few days unless someone is using it ( for new class loaders)", 
   "- removed deprecated methods in context."
  ], 
  "revision_id": "282225"
 }
]