[
 {
  "author": "jiricka", 
  "date": "2000-08-23T20:22:04.000000Z", 
  "msg": [
   "Allowing the user to specify a random class to be used for generating session ids. By default, java.security.SecureRandom is used, but other classes (e.g. java.util.Random) can be used too, which may improve startup time."
  ], 
  "revision_id": "282314"
 }, 
 {
  "author": "jiricka", 
  "date": "2000-08-23T16:57:59.000000Z", 
  "msg": [
   "Fixing a key in a resource bundle."
  ], 
  "revision_id": "282313"
 }, 
 {
  "author": "costin", 
  "date": "2000-08-23T06:53:13.000000Z", 
  "msg": [
   "- Moved tomcat/facade in a separate module ( src/facade22 ).", 
   "- Changed build.xml to acomodate this.", 
   "- fixed the code to remove all remaining dependencies.", 
   "JspInterceptor is moved to facade22, it has too many deps", 
   "on jasper and servlet22. I'll spend some more time on this", 
   "when jsp1.2 implementation is available.", 
   "WarInterceptor is also dependent on servlet2.2, but", 
   "no compile deps - it should also be moved to facade22/../modules"
  ], 
  "revision_id": "282312"
 }, 
 {
  "author": "costin", 
  "date": "2000-08-23T05:39:20.000000Z", 
  "msg": [
   "Adding the current servlet 2.2 facade to a different module.", 
   "This have 3 benefits:", 
   "- allows a cleaner separation between core and facades", 
   "- encourages people to create alternate implementations, while", 
   "using the same core, server integration and basic modules.", 
   "That means not only 2.3 and 2.2, but for the same API ( with", 
   "various characteristics - speed, security, etc).", 
   "- it allows evolution without affecting the stability of the code.", 
   "An alternate facade can be developed and tested while keeping the", 
   "original code as a backup."
  ], 
  "revision_id": "282311"
 }, 
 {
  "author": "costin", 
  "date": "2000-08-23T04:06:43.000000Z", 
  "msg": [
   "More hacking on build.xml.", 
   "Now it is possible to compile tomcat with either servlet23.jar or", 
   "servlet22.jar. It will work only with servlet22.jar, of course.", 
   "Also checked in the old facade ( with the required aditions )", 
   "into facade23, to get it started. I hope all facade23 code will be", 
   "re-written with a fresh implementation.", 
   "In order to have tomcat working with 2.3 the facade23 must be", 
   "implemented and few specific interceptors, plus a modified", 
   "server.xml ( that will use the 2.3 interceptors, and set the 2.3", 
   "facade into all contexts - XXX make the default configurable ).", 
   "Running both in the same VM is still a goal, but it's not the", 
   "biggest priority. Separating the facade from the core is more", 
   "important.", 
   "The old facade code and 2.2 specific interceptors", 
   "should move to facade22 directory."
  ], 
  "revision_id": "282310"
 }
]