[
 {
  "author": "costin", 
  "date": "2000-08-30T06:39:40.000000Z", 
  "msg": [
   "Added few test files I had in various places on my machine.", 
   "I used them to verify various things, but never had a chance to write", 
   "a formal <test> - you may find them useful ( or ignore them if not)", 
   "( some are based on bug reports - sorry if I missed the contributor )", 
   "- Hello, HelloW are good for testing server overhead ( simple pages", 
   "with minimal time spent in the servlet, all the time processing", 
   "the request)", 
   "- sessionShare used to verify that sessions created in servlets are", 
   "visible in jsps", 
   "- Policy tests tomcat.policy for servlets ( I also use to build a jar and", 
   "put it in lib to verify the policy applies to classes and lib too )", 
   "- XXXStream, Writer are usefull to evaluate the overhead of the 3", 
   "output methods ( ServletOutputStream/bytes, SOS/chars, writer). Very", 
   "interesting ( or it used to be in 3.1, 3.2 ).", 
   "- RmiTest - can you start RMI from a servlet ?", 
   "- CookieExpire - do we set the cookie expire ?", 
   "- Post - I'm not sure if it is supposed to work ( it hangs until you hit", 
   "stop in the browser ).", 
   "Again - if you don't like them feel free to remove, I find the tests", 
   "usefull even if the code is not very clean - just hacks."
  ], 
  "revision_id": "282379"
 }, 
 {
  "author": "costin", 
  "date": "2000-08-30T05:39:28.000000Z", 
  "msg": [
   "Added a small policy example ( it should fail if policy is", 
   "enabled). I couldn't think of a better example - this is probably", 
   "pretty bad ( creates a file in /tmp )"
  ], 
  "revision_id": "282378"
 }, 
 {
  "author": "costin", 
  "date": "2000-08-30T05:15:39.000000Z", 
  "msg": [
   "Minor fixes in class loading ( for \"java -jar tomcat.jar\"), plus", 
   "command line options.", 
   "ContextManager now have a property names \"serverClassPath\" containing", 
   "the classpath used internaly by tomcat ( the one containing jaxp, webserver,", 
   "etc) in addition to the parent class loader ( see the discution on tomcat-dev)", 
   "- double-check SimpleClassLoader's urls, make sure dir urls end with \"/\"", 
   "( this avoids one file access per cpath component)"
  ], 
  "revision_id": "282377"
 }, 
 {
  "author": "larryi", 
  "date": "2000-08-29T10:43:49.000000Z", 
  "msg": [
   "For the PATH environment variable, Win9x wants paths that contain spaces", 
   "to be enclosed in quotes."
  ], 
  "revision_id": "282376"
 }, 
 {
  "author": "larryi", 
  "date": "2000-08-29T10:42:25.000000Z", 
  "msg": [
   "For the PATH environment variable, Win9x wants paths that contain spaces", 
   "to be enclosed in quotes."
  ], 
  "revision_id": "282375"
 }
]