[
 {
  "author": "costin", 
  "date": "2000-09-17T07:51:28.000000Z", 
  "msg": [
   "- added server.modules", 
   "- added \"tomcat.dist\" - it is a better name than tomcat.home. It have the", 
   "same value, nothing should change", 
   "- started ( commented out) a modularization of build.xml ( so that each", 
   "sub-module will have its own build and can be developed independently)"
  ], 
  "revision_id": "282434"
 }, 
 {
  "author": "costin", 
  "date": "2000-09-17T07:16:51.000000Z", 
  "msg": [
   "Replaced <connector> with <interceptor> in config files.", 
   "<connector> should still work ( except for shutdown using the Ajp12 message,", 
   "that means the new ajp12 must be used. We can easily back off if the", 
   "interceptors will fail )"
  ], 
  "revision_id": "282433"
 }, 
 {
  "author": "costin", 
  "date": "2000-09-17T06:47:24.000000Z", 
  "msg": [
   "- Added code to detect what methods are overriden in interceptors.", 
   "This allows to call only the interceptors that are interested in a certain", 
   "event.", 
   "- copied the comments from Request and ContextInterceptor to BaseInterceptor.", 
   "- moved the code handling interceptors from ContextManager to Container.", 
   "This is based on Nacho's changes that allows setting per/container interceptor.", 
   "- added individual chains. Right now this duplicates the old system,", 
   "after more tests the old requestInterceptors[] will be removed and replaced", 
   "by the new chains.", 
   "- Updated comments in ContextManager, removed old debug messages, removed unused", 
   "code hanging around"
  ], 
  "revision_id": "282432"
 }, 
 {
  "author": "costin", 
  "date": "2000-09-17T06:46:53.000000Z", 
  "msg": [
   "Added command line option to specify additional classpath.", 
   "java -jar doesn't pass CLASSPATH or -cp ( at least on JDK1.3 )"
  ], 
  "revision_id": "282431"
 }, 
 {
  "author": "costin", 
  "date": "2000-09-17T06:40:30.000000Z", 
  "msg": [
   "Refactoring - moved the timers ( or accounting system ) in a separate class.", 
   "This is shared by ContextManager, Request and other classes that need", 
   "to store timing, usage counters, etc.", 
   "It need a nice web page to display the information."
  ], 
  "revision_id": "282430"
 }
]