[
 {
  "author": "craigmcc", 
  "date": "2000-11-04T20:08:07.000000Z", 
  "msg": [
   "When receiving messages from the input stream, fully read the header and", 
   "the message before returning."
  ], 
  "revision_id": "282579"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-03T23:18:57.000000Z", 
  "msg": [
   "WebDav seems to work fine in DAVExplorer. Excelent code...", 
   "The directory structure is a mess, I'll fix it later ( i.e. move", 
   "all the sources in src/webdav/WEB-INF/src, make it a standalone", 
   "webapplication).", 
   "So far it seems to work with absolutely no dependency on tomcat -", 
   "if someone has another container it would be nice to test it!!!!", 
   "( the .war will be available soon, need to fix the build )"
  ], 
  "revision_id": "282578"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-03T21:27:47.000000Z", 
  "msg": [
   "Initial commit for the webdav module from catalina.", 
   "Most of the junk is removed, but a bit more refactoring is still needed -", 
   "the cache generates a lot of garbage and the number of threads need to", 
   "be reduced ( and integrated with the server's thread management )", 
   "The new tomcat3 module has no external dependency ( except servlet22.jar ).", 
   "It doesn't work yet, but compiles fine ( it's very close to working :-)", 
   "Probably the resources should go to tomcat.util.resources, as we may reuse", 
   "them ( or at least the cache ) for static files ( well, that's just for", 
   "benchmark purpose, I don't think any decent admin would turn this on,", 
   "using a large cache in java will kill everything else - of course,", 
   "if only one file is cached, like in a \"ab\" benchmark, it looks ok ... )", 
   "The only missing part is the ServerLiaison, that will allow it to plug", 
   "into any servlet container."
  ], 
  "revision_id": "282577"
 }, 
 {
  "author": "nacho", 
  "date": "2000-11-03T12:15:37.000000Z", 
  "msg": [
   "Sync shell script with new jar structure."
  ], 
  "revision_id": "282576"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-02T21:57:01.000000Z", 
  "msg": [
   "Few changes to Hello and HelloW ( 100 bytes output )", 
   "Removed old tags from build.xml"
  ], 
  "revision_id": "282575"
 }
]