[
 {
  "author": "craigmcc", 
  "date": "2000-11-05T03:55:50.000000Z", 
  "msg": [
   "Eliminiate the performance impact of locking on every request to avoid", 
   "the race condition.  Thanks to Sam Ruby for pointing this out."
  ], 
  "revision_id": "282589"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-05T03:36:04.000000Z", 
  "msg": [
   "Fix a race condition that could cause a servlet to be initialized twice if", 
   "it had not been initialized before, and two+ simultaneous requests are", 
   "received.", 
   "Submitted by: yhs@mimic.onesource.com"
  ], 
  "revision_id": "282588"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-05T03:12:03.000000Z", 
  "msg": [
   "Although I could not reproduce a reported error (\"calling a servlet with", 
   "RequestDispatcher.include() cauases headers and cookies that were set in", 
   "the calling servlet to disappear), I did find many cases where the", 
   "included servlet could mess things up.  In particular, Tomcat 3.2 was not", 
   "ignoring the following calls from an included servlet:", 
   "- response.reset()", 
   "- response.addCookie()", 
   "- response.setLocale()", 
   "- response.setContentType()", 
   "- response.setContentLength()", 
   "I also tried to get rid of the convoluted double negative logic in most", 
   "cases, but I don't really want to mess with more of this than necessary."
  ], 
  "revision_id": "282587"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-05T00:01:24.000000Z", 
  "msg": [
   "If ap_bread() returns a negative value (to indicate that an error occurred),", 
   "return -1 ourselves instead of trying to call ap_bwrite() with a length of", 
   "-1.  This was causing a GPF on Windows.", 
   "Submitted by: yhs@mimic.onesource.com"
  ], 
  "revision_id": "282586"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-04T23:48:11.000000Z", 
  "msg": [
   "Fix a bug in \"jk_ajp13.c\" that caused the \"Authorization\" header to be", 
   "incorrectly transmitted to Tomcat as an \"Accept-Language\" header.", 
   "I DO NOT HAVE REASONABLE FACILITIES TO TEST THIS PATCH - PLEASE TRY IT OUT.", 
   "Submitted by: Sergejs Suskovs <sergejs.suskovs@linkedwith.com>"
  ], 
  "revision_id": "282585"
 }
]