[
 {
  "author": "craigmcc", 
  "date": "2000-11-18T01:34:00.000000Z", 
  "msg": [
   "Enable the use of load balancing (behind Apache), even when URL rewriting", 
   "is used to maintain session state.  A *big* thank you to Shai Fultheim for", 
   "creating and testing this patch, and then submitting it multiple times", 
   "because the underlying source files were being changed for other fixes.", 
   "Submitted by:\tShai Fultheim <shai@brm.com>"
  ], 
  "revision_id": "282669"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-18T00:09:44.000000Z", 
  "msg": [
   "Implement a configuration option to disable ServletContext.getContext()", 
   "from returning the ServletContext for a different web application,", 
   "possibly allowing a malicious webapp to bypass security constraints.  This", 
   "is in accordance with the JavaDoc comments for this method, which state:", 
   "\"In a security conscious environment, the servlet", 
   "container may return null for a given URL.\"", 
   "The default setting allows access to other contexts, because this was the", 
   "previous behavior (and is the default behavior in Tomcat 4.0 at the", 
   "moment as well)."
  ], 
  "revision_id": "282668"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-18T00:07:00.000000Z", 
  "msg": [
   "Remove the old comment about security constraints and RequestDispatcher, which", 
   "turned out to be incorrect.", 
   "Add a new \"Known Issue\" comment about the fact that the generated configuration", 
   "files (such as tomcat-apache.conf) for web server integration known nothing", 
   "about the contents of \"web.xml\"."
  ], 
  "revision_id": "282667"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-17T23:19:55.000000Z", 
  "msg": [
   "(Porting a change from the 3.3 tree)", 
   "If Tomcat is run under a security manager, and a remote client tries to", 
   "connect that is not allowed by the security policy in place, log and", 
   "ignore the java.security.AccessControlException rather than shutting down", 
   "the endpoint.  This is done in a manner that should still be JDK 1.1", 
   "compliant.", 
   "Submitted by:\tGlenn Nielsen <glenn@voyager.apg.more.net>"
  ], 
  "revision_id": "282666"
 }, 
 {
  "author": "glenn", 
  "date": "2000-11-17T22:05:50.000000Z", 
  "msg": [
   "Remove current directory from CLASSPATH"
  ], 
  "revision_id": "282665"
 }
]