[
 {
  "author": "nacho", 
  "date": "2000-11-09T22:50:50.000000Z", 
  "msg": [
   "* Removing was added as binary to CVS"
  ], 
  "revision_id": "282624"
 }, 
 {
  "author": "larryi", 
  "date": "2000-11-09T21:42:55.000000Z", 
  "msg": [
   "Add some indication of the unavailable time to the default response for", 
   "UnavailableExceptions.  Needed to see if recent changes to Exception", 
   "handling are actually working."
  ], 
  "revision_id": "282623"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-09T21:21:35.000000Z", 
  "msg": [
   "Do not attempt to load the \"PermanentlyAvailable2\" servlet at startup time.", 
   "Because the test application is part of the default build, this will lead to", 
   "tons of user questions about \"Why do I get this error message at startup time\"", 
   "even though the error message is correct."
  ], 
  "revision_id": "282622"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-09T21:18:09.000000Z", 
  "msg": [
   "Previous changes implemented \"exception rethrowing\" in the case of a path", 
   "based include().  This patch adds the following enhancements:", 
   "- If an included servlet throws an exception other than IOException or", 
   "ServletException, wrap it in a new ServletException (as the root cause)", 
   "and throw that instead.", 
   "- Add exception throwing support in the following additional cases:", 
   "* Path based forward() - getServletContext().getRequestDispatcher()", 
   "* Name based include() - getServletContext().getNamedDispatcher()", 
   "* Name based forward() - getServletContext().getNamedDispatcher()", 
   "- When processing a named based include, set the \"included\" flag on the", 
   "response so that attempts to modify headers and cookies in the included", 
   "servlet are (correctly) ignored.", 
   "Currently passes all the Watchdog servlet tests, and all the Watchdog JSP", 
   "tests except for some taglib-related ones that are unrelated to this", 
   "particular issue."
  ], 
  "revision_id": "282621"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-09T20:17:52.000000Z", 
  "msg": [
   "Allow the tests to run under Ant 1.2 and later.  Without this, the <taskdef>", 
   "for GTest was not being recognized."
  ], 
  "revision_id": "282620"
 }
]