[
 {
  "author": "craigmcc", 
  "date": "2000-11-10T06:42:52.000000Z", 
  "msg": [
   "Make references to StringManager instances static in all relevant cases,", 
   "because the actual strings (and corresponding resource bundles) do not", 
   "change while Tomcat is running.  This should positively impact", 
   "performance, with no negative consequences.", 
   "PR: BugRat Bug Report #110"
  ], 
  "revision_id": "282629"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-10T02:59:39.000000Z", 
  "msg": [
   "Correctly perform header name comparisons based on the data type of the", 
   "*name*, not the *value*.  This bug caused duplicate headers in some cases,", 
   "even if the calling servlet called a method like response.setDateHeader()", 
   "with the same header name more than once (which should cause the previous", 
   "value to be replaced).", 
   "PR: BugRat Bug Report #185."
  ], 
  "revision_id": "282628"
 }, 
 {
  "author": "nacho", 
  "date": "2000-11-10T02:50:01.000000Z", 
  "msg": [
   "* Fixing a problem with redirections,  was using the lsocket port", 
   "not the host header port if present"
  ], 
  "revision_id": "282627"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-10T02:06:32.000000Z", 
  "msg": [
   "Restore the previous exception propogation model so that exceptions are", 
   "propogated only from included servlets.  This undoes part of a change", 
   "Larry committed earlier -- after further discussion with him, we've agreed", 
   "that this is the correct behavior so that servlets can trap exceptions", 
   "thrown by included servlets without corrupting the content of the", 
   "response.", 
   "NOTE:  If you include a JSP page that declares an error page, and your JSP", 
   "page throws an exception, the transfer to the error page will still happen", 
   "as expected even in an included page.  This is handled completely within", 
   "the JSP environment, and did not rely on the error propogation mechanism", 
   "for servlet exceptions -- which was Larry's primary concern.", 
   "As a result of this change, Tomcat 3.2 will trigger the <error-page>", 
   "handling only if the top-level servlet throws an exception.  This is also", 
   "consistent with the behavior of Tomcat 4.0 in this respect."
  ], 
  "revision_id": "282626"
 }, 
 {
  "author": "nacho", 
  "date": "2000-11-09T22:52:26.000000Z", 
  "msg": [
   "* Readding en properties as text", 
   "* Making es in synch with latest additions"
  ], 
  "revision_id": "282625"
 }
]