[
 {
  "author": "pierred", 
  "date": "2000-12-19T23:44:40.000000Z", 
  "msg": [
   "Bug fix for bug report #540.", 
   "\"If you have more than one set of tags with the same name, you get a compile error like this:", 
   "Variable '_tmpS' is already defined in this method. String [] _tmpS = new String[3]; It doesn't look like the temp string is", 
   "even needed, it isn't referenced anywhere but where it's declared.\"", 
   "This statement was indeed superfluous. Removed it.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tMark Wutka ( mark@wutka.com )", 
   "Reviewed by:"
  ], 
  "revision_id": "282794"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-19T23:18:30.000000Z", 
  "msg": [
   "More function name updates."
  ], 
  "revision_id": "282793"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-19T21:19:21.000000Z", 
  "msg": [
   "First round of changes to support the latest Apache2.0", 
   "It should compile ( with warnings - there are still functions that haven't", 
   "been changed )."
  ], 
  "revision_id": "282792"
 }, 
 {
  "author": "larryi", 
  "date": "2000-12-17T22:16:36.000000Z", 
  "msg": [
   "More fixes for exception handling.", 
   "It now works correctly when an included serlvet catches an exception and", 
   "either handles it or rethrows a different exception.", 
   "It also works correctly when an included servlet throws an permanent", 
   "UnavailableException.  If \"includers\" do not handle the exception, they are", 
   "not made permanently unavailable too!", 
   "The idea of saving the original exception on Response and not overwriting it", 
   "doesn't work when exceptions are caught and handled or a different", 
   "exception is thrown. As a result, Handler.saveError() now always saves new", 
   "exceptions on the Response, not updating the information if the exception", 
   "is the same as the one already set.", 
   "Removing the errorException property from Request since it is no longer", 
   "needed."
  ], 
  "revision_id": "282791"
 }, 
 {
  "author": "nacho", 
  "date": "2000-12-17T02:37:55.000000Z", 
  "msg": [
   "a Typo"
  ], 
  "revision_id": "282790"
 }
]