[
 {
  "author": "costin", 
  "date": "2000-12-03T08:19:03.000000Z", 
  "msg": [
   "Few more changes in startup:", 
   "- make sure no request is served before all interceptors are started.", 
   "- added 2 more hooks - engineStart/engineStop. That will allow modules", 
   "to know when the engine is accepting connections and when is it stopped", 
   "( mostly for the use of connectors )"
  ], 
  "revision_id": "282729"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-03T07:44:53.000000Z", 
  "msg": [
   "Fixed last watchdog failure for 3.3. Now hunting changes that went in 3.2", 
   "but were not updated to 3.3.", 
   "Nightly builds will include watchdog results ( run 3 times - another good", 
   "performance indicator, plus a good stress test. If everything works ok", 
   "I'll increase that to a higher number of passes )"
  ], 
  "revision_id": "282728"
 }, 
 {
  "author": "larryi", 
  "date": "2000-12-03T01:51:27.000000Z", 
  "msg": [
   "Change meaning of JspInfo.compileTime to \"time of last attempted", 
   "translate-and-compile\".  At startup, set compileTime from the java file", 
   "if the class file doesn't exist and the java file is found.", 
   "This avoids retrying the translate-and-compile when it is just going to fail", 
   "again.  If java source is being kept, each retry would create a new java", 
   "file."
  ], 
  "revision_id": "282727"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-02T08:27:03.000000Z", 
  "msg": [
   "- Fixed the documentation of ContextManager ( or started to ), fixed", 
   "the shutdown. Thanks Larry, I think now is better. I'll continue to", 
   "fix the code to match the documentation.", 
   "- fixed the compilation for jdk1.1.7 ( the compiler is buggy )", 
   "- make sure the \"JVM is broken\" is displayed only once, no need", 
   "to see it for every request."
  ], 
  "revision_id": "282726"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-01T23:15:22.000000Z", 
  "msg": [
   "Checked in \"debug\" version of DependManager. It seems the workaround", 
   "works fine ( i.e. call the method from another method, ignore the result", 
   "that is bogus and return the real value )"
  ], 
  "revision_id": "282725"
 }
]