[
 {
  "author": "craigmcc", 
  "date": "2000-12-01T03:00:41.000000Z", 
  "msg": [
   "Fix a potential security problem in Tomcat 3.2.", 
   "The servlet specification prohibits servlet containers from serving", 
   "\"files\" in the WEB-INF directory of a web application.  Tomcat 3.2", 
   "currently enforces this restriction on static resources (like", 
   "/WEB-INF/web.xml),but allowed access to JSP pages stored there", 
   "(/WEB-INF/index.jsp).  This access is no longer allowed.", 
   "Submitted by: David Aiken <David_Aiken@bmc.com>"
  ], 
  "revision_id": "282719"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-30T22:43:55.000000Z", 
  "msg": [
   "Removed the old ServerCookie and 1/2 of CookieTools."
  ], 
  "revision_id": "282718"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-30T17:42:49.000000Z", 
  "msg": [
   "Start work on Cookies, Parameters, Headers.", 
   "The code in Cookies is almost ready, all cookie processing was re-done", 
   "from scratch - and will support the full spec, not only name/values.", 
   "It'll also be much faster, and the object model is better ( no need", 
   "for artificial \"helpers\").", 
   "Parameter parsing is also rewritten ( and more efficient ).", 
   "Both Parameters and Cookies are now (almost) GC-free. The code will be more", 
   "eficient if there are only few cookies/parameters (2..10 ?), for requests", 
   "with many params we'll add the optimizations later.", 
   "The code is not used right now - it'll gradually move in."
  ], 
  "revision_id": "282717"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-30T17:34:18.000000Z", 
  "msg": [
   "Start refactoring of MimeHeaders, params and cookies.", 
   "MultiMap is a subset of MimeHeaders ( same data representation, but only", 
   "\"generic\" methods ) and will be the base of all 3 collections.", 
   "( we can add a hash and other optimizations, but after the refactoring is done)", 
   "Also, moved SimpleHashtable to tomcat.util.collections - reduce the", 
   "name polution in tomcat.util"
  ], 
  "revision_id": "282716"
 }, 
 {
  "author": "costin", 
  "date": "2000-11-30T08:23:51.000000Z", 
  "msg": [
   "Added the raw data for various performance tests comparing 3.0, 3.1, 3.2 and 3.3", 
   "( I'll add more as we go, probably not very usefull but it is information you", 
   "can filter out )", 
   "It would be interesting to test on different systems/OS/VMs, but I don't have", 
   "time right now.", 
   "Also, needs HTML, formating - if you find it usefull I'll do that, if not", 
   "I'll just remove it ."
  ], 
  "revision_id": "282715"
 }
]