[
 {
  "author": "costin", 
  "date": "2000-12-04T21:22:49.000000Z", 
  "msg": [
   "Added a connector ( based on refactoring of DefaultCMSetter, etc) to set", 
   "and manage the workdir.", 
   "New options to use a private directory inside WEB-INF ( according to the spec", 
   "a container is allowed to use it's own internal representation of a web", 
   "application ) - that would simplify the configuration of security", 
   "options and ( if the workdir is used to store persistent data like", 
   "compiled jsp files ) simplify the migration of webapplications", 
   "in a pool of containers.", 
   "This also allow people to completely replace the current behavior more easily,", 
   "by keeping all that's related with workdir in a single module."
  ], 
  "revision_id": "282739"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-04T21:18:44.000000Z", 
  "msg": [
   "Added a new module that should replace AutoConfig.", 
   "The new module is aware of virtual hosts ( 3.2 supports auto-loading", 
   "of apps from tomcat/webapps - but only in the \"default\" host )", 
   "It also supports contexts mapped to \"deep\" paths ( 3.2 supports only", 
   "one level - i.e apps mapped to top level URIs).", 
   "It will replace AutoConfig after more testing and after I'll add the code to", 
   "supprot old /webapps dir."
  ], 
  "revision_id": "282738"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-04T21:11:56.000000Z", 
  "msg": [
   "Added a new module, based on refactoring part of DefaultCMSetter.", 
   "This module will \"fix\" any relative path used in tomcat's configs,", 
   "using the same rules as before. The main difference is that all the \"fixing\" is", 
   "grouped in a single replaceable module - that should make the code", 
   "easier to read and fix.", 
   "The module will replace DefaultCMSetter after some more testing. It needs more", 
   "documentation of the rules ( based on what we think is the right way to", 
   "do that, not what happened to happen before )"
  ], 
  "revision_id": "282737"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-04T18:47:46.000000Z", 
  "msg": [
   "Change log() methods in BaseInterceptor to public - if get/set", 
   "debug and all other methods are public there is no reason to make", 
   "the log() method protected.", 
   "This also fix a build problem on 1.2.2/solaris ( where the SimpleRealm", 
   "doesn't compile - and I'm not sure the compiler is right or wrong", 
   "rejecting access to a protected method from an internal class of", 
   "a class that extends the base class )"
  ], 
  "revision_id": "282736"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-04T18:47:07.000000Z", 
  "msg": [
   "Add the exception message to the log when a SQLException occurs, to aid", 
   "in debugging the underlying cause of the problem.", 
   "Submitted by:\tScott Hamilton <hamilton@grunj.cat.org.au>"
  ], 
  "revision_id": "282735"
 }
]