[
 {
  "author": "costin", 
  "date": "2000-12-26T23:13:55.000000Z", 
  "msg": [
   "Refactoring - moved init/shutdown from ContextManager to Context ( better OO :-)", 
   "Added the setProperty/getProperty - to reduce the pressure of adding", 
   "new methods needed by various modules. XmlMapper will automatically call", 
   "setProperty if no explicit setter is found.", 
   "That would allow people to better develop modules, without asking for", 
   "changes in the core ( that should  be frozen after 3.3dev is finished )"
  ], 
  "revision_id": "282819"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-26T23:10:55.000000Z", 
  "msg": [
   "- added more doc to Container", 
   "- added removeInterceptor ( you can now add and remove )", 
   "- fixed bugs related with the interceptor cache.", 
   "The whole thing was designed to allow runtime configuration without server", 
   "restart - but because of time constraints this didn't make it for 3.2."
  ], 
  "revision_id": "282818"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-26T23:07:57.000000Z", 
  "msg": [
   "Update the comments in BaseInterceptor, added hooks for add/remove Interceptor,", 
   "missing engineStart/Stop, addHandler. All those are important events in the", 
   "server operation and will allow modules to work better.", 
   "For example, the HttpInterceptor should refuse connections until engineStart", 
   "is called, and should stop accepting when engineStop is called ( or", 
   "return \"Temporarily unavailable ).", 
   "The add/removeIntereptor hook is important for monitoring modules and for", 
   "admin modules.", 
   "addHandler allow modules to find about all handlers that exist in the system."
  ], 
  "revision_id": "282817"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-26T23:02:00.000000Z", 
  "msg": [
   "Better log messages, make sure LogEvents reportst all events ( it's a great tool", 
   "in tracing the server activity )"
  ], 
  "revision_id": "282816"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-26T23:01:07.000000Z", 
  "msg": [
   "The contexts should be added before the engine is started.", 
   "engineInit() should initialize the interceptor and prepare it, if we add", 
   "contexts we might have a server that is not completely set up."
  ], 
  "revision_id": "282815"
 }
]