[
 {
  "author": "marcsaeg", 
  "date": "2000-12-22T17:35:05.000000Z", 
  "msg": [
   "The PRNG is now initialized with a seed value to prevent the multi-second", 
   "delay seen on many platforms.", 
   "This code is based on Craig's changes to Catalina that address the same", 
   "issue there."
  ], 
  "revision_id": "282804"
 }, 
 {
  "author": "pierred", 
  "date": "2000-12-22T14:19:14.000000Z", 
  "msg": [
   "Bug fix: bug report #269 -- java.io.UnsupportedEncodingException when processing JSP", 
   "From the bug report:", 
   "\"A \"java.io.UnsupportedEncodingException: UTF8\" is thrown when generating", 
   "the servlet for a JSP file when the Kaffe VM is used. The \"UTF8\" encoding", 
   "name is hardcoded in the Compiler class as the encoding for the generated", 
   "servlet source code file. I believe the reason for using \"UTF8\" as opposed", 
   "to \"UTF-8\" (note the dash) is that this is the only name supported in", 
   "JDK 1.1. I suggest adding an init parameter to JspServlet for setting", 
   "the encoding name when \"UTF8\" doesn't work.\"", 
   "Given that there are several possible representations of Unicode data", 
   "(UTF-8, UTF-16, UTF-32), and given that the supported encodings vary", 
   "between different implementations of the Java platform,", 
   "the best way to tackle this is probably as suggested by Hans.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tHans Bergsten ( hans@gefionsoftware.com )", 
   "Reviewed by:"
  ], 
  "revision_id": "282803"
 }, 
 {
  "author": "pierred", 
  "date": "2000-12-21T23:25:27.000000Z", 
  "msg": [
   "Check for null value before invoking method.", 
   "From email sent by Brian Bucknam:", 
   "It's a long story, but I'm working on a project where Jasper 3.x is embedded", 
   "inside a servlet, which can then be deployed to the container of our", 
   "customer's choice.  The servlet uses JSP files as templates, which is where", 
   "Jasper comes in.", 
   "In this type of environment, sometimes thing can go really wrong, and the", 
   "compiled JSP might, in some cases, fail to get a JspFactory, PageContext, or", 
   "JspWriter.", 
   "If any of _jspxFactory, pageContext, or out fail to be created, the catch{}", 
   "and finally{} clauses just throw NPE's.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:  \"Bucknam, Brian\" <Brian.Bucknam@webgain.com>", 
   "Reviewed by:"
  ], 
  "revision_id": "282802"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2000-12-21T19:24:19.000000Z", 
  "msg": [
   "Added notice about the NT service termination feature of JDK1.3"
  ], 
  "revision_id": "282801"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-20T19:45:23.000000Z", 
  "msg": [
   "1. I'm a stupid C programmer.", 
   "2. It seems to work now, by sending the buffer in chunks <= 4096.", 
   "I'll try to run watchdog and more tests, only one bug is not a good sign :-)"
  ], 
  "revision_id": "282800"
 }
]