[
 {
  "author": "costin", 
  "date": "2000-12-29T19:53:53.000000Z", 
  "msg": [
   "Ops, forgot the starting \"/\" in the path.", 
   "The workdir for examples in the default host should be:", 
   "work/DEFAULT/examples ( without this patch it's %2Fexamples - not nice )"
  ], 
  "revision_id": "282859"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-29T01:34:42.000000Z", 
  "msg": [
   "- replaced WorkDirInterceptor with the new ( rewritten ) version.", 
   "The replacement can handle storing the temp files in WEB-INF ( very", 
   "useful for setting policies for the applications ), can use better", 
   "names ( work/HOSTNAME/PATH instead of ugly names ) and of course", 
   "can use the old names.", 
   "Saving temp files in WEB-INF is disabled by default ( according to the spec", 
   "the server can use any internal file-system representation it wants, but", 
   "this needs a bit more review before enabling it by default ). A big", 
   "advantage is that all the files used by a web application are grouped.", 
   "- DefaultCMSetter will generate a random number in config. ( for later", 
   "use )", 
   "- Ajp12Interceptor will generate a file containing the current port.", 
   "The idea is to add a shared \"secret\" for shutdown, but without requiring", 
   "the user to configure anything - if someone has read access to the", 
   "conf directory, it can read the config file containing the user-configured", 
   "secret as well."
  ], 
  "revision_id": "282858"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-29T00:38:01.000000Z", 
  "msg": [
   "Removed SimpleTomcat ( used to be part of EmbededTomcat ). It belongs in", 
   "an example directory, not in the standard distribution."
  ], 
  "revision_id": "282857"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-29T00:35:47.000000Z", 
  "msg": [
   "Removed web.xml, web.dtd - the files are not used. ( web.dtd is duplicated", 
   "in tomcat.resources - that version is used to validate webapps )", 
   "Regarding web.xml - it has been a whole thread about that, and it hasn't", 
   "been used for quite a while - keeping it around is only confusing"
  ], 
  "revision_id": "282856"
 }, 
 {
  "author": "costin", 
  "date": "2000-12-29T00:33:15.000000Z", 
  "msg": [
   "More cleanup.", 
   "The sanity-test application is now separated ( no more polution on the", 
   "tomcat distribution ). I'll update the ant file to run it in the new", 
   "structure.", 
   "Simple-user realms are grouped under conf/users ( they are not intended for", 
   "production mode anyway - use JdbcRealm or JAAS )."
  ], 
  "revision_id": "282855"
 }
]