[
 {
  "author": "costin", 
  "date": "2001-01-28T19:20:34.000000Z", 
  "msg": [
   "Removed old LoaderInterceptor12, no longer needed ( util.compat ).", 
   "LoaderInterceptor11 will set the class loader attribute ( needed at", 
   "least in jasper's JspServlet - but maybe in other application )"
  ], 
  "revision_id": "282969"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-28T19:19:11.000000Z", 
  "msg": [
   "Removed unused modules."
  ], 
  "revision_id": "282968"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-28T19:18:37.000000Z", 
  "msg": [
   "Updated GTestTag to process \"port\", \"http.protocol\", \"host\"", 
   "parameters and set them as ant properties.", 
   "This allows testing with apache ( where http.protocol is HTTP/1.1, and", 
   "the port is different ), and allows to test virtual hosts.", 
   "Added the options in the simple form in test.jsp. ( again, the graphical", 
   "aspect of the test application sucks, and most of the taglibraries used", 
   "are ugly - the goal is to find and fix the bugs, we can make it look", 
   "nice later )", 
   "It would be really great if someone can \"beautify\" the test page and the", 
   "other admin pages, etc - but it's low priority right now."
  ], 
  "revision_id": "282967"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-28T05:54:35.000000Z", 
  "msg": [
   "JspInterceptor: adding support for all options supported by Jasper.", 
   "This is a slightly bigger change - the Mangler, Options and EngineContext", 
   "are moved out of JspInterceptor ( to respect the organization of", 
   "jasper and CommandLineCompiler ).", 
   "( they were developed with JspInterceptor as an experimental way to", 
   "speed up jsp execution - probably at the beggining of tomcat3.2 development,", 
   "now the code is stable, there is no reason to play with the jasper liaison )"
  ], 
  "revision_id": "282966"
 }, 
 {
  "author": "larryi", 
  "date": "2001-01-27T18:42:26.000000Z", 
  "msg": [
   "Add usability enhancements action item offered by Costin."
  ], 
  "revision_id": "282965"
 }
]