[
 {
  "author": "costin", 
  "date": "2001-02-01T05:06:04.000000Z", 
  "msg": [
   "The first significant change in core for this year :-)", 
   "The startup rules for tomcat were almost undefined in tomcat 3.2 and before,", 
   "and defining a clear state was one of the biggest issues for 3.3.", 
   "Things has improved ( thanks to Larry and Nacho for all the feedback),", 
   "but I don't think they are perfect yet", 
   "This is one of the biggest things that need review and attention.", 
   "This fix tightens up a bit more the startup process:", 
   "- no addContext or initContext hook can be called before the server is", 
   "fully configure ( i.e. in STATE_CONFIG ). Because the server.xml reader", 
   "adds both modules and contexts, calling addContext is delayed until", 
   "init()", 
   "- make clear that after init(), the server is fully configured and initialized", 
   "engineStart is mostly for connectors.", 
   "- reorganized a bit the documentation - runtime configuration is a different", 
   "issue.", 
   "Please read at least the ContextManager comments on the top, and send", 
   "any feedback.", 
   "( ContextManager has 1 very important role - call the hooks that", 
   "compose tomcat. It also stores global config, modules and contexts -", 
   "but that's easy )"
  ], 
  "revision_id": "282999"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T04:47:12.000000Z", 
  "msg": [
   "Fix cut&paste bug, all modules were called to handleError instead of", 
   "just the ones that implemented the hook.", 
   "Added few comments in BaseInterceptor. ( related with the fix in ContextManager", 
   "that will follow for startup order and war expansion )"
  ], 
  "revision_id": "282998"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T04:44:57.000000Z", 
  "msg": [
   "Return error code if jsp compilation fails."
  ], 
  "revision_id": "282997"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T04:43:48.000000Z", 
  "msg": [
   "- removed unused attribute from <ant:ant>", 
   "- fixed the auth-constraing ( the role in admin-users.xml is tomcat_admin )", 
   "- update watchdog-servlet.jsp and watchdog-jsp.jsp to use <ant:ant>", 
   "( all 3 tests are working fine now - and passing. I found the problem with", 
   "watchdog jsp failures - it seems that one of the watchdog taglibs is", 
   "using a static variable that is initialized at compile time - so if", 
   "the .jsp is not re-compiled the test will fail. The only workaround is", 
   "to do a \"rm -rf work/DEFAULT/jsp-test/jsp/tagext )"
  ], 
  "revision_id": "282996"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T04:38:14.000000Z", 
  "msg": [
   "Added the shell scripts I use for the nightly build. All is an ugly", 
   "hack, but it works ( it started with a simple shell to just build", 
   "tomcat )."
  ], 
  "revision_id": "282995"
 }
]