[
 {
  "author": "costin", 
  "date": "2001-01-21T20:10:40.000000Z", 
  "msg": [
   "Varius cosmetic changes to the testing component of the admin webapp.", 
   "- Option to do \"external\" formating ( i.e. the test results are stored,", 
   "and the JSP page can do whatever formating it wants ). Old style is", 
   "still supported ( text, simple html generated by GTest )", 
   "- A simple tag to set the defaults for HttpClient and GTest ( avoid quite", 
   "a few keystrokes - host=\"${host}\", etc for each test )", 
   "- test.jsp will display the FAILED tests first ( easier to read )", 
   "- the test now detects HTTP/0.9 errors ( 9 tests are now failing, mostly", 
   "because of a bug in HTTP/0.9 support - not hard to fix, I think the bug", 
   "is also present in 3.2 ). The old GTest didn't implemented 0.9 support", 
   "corectly, and accepted 1.0 responses for 0.9 requests. Few of the tests are", 
   "wrong from the same reason ( expect status on 0.9 requests )", 
   "- fixes, more options, etc"
  ], 
  "revision_id": "282939"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-21T06:39:22.000000Z", 
  "msg": [
   "Second round of changes in the sanity-test running.", 
   "You should be able to run the tests by starting tomcat and accessing", 
   "http://localhost:8080/admin/test/test.jsp", 
   "The old GTest is deprecated, it has been split into HttpClient and", 
   "DefaultMatcher ( plus a wrapper that allows 'old-style' calling ).", 
   "The goal is to make it easy to run the tests, and to make it easy and", 
   "clean to add tests.", 
   "I'll probably add a page that allow to run watchdog from the web, but", 
   "right now it's more important to get \"writing new tests\" and", 
   "adding regression tests for the bugs we fix as easy and simple as possible.", 
   "( long term we should use a dedicated test program - ant is getting", 
   "very hard to use embeded without enough API control ).", 
   "Changes:", 
   "- added a form to test.jsp, allow to run a subset of the tests", 
   "- fixes to deal with IntrospectionHelper", 
   "- various fixes in the util.test", 
   "- more debugging", 
   "- dispay the <a> on GET tests, so we can re-run individual tests", 
   "manually", 
   "- added a sample test using the cleaner ( IMHO ) syntax ( i.e. httpClient", 
   "followed by a matcher )", 
   "Missing:", 
   "- code documentation", 
   "- documentation on how to write tests", 
   "- fixes, etc.", 
   "( it's a test application, should make things simpler - if it doesn't we", 
   "should go back to the old one )"
  ], 
  "revision_id": "282938"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-20T23:25:44.000000Z", 
  "msg": [
   "- accept a \"target\" request parameter ( to run a subset of the tests )", 
   "- make sure the context logs go to the context log", 
   "- added (the initial) code to support using JspServlet as an option.", 
   "( that is turned now on by default - will change after this is tested", 
   "and finished )", 
   "XXX missing - add code to support setting all options supported by jasper,", 
   "in both cases - JspServlet params or the TomcatOptions for interceptor-only."
  ], 
  "revision_id": "282937"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-20T21:50:24.000000Z", 
  "msg": [
   "The web-based test runner started to work on my machine ( using the", 
   "old GTest, the new one is still not tested ).", 
   "Changes:", 
   "- add the old GTest to the /admin ( using build.xml )", 
   "- removed unused lines, cleaned a bit build.xml", 
   "- enhance the adm:admin taglib - it can now change the logger of a Context", 
   "( it probably need a form and a page for general use, I need it for", 
   "the test app )", 
   "- enhance the adm:gtest taglib - set the default writer of GTest to", 
   "the servlet output writer ( ant messages are handled by AntServletLogger ),", 
   "also show root cause and set html style output.", 
   "- added the simple test.jsp page, to get things running"
  ], 
  "revision_id": "282936"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-20T21:44:39.000000Z", 
  "msg": [
   "Trying to get my CVS in sync.", 
   "Changes to IntrospectionUtil to better process the classpath, removed", 
   "dead code, small optimization in ContentType ( one less String !).", 
   "In the new GTest: allow to set a default outType ( it'll generate reports", 
   "in text, xml, html )."
  ], 
  "revision_id": "282935"
 }
]