[
 {
  "author": "costin", 
  "date": "2001-01-20T19:28:20.000000Z", 
  "msg": [
   "Added a paragraph about the release team and release manager, listing", 
   "the current volunteers. ( the final list will be of course decided", 
   "in the voting process ).", 
   "Added an action item to add a credits page with the members of the", 
   "release team ( will be part of the standard distribution, so people", 
   "can contact the right persons )."
  ], 
  "revision_id": "282929"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-20T03:43:07.000000Z", 
  "msg": [
   "Few changes in build.xml:", 
   "- remove older packages ( tomcat/logging, etc )", 
   "- added the self-test application to the default target, it'll be", 
   "built by default now - but probably we need to disable/remove it from", 
   "the distribution ( tests may have security problems ). I think it's very", 
   "important to keep it enabled for a while, so people can test", 
   "on multiple platforms and maybe add test cases for their bugs.", 
   "- no longer copy ant.jar in tomcat/lib - ant is not used right now, no", 
   "need to include it in CLASSPATH by default. Applications needing ant should", 
   "include it in WEB-INF.", 
   "- indentation of xml ( easier to read )", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "282928"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-20T02:35:36.000000Z", 
  "msg": [
   "Added missing file, needed to run the self-test ( was moved from share/", 
   "since was not a required part of tomcat, and is used only in the test", 
   "app ).", 
   "There are many enhancements needed to make it really easy to run the", 
   "tests. I guess we'll do them as we go.", 
   "I also did a small change - GTest new extends Task and uses log() instead", 
   "of System.out(). ( I'll check in a jsp file that runs the test - the change is", 
   "needed to send the output to the right destination ).", 
   "Note: this is a change to the CVS HEAD. IMHO there is nothing to stop", 
   "fixes to go in - as long as we don't call it anyway. I'll commit a number", 
   "of fixes over the weekend - including restoring the JDK1.1 build ( plus", 
   "a solution that will simplify supporting JDK1.1 ), and I'll probably finish", 
   "the .jsp taglib that runs the tests. Lazy consensus should work as before -", 
   "if anyone has a problem with any checkin, please -1 it."
  ], 
  "revision_id": "282927"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-19T03:28:00.000000Z", 
  "msg": [
   "- incorporate Jon's suggestions: specify that the release team will", 
   "coordinate the support, the milestones will be periodical,based on", 
   "the RM decision, +1 commiters will decide what goes in during beta,", 
   "added mention for the extra OSs.", 
   "- incorporate Larry's sugestions ( Jasper, JspServlet )", 
   "- incorporate Hans sugestions ( move the goals to release criteria, added", 
   "a note regarding the new features and STATUS, added a list of open items )", 
   "Some notes:", 
   "- I don't think we can add a requirement that all bugs have test cases. This is", 
   "sometimes impossible, and AFAIK no other apache project is doing that.", 
   "- MacOS ( and FreeBSD ) are optional - most current developers are not using", 
   "them, and this would be a too big burden. We'll try to get people using those", 
   "OSes to contribute test reports."
  ], 
  "revision_id": "282926"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-18T07:38:23.000000Z", 
  "msg": [
   "Initial checkin for the release proposal."
  ], 
  "revision_id": "282925"
 }
]