[
 {
  "author": "costin", 
  "date": "2001-01-29T06:46:19.000000Z", 
  "msg": [
   "A bit of reorganization of the tester before it becomes more complex.", 
   "We use simpler tags - GTestTag is dealing only with GTest-specific properties.", 
   "AntTag is calling ant, and you can set properties using AntProperty.", 
   "Tags that deal with ant are separated from tags that deal with general", 
   "administration ( which also need more specialization )", 
   "( BTW, there are quite a few interesting pages we can add - like", 
   "rebuilding a web application from the web page, etc - there is a lot", 
   "of automation that can be done using <ant> tag )"
  ], 
  "revision_id": "282979"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-28T21:46:01.000000Z", 
  "msg": [
   "Fix in mod_jk.c ( should resolve at least some of the failures", 
   "on Apache ) - we need to check Apache2.0 module too.", 
   "- send the \"right\" hostname and port ( uncomment the println to see", 
   "what's generated in the other cases - at least of 1.3.12 this is the", 
   "only combination that seems to work )", 
   "- This should fix \"Location\" problems with Apache", 
   "StaticInterceptor:", 
   "- more consistency with Apache, use 301 instead of 302 and do a redirect for", 
   "directories if the uri doesn't end in \"/\"", 
   "-Ajp12 - read the protocol from the server ( it was http/1.0 only ). Even", 
   "if currently tomcat implements only 1.0, we should report the protocol", 
   "of the real server - i.e. 1.1.", 
   "- added few comments in test-tomcat.xml", 
   "test.jsp:", 
   "- fill port and host from the request data ( if you access test.jsp", 
   "using Apache port - no need to change )", 
   "- added \"comments\" for failed tests. Gtest now supports a", 
   "<comment>body</comment> to allow more descriptive data ( description", 
   "is very limited )", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "282978"
 }, 
 {
  "author": "danmil", 
  "date": "2001-01-28T21:30:35.000000Z", 
  "msg": [
   "Fixed autogeneration of mod_jk.conf files by Tomcat, and", 
   "added intelligence about ajp13 v. ajp12.", 
   "The generated file will use ajp13 if Tomcat is configured to have", 
   "interceptors for both.", 
   "Also, adding an Ajp13Interceptor to the default server.xml config.", 
   "Contributed by Keith Wannamaker (Keith@Wannamaker.org)."
  ], 
  "revision_id": "282977"
 }, 
 {
  "author": "danmil", 
  "date": "2001-01-28T20:54:22.000000Z", 
  "msg": [
   "Fixing win32 build files to reflect new directory structure.", 
   "Contributed by Keith Wannamaker (Keith@Wannamaker.org)."
  ], 
  "revision_id": "282976"
 }, 
 {
  "author": "danmil", 
  "date": "2001-01-28T20:51:45.000000Z", 
  "msg": [
   "Adding support for WEBDAV methods to Ajp13.", 
   "Contributed by Keith Wannamaker (Keith@Wannamaker.org).", 
   "Also, adding documentation for what is done if the servlet container", 
   "requests more body information than the web server can supply."
  ], 
  "revision_id": "282975"
 }
]