[
 {
  "author": "larryi", 
  "date": "2001-01-22T21:21:44.000000Z", 
  "msg": [
   "Some updates the schedule and move open items to STATUS.html.", 
   "Filled in my name as Release Manager.", 
   "Added action items to the Release Preparation section of STATUS.html.", 
   "I'll make another pass through these documents, but at this time I don't", 
   "have any major changes planned.", 
   "Comments welcome.  Especially if I am missing something that is required by", 
   "previous agreements."
  ], 
  "revision_id": "282944"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-22T16:42:15.000000Z", 
  "msg": [
   "Added code and build changes to allow us to run watchdog using a simple", 
   "web page.", 
   "The \"right\" way to run watchdog is by using the provided scripts. The current", 
   "mechanism ( built using \"ant watchdog-web-based\" and run by accessing", 
   "http://localhost:8080/admin/test/watchdog-jsp.jsp , watchgod-servlet.jsp )", 
   "is intended to increase the test pool by making it easier for people with", 
   "special platforms to run tests. ( example - I don't think a Mac will run", 
   "either .sh or .bat files ).", 
   "Running watchdog as web application is mostly a hack - for example the", 
   "servlet tests are based on moo ( remember moo ? ), and the trick used is", 
   "an <ant> java task that runs it ( with fork=true ), so that the output", 
   "goes to the ant logger ( AntServletLogger in this case ). This is the", 
   "trickiest part, for jsps GTest is used ( and we use <replace> to patch", 
   "in the new GTest ).", 
   "This is not production-quality or even close - it's just a quick way to", 
   "get things started ( testing and adding regression tests to the /test", 
   "application ). The nightly builds will include both /test and watchdog,", 
   "in order to allow people to check tomcat on their platform. Running", 
   "the scripts is still the \"correct\" way to run watchdog."
  ], 
  "revision_id": "282943"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-22T06:12:13.000000Z", 
  "msg": [
   "Adding a regression test for the previous fix :-)", 
   "Probably we need some more funny-named jsps and see if we can", 
   "find any new bug."
  ], 
  "revision_id": "282942"
 }, 
 {
  "author": "costin", 
  "date": "2001-01-22T05:50:40.000000Z", 
  "msg": [
   "Fixed encoding bug - special characters that are ok in filesystem but", 
   "not in java classes are encoding ( same as in JspServlet ).", 
   "We still preserve the \"/\" and generate packages instead of long names.", 
   "( this is specific to JspInterceptor )"
  ], 
  "revision_id": "282941"
 }, 
 {
  "author": "larryi", 
  "date": "2001-01-22T04:28:43.000000Z", 
  "msg": [
   "Begin updating for next Tomcat.", 
   "Added items for some of the changes from Tomcat 3.2 that have been", 
   "completed.  These try to summarize some of the information found in the", 
   "changes3.3 file.  These additions are identified by the release being specified", 
   "as 3.3.", 
   "Append a section for adding action items related to the release.  I'll try to", 
   "flesh this out soon."
  ], 
  "revision_id": "282940"
 }
]