[
 {
  "author": "costin", 
  "date": "2001-02-03T05:43:18.000000Z", 
  "msg": [
   "Few changes needed to finish the LogSetter.", 
   "- ContextManager is no longer a \"Log\" manager - LogSetter is just setting", 
   "the Log tomcat will use ( instead of storing the logs in CM and then", 
   "processing them, etc )", 
   "- use better names for the log channel ( org/apache/tomcat/core ,", 
   "org/apache/tomcat/facade )", 
   "- no LogAware - LogSetter is doing the job of plugging the log in the", 
   "context and CM."
  ], 
  "revision_id": "283034"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T05:36:24.000000Z", 
  "msg": [
   "Finishing the LogSetter.", 
   "- The name of the log will be a full path ( org/apache/tomcat, etc )", 
   "instead of tc_log", 
   "- add a log message ( until we're sure everything works as we want )", 
   "- register and open the logger ( used to be the hack in DefaultCMSetter)", 
   "- explicitely set the Context log or the servlet log.", 
   "( there are few associated changes in CM, Context and BaseInterceptor -", 
   "next commit )"
  ], 
  "revision_id": "283033"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T05:29:50.000000Z", 
  "msg": [
   "Small change in Log, to allow future improvements ( if needed ) without", 
   "chaging the core.", 
   "Log has the methods used by tomcat.core and modules - QueueLogger and", 
   "DefaultLogger are simple implementations that are hidden behind Log.", 
   "This allows to use Log.getLog() instead of new Log and moves the", 
   "constants in Log, so only one class is used from core."
  ], 
  "revision_id": "283032"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T05:22:19.000000Z", 
  "msg": [
   "Finishing the LogSetter - the module that deals with Log is the", 
   "LogSetter, there is no need for the hack in DefaultCMSetter/PathSetter.", 
   "( the problem was that logs were set in a \"special\" way by server.xml.", 
   "Now it's just a regular module that has full access to all the", 
   "hooks and methods - no need for hacks )"
  ], 
  "revision_id": "283031"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T05:19:45.000000Z", 
  "msg": [
   "Started work on 427 - if a war file is specified in server.xml in", 
   "a different location than webapps, we should expand it.", 
   "( I'm not sure this is the right thing - IMHO the right thing would be to", 
   "do a simple deploytool - even as a simple shell script or in ant - and", 
   "do the deployment the right way. Auto-expanding war files was just a", 
   "simple solution to the lack of a real deploy tool. )"
  ], 
  "revision_id": "283030"
 }
]