[
 {
  "author": "costin", 
  "date": "2001-02-01T06:41:16.000000Z", 
  "msg": [
   "NPE - path can be null ( for console output ).", 
   "Note that per/context interceptors are not working right now, I'll", 
   "have them restored tommorow night. I also have to commit the fix", 
   "to the original problem ( war expansion broken )."
  ], 
  "revision_id": "283009"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T06:24:34.000000Z", 
  "msg": [
   "Use ServerXmlReader and ContextXmlReader."
  ], 
  "revision_id": "283008"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T06:22:08.000000Z", 
  "msg": [
   "Split ServerXmlInterceptor in 2 modules - one deals with general", 
   "server configuration ( reading server.xml and setting up the", 
   "modules that compose the server ), one deals with setting", 
   "context preferences.", 
   "This helps clarify the startup process, gives more flexibility.", 
   "One important thing is to try to use separate files for context", 
   "config and server config - this will also simplify context adding", 
   "and context configuration ( instead of editing server.xml, you'll just", 
   "add a file - see the way RedHat deals with that - like", 
   "/etc/xinetd.d, all the rc.x/ files, adding apps to the menu, etc )", 
   "Of course, it's just a matter of style - contexts in server.xml", 
   "will still be supported ( and this feature is available in tomcat", 
   "3.2 also - you can use multiple server-foo.xml files and split the", 
   "config, it's just that we don't use it by default )"
  ], 
  "revision_id": "283007"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T06:17:41.000000Z", 
  "msg": [
   "Added getFileBase() ( I wanted to fix what ServerXmlInterceptor was doing,", 
   "but since it's a general-purplose util I moved it to FileUtil )"
  ], 
  "revision_id": "283006"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-01T06:08:48.000000Z", 
  "msg": [
   "Replaced <Logger> with the LogSetter, now everything works the same way", 
   "without any special hacks.", 
   "The comments on logging moved to the LogSetter - I'll also migrate", 
   "more of the comments from server.xml to the modules.", 
   "The idea is that module documentation ( that should be located in", 
   "modules themself - or in the user documentation ) should be part of", 
   "the docs, not in xml comments. server.xml might get re-generated by", 
   "tools and the comments are hard to preserve.", 
   "We can add an explicit description=\"...\" to each module, to explain", 
   "what it's doing, but I don't think server.xml is the right user documentation", 
   "( if we decide to use it as user doc, we should add comments for all", 
   "modules )", 
   "( also fixed the class name in LogSetter - bad commit )"
  ], 
  "revision_id": "283005"
 }
]