[
 {
  "author": "keith", 
  "date": "2001-02-07T23:47:12.000000Z", 
  "msg": [
   "Add the ACL method to ajpv13", 
   "(see http://www.ietf.org/internet-drafts/draft-ietf-webdav-acl-04.txt)"
  ], 
  "revision_id": "283084"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2001-02-07T23:24:53.000000Z", 
  "msg": [
   "First draft of the proposed release plan for Tomcat 3.2.2"
  ], 
  "revision_id": "283083"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-07T07:01:30.000000Z", 
  "msg": [
   "Fixed a number of probles with reading the request body.", 
   "- moved the check for \"available\" in Request, and make sure all the", 
   "adapters are checking if more data is to be expected.", 
   "( it used to be in the facade, but this is not the only place where the", 
   "check must be made - it's much better to test it at the lower level )", 
   "- few changes in how the POST data is pushed in Parameters.", 
   "Note: reading the request body will be changed a bit to deal with the", 
   "encoding problems, right now the parameters have hardcoded charset", 
   "( that was the original code ), and needs to be fixed."
  ], 
  "revision_id": "283082"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-07T06:49:34.000000Z", 
  "msg": [
   "More work on testing the parameter handling.", 
   "The final tests will cover:", 
   "- POST + GET and the way the params are merged", 
   "- The Body is read on getParameter ( and not before )", 
   "- RequestDispatchers and the way params are merged and restored.", 
   "- RequestDispatchers and the rule that the Body is read on the first", 
   "getParameter ( this will probably fail with Tomcat3.2 )", 
   "- Same tests for JSPs ( the tests for reading the Body will probably", 
   "fail on 3.2 and if 3.3 is using JspServlet - since JspServlet does a", 
   "getParameter that will automatically read the body )", 
   "- the special case of jsp_compile ( the spec mentions that ?jsp_compile", 
   "can be used - which is a special form of parameter, since it has no =)", 
   "- also make sure that jsp_compile doesn't execute the jsp", 
   "So far the tests found few bugs in reading input, I'll commit the fix", 
   "tommorow."
  ], 
  "revision_id": "283081"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-07T06:42:48.000000Z", 
  "msg": [
   "Fix the test.jsp to allow multiple checks per request."
  ], 
  "revision_id": "283080"
 }
]