[
 {
  "author": "costin", 
  "date": "2001-02-06T06:33:35.000000Z", 
  "msg": [
   "ServletRequestFacade will now use Parameters. It'll also implement the", 
   "API requirements about when and how the POST parameters are read.", 
   "JspInterceptor will now deal with jsp_precompile."
  ], 
  "revision_id": "283059"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-06T06:30:58.000000Z", 
  "msg": [
   "Use Parameters in AccessInterceptor."
  ], 
  "revision_id": "283058"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-06T06:29:19.000000Z", 
  "msg": [
   "Corresponding changes in Request - the parameter representation and handling", 
   "is now encapsulated in Parameters.", 
   "The Request and RequestDispatcher will create and manipulate Parameters,", 
   "by adding data ( handlePostParameters() is a special case that will", 
   "\"feed\" all the post body to Parameters ). Parameters are not dealing with", 
   "reading data or anything similar - just store and manipulate params."
  ], 
  "revision_id": "283057"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-06T06:24:26.000000Z", 
  "msg": [
   "All parameter handling code is now part of Parameters.", 
   "The internal representation of parameters is now encapsulated,", 
   "no external class can access the internal details.", 
   "This is still the old code and representation ( hashatble of", 
   "name-> value[] ), but a the processing has been improved and now follows the", 
   "rules defined in the spec for merging GET/POST params and merging", 
   "RequestDispatcher queries.", 
   "It'll also simplify RequestDispatcher a lot by removing all the hacky", 
   "code to support parameter saving/restoring.", 
   "( this started as a fix for JspInterceptor to deal with jsp_precompile,", 
   "but it's better to do a real fix instead of a simple hack. )"
  ], 
  "revision_id": "283056"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-06T04:44:53.000000Z", 
  "msg": [
   "Shell changes to match Nacho's bat file.", 
   "The new behavior is enabled by default, comment out the first line", 
   "if you want to go back.", 
   "( after a transition period I'll remove the old code from the startup", 
   "script - it'll be much simpler and cleaner )"
  ], 
  "revision_id": "283055"
 }
]