[
 {
  "author": "nacho", 
  "date": "2001-02-04T22:05:17.000000Z", 
  "msg": [
   "Golden files cannot include localized messages.", 
   "XXX we need to deal with this in a more elaborated way ?", 
   "Perhaps a easy way is to have the national languaje version", 
   "of the Golden file in properties flavour ?", 
   "Comments are welcome.."
  ], 
  "revision_id": "283039"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T16:08:25.000000Z", 
  "msg": [
   "Added scripts for tomcat3.2.x nightly build & test.", 
   "Minor changes to reuse the previous script functions."
  ], 
  "revision_id": "283038"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T07:48:28.000000Z", 
  "msg": [
   "Fix setLog in TomcatAdmin taglib."
  ], 
  "revision_id": "283037"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T07:34:41.000000Z", 
  "msg": [
   "Ops, made a mistake - the context modules can't be initialized", 
   "before the context is added - since there is no context manager.", 
   "Also added some comments about the fact that the only tested", 
   "mode is: create context, add modules to it, add it to the server.", 
   "Adding/removing modules at run time may work, but it's not", 
   "supported or tested."
  ], 
  "revision_id": "283036"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-03T07:08:00.000000Z", 
  "msg": [
   "Few changes in Context to make sure the state and rules defined in", 
   "ContextManager are respected. ( i.e. no add/initContext before", 
   "all modules are initialized, etc ).", 
   "Note that per-Context modules have less power than global modules,", 
   "i.e. engineInit is called only when the Context is added, contextMap", 
   "is never called, etc.", 
   "That means that \"configuration\" modules and \"context mappers\" need to", 
   "be \"global\". It would be a good idea to make all modules that can be", 
   "context-local part of a \"profile\" to simplify the configuration", 
   "( for example a set of contexts that may share common authentication", 
   "style, logging, etc - right now you have to set it on each module )", 
   "Global modules are bad because it's hard to tune them for individual", 
   "contexts."
  ], 
  "revision_id": "283035"
 }
]