[
 {
  "author": "costin", 
  "date": "2001-02-27T16:56:33.000000Z", 
  "msg": [
   "DependManager is a note, shared by those modules."
  ], 
  "revision_id": "283214"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T16:54:02.000000Z", 
  "msg": [
   "Another change related with the profiles/lib reorg - remove the", 
   "dependency between core and DependManager.", 
   "As with the previous changes, DependManager is just an implementation", 
   "choice made by the Reload module ( and few other modules adding dependencies).", 
   "There are other ways to implement reloading ( modified class loaders, etc ),", 
   "and there is no reason to \"force\" one way in the core APIs.", 
   "DependManager is specific to a module ( or few ), but not required", 
   "for normal tomcat operation ( other choices are possible as well )."
  ], 
  "revision_id": "283213"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T16:26:08.000000Z", 
  "msg": [
   "Remove the Counters object - the only object using it ( AccountingInterceptor)", 
   "uses a local object ( it is specific to that interceptor ).", 
   "A better solution for accounting is needed, but it doesn't have to", 
   "be hardcoded."
  ], 
  "revision_id": "283212"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T16:24:23.000000Z", 
  "msg": [
   "Remove hard-coded dependency on \"Counters\" - Counters code is still", 
   "experimental and the same thing can be easily done without an explicit", 
   "get/set ( using notes ). That would also allow other \"accounting\"", 
   "modules to use better data structures."
  ], 
  "revision_id": "283211"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T16:20:04.000000Z", 
  "msg": [
   "Prepare to remove the dependecy on Counters ( an early experiment in", 
   "performance tunning ). The code is still ok, but it doesn't have to", 
   "be hard-coded in the core - a note is enough.", 
   "( BTW, this module shouldn't be part of the \"standard\" distribution, but", 
   "as a extra module - after we create the proposed modules/ directory )"
  ], 
  "revision_id": "283210"
 }
]