[
 {
  "author": "costin", 
  "date": "2001-02-27T18:23:11.000000Z", 
  "msg": [
   "Code move to simplify dependencies."
  ], 
  "revision_id": "283219"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T18:21:58.000000Z", 
  "msg": [
   "More info"
  ], 
  "revision_id": "283218"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T17:43:21.000000Z", 
  "msg": [
   "Added the top-level directories for the contributed modules and", 
   "apps that will not be included in the release ( either because", 
   "they are not ready or as a choice to keep the release focused).", 
   "This will allow us to check in the new adminUI and the digested auth.", 
   "Modules here should be considered \"revolution\"-like, and are not part", 
   "of the release ( or optional/ in ant terms ).", 
   "The main goals are to avoid featurism in the released tomcat, while", 
   "allowing people to add the functionality they need ( without impacting", 
   "the release cycle )"
  ], 
  "revision_id": "283217"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T17:16:50.000000Z", 
  "msg": [
   "Initial version of ProfileLoader.", 
   "It's a very simple class - it will read a profile description ( the", 
   "config attribute ) and store the set of modules and their config.", 
   "When a context is loaded with a propery \"profile\" matching the profile", 
   "name, all the modules will be added to the context.", 
   "For example:", 
   "<ProfileLoader config=\"conf/profile.xml\" name=\"foo\" />", 
   "...", 
   "<Context profile=\"foo\" ... />", 
   "The profile has 2 roles:", 
   "- simplified config ( you don't have to specify Jdbc auth + specific logger", 
   "options for each module )", 
   "- ( later ) allow groups of contexts to share some classes ( i.e. form a", 
   "hierarchy of class loaders ) - this is very important for inter-context", 
   "communication, without requiring libs shared by few apps to be", 
   "forced in the CLASSPATH ( at global level )."
  ], 
  "revision_id": "283216"
 }, 
 {
  "author": "costin", 
  "date": "2001-02-27T17:09:37.000000Z", 
  "msg": [
   "Small change in reading module definitions. All modules will be read and", 
   "saved in a CM note ( by ServerXmlReader ). Any module needing module", 
   "definition can use the note ( instead of reading again modules.xml ).", 
   "( modules.xml contains ant-like taskdefs, associating a tag name with", 
   "a class name implementing BaseInterceptor - not Task :-)", 
   "Other information can be added to modules.xml ( and be processed by a tool", 
   "like /admin )."
  ], 
  "revision_id": "283215"
 }
]