[
 {
  "author": "costin", 
  "date": "2001-03-08T01:08:06.000000Z", 
  "msg": [
   "Added code to replace the attributes using ${property}, ant-style,", 
   "as proposed. This works for all attributes set using SetProperties", 
   "( i.e. automatic introspection )", 
   "( also setVariable renamed setVar, it was overriding another method ).", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "283284"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-08T01:06:00.000000Z", 
  "msg": [
   "Added replaceProperties - cut&paste from ant, with dependencies removed.", 
   "It can be used with a Hasthable storing properties or with a", 
   "simple adapter ( the PropertySource - it's used to support default", 
   "or \"dynamic\"/runtime values ).", 
   "( before anyone start screaming \"duplication\" - I wrote part of the code", 
   "that deal with properties in ant, and it'll be moved in commons as soon", 
   "as possible - if ant people also agree to share it.  )"
  ], 
  "revision_id": "283283"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-08T00:59:41.000000Z", 
  "msg": [
   "Another step in ProfileLoader implementation. Now it has support", 
   "for separate class loaders for each profile, allowing groups", 
   "of application that share a certain set of common jars without", 
   "affecting the rest ( i.e. in configs with many applications, you", 
   "can partition both the config and the shared classes )", 
   "The code is not very clean ( a lot of cut&paste), but this is not used", 
   "by default.", 
   "I'll propose moving this to the \"outside-of-stable-release\" area, so", 
   "that (likely) changes in ProfileLoader will not delay or affect the release", 
   "quality."
  ], 
  "revision_id": "283282"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2001-03-08T00:56:41.000000Z", 
  "msg": [
   "The source for the example bulid.bat was incorrect.  There is a missing", 
   "%CP% on the second set.  The example build.bat file was fixed ages ago", 
   "but the documentation hadn't gotten updated.", 
   "PR: 447"
  ], 
  "revision_id": "283281"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-07T23:52:48.000000Z", 
  "msg": [
   "Set the DependManager on contextAdd, it'll be available in contextInit", 
   "( no need to check/create, all options are set in the ReloadInterceptor,", 
   "where reloading is configured ) ( assuming someone adds the config", 
   "options - right now they are not exposed )"
  ], 
  "revision_id": "283280"
 }
]