[
 {
  "author": "costin", 
  "date": "2001-03-08T18:42:43.000000Z", 
  "msg": [
   "Few more checks for invalid requests, removing JDK1.2 code that isn't needed."
  ], 
  "revision_id": "283289"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-08T14:31:34.000000Z", 
  "msg": [
   "Ops, wrong directory... Fix the last night's commit - sorry about it.", 
   "( the CVS should be closed during night time :-)"
  ], 
  "revision_id": "283288"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-08T07:23:02.000000Z", 
  "msg": [
   "My last change for M2 - replaced the attempted get/setNote with", 
   "get/setInfo.", 
   "The hook is intended for lazy evaluation of request informations like", 
   "the encoding and for more flexibility in attributes like the SSL chain.", 
   "Tomcat performance is due in part to the lazy evaluation - certain fields", 
   "in request are not used in all requests, and pre-computing them is a waste.", 
   "There is another problem - supporting attributes like the SSL chain", 
   "no longer requires the SSL module to set an attribute ( i.e. the chain ),", 
   "but can be delayed until and if the request needs it.", 
   "In the case of encoding - while this doesn't change too much in the", 
   "current implementation, it allows modules to provide smarter mechanisms", 
   "to detect the charset and more optimizations."
  ], 
  "revision_id": "283287"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-08T03:51:26.000000Z", 
  "msg": [
   "Small fix - getContextManager() instead of contextM.", 
   "Probably some of those lazy-initialziations should be removed - it's", 
   "great for performance when it's in the critical path, but for initialization", 
   "it doesn't matter."
  ], 
  "revision_id": "283286"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-08T01:09:52.000000Z", 
  "msg": [
   "Added code to support ant properties in the config file.", 
   "This is not completed, but should work fine for global", 
   "modules.", 
   "This doesn't/shouldn't affect the code stability in any way - if you don't", 
   "use properties nothing will change in tomcat's behavior.", 
   "This should allow us to clean/clarify the paths and what's relative", 
   "to what, and provide more flexibility in the configuraton."
  ], 
  "revision_id": "283285"
 }
]