[
 {
  "author": "nacho", 
  "date": "2001-03-11T19:29:14.000000Z", 
  "msg": [
   "Fix for Bugzilla bug#270", 
   "An invalid symlinked .jar file in WEB-INF/lib gives ambiguous error BugRat Report#489", 
   "Reported by : kief at bitBull.com (Kief Morris)"
  ], 
  "revision_id": "283319"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-11T02:45:43.000000Z", 
  "msg": [
   "Few more fixes on the build system.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "283318"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-10T18:27:16.000000Z", 
  "msg": [
   "Ok, the ugly is in.", 
   "Set \"work.dir\" to \"..\" if you want to use the previous layout", 
   "( with build in a separate dir and clean sources )", 
   "Also few changes ( you'll hate me for, but since you'll have to", 
   "change the build :-):", 
   "- Uniform naming ( ant.home, jsse.home, jaxp.home, etc - for all", 
   "binaries distribution we depend on )", 
   "- tomcat.home should be the dir where tomcat is installed,", 
   "use tomcat.dist and tomcat.build for the build ( a \"install\" target", 
   "may be added to install )", 
   "- convenience - \"install.dir\" points to a dir where you may download and", 
   "install various packages ( /usr/share, Program Files - I use", 
   "/opt/java )", 
   "- JSSE change - we no longer require JSSE to be included in CLASSPATH", 
   "to build, but just use the jsse.home", 
   "- Print \"DETECTED\" messages - so we know what we build", 
   "- No longer depend on watchdog - the web-based tester will just", 
   "include the files from servlet-tests/WEB-INF/classes in the", 
   "( separate ) class loader used to run ant ( for testing)."
  ], 
  "revision_id": "283317"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-10T18:21:22.000000Z", 
  "msg": [
   "A bit of clean-up, the build dir was a mess.", 
   "I'll update it to the latest nightly-build scripts, including the", 
   "new webapp that I'll use for nightly-builds.", 
   "( I hope to integreate the build system into gump, but this will", 
   "take time )"
  ], 
  "revision_id": "283316"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-10T18:18:43.000000Z", 
  "msg": [
   "First attempt to fix the UTF decoding bug.", 
   "This doesn't change the behavior - what worked before should work the", 
   "same ( i.e. bytes<0x80 ). For chars > 0x80 ( that didn't worked with", 
   "the previous code ) I cut&pasted code from xerces.", 
   "The idea is to avoid using the (memory expensive) String( bytes[] ),", 
   "which proved to be a performance problem in many cases.", 
   "Xerces is doing exactly the same thing to optimize the conversion.", 
   "This works for UTF8 - for all other encodings the slow method is used.", 
   "There is another way to resolve the problem ( a trick similar with", 
   "OutputBuffer ), and we may implement it someday, but the hope is that", 
   "people will start using unicode as a clean and simple solution for", 
   "non-ascii charsets.", 
   "Netscape and IIS and most platforms already support UTF. ( that doesn't mean", 
   "we shouldn't deal with the other encodings )", 
   "( the code is untested - I need UTF examples, adding files in", 
   "various encoding with \"strange\" names to the test suite is still on the", 
   "todo list )"
  ], 
  "revision_id": "283315"
 }
]