[
 {
  "author": "marcsaeg", 
  "date": "2001-03-27T21:29:29.000000Z", 
  "msg": [
   "Adding new \"how to\" document for Tomcat on NetWare.", 
   "Submitted by:    Mike Anderson [MMANDERS@novell.com]"
  ], 
  "revision_id": "283409"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-27T20:27:41.000000Z", 
  "msg": [
   "A quick fix for StopTomcat - if the file is not found ( probably because", 
   "we run from a different machine or tomcat was rebuilt ) but", 
   "command-line params are present ( port for example ), we'll execute", 
   "instead of throwing exception.( and ignore that ajp12.id is not found )"
  ], 
  "revision_id": "283408"
 }, 
 {
  "author": "melaquias", 
  "date": "2001-03-26T14:47:58.000000Z", 
  "msg": [
   "Temporary(?) fix to stop crashes when creating a new Session in embedded use of Jasper (i.e. as standalone JspServlet ).  Problem may occur in other situations as well, I'm not sure.", 
   "Problem:  When SimpleSessionStore.SimpleSessionManager.getNewSession() is called (as a result of a call to request.getSession(), the session ID of the new session has not been set.  Since it is implemented as a MessageBytes object, the .toString() method to get a string representation of the session id returns null.  When getNewSession() tries to use this value as a key into the sessions hashtable, a NullPointerException is thrown.", 
   "Fix:  To stop the crashing, I've added a line to \"getNewSession()\" to replace a null value for the string representation with the literal \"null\".  This should NOTbe considered a fix of the underlying problem:  Why is newId == null (i.e. why is the new session's id not initialized)?  The implication is that request.getSession() is broken in jasper right now, at least when using Jasper independent of tomcat."
  ], 
  "revision_id": "283407"
 }, 
 {
  "author": "larryi", 
  "date": "2001-03-25T21:53:17.000000Z", 
  "msg": [
   "Allow separate \"home\" and \"install\" directories by specifying both, \"home\"", 
   "using the \"tomcat.home\" System property and \"install\" using the", 
   "\"tomcat.install\" System property.  If either is not specified, it defaults to the", 
   "other. Classloader construction now uses \"install\" to find the \"lib\" jars."
  ], 
  "revision_id": "283406"
 }, 
 {
  "author": "nacho", 
  "date": "2001-03-25T13:33:45.000000Z", 
  "msg": [
   "Bug#1056", 
   "Jikes Compiler code fails under unix -patch", 
   "Reporter: tom at 58k.com (Thomas Riemer)"
  ], 
  "revision_id": "283405"
 }
]