[
 {
  "author": "costin", 
  "date": "2001-04-28T18:47:25.000000Z", 
  "msg": [
   "As discussed on tomcat-dev, build.sh and build.bat shoulnd't be used", 
   "( they were not maintained for a while ).", 
   "Use \"ant\" ( in the same way as you would use \"make\""
  ], 
  "revision_id": "283489"
 }, 
 {
  "author": "nacho", 
  "date": "2001-04-28T18:39:11.000000Z", 
  "msg": [
   "Bugzilla#348", 
   "security-role-ref not observed in isUserInRole() BugRat Report#626"
  ], 
  "revision_id": "283488"
 }, 
 {
  "author": "costin", 
  "date": "2001-04-28T17:01:41.000000Z", 
  "msg": [
   "Same changes as in runtime 11 - the code is almost identical with", 
   "the one in tomcat-4, with Constants and JasperException moved in", 
   "the same package and all external dependencyes removed", 
   "( well, replaced with a Liaiason ).", 
   "The code is very similar with runtime 1.1, with few diffs because of the new", 
   "features, minus performance optimizations.", 
   "It should be possible ( even quite easy ) to use the same code base for", 
   "both - with probably one or 2 \"ifs\" to provide the right behavior.", 
   "( not a priority for now, but when we start 'real' optimizations of the", 
   "runtime )"
  ], 
  "revision_id": "283487"
 }, 
 {
  "author": "costin", 
  "date": "2001-04-28T16:57:10.000000Z", 
  "msg": [
   "Adding the (slightly refactored) runtime of jasper ( the tomcat3.3 version ).", 
   "Changes compared with the original:", 
   "- new package names", 
   "- all runtime in the same place ( Constants and JasperException moved in", 
   "runtime, since they are runtime-used )", 
   "- Constants no longer have \"log\" or \"getString\" methods, but only constants", 
   "- no dependency on any external code !!! No logger, simple pool or string", 
   "manager - those services should be provided by the container ( or container", 
   "adapter ), and a Liaiason interface is provided.", 
   "- JspFactoryImpl is the class used to plug in the Liaiason ( as sugested", 
   "in the specs ). From an jasper integrator view it's the only object it", 
   "should manipulate ( next step: add explicit setters for all things that", 
   "the runtime know, stop using \"tricks\" like runtime properties. The integrator", 
   "should provide configuration of JspFactoryImpl via whatever it want.", 
   "Note that we still have a lot of code that is not actually used at runtime", 
   "but at compile time - that should go away in time.", 
   "As soon as the compiler is modified to generate self-contained code we should", 
   "be able to include the runtime in the war, with jspc-generated code and", 
   "have self-contained apps ( from the point of view of jasper )."
  ], 
  "revision_id": "283486"
 }, 
 {
  "author": "costin", 
  "date": "2001-04-28T16:48:53.000000Z", 
  "msg": [
   "Added build.xml for runtimes."
  ], 
  "revision_id": "283485"
 }
]