[
 {
  "author": "costin", 
  "date": "2001-06-09T03:33:24.000000Z", 
  "msg": [
   "Ops, commited a bit too much...", 
   "Removed the serialization/deserialization of tomcat snapshots ( it doesn't", 
   "work anyway without the additional \"transient\" and \"Serializable\"), better", 
   "to keep things simple."
  ], 
  "revision_id": "283659"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-09T03:28:50.000000Z", 
  "msg": [
   "A bit of cleanup and reorganization.", 
   "EmbededTomcat is the main entry point and starter for tomcat.", 
   "Tomcat.java is a nice program that can execute a number of tasks, process", 
   "the command line, etc. It delegates to EmbededTomcat whatever is related", 
   "with starting tomcat, and to other objects to stop, etc.", 
   "Main is a java wrapper that sets the class paths for clean separation", 
   "and executes Tomcat.", 
   "With a bit of time, we should refactor Main in a general-purpose", 
   "application starter ( in tomcat/util ), and play a bit more with", 
   "command line processing and introspection ( maybe with a simple", 
   "properties file that would drive Main ). Tomcat.java can disapear if", 
   "Main can take over the dispatching and command line processing.", 
   "The original idea was to use patterns like in \"ant\" for Main - only", 
   "with command line options instead of XML attributes. A services-like", 
   "properties file could allow Main to work with any application following", 
   "the setXXX and execute() patterns.", 
   "No time for that right now - but if anyone wants to try I would be happy to", 
   "help.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "283658"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-09T03:22:32.000000Z", 
  "msg": [
   "Various fixes and cleanup in ProfileLoader.", 
   "The code that was common with Main is now in IntrospectionHelper,", 
   "we also use the fields in ContextManager to get the right loaders.", 
   "A bit of refactoring and cleanup ( better OO :-)"
  ], 
  "revision_id": "283657"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-09T03:20:52.000000Z", 
  "msg": [
   "Extra checks for errors on adding the modules.", 
   "Added fields and accessors for the other 3 class loaders used in tomcat,", 
   "to allow modules to start using it."
  ], 
  "revision_id": "283656"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-09T03:18:17.000000Z", 
  "msg": [
   "Use the new package name for Ajp13."
  ], 
  "revision_id": "283655"
 }
]