[
 {
  "author": "costin", 
  "date": "2001-07-13T06:13:56.000000Z", 
  "msg": [
   "One more improvement in the generated config.", 
   "As mentioned, the default is the \"stupid\" mode where all requrest are forwarded", 
   "to tomcat. There is nothing we can do about this, web.xml doesn't match", 
   "what Apache can normally do.", 
   "However, for some contexts where only \"basic\" web.xml settings are used", 
   "we can generate a good configuration for Apache that will use entirely the", 
   "native apache modules ( with no double mapping - previously mod_jk and", 
   "mod_jserv did a second parsing/matching on requests, in translate, reducing", 
   "the peformance for all requests ).", 
   "We now use SetHandler to triger the tomcat forwarding ( thanks Dirk for", 
   "giving the idea ). That means people with Apache background can easily", 
   "\"hack\" some optimized configurations for their sites.", 
   "For virtual hosts we can generate the right <VirtualHost >, ServerName,", 
   "ServerAliases - it should work fine for name-based virtual hosts ( but", 
   "you'll need manual tuning for IP-based vhosts ).", 
   "As I mentioned, this all extra efforts is spent to allow people to tune", 
   "their servers and get maximum performance. By default we'll just", 
   "generate JkMount which forwards all requests, that should solve most", 
   "questions about how to configure.", 
   "Of course, Ajp14 can make few more steps, but I think the current ApacheConfig is a good enough progress for 3.3."
  ], 
  "revision_id": "283764"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-13T06:04:30.000000Z", 
  "msg": [
   "Added back the context's name. It was removed during the initial refactoring,", 
   "as many apps used it in a wrong way ( it was not unique, but based only", 
   "on the path - and that created problems with virtual hosts ).", 
   "Now all internal apps (admin, etc ) are cleaned and know how to deal with", 
   "virtual hosts, and it is usefull to add back the method ( with a correct", 
   "behavior ).", 
   "Thanks  Leong Mun Wai for reminding me that."
  ], 
  "revision_id": "283763"
 }, 
 {
  "author": "larryi", 
  "date": "2001-07-13T02:42:06.000000Z", 
  "msg": [
   "I believe a classloader bug made building tomcat_test_util.jar necessary.", 
   "Removing since the bug has been fixed and tomcat_test_util.jar is no", 
   "longer needed."
  ], 
  "revision_id": "283762"
 }, 
 {
  "author": "larryi", 
  "date": "2001-07-11T05:24:14.000000Z", 
  "msg": [
   "Prior patch to fix recursive status handling went too far and broke", 
   "authorization which makes a recursive call to the status handling.", 
   "Modify to report a recursive loop only if recursion occurs with the same", 
   "status code.", 
   "Suggested by: Ignacio J. Ortega"
  ], 
  "revision_id": "283761"
 }, 
 {
  "author": "nacho", 
  "date": "2001-07-10T23:56:33.000000Z", 
  "msg": [
   "Readded tabs, to maintain actual coding style.."
  ], 
  "revision_id": "283760"
 }
]