[
 {
  "author": "larryi", 
  "date": "2001-07-06T18:36:16.000000Z", 
  "msg": [
   "Add all default handlers to the context even though they may not be", 
   "used by default due to an web.xml error mapping.  The default handler", 
   "may be needed if there is a problem with the web.xml error mapping."
  ], 
  "revision_id": "283749"
 }, 
 {
  "author": "larryi", 
  "date": "2001-07-05T20:40:45.000000Z", 
  "msg": [
   "Don't overwrite existing error page definitions with default ones.. This is", 
   "better than leaving ErrorHandler and WebXmlReader interceptors", 
   "sequence dependent in server.xml.    Fixes problem with setting 404 error", 
   "page in web.xml."
  ], 
  "revision_id": "283748"
 }, 
 {
  "author": "hgomez", 
  "date": "2001-07-05T09:05:27.000000Z", 
  "msg": [
   "needed rt.jar to have tomcat compiling jsp", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "283747"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-04T05:09:56.000000Z", 
  "msg": [
   "Some more improvements to ApacheConfig, many thanks to William Barker.", 
   "This is based on his patch sent on tomcat-dev, with few changes.", 
   "There is still a lot to add before we could turn this on ( and probably", 
   "the most important short term thing is to detect the apps where this", 
   "kind of configuration can be used, and use \"forward all\" for apps where", 
   "settings in web.xml do not map to apache configs).", 
   "I hope William can help with more patches like this one :-)", 
   "Also, now we have an option to generate either JkMount ( i.e. jk_uri_map", 
   "will do the work and mapping ) or <Location> and SetHandler directives,", 
   "and let apache mapper do the mapping ( probably better ).", 
   "This later option doesn't work for the old mapper, and hasn't been backported", 
   "to mod_jk for Apache1.3 ( I tested and commited the code for 2.0, when", 
   "it's done I can do the backporting but it's too painfull to work with", 
   "2 versions at once ).", 
   "For IIS the situation is really bad, there is a bit of hope for some", 
   "webapps in NES - but for Apache I think we can cover almost all web.xml", 
   "settings using the native apache configuration.", 
   "Ajp14 will improve a lot the cases we can't cover - both autoconfiguration", 
   "( which seems to work just great ! ), and also by protocol extensions that", 
   "are planned for jasper ( and will help a lot in static content handling ).", 
   "Submitted by:\twilliam.barker@wilshire.com"
  ], 
  "revision_id": "283746"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-03T23:55:27.000000Z", 
  "msg": [
   "Added the JkDebug option - another small step in having all user", 
   "setable options in server.xml ( and not having the user touch", 
   "any server config file ).", 
   "Note that JkDebug should be moved in workers.properties, along with", 
   "many other jk options - the file is common to all servers.", 
   "Right now I'll use ApacheConfig, and move later - I can't test with", 
   "IIS and NES and it'll be easier to wait until everything is finished", 
   "for apache, and then update the others ( by removing what will no longer", 
   "be needed )"
  ], 
  "revision_id": "283745"
 }
]