[
 {
  "author": "larryi", 
  "date": "2001-07-14T04:33:32.000000Z", 
  "msg": [
   "Update authenticate() method to default to returning DECLINED so it doesn't", 
   "authenticate by default."
  ], 
  "revision_id": "283769"
 }, 
 {
  "author": "larryi", 
  "date": "2001-07-14T04:26:42.000000Z", 
  "msg": [
   "Update isUserInRole() to expect DECLINED as the indication that", 
   "interceptors should continue to be called."
  ], 
  "revision_id": "283768"
 }, 
 {
  "author": "nacho", 
  "date": "2001-07-14T03:52:43.000000Z", 
  "msg": [
   "*delocalize test, test cannot use messages for match", 
   "will fail on languages distinct from english."
  ], 
  "revision_id": "283767"
 }, 
 {
  "author": "nacho", 
  "date": "2001-07-14T03:20:37.000000Z", 
  "msg": [
   "* Added RealmBase to simplify a bit Realms writing", 
   "* Used RealmBase in Simple Realm to allow use of  digested passwords. there.", 
   "* Used RealmBase in JDBCRealm.", 
   "and ported this fix to JDBCRealm from Tomcat 3.2. branch", 
   "Bug# 2149 , 727 ( possibly others )", 
   "JDBCRealm did not close all the prepared staments opened,", 
   "when trying to reconnect when found a broken DBConnection,", 
   "I'ts a problem specillay surfaced when using MySQL..", 
   "Reported By :", 
   "mark.shotton at micromass.co.uk", 
   "andre.gommlich at netkom.de", 
   "edwin at finalist.com", 
   "kaneda at dedaletechnology.com"
  ], 
  "revision_id": "283766"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-13T06:22:15.000000Z", 
  "msg": [
   "Make sure modules.xml file is configurable.", 
   "Another small optimization in startup time, by caching the information", 
   "we need in modules.xml and avoiding a parse.", 
   "( modules.xml is supposed to grow in future to allow much more decriptive", 
   "info about tomcat modules, most of it will be used by the admin interface,", 
   "tomcat only need name/class name - sort of taskdef in ant )", 
   "This can be turned off as default ( but I don't see any reasons for that ).", 
   "A next step would be to cache the result of Hook introspection, and maybe", 
   "( a bit more difficult ) the XmlMapper work can be avoided - that should", 
   "reduce the startup time to an insignifiant value.", 
   "( and of course, allow very small tomcat runtime, without xml or introspection)", 
   "I'm not planning any of those for 3.3, but in a new set of config", 
   "modules ( that could be used instead of the default one ), after 3.3 is", 
   "released."
  ], 
  "revision_id": "283765"
 }
]