[
 {
  "author": "costin", 
  "date": "2001-07-16T00:12:03.000000Z", 
  "msg": [
   "Major security addition - DecodeInterceptor is now able to \"normalize\"", 
   "a URI, using the same (well tested ) alghoritm that apache does.", 
   "This will remove all unsafe path components at the earliest stage,", 
   "making sure all components benefit from this ( not only StaticInterceptor", 
   "via FileUtils ).", 
   "We deal with //, /./, /../, /.., /.", 
   "Note that this behavior can be disabled, if you think following", 
   "ad-literam the servlet spec is better than security. The servlet spec", 
   "requires the user to get the \"original\" URI - which this fix obviously disables.", 
   "On the other side, not doing the normalization opens _huge_ security problems,", 
   "and _all_ servlets that are using paths ( a default servlet, etc) will", 
   "have to know how to secure the path. Since the container still has problems,", 
   "it's very unlikely most user code will be able to do so.", 
   "In particular the security matching is greatly affected."
  ], 
  "revision_id": "283779"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-16T00:05:04.000000Z", 
  "msg": [
   "Extra check in trusted apps. Since the app is trusted, it has full access", 
   "to the internals - it could add new modules during a servlet init, but", 
   "we want this to happen sooner, as modules might use the earlier callbacks."
  ], 
  "revision_id": "283778"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-16T00:02:32.000000Z", 
  "msg": [
   "Set the class loader in addContext, there's no need to wait until", 
   "contextInit."
  ], 
  "revision_id": "283777"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-16T00:01:42.000000Z", 
  "msg": [
   "AutoWebApp ( the one that adds apps from a dir ) can now set the trusted", 
   "flag and a profile on all apps loaded from that particular dir."
  ], 
  "revision_id": "283776"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-16T00:00:41.000000Z", 
  "msg": [
   "Remove the ending / from Alias ( it's not used in the default config,", 
   "only when you want static files served by apache )"
  ], 
  "revision_id": "283775"
 }
]