[
 {
  "author": "costin", 
  "date": "2001-07-03T23:50:32.000000Z", 
  "msg": [
   "Added the code to generate \"simple/stupid\" mappings, a bit of reorganization", 
   "in the code that lets apache serve static files.", 
   "We can easily generate apache rules to map all the servlet mappings,", 
   "including security constraints, and we can also detect apps using", 
   "other configs - and do the stupid thing only for those.", 
   "I think welcome files could be handled, same for error pages and", 
   "mime types ( at least apache2.0 seems to support that). It'll be hard/imposible", 
   "on NES and IIS, but there's nothing we can do about it ( well, even", 
   "for those we can map some contexts and we can use manual mode for those", 
   "using non-mappable  web.xml options ) ."
  ], 
  "revision_id": "283744"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-03T23:32:26.000000Z", 
  "msg": [
   "Removed the jserv configuration part, reorganize a bit the code.", 
   "The context mappings will be generated only of the user explicitely", 
   "asks that, by default we'll forward all requests to tomcat, including", 
   "static files ( since not all web.xml can be mapped to apache configs ).", 
   "Later we can detect if web.xml can be mapped and generate native mappings", 
   "for those contexts, and when mod_jk will finish duplicating the", 
   "mapper we can generate uri_worker_map file.", 
   "The second part will probably go in a UriMap.java file that will be shared", 
   "for all servers, ApacheConfig will still generate apache-specific", 
   "configuration."
  ], 
  "revision_id": "283743"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-03T23:29:32.000000Z", 
  "msg": [
   "Split jserv config part out of ApacheConfig, it's quite different", 
   "( and deprecated )."
  ], 
  "revision_id": "283742"
 }, 
 {
  "author": "hgomez", 
  "date": "2001-07-03T16:27:14.000000Z", 
  "msg": [
   "Fix CR/LF problems", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tin tomcat-dev, sorry I forget email address", 
   "Reviewed by:"
  ], 
  "revision_id": "283741"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-02T19:40:54.000000Z", 
  "msg": [
   "Create a new dir where we'll store all \"auto-generated\" configs.", 
   "( it's likely we'll have few, and it's easier to group them togheter", 
   "instead of mixing with user-editable files )"
  ], 
  "revision_id": "283740"
 }
]