[
 {
  "author": "larryi", 
  "date": "2001-08-02T17:15:47.000000Z", 
  "msg": [
   "Additions and corrections to documentation"
  ], 
  "revision_id": "283874"
 }, 
 {
  "author": "larryi", 
  "date": "2001-08-02T10:34:08.000000Z", 
  "msg": [
   "Updated to better match current ApacheConfig behavior."
  ], 
  "revision_id": "283873"
 }, 
 {
  "author": "larryi", 
  "date": "2001-08-02T10:33:02.000000Z", 
  "msg": [
   "Addresses problem with using an Alias directive with the root context.", 
   "Reported by: William Barker", 
   "The noRoot parameter now works with forwardAll false too.  If noRoot is", 
   "false, an Alias directive is no longer included for the root context.  An", 
   "\"Alias / ...\" directive appears to interfere with Alias directives for other", 
   "contexts.  Instead a message is included indicating that Apache's", 
   "DocumentRoot setting must be updated.  Also, a similar message is", 
   "included for noRoot false and forwardAll true since some static resources", 
   "will still come from Apache's root unless it is changed.", 
   "Also made some other minor changes such as updating the javadoc and", 
   "changed a log message to require debug > 0."
  ], 
  "revision_id": "283872"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2001-07-30T00:57:34.000000Z", 
  "msg": [
   "A Date: header is now sent in the response when Tomcat is running stand-alone.", 
   "Also fixes a bug in the previous date formats that had a 5 digit date format", 
   "(yyyyy) that caused a leading zero at the front of the years (e.g. 02001).", 
   "PR: 345", 
   "Submitted by:\tGOMEZ Henri [hgomez@slib.fr]"
  ], 
  "revision_id": "283871"
 }, 
 {
  "author": "costin", 
  "date": "2001-07-29T00:45:53.000000Z", 
  "msg": [
   "One more fix in trusted loader: when the server is initializing we", 
   "create the modules from trusted apps. This allows modules to have access to", 
   "addContext callbacks and fix the classpaths.", 
   "When the server is stable it'll start adding/initializing modules. We", 
   "remove all previously loaded interceptors, the same as for a reload.", 
   "Note that reloading for modules is mostly untested, it'll be provided by a", 
   "standalone module, we want only the basic functionality in the core set of", 
   "modules."
  ], 
  "revision_id": "283870"
 }
]