[
 {
  "author": "costin", 
  "date": "2001-08-21T04:48:35.000000Z", 
  "msg": [
   "A much more serious problem here. We recently fixed DependClassLoader - it needs", 
   "to use defineClass() itself, it it relys on the parent the other classes which", 
   "depend on the loaded class will be loaded with the parent loader.", 
   "This change had a side effect - since defineClass() was used with 3 parms, without", 
   "the protection domain.", 
   "The first fix was required to fix reloading, this one is required to fix sandboxing.", 
   "I reproduced the same tricks we used in jasper to maintain compatibility with JDK1.1", 
   "( however, I may need to add one more method ). This is not finalized, and is", 
   "possible it'll brake JDK1.1 compilation ( not difficult to fix, but I have few other", 
   "changes to commit)."
  ], 
  "revision_id": "283959"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-21T04:44:02.000000Z", 
  "msg": [
   "Fix a possible security problem ( if JdkCompat ends up with too many permissions,", 
   "the previous code could allow granting them to untrusted code ).", 
   "Now the priviledged call is done in the context of the caller ( you can't run without", 
   "a context, and the only way untrusted code could get the context is via JdkCompat )", 
   "Better to be safe."
  ], 
  "revision_id": "283958"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-21T04:41:32.000000Z", 
  "msg": [
   "A number of additions to IntrospectioUtils, in order to support the class loader", 
   "hierarchy in EmbededTomcat and the simpler startup mechanism.", 
   "Nothing spectacular, just the plain old java.lang.reflect."
  ], 
  "revision_id": "283957"
 }, 
 {
  "author": "hgomez", 
  "date": "2001-08-20T16:11:09.000000Z", 
  "msg": [
   "Updated documentation about SSL to handle TC 3.3", 
   "new conf and add example of keytool use :)", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "283956"
 }, 
 {
  "author": "larryi", 
  "date": "2001-08-19T22:52:51.000000Z", 
  "msg": [
   "Added a TOMCAT_INSTALL environment variable to allow Tomcat to", 
   "be started with \"conf\" and \"lib\" in separate locations.", 
   "Updated to make \"env\" option function properly."
  ], 
  "revision_id": "283955"
 }
]