[
 {
  "author": "costin", 
  "date": "2001-08-17T04:02:55.000000Z", 
  "msg": [
   "Same thing. Some fields were package, changed them to private.", 
   "Now the core is consistent ( I hope ), at least from methods declaration", 
   "point of view."
  ], 
  "revision_id": "283949"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-17T03:59:48.000000Z", 
  "msg": [
   "Small changes ( but the diff is big ). I tried to put in order all the", 
   "package/protected/final stuff.", 
   "Having final methods and classes hava a tiny impact on performance but may", 
   "affect our ability to do \"hot fixes\" via add-on modules, and to extend", 
   "tomcat or tune it for special configurations.", 
   "Let me know if this creates a problem for anyone - I believe removing the final", 
   "doesn't affect in any way the code stability but provides a lot of flexibility.", 
   "I also added few factory methods in CM, to completely allow specialized", 
   "extensions to control the whole thing."
  ], 
  "revision_id": "283948"
 }, 
 {
  "author": "larryi", 
  "date": "2001-08-17T03:53:24.000000Z", 
  "msg": [
   "Update to make all contexts for a virtual host appear within a single", 
   "<Virtual Host> block.  For a root context in a virtual host, set DocumentRoot", 
   "instead of a using \"Alias / ...\".  For a root context outside of a virtual host,", 
   "supply an appropriate message about DocumentRoot.  Can't override the", 
   "one in httpd.conf."
  ], 
  "revision_id": "283947"
 }, 
 {
  "author": "larryi", 
  "date": "2001-08-16T05:24:14.000000Z", 
  "msg": [
   "Updated to have features similar to ApacheConfig."
  ], 
  "revision_id": "283946"
 }, 
 {
  "author": "larryi", 
  "date": "2001-08-16T05:22:41.000000Z", 
  "msg": [
   "Update to avoid writing duplicate NameVirtualHost directives.  Also,", 
   "if the context's host name is an ip address, or a host ip address is specified,", 
   "then that address is used for the NameVirtualHost and <VirtualHost>", 
   "directives.", 
   "Added generation of NameVirtualHost to generateContextMappings()."
  ], 
  "revision_id": "283945"
 }
]