[
 {
  "author": "costin", 
  "date": "2001-08-21T05:38:24.000000Z", 
  "msg": [
   "Update for the fix in compat."
  ], 
  "revision_id": "283974"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-21T05:37:16.000000Z", 
  "msg": [
   "Tomcat.java is no longer used/needed, added deprecated mark. It still works, but", 
   "you should use the real beans ( tasks ) that perform the actions you need."
  ], 
  "revision_id": "283973"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-21T05:35:26.000000Z", 
  "msg": [
   "Few fixes."
  ], 
  "revision_id": "283972"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-21T05:35:05.000000Z", 
  "msg": [
   "As expected, Main.java is now smaller. The first argument to Main is used", 
   "to load a bean. It'll only set the common class loader, pass args[] and", 
   "class loader informations, and call execute() method on the bean", 
   "( ant style ).", 
   "Note that the bean itself will process the args. Right now we use magic", 
   "to turn args into setXXX() calls ( like we do for server.xml, or like ant", 
   "does with it's tasks ). Single option arguments are equivalent with", 
   "boolean setters."
  ], 
  "revision_id": "283971"
 }, 
 {
  "author": "costin", 
  "date": "2001-08-21T05:29:27.000000Z", 
  "msg": [
   "Ok, this is the big one !", 
   "I did a lot of work on this area, now things should be much cleaner and simpler", 
   "( by my taste ).", 
   "First, most of the settings from Main.java are now part of EmbededTomcat. We", 
   "expect people to use EmbededTomcat to include tomcat in other apps, not", 
   "Main - since we need to provide a reach interface and more control.", 
   "Main.java is now reduced to the same role as \"java -jar\" ( and is equivalent", 
   "with it - or should be ). It just create a simple class loader including all", 
   "the classes in common, and then pass control to EmbededTomcat, which does", 
   "all the real work.", 
   "In other words, to embed tomcat you need to include all the common in", 
   "a classpath, then use EmbeddedTomcat as a regular bean - set properties and", 
   "call the methods you need.", 
   "EmbededTomcat will set the container environment ( which must be separated", 
   "in another class loader - security and isolation ).", 
   "I also added a bit more documentation.", 
   "An important change - there is no dependency between ET and container classes", 
   "( see 2 lines above ).", 
   "EmbededTomcat now  works in both modes - if setEstart is used ( equivalent", 
   "with java -jar tomcat.jar estart ), it'll use the hardcoded modules", 
   "( or an alternate set, depending on your code ). The default, or if", 
   "\"start\" command is used on the command line, is to load tomcat using", 
   "server.xml, as before."
  ], 
  "revision_id": "283970"
 }
]