[
 {
  "author": "costin", 
  "date": "2001-09-10T06:53:16.000000Z", 
  "msg": [
   "Fix 1589, deal with setFoo(Object) in jasper.", 
   "Thanks bprice@evergreen.com for finding the bug and the fix.", 
   "( BTW, I do sync updates in jakarta-tomcat-jasper, but I can't commit until I get my", 
   "workspace stable - the SAX stuff is going to take at least few more weeks. )", 
   "Submitted by:\tbprice@evergreen.com"
  ], 
  "revision_id": "284119"
 }, 
 {
  "author": "costin", 
  "date": "2001-09-10T06:43:02.000000Z", 
  "msg": [
   "Fix 3441, small enhancement in security constraints handling.", 
   "The problem was that ContextManager only checked for user roles to decide if authorization", 
   "is needed.", 
   "Now any security-related property will triger the authorize hook ( well, right now there are", 
   "only 2 kinds - transport and user, but it's better to be flexible ). A new field, securityContext", 
   "will hold all the secuirity-related properties for the request and will be set by", 
   "AccessInterceptor.", 
   "No other changes are needed, except for modules that implement authorize() - they must", 
   "be prepared to deal with situations when only transport constraints are required.", 
   "Regarding the transport - we just report an error - we could do a more advanced operation", 
   "like redirect, but that can also be done by users using error directives - or later, by", 
   "a more advanced module.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "284118"
 }, 
 {
  "author": "larryi", 
  "date": "2001-09-09T22:00:45.000000Z", 
  "msg": [
   "Improve error message if \"/lib/tomcat.jar\" can't be found."
  ], 
  "revision_id": "284117"
 }, 
 {
  "author": "larryi", 
  "date": "2001-09-09T21:59:55.000000Z", 
  "msg": [
   "To better support separate \"install\" and \"home\" directories, search for", 
   "\"install\" before defaulting to \"home\"."
  ], 
  "revision_id": "284116"
 }, 
 {
  "author": "larryi", 
  "date": "2001-09-09T21:57:32.000000Z", 
  "msg": [
   "To better support separate \"install\" and \"home\" directories, establish", 
   "\"install\" first, then default \"home\" if necessary."
  ], 
  "revision_id": "284115"
 }
]