[
 {
  "author": "larryi", 
  "date": "2001-10-08T05:23:57.000000Z", 
  "msg": [
   "Add sample add-on module.  PasswordPrompter will prompt for pass words", 
   "for secure PoolTcpConnectors and JDBCRealms."
  ], 
  "revision_id": "284259"
 }, 
 {
  "author": "larryi", 
  "date": "2001-10-08T04:58:19.000000Z", 
  "msg": [
   "Add methods to detect if connection name and password have been set."
  ], 
  "revision_id": "284258"
 }, 
 {
  "author": "billbarker", 
  "date": "2001-10-06T02:31:10.000000Z", 
  "msg": [
   "Impove error handling when the user has choosen not to define a ROOT context.", 
   "A better solution is to force the definition of DEFAULT@ROOT, but that creates too many problems this close to release.  I'm the first to vote to role this back once someInterceptor takes responsibilty for DEFAULT@ROOT.", 
   "It is very easy (and, it seems common) to setup Tomcat without a ROOT context. This caused Tomcat to generate useless exception reports in the log.  With this patch, you get the expected 404 response to an un-mappable request.", 
   "This fixes Bug #3988", 
   "Reported by: Alex Polverini polverini@explo-it.com", 
   "Reported by: Hans Schmid hans.schmid@einsurance.de", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "284257"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2001-10-05T21:50:14.000000Z", 
  "msg": [
   "Fixes Bugzilla 2333.  Instead of the proposed patch, which did its own", 
   "memory allocation, I used jk_pool_strdup(), but the end result is the same.", 
   "In the process of fixing this one I noticed that the jk_pool created in", 
   "mod_jk was not being closed.  This usually doesn't leak because the pool's", 
   "buffer is allocated on the stack in jk_handler(), but it would leak any", 
   "dynamically allocated memory.", 
   "I'll commit the same changes to the jakarta-tomcat-connectors repository.", 
   "PR: 2333", 
   "Submitted by:  roloff@mecom.de"
  ], 
  "revision_id": "284256"
 }, 
 {
  "author": "nacho", 
  "date": "2001-10-05T21:41:20.000000Z", 
  "msg": [
   "Was not initting or stopping the JDBC connection at Tomcat init or shutdown"
  ], 
  "revision_id": "284255"
 }
]