[
 {
  "author": "larryi", 
  "date": "2002-02-08T12:55:55.000000Z", 
  "msg": [
   "Added an ajp12 option to go with the new ajp13 option and reworked the", 
   "logic a bit.", 
   "If either ajp12 or ajp13 is set (or the last one if both are set), that protocol", 
   "will be used.  If an ajpid file is not specified, the associated default will be", 
   "used.", 
   "If neither ajp12 or ajp13 is specified, and no ajpid file is specified, then", 
   "ajp13 is tried first with failover to ajp12 if the ajp13 file is not found or", 
   "shutdown isn't enabled.  If an ajpid file is specified, it defaults to using", 
   "ajp12.", 
   "Updated the help output."
  ], 
  "revision_id": "284534"
 }, 
 {
  "author": "larryi", 
  "date": "2002-02-08T12:48:04.000000Z", 
  "msg": [
   "Since the ajp13.id file is always written, a \"shutdown\" property is added", 
   "to the file to indicate that shutdown is enabled.", 
   "Added an authenticateRequests attribute so a secret may be set for", 
   "shutdown purposes and it still be able to work with Tomcat 3.3's mod_jk", 
   "based connectors. It defaults to not authenticating."
  ], 
  "revision_id": "284533"
 }, 
 {
  "author": "larryi", 
  "date": "2002-02-08T12:43:58.000000Z", 
  "msg": [
   "Move delay to the proper location as suggested by Bill Barker.  Make the", 
   "attribute a number again so the length of the delay may be specified."
  ], 
  "revision_id": "284532"
 }, 
 {
  "author": "billbarker", 
  "date": "2002-02-08T03:10:48.000000Z", 
  "msg": [
   "Prevent a possible DoS exploit.", 
   "The last fix opens the possiblity of a DoS attack by continuously streaming data to Tomcat.  This should be a good compromise between being nice and staying alive.", 
   "Thanks to Costin for making me aware of this potential problem."
  ], 
  "revision_id": "284531"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-07T05:09:36.000000Z", 
  "msg": [
   "Added logic to send the shutdown command using ajp13. That means ajp12", 
   "is no longer needed if the password is enabled on ajp13.", 
   "The ajp13.id is cleaner ( i.e. a properties file ) - it can be", 
   "read from mod_jk as well ( but that's for a future version ), to", 
   "eliminate duplicated config."
  ], 
  "revision_id": "284530"
 }
]