[
 {
  "author": "larryi", 
  "date": "2002-02-02T04:45:06.000000Z", 
  "msg": [
   "In a query string, '+' is a substitute for space, but not in the path portion of a", 
   "URL.  Add methods that include a \"query\" parameter to control if the '+'", 
   "should be converted to a space."
  ], 
  "revision_id": "284509"
 }, 
 {
  "author": "billbarker", 
  "date": "2002-02-02T03:24:32.000000Z", 
  "msg": [
   "Make this a bit smarter about skipping un-read input.", 
   "This does much the same thing in the case of a buggy browser adding \\r\\n to the POST body.  However, it fixes the problem when the servlet doesn't finish reading the body of a big upload.  Also, leaving even one byte behind can cause problems for people connecting via a proxy server.", 
   "Fix for bug 5983", 
   "Reported by: Olaf Jahn olaf.jahn@zamioculcas.net"
  ], 
  "revision_id": "284508"
 }, 
 {
  "author": "billbarker", 
  "date": "2002-02-01T03:46:35.000000Z", 
  "msg": [
   "Make the building of mod_jk a bit smarter for Solaris.", 
   "Fix for bug 4365.", 
   "Also allow the options of setting APACHE_HOME and JAVA_HOME from the command line, so that there is no longer a need to edit the script", 
   "Reported by:  Joachim Wolfgang Kaltz jwkaltz@yahoo.com"
  ], 
  "revision_id": "284507"
 }, 
 {
  "author": "larryi", 
  "date": "2002-01-31T04:29:13.000000Z", 
  "msg": [
   "Document recent changes"
  ], 
  "revision_id": "284506"
 }, 
 {
  "author": "larryi", 
  "date": "2002-01-31T04:16:47.000000Z", 
  "msg": [
   "Reworking the \"delay\" kluge for test software in which client and server run", 
   "on the same system and experience \"Socket reset by peer\" errors due to", 
   "unfavorable sequencing of thread execution.  This update was needed", 
   "because adding the sleep(0) caused the failure rate of Tomcat 3.3 tests", 
   "under Cactus to go from infrequently to frequently on the primary Gump", 
   "system running Linux.", 
   "Changed delaySocketClose to closeSocketDelay and made the attribute", 
   "numeric.  The default is -1, which adds no delay.  A value of 0, adds a", 
   "Thread.yield() prior to closing the socket.  A value greater than 1 causes", 
   "CPU cycles to be eaten for the specified number of milliseconds prior to", 
   "closing the socket.  Using Thread.sleep(n) proved to be unhelpful on", 
   "RH Linux 7.1."
  ], 
  "revision_id": "284505"
 }
]