[
 {
  "author": "billbarker", 
  "date": "2002-04-16T03:04:55.000000Z", 
  "msg": [
   "Fix a problem where Tomcat was displaying the source of a JSP page.", 
   "This was reported against 4.0 as bug #8092.", 
   "To reproduce, download the webapp attached to the bug and request .../jsp/including.jsp.", 
   "Reported by: Andreas Junghans Andreas.Junghans@fh-karlsruhe.de"
  ], 
  "revision_id": "284649"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-15T10:48:19.000000Z", 
  "msg": [
   "Fix location of built jars and name of \"container\" utilities jar.  Added", 
   "core_util.jar since it is listed in coyote's build.xml.  This seems to fix my", 
   "local Gump build."
  ], 
  "revision_id": "284648"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-15T10:19:41.000000Z", 
  "msg": [
   "Remove etomcat.jar since it is not created by the build target"
  ], 
  "revision_id": "284647"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-15T04:28:06.000000Z", 
  "msg": [
   "Remove commons-logging dependency.  Update to the target which builds", 
   "jakarta-tomcat with only the jakarta-tomcat-connectors util dependency,", 
   "which won't rebuild if already built."
  ], 
  "revision_id": "284646"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-15T04:25:24.000000Z", 
  "msg": [
   "Note sure if this will be in time for tonight's Gump build.  The tomcat-jar target", 
   "still included the coyote target, which would cause it to fail.", 
   "This also implements a different approach to keeping Gump happy.  Rather", 
   "than to define separate Gump targets, add new targets at needed points", 
   "in the standard build flow.  For this purpose, main.lite was added.", 
   "It relies on the use of <uptodate> to avoid rebuilding the J-T-C util project,", 
   "which causes problems for Gump.", 
   "Also, since jakarta-tomcat doesn't directly depend on commons-logging,", 
   "I have removed it from this build.xml.  commons-logging.jar is now copied", 
   "from the results of the J-T-C util build.", 
   "These changes should get Gump working again with \"main\" and \"dist'\"", 
   "targets still including coyote.  More changes are coming so that a", 
   "future Gump project can defined for jakarta-tomcat which will include", 
   "the J-T-C dependencies."
  ], 
  "revision_id": "284645"
 }
]