[
 {
  "author": "marcsaeg", 
  "date": "2003-07-01T20:59:57.000000Z", 
  "msg": [
   "Check for debug > 0 before printing debug messages.", 
   "Catch SocketException to avoid sending data down a closed connection."
  ], 
  "revision_id": "284814"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2003-07-01T20:59:02.000000Z", 
  "msg": [
   "Avoid multiple calls to isOutDated().", 
   "Avoid multiple string concatenations in getPackageName()."
  ], 
  "revision_id": "284813"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2003-06-04T14:25:50.000000Z", 
  "msg": [
   "Fixed a thread synchronization bug that appears in MimeHeaderField.parseDate().", 
   "The SimpleDateFormats in DateTool where exposed as public members that parseDate()", 
   "reference directly with no synchronization.  The SimpleDateFormat methods are", 
   "not thread safe.", 
   "Tomcat 3.2.x is no longer being officially maintained.  There will be no", 
   "more official releases of Tomcat 3.2.x.  To get these fixes you will need", 
   "to build Tomcat from source.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "284812"
 }, 
 {
  "author": "billbarker", 
  "date": "2003-05-31T02:45:58.000000Z", 
  "msg": [
   "Localize the charset for all error handlers.", 
   "Also change to always set the charset if it is available, since IMHO it is better to send a charset then to assume that the browser defaults to iso-latin-1 (which is false for MSIE, for example).", 
   "This clearly needs to be done for Japanese servers.  It should be a pretty minor change for en, fr, and sp servers.  Other Locals where probably just as broken before.", 
   "Fix for bug #20361.", 
   "Reported By: Gary gbraven@yahoo.com"
  ], 
  "revision_id": "284811"
 }, 
 {
  "author": "marcsaeg", 
  "date": "2003-05-21T16:43:02.000000Z", 
  "msg": [
   "Added support for the If-Modified-Since header to the FileHandler", 
   "servlet wrapper.", 
   "NOTE:  Tomcat 3.2.x is no longer being actively developed or", 
   "maintained.  These changes will not appear an any official release.", 
   "To get these changes you will need to build Tomcat from source."
  ], 
  "revision_id": "284810"
 }
]