[
 {
  "author": "craigmcc", 
  "date": "2000-08-23T18:32:29.000000Z", 
  "msg": [
   "Update the overall build script to build the new ROOT webapp also.", 
   "Fix a bad reference to the web.xml DTD file in the examples webapp."
  ], 
  "revision_id": "285004"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-23T18:29:54.000000Z", 
  "msg": [
   "Add the files for the ROOT context to the webapps directory for", 
   "Tomcat 4.0.", 
   "NOTE:  There appears to be a problem with displaying welcome files in", 
   "Catalina currently.  Until this is resolved, simply click on the", 
   "index.html file in the directory listing to proceed."
  ], 
  "revision_id": "285003"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-23T17:08:52.000000Z", 
  "msg": [
   "Create a work directory path that includes the name of the virtual host,", 
   "so that work directories for two virtual hosts that have web apps with the", 
   "same context path underneath them do not clash with each other."
  ], 
  "revision_id": "285002"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-23T01:07:15.000000Z", 
  "msg": [
   "Implement substantial changes to ApplicationDispatcher (the request", 
   "dispatcher implementation class for Catalina) to support the new 2.3", 
   "ability for servlets to wrap the request and response objects that they", 
   "pass to forward() or include().  Previously, servlets were required to use", 
   "the original request and response objects.  This is the largest single", 
   "impact change required by Servlet 2.3.", 
   "Be sure you pick up the updates to the \"jakarta-servletapi\" module, which", 
   "fixes a problem with getSession() returning null on all session related", 
   "events.", 
   "As of now, Tomcat 4.0 passes all but one of the Watchdog servlet tests", 
   "(the one that checks for version 2.2 :-), and all but one of the JSP tests", 
   "(positiveInclude.jsp, which needs further investigation)."
  ], 
  "revision_id": "285001"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-22T04:10:20.000000Z", 
  "msg": [
   "Add an example Filter implementation that is configured two different ways", 
   "-- once for the \"invoker\" servlet by name, and once for the url pattern", 
   "\"/servlet/*\".  Because of the way that the Catalina invoker servlet works,", 
   "the first request to a particular invoked servlet will trigger both", 
   "filters, while subsequent requests will only invoke the path mapped filter", 
   "(because the invoker servlet registers a new servlet with an exact path", 
   "mapping that bypasses it on subsequent requests)."
  ], 
  "revision_id": "285000"
 }
]