[
 {
  "author": "craigmcc", 
  "date": "2000-09-01T21:12:02.000000Z", 
  "msg": [
   "Set the context class loader for a request processing thread as soon as the", 
   "Context to be utilized has been selected (and therefore we know which class", 
   "loader to assign)."
  ], 
  "revision_id": "285034"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-01T18:17:16.000000Z", 
  "msg": [
   "Improve the efficiency of request parameter processing, by creating a new", 
   "\"lockable\" subclass of HashMap that can be returned to the application (as", 
   "the value of a call to ServletRequest.getParameterMap() without being", 
   "cloned in order to avoid application-level modifications.  In addition,", 
   "the parameters variable of HttpRequestBase is now recycled instead of", 
   "being recreated on every request."
  ], 
  "revision_id": "285033"
 }, 
 {
  "author": "pierred", 
  "date": "2000-09-01T15:58:44.000000Z", 
  "msg": [
   "Changed to work with Microsoft VM (needs to include in classpath", 
   "contents of System.getProperty(\"java.home\")\\Packages\\*.zip )", 
   "Submitted by: Marc Beneteau (mbeneteau2@home.com)"
  ], 
  "revision_id": "285032"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-31T21:56:00.000000Z", 
  "msg": [
   "Work around a problem with Java clients using the JDK 1.3 version of the", 
   "HttpURLConnection class (and probably other HTTP/1.1 clients as well).", 
   "The problem was that the client would send an HTTP/1.1 request, and include", 
   "the \"Connection: keep-alive\" header.  Catalina's HTTP/1.1 connector would", 
   "therefore dutifully keep the connection open and listen for a subsequent", 
   "request, which would not happen if the client just closed the connection.", 
   "Now, the request processing code detects this situation and silently closes", 
   "the socket, instead of complaining about the lack of a request line."
  ], 
  "revision_id": "285031"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-08-31T20:50:49.000000Z", 
  "msg": [
   "Fix bug in the implementation of RequestDispatcher.include() that was", 
   "passing null unstead of the response wrapper as the second argument to", 
   "the servlet that is ultimately invoked."
  ], 
  "revision_id": "285030"
 }
]