[
 {
  "author": "pierred", 
  "date": "2000-10-04T04:49:51.000000Z", 
  "msg": [
   "Fixed typo: validatorclass instead of validatorClass", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285154"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-04T02:26:33.000000Z", 
  "msg": [
   "Scan the tag library descriptors of all custom tag libraries that can be", 
   "found in each web application, and register any application events", 
   "listener classes that are found.", 
   "This change requires Catalina to be able to process TLDs in addition to", 
   "deployment descriptors.  Therefore, the DTDs for the tag library", 
   "descriptor for JSP version 1.1 (official) and 1.2 (unofficial) are being", 
   "checked in so that TLDs can be validated as they are processed."
  ], 
  "revision_id": "285153"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-03T21:30:44.000000Z", 
  "msg": [
   "Introduce a new \"available\" property for Contexts, which can be used", 
   "(among other things) to disable the use of an application that encountered", 
   "initialization errors (such as parsing problems in web.xml).  Such", 
   "applications will now throw a 503 status when you attempt to access any", 
   "URL within that app."
  ], 
  "revision_id": "285152"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-03T18:57:45.000000Z", 
  "msg": [
   "Make Catalina report parsing errors (from the XML validating parser being", 
   "used) found in the default ($CATALINA_HOME/conf/web.xml) or application", 
   "(WEB-INF/web.xml) deployment descriptors.  Previously, these errors were", 
   "getting silently swallowed.", 
   "NOTE:  The occurrence of such errors still does not prevent the", 
   "application from being deployed.  This is going to require some additional", 
   "modifications to handle all classes of application initialization errors", 
   "in ContextConfig."
  ], 
  "revision_id": "285151"
 }, 
 {
  "author": "remm", 
  "date": "2000-10-03T18:43:09.000000Z", 
  "msg": [
   "I had forgotten to update the top level README file regarding the new", 
   "requirement for JMX (Catalina README file was already up to date). Sorry."
  ], 
  "revision_id": "285150"
 }
]