[
 {
  "author": "pierred", 
  "date": "2000-10-05T16:48:01.000000Z", 
  "msg": [
   "It is the tag <uri> in the TLD that sets the value of the", 
   "'urn' field, not <urn>.", 
   "And for more details:", 
   "Referring to bug 214, Hans Bergsten wrote:", 
   "> Looking at the code, it seems like it's a bug that an element named", 
   "> \"urn\" is processed instead of the \"uri\" element. But I assume this", 
   "> only means that the \"uri\" element is (incorrectly) ignored but that", 
   "> the TLD is still parseable. Since the \"uri\" element is intended to", 
   "> be used by development tools rather than the container, this should", 
   "> not be a fatal problem.", 
   "Correct.", 
   "I must admit the spec is quite confusing on that matter.", 
   "The confusion comes from the fact that the <uri> subelement of <taglib>", 
   "in the TLD is mapped to the 'urn' field of TagLibraryInfo", 
   "(which is accessible via the method getReliableURN()).", 
   "This 'reliable urn' is not used anywhere else in the source base.", 
   "As Hans mentioned, it is \"intended to be used by development tools", 
   "rather than the container\".", 
   "The code simply needs to be fixed by accepting the tag <uri> in the TLD", 
   "instead of <urn>.", 
   "[Wish the tag was named something like <reliableurn> in the", 
   "TLD instead of <uri> to remove the confusion.", 
   "And, for completeness, the 'uri' field of TagLibraryInfo is set", 
   "via the 'uri' attribute of the taglib directive. It is accessible", 
   "via the getURI() method of TagLibraryInfo]", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tBrian Bucknam", 
   "Reviewed by:"
  ], 
  "revision_id": "285164"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-05T03:44:55.000000Z", 
  "msg": [
   "Make sure the release notes document(s) are copied to the top-level directory", 
   "of a binary distribution build of Tomcat 4.0."
  ], 
  "revision_id": "285163"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-05T03:44:25.000000Z", 
  "msg": [
   "Check in what will become the release notes for the Tomcat 4.0-m2 release", 
   "when completed."
  ], 
  "revision_id": "285162"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-05T03:27:17.000000Z", 
  "msg": [
   "Initial check-in of documentation about the new Manager application."
  ], 
  "revision_id": "285161"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-05T02:30:23.000000Z", 
  "msg": [
   "Add a new web application (/manager) that uses the new hot-deploy", 
   "facilities of StandardHost to support deployment, undeployment, and", 
   "on-command reloading of other web applications that are deployed on the", 
   "same virtual host.", 
   "NOTE:  The problem alluded to in the previous commit message prevents you", 
   "from deploying, undeploying, and then redeploying a web application from a", 
   "WAR file at exactly the same URL.  However, you can deploy and undeploy a", 
   "directory-based application any number of times without problems.", 
   "A document will shortly be added that describes the usage of the manager", 
   "application."
  ], 
  "revision_id": "285160"
 }
]