[
 {
  "author": "craigmcc", 
  "date": "2000-10-05T01:31:06.000000Z", 
  "msg": [
   "Add a FIXME note.  The JarURLConnection mechanism seems to cache instances", 
   "of JarFile -- even after you close them!  This prevents you from", 
   "undeploying an application, replacing the JAR file, and redeploying the", 
   "application :-(.  I cannot seem to find a workaround for this at the", 
   "moment."
  ], 
  "revision_id": "285159"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-04T23:03:05.000000Z", 
  "msg": [
   "Add a new extension of Container called Deployer, which represents a", 
   "Container into which web applications can be deployed and undeployed.  In", 
   "the current environment, StandardHost is the only container implementation", 
   "that is also a deployer -- but additional such containers can be created", 
   "(such as the forthcoming specialized container for the Apache connector).", 
   "Implemented the deploy() and undeploy() functionality in StandardHost.", 
   "Now, Tomcat 4.0 is capable of \"hot\" application loading and unloading,", 
   "given just a context path and the URL of a WAR file.  This will be of", 
   "tremendous use in administrative and management applications.", 
   "As before, application deployment from a WAR file in the application base", 
   "directory ($CATALINA_HOME/webapps for the default configuration) will", 
   "cause the WAR to be automatically expanded.  However, the new undeploy", 
   "functionality also deletes the directory when the application is", 
   "undeployed -- the theory is that the developer will be replacing the WAR", 
   "anyway in this scenario, and this is a common complaint about the way that", 
   "Tomcat 3.x works (once the directory is expanded the user has to remember", 
   "to delete it)."
  ], 
  "revision_id": "285158"
 }, 
 {
  "author": "pierred", 
  "date": "2000-10-04T20:01:06.000000Z", 
  "msg": [
   "Well formed XML fragments can appear where #PCDATA can appear", 
   "in an XJSP (JSP page as an XML document) page.", 
   "No need to wrap these XML fragments inside CDATA sections", 
   "anymore in the XJSP page.", 
   "ParseXJspSaxHandler", 
   "- startElement now makes the distiction between a custom tag", 
   "and an 'uninterpreted' tag", 
   "- processCustomTagBegin() adjusted given that some code has", 
   "been moved in startElement() so we know immediately if we", 
   "deal with a custom tag or not.", 
   "- Node class now has internal state telling whether a node", 
   "is an 'uninterpreted' tag or not.", 
   "- characters encountered while in an 'uninterpreted tag'", 
   "are simply passed through as char data.", 
   "(just like for body content of jsp:root)", 
   "JspParseEventListener", 
   "- Two new methods to handle the 'uninterpreted' tags:", 
   "handleUninterpretedTagBegin() and handleUninterpretedTagEnd()", 
   "ParseEventListener", 
   "BaseJspListener", 
   "DelegatingListener", 
   "- Added the two new methods required in JspParseEventListener", 
   "(these classes are pretty much no-ops... should do some", 
   "cleanup and get rid of them eventually)", 
   "UninterpretedTagBeginGenerator", 
   "UninterpretedTagEndGenerator", 
   "- New Generators to handle uninterpreted tags", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285157"
 }, 
 {
  "author": "pierred", 
  "date": "2000-10-04T05:13:51.000000Z", 
  "msg": [
   "web.dtd removed.", 
   "replaced by web_22.dtd and web_23.dtd.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285156"
 }, 
 {
  "author": "pierred", 
  "date": "2000-10-04T05:10:58.000000Z", 
  "msg": [
   "Validation errors on TLDs and web.xml were ignored because an", 
   "ErrorHandler was not used. This came up when trying to use", 
   "JAXP1.1EA whose default behavior is to throw exceptions both", 
   "for fatal errors and errors (other parsers fail silently", 
   "on errors if no ErrorHandler is setup).", 
   "Took the opportunity to cleanup how we handle the cached", 
   "DTDs, as well as try to provide meaningful error messages", 
   "as much as possible when exceptions are thrown.", 
   "Constants", 
   "- All versions of DTD's for taglibs and web deployment descriptors", 
   "are now properly supported.", 
   "compiler.JspUtil", 
   "- An ErrorHandler is now associated with the validating parser", 
   "so that errors are properly handled (and not ignored as they", 
   "were before).", 
   "- Unique copy of entity resolver may now be shared for all calls", 
   "to parseXmlDoc().", 
   "- EntityResolver now handles all cached DTD's for the various", 
   "versions of the deployment descriptor and the taglib descriptor.", 
   "- Improved messages for exceptions thrown", 
   "- Commented out the FIXME part which said that it should be", 
   "removed...", 
   "compiler.TagLibraryInfoImpl", 
   "- JspUtil:parseXmlDoc() now called with its new signature", 
   "- Improved messages for exceptions thrown", 
   "compiler.JspParseEventListener", 
   "- Do not re-wrap the exception thrown at lower levels. We lose the", 
   "root cause of the exception by doing that.", 
   "resources.messages.properties", 
   "resources.messages_es.properties", 
   "- New messages:", 
   "jsp.error.parse.xml", 
   "jsp.error.parse.xml.line", 
   "jsp.error.internal.filenotfound", 
   "jsp.error.parse.xml.invalidPublicId", 
   "removed file", 
   "- resources/web.dtd", 
   "new files", 
   "- resources/web_22.dtd", 
   "- resources/web_23.dtd", 
   "- resources/web-jsptaglib_1_2.dtd", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285155"
 }
]