[
 {
  "author": "craigmcc", 
  "date": "2000-09-30T19:47:08.000000Z", 
  "msg": [
   "Clean up the startup scripts a little bit more."
  ], 
  "revision_id": "285144"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-30T19:15:47.000000Z", 
  "msg": [
   "Implement a new object hierarchy level in server.xml called <Service>.", 
   "A Service is defined as a set of one or more Connectors that share the", 
   "same Container (in most cases an Engine) to process their requests.  For", 
   "example, Tomcat 4.0 running stand-alone might typically have a non-SSL", 
   "connector running on port 8080, and an SSL connector running on port 8443.", 
   "At the same time, a separate Service might be present with an Apache", 
   "Connector talking to a specialized Engine imlementation that knows how to", 
   "share configuration information back to Apache (this connector is nearing", 
   "completion).", 
   "In addition, a new classloader level for shared server extensions (i.e.", 
   "the contents of the $CATALINA_HOME/lib directory) is now propogated down", 
   "to the Context implementations (via setParentClassLoader) so that it", 
   "becomes the parent classloader for all webapp classloaders.", 
   "Remaining steps (later today):", 
   "* Add a developer document describing the class loader architecture", 
   "inside Tomcat 4.0.", 
   "* Enforce the checking for required packages and versions as described", 
   "in the new spec (the infrastructure is all there now, just not the", 
   "enforcement)."
  ], 
  "revision_id": "285143"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-29T20:44:07.000000Z", 
  "msg": [
   "Implement the first stage of support for the new Servlet 2.3 requirments", 
   "related to recognizing dependencies on shared \"optional packages\"", 
   "(formerly called \"standard extensions\") that might be made available to", 
   "all web applications via a special class loader that becomes the parent to", 
   "the web app class loader.", 
   "NOTE:  The shared extensions class loader is currently being created (by", 
   "the Bootstrap class) and propogated to the Catalina object, but not yet", 
   "propogated down to the containers.  That will be part of the next set of", 
   "commits, which will include enhancements to enforce the new rules."
  ], 
  "revision_id": "285142"
 }, 
 {
  "author": "shemnon", 
  "date": "2000-09-29T06:06:38.000000Z", 
  "msg": [
   "Add conversions for JSP to XJSP run-time attributes to the XMLOutputter.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285141"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-28T19:00:26.000000Z", 
  "msg": [
   "Clean up the error handling behavior of the invoker servlet (/servlet/*", 
   "mapping) when you do not specify a servlet class or name, or the servlet", 
   "class or name you specify is not found.  Now, all of the following cases", 
   "will return a 404 (not found) error:", 
   "http://localhost:8080/servlet", 
   "http://localhost:8080/servlet/", 
   "http://localhost:8080/servlet/nonExistentServlet", 
   "instead of the previous 503 error.", 
   "A 500 (internal server error) will be returned if the servlet actually", 
   "exists but cannot be initialized (for example, the init() method returns", 
   "an UnavailableException).", 
   "PR: BugRat Bug Report #177", 
   "Submitted by:\tAnil Amarakoon <anil@awcoldstream.com>"
  ], 
  "revision_id": "285140"
 }
]