[
 {
  "author": "craigmcc", 
  "date": "2000-10-16T18:27:51.000000Z", 
  "msg": [
   "Update the example main() method in the Embedded class to reflect changes", 
   "in the refactoring of context startup, and to document the option to use", 
   "the new deploy() method.", 
   "When using the Embedded class, you will also need to include the JAR files", 
   "in $CATALINA_HOME/server on your system classpath, or else build a custom", 
   "class loader for these classes the way that", 
   "org.apache.catalina.startup.Bootstrap does.  The startup script has been", 
   "modified to do the former when you use the \"embedded\" option."
  ], 
  "revision_id": "285229"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-16T17:25:44.000000Z", 
  "msg": [
   "Add support for the new method just added to the PageContext interface:", 
   "public void handlePageException(Throwable e)", 
   "throws IOException, ServletException;", 
   "The handling is identical to the current version of this method that accepts", 
   "an Exception, rather than a Throwable, as an argument."
  ], 
  "revision_id": "285228"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-14T21:43:54.000000Z", 
  "msg": [
   "Finish refactoring and make session persistence across auto-reload (either", 
   "because a class in WEB-INF/classes was changed or initiated through the", 
   "manager application) and server shutdown/restart.", 
   "When a reload is initiated, any loaded filters and application event", 
   "listeners are also released and re-initialized, to avoid class cast errors", 
   "due to the creation of a new classloader after the reload.", 
   "Application event listeners will see sessions being persisted to storage", 
   "and then expired, followed by being recreated and the attributes re-added", 
   "after the reload."
  ], 
  "revision_id": "285227"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-14T05:21:14.000000Z", 
  "msg": [
   "Rearrange the location of the support for application event listeners, and", 
   "make sure that they are reinitialized during a reload() operation on a", 
   "Context.  Otherwise, there would be a potential for class cast exceptions", 
   "because they would have been loaded by the previous class loader.", 
   "Still need to refactor when session reloading from persistent storage", 
   "takes place versus when application event listeners are set up, so that", 
   "the listeners will hear about the reloaded sessions."
  ], 
  "revision_id": "285226"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-14T01:09:42.000000Z", 
  "msg": [
   "Fix the line endings again (sigh ...)"
  ], 
  "revision_id": "285225"
 }
]