[
 {
  "author": "craigmcc", 
  "date": "2000-10-13T23:49:24.000000Z", 
  "msg": [
   "Remove obsolete comments about the authentication method being used."
  ], 
  "revision_id": "285224"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-13T23:43:21.000000Z", 
  "msg": [
   "Correct CLIENT-CERT authentication handling.  The Java type of the SSL", 
   "certificate chain was corrected at the socket level, but not here."
  ], 
  "revision_id": "285223"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-13T23:34:53.000000Z", 
  "msg": [
   "Uncomment the definition entry for the examples context, so that it will", 
   "start up in auto-reload mode by default."
  ], 
  "revision_id": "285222"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-13T23:33:27.000000Z", 
  "msg": [
   "Refactor the startup processing so that saving sessions across automatic", 
   "context reloads, and normal shutdown/startup of the server.  Previously", 
   "there were cases where you would not see the session information restored", 
   "correctly.", 
   "NOTE:  There are still issues with the timing of when application event", 
   "listeners are initialized versus when session restoration occurs.  These", 
   "will be addressed shortly.", 
   "NOTE:  If you have saved session information from a previous version of", 
   "Tomcat 4.0, you will not be able to reload it with this version - the", 
   "format of serialized sessions has changed slightly.  To avoid any", 
   "problems, simply delete the $CATALINA_HOME/work directory before starting", 
   "this version of Tomcat 4.0."
  ], 
  "revision_id": "285221"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-13T20:16:25.000000Z", 
  "msg": [
   "Work around the lack of a JSSE call to ask for the key size.", 
   "The cipher suite name is examined to detect cases where it contains a cipher", 
   "name for which the key size is known.  If it is known, the corresponding key", 
   "size is published.  Otherwise, a key size of zero is published.", 
   "The underlying data for this mapping comes from the TLS Version 1.0", 
   "Specification (RFC 2246), Appendix C."
  ], 
  "revision_id": "285220"
 }
]