[
 {
  "author": "remm", 
  "date": "2000-11-14T04:09:24.000000Z", 
  "msg": [
   "- Added a DAV clients compatibility list."
  ], 
  "revision_id": "285344"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-14T02:05:20.000000Z", 
  "msg": [
   "- Fix two bugs found using Adobe GoLive 5 :", 
   "* The lock scope was incorrectly parsed. It could be a cut and paste bug,", 
   "since the fix was already present in the original Slide code", 
   "* \"/\" was sometimes incorrectly appended to a path when generating href", 
   "elements", 
   "- Lock functionality doesn't work yet with GoLive, since it doesn't like that I", 
   "obsfucate the lock token (and even crashes if I don't specify a locktoken", 
   "element, which I'm allowed to do according to the DTD). I'll add a", 
   "workaround, since some other clients may not like this. What will happen", 
   "is that a user will be able to access the locktoken of the locks that he has", 
   "set (so that he can steal his own locks using another WebDAV enabled", 
   "application, which can prove to be useful)."
  ], 
  "revision_id": "285343"
 }, 
 {
  "author": "pierred", 
  "date": "2000-11-14T01:04:23.000000Z", 
  "msg": [
   "Port of improvement made in 3.2b7", 
   "-----", 
   "When \"redirecting\" to the error page in handlePageException(), first try to", 
   "forward to the error page.  If this fails because the response has already", 
   "been committed, do an include of the error page instead -- that way the user", 
   "gets at least some feedback on what is causing the problem.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:\tLarry Isaacs <Larry.Isaacs@sas.com>", 
   "Reviewed by:"
  ], 
  "revision_id": "285342"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-13T06:52:04.000000Z", 
  "msg": [
   "- Update the README files : new instructions on how to install JNDI on", 
   "JDK 1.2."
  ], 
  "revision_id": "285341"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-13T06:48:59.000000Z", 
  "msg": [
   "- Updates to the documentation to reflect the change in classloader", 
   "architecture."
  ], 
  "revision_id": "285340"
 }
]