[
 {
  "author": "pierred", 
  "date": "2000-11-26T16:13:57.000000Z", 
  "msg": [
   "PageContext has two variations of handlePageException().", 
   "Have the one with the Exception argument simply calls the", 
   "one with the Throwable argument to avoid duplication of", 
   "code (I had previously modified the first one without", 
   "updating the second one). Sent message to spec lead inquiring", 
   "why both variations are kept in 1.2. Backward compatibility", 
   "is not a valid reason imho.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285369"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-25T00:57:25.000000Z", 
  "msg": [
   "Improve backwards compatibility of servlet 2.2 applications running under", 
   "Catalina, by conditionally accepting context-relative pathnames that do", 
   "not start with \"/\".  To enable this acceptance, you must explicitly", 
   "reference the public identifier of the 2.2 DTD in your web.xml file:", 
   "<!DOCTYPE web-app", 
   "PUBLIC \"-//Sun Microsystems, Inc.//DTD Web Application 2.2//EN\"", 
   "\"http://java.sun.com/j2ee/dtds/web-app_2_2.dtd\">", 
   "(in other words, the standard DOCTYPE declaration for a 2.2 webapp).  The", 
   "paths without leading slashes are accepted on the following web.xml", 
   "elements:", 
   "* <jsp-file> subelement of the <servlet> element.", 
   "* <location> subelement of the <error-page> element.", 
   "* <form-login-page> and <form-error-page> subelements of the", 
   "<form-login-config> element.", 
   "To encourage attention to this issue, a warning message will be logged to", 
   "the Logger associated with this Context, if such a value is accepted.", 
   "If you specify the 2.3 version of the DTD, attempts to specify such a path", 
   "without a leading \"/\" will be rejected.  This is based on the tightened", 
   "requirements that are specifically defined in the 2.3 specification."
  ], 
  "revision_id": "285368"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-24T22:36:25.000000Z", 
  "msg": [
   "Provide a mechanism where the public identifier of the web application", 
   "deployment descriptor DTD is communicated to the Context implementation", 
   "object.  This will be necessary in order to apply the looser (in 2.2)", 
   "versus tighter (in 2.3) validation on web.xml values (such as the 2.3", 
   "requirement that a <jsp-file> entry begin with a \"/\").", 
   "This mechanism is not yet used -- that will be the next patch, separated", 
   "so that we can clearly see what rules are being relaxed (in the name of", 
   "backwards compatibility) when parsing a 2.2 web.xml file."
  ], 
  "revision_id": "285367"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-24T19:55:20.000000Z", 
  "msg": [
   "- Start using the new buffers in the request, to test their functionality.", 
   "- Use the modified request in the processor.", 
   "- The request parsing still needs more optimization, and the response hasn't", 
   "been optimized at all. A profiling session would probably be very useful", 
   "before doing any additional work."
  ], 
  "revision_id": "285366"
 }, 
 {
  "author": "pier", 
  "date": "2000-11-24T18:10:41.000000Z", 
  "msg": [
   "Added the module (done) and the library it relies upon (partial)...", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285365"
 }
]