[
 {
  "author": "craigmcc", 
  "date": "2000-11-02T23:04:50.000000Z", 
  "msg": [
   "Extend the instance listener support to include events before and after", 
   "individual filter instances are invoked, as well as before and after", 
   "servlet instances are invoked.  The new event types are defined by the", 
   "manifest constants InstanceEvent.BEFORE_FILTER_EVENT and", 
   "InstanceEvent.AFTER_FILTER_EVENT, both of which pass the filter instance", 
   "itself as a data object."
  ], 
  "revision_id": "285304"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-02T06:17:24.000000Z", 
  "msg": [
   "- Link the new JNDI sevlet example from the servlet examples index page"
  ], 
  "revision_id": "285303"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-02T06:16:49.000000Z", 
  "msg": [
   "- Updated web.xml with some env-entry elements"
  ], 
  "revision_id": "285302"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-02T06:16:16.000000Z", 
  "msg": [
   "- Add a naming servlet example"
  ], 
  "revision_id": "285301"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-02T06:14:18.000000Z", 
  "msg": [
   "- JNDI implementation which provides a per web application naming environment.", 
   "- 100% independent from Catalina (root package name : org.apache.naming).", 
   "- The Context implementation supports federation, links and references.", 
   "- Web application environment support (\"java\" URL scheme), which is a special", 
   "read-only JNDI context populated using the web app deployment descriptor.", 
   "- Updated STATUS.html to reflect that addition.", 
   "- Generic references are used for EJB and Resources. A set of factories", 
   "(org.apache.naming.factory) will be provided to interface various popular", 
   "J2EE providers, whenever possible.", 
   "- Each web application can also get a writable initial context, which is NOT", 
   "accessible to other web applications.", 
   "- Adds various switches in Catalina to enable / disable the naming support :", 
   "* \"-nonaming\" command line option completely disables naming", 
   "* Embedded.setUseNaming(false) also completely disables naming (useful is the", 
   "embedding application provides its own naming environment)", 
   "* In server.xml, a new attribute of Context element, \"useNaming\" can be used", 
   "to disable the naming support for a specific web application.", 
   "* By default, internal naming is enabled for each of the web applications.", 
   "- Updates to the JMX wrapper to Embedded to reflect this.", 
   "- JMX wrapper to the naming service (named NamingService). It has simple start", 
   "and stop commands which initialize / restore to previous values when you stop", 
   "the required environment variables."
  ], 
  "revision_id": "285300"
 }
]