[
 {
  "author": "remm", 
  "date": "2000-11-04T06:54:25.000000Z", 
  "msg": [
   "- Fixes two JavaDoc warnings."
  ], 
  "revision_id": "285309"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-04T06:46:09.000000Z", 
  "msg": [
   "- Removed the address references, and replaced them with references", 
   "(EjbRefAddr -> EjbRef, ResourceEnvRefAddr -> ResourceEnvRef,", 
   "ResourceRefAddr -> ResourceRef). It makes the code simpler and easier to", 
   "understand.", 
   "- Modified StandardContext to reflect this and create the right objects.", 
   "- Add a Tyrex resource factory. Instructions on how to use it to follow", 
   "shortly, as soon as all the issues are ironed out. Although the DataSource", 
   "is successfully instantiated, some more configuration is needed.", 
   "- The object factories are packaged in a separate JAR file", 
   "(lib/namingfactory.jar), to avoid classloading related problems.", 
   "- Object factory selector, which should be more efficient than the built in", 
   "JNDI mechanism. There will be one for each type (resource, ejb,", 
   "resource-env). The first one is the ResourceFactory, which checks the", 
   "requested type and the parameters given to select the appropritate factory.", 
   "As there's only one factory right now, it can only select that one.", 
   "- Add the selector factories for EJB and resource env (without any actual", 
   "factories)", 
   "- Add transaction reference object.", 
   "- Add a transaction factory selector.", 
   "- Add a wrapper to get a UserTransaction object from Tyrex.", 
   "- The StandardContext will now bind a reference to a user transaction in", 
   "java:comp/UserTransaction as recommended by the J2EE spec."
  ], 
  "revision_id": "285308"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-03T07:30:58.000000Z", 
  "msg": [
   "- RefAddr.toString() actually does getContent().toString(), so overriding", 
   "getContent() and returning \"this\" is not a good idea ;)"
  ], 
  "revision_id": "285307"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-03T06:46:54.000000Z", 
  "msg": [
   "- Fix for a dumb initialization problem of the naming context, where naming", 
   "entries which were including paths could be bound to an incorrect path.", 
   "- Add an easy to specify additional parameters for resources (by using env-entry", 
   "elements)."
  ], 
  "revision_id": "285306"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-03T00:21:17.000000Z", 
  "msg": [
   "Extend the set of container events to include notification before and", 
   "after instances of application event listeners are invoked.  In each case,", 
   "the listener instance is passed as the data object associated with this", 
   "event."
  ], 
  "revision_id": "285305"
 }
]