[
 {
  "author": "remm", 
  "date": "2000-11-09T18:52:08.000000Z", 
  "msg": [
   "- The determination of the chunk mode flag is more dynamic. Before, it was", 
   "only determined when the stream was instantiated, which could lead to", 
   "problems."
  ], 
  "revision_id": "285324"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-09T07:23:05.000000Z", 
  "msg": [
   "- Now enables to specify the charset used."
  ], 
  "revision_id": "285323"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-09T07:22:22.000000Z", 
  "msg": [
   "- Add a debug method in the DefaultServlet, which will output to System.out", 
   "all the info about the request. It should be useful to debug conditional", 
   "requests and ranged requests.", 
   "- In the WebDAV servlet, one of the XMLWriters I was using wasn't", 
   "properly initialized. As a result, the XML header wasn't present in the", 
   "XML sent back to the client, which may have caused various problems with some", 
   "clients.", 
   "- Now use ISO date format for the creationdate property.", 
   "- Fixes one or two cosmetic issues in the code layout.", 
   "- The displayname property now have a more \"friendly\" value (the '/' are", 
   "replaced by '_')", 
   "- The JSP include fix intrduced a bug : The response stream was not opened at", 
   "the right time, so chunking was enabled all the time (it seems).", 
   "Note : We should decide if we chunk or not in a more robust way. It will be", 
   "addressed in a future patch."
  ], 
  "revision_id": "285322"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-08T19:30:24.000000Z", 
  "msg": [
   "Work around a problem where the default hostname is not set when you access", 
   "Tomcat 4.0 using a simple Telnet request.  NOTE:  It actually violates the", 
   "HTTP spec to send a request like \"GET / HTTP/1.0\" without a \"Host:\" header,", 
   "but this is way too handy for debugging to have the server name set from the", 
   "default host you declare in server.xml."
  ], 
  "revision_id": "285321"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-08T01:18:54.000000Z", 
  "msg": [
   "Use the platform-independent file separator instead of a hard coded", 
   "\"/\" character.", 
   "Submitted by: Chris Halverson <chalvers@ncube.com>"
  ], 
  "revision_id": "285320"
 }
]