[
 {
  "author": "remm", 
  "date": "2000-11-18T00:16:57.000000Z", 
  "msg": [
   "- Should fix lots of potential problems. The base is removed before", 
   "comparing. I checked with Tomcat 3.2, and the code is very similar.", 
   "Also, the case checking is only necessary when running Windows."
  ], 
  "revision_id": "285354"
 }, 
 {
  "author": "pierred", 
  "date": "2000-11-17T22:39:23.000000Z", 
  "msg": [
   "trim the tag values. (see bug report #349).", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285353"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-17T20:09:21.000000Z", 
  "msg": [
   "- Case sensitivity is now enforced.", 
   "However, it creates some problems under Windows :", 
   "Let's say a foo resource exists. Foo doesn't exist (well, at least, that's what", 
   "the Resources will tell you). If you set the content of Foo, you'll delete foo in", 
   "the process. I can't find any workaround to this."
  ], 
  "revision_id": "285352"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-17T07:25:36.000000Z", 
  "msg": [
   "- Skip extra CRLF before starting reading the request line, as is heavily", 
   "recommended to do that in the HTTP spec."
  ], 
  "revision_id": "285351"
 }, 
 {
  "author": "remm", 
  "date": "2000-11-17T03:30:43.000000Z", 
  "msg": [
   "- Optimized the socket byte reading, which results in a big boost of the", 
   "connector performance. Overall servlet performance is increased by around", 
   "30%, and is on par with the current CVS version of Tomcat 3.3.", 
   "- Add some recyclable specilized buffer objects for the handling of the", 
   "request line and the headers.", 
   "- HttpProcessor currently do not take advantage of these objects, and wrap", 
   "them into String objects immediately after reading them. Very little changes", 
   "have been made to the HTTP processor, so far.", 
   "- The request header parsing is now done inside the socket stream, to get", 
   "maximum performance.", 
   "- The new buffer objects will eventually allow to have 0 GC inside the", 
   "connector."
  ], 
  "revision_id": "285350"
 }
]