[
 {
  "author": "pierred", 
  "date": "2000-12-21T23:16:41.000000Z", 
  "msg": [
   "Check for null value before invoking method.", 
   "From email sent by Brian Bucknam:", 
   "It's a long story, but I'm working on a project where Jasper 3.x is embedded", 
   "inside a servlet, which can then be deployed to the container of our", 
   "customer's choice.  The servlet uses JSP files as templates, which is where", 
   "Jasper comes in.", 
   "In this type of environment, sometimes thing can go really wrong, and the", 
   "compiled JSP might, in some cases, fail to get a JspFactory, PageContext, or", 
   "JspWriter.", 
   "If any of _jspxFactory, pageContext, or out fail to be created, the catch{}", 
   "and finally{} clauses just throw NPE's.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by: \"Bucknam, Brian\" <Brian.Bucknam@webgain.com>", 
   "Reviewed by:"
  ], 
  "revision_id": "285499"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-21T22:27:11.000000Z", 
  "msg": [
   "Add some debugging instrumentation (still disabled by default) to track down", 
   "the \"non-normalized\" URLs issue.  If you start Catalina using the standard", 
   "startup script, without a CATALINA_HOME environment variable set, you do indeed", 
   "get URLs that have \"/../\" in them passed to the classloader.  Interestingly", 
   "enough, though, they continue to work.", 
   "I'm going to check this out on Solaris and Windows to see if there might be", 
   "platform-specific discrepancies in how URLClassLoader is implemented."
  ], 
  "revision_id": "285498"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-19T03:23:12.000000Z", 
  "msg": [
   "Enhance the example main() method in the Embedded class so that it will", 
   "actually run.  The \"/examples\" webapp does not work without a Realm defined.", 
   "Add get/setDefaultHost() to the Engine interface, not just the StandardEngine", 
   "implementation class."
  ], 
  "revision_id": "285497"
 }, 
 {
  "author": "", 
  "date": "2000-12-18T05:06:14.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'J2EE_13_05'."
  ], 
  "revision_id": "285496"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-18T05:06:14.000000Z", 
  "msg": [
   "Add the initial version of a unit testing suite for Tomcat 4.0.  The test", 
   "client is a custom Ant task modelled after the GTest task used by the", 
   "Watchdog tests, but which uses HttpURLConnection instead of a low level", 
   "socket connection for processing.", 
   "The intent of this suite is to host unit tests for Tomcat-specific", 
   "functionality, rather than the spec compliance that is checked by", 
   "Watchdog.  As such, the tests rely on specifics of the way that a default", 
   "Tomcat 4.0 installation is laid out.", 
   "Currently, the tester suite is *not* integrated in the top-level build", 
   "scripts for Tomcat 4.0.  To build and deploy it to the \"build\" version,", 
   "execute the following commands from the top level directory of the source:", 
   "cd tester", 
   "./build.sh deploy-main", 
   "and then restart Tomcat 4.0.  To execute the tests, execute:", 
   "$CATALINA_HOME/bin/tester.sh"
  ], 
  "revision_id": "285495"
 }
]