[
 {
  "author": "craigmcc", 
  "date": "2000-12-14T22:36:10.000000Z", 
  "msg": [
   "Initialize the release notes document for the next release (beta 1)."
  ], 
  "revision_id": "285469"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-14T22:33:43.000000Z", 
  "msg": [
   "Reset version numbers for next development round."
  ], 
  "revision_id": "285468"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-14T22:32:19.000000Z", 
  "msg": [
   "Allow a server that is embedding Catalina to initialize the \"follow", 
   "standard delegation model\" property of the web app class loader that will", 
   "be configured.  The default for this property remains \"false\", consistent", 
   "with prior behavior.", 
   "Submitted by:\tVivek Nagar <vivek.nagar@eng.sun.com>"
  ], 
  "revision_id": "285467"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-14T20:44:15.000000Z", 
  "msg": [
   "Modify the startup/shutdown script so that it works from within the \"bin\"", 
   "directory, as it already does in the Windows version.  Among other things,", 
   "that means you can double click on the \"startup.sh\" or \"shutdown.sh\"", 
   "scripts in a GUI environment to start or stop Tomcat."
  ], 
  "revision_id": "285466"
 }, 
 {
  "author": "remm", 
  "date": "2000-12-14T07:49:16.000000Z", 
  "msg": [
   "- Fix two overlapping problems in input chunking.", 
   "- Fix for a serious logic bug (apparently, I had forgotten to port back another fix", 
   "from the HTTP client library :(((().", 
   "- Removed buffering in RequestStream, since it was causing problems with", 
   "chunking in some cases. The request was double buffered anyway, so the", 
   "performance impact, if any, shouldn't be too big. Doing a buffered stream which", 
   "would also transparently handle chunks could be tricky, so I prefer keeping", 
   "those two things separate : at the bottom is the buffered stream, and the chunk", 
   "handling is done at a higher level. Also, an all in one approach wouldn't work", 
   "for more that one transfer encoding. In the future a layered approach could", 
   "be used to transparently do successive decodings / encodings."
  ], 
  "revision_id": "285465"
 }
]