[
 {
  "author": "craigmcc", 
  "date": "2000-12-14T02:56:14.000000Z", 
  "msg": [
   "Fix a bug that prevented starting multiple <Service> entries at", 
   "Tomcat startup time.", 
   "Modify the default \"server.xml\" file to include configuration of the", 
   "Apache Connector.  So far, this connector has only been tested VERY", 
   "lightly, and only on Unix systems.  It is likely to have significant", 
   "bugs -- please help us shake them out."
  ], 
  "revision_id": "285454"
 }, 
 {
  "author": "pier", 
  "date": "2000-12-14T01:25:57.000000Z", 
  "msg": [
   "Start WarpHost container if WarpEngine has already been started."
  ], 
  "revision_id": "285453"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-13T23:45:38.000000Z", 
  "msg": [
   "Fix a buffering issue that was causing one Watchdog-4.0 test failure", 
   "(SetBufferSize_1Test), and also could cause grief for applications as", 
   "well.", 
   "The issue:  Several methods on ServletResponse are required to throw an", 
   "IllegalStateException if any output has been written to the output stream", 
   "or writer, even if the response has not been committed to the client yet.", 
   "The original implementation simply returned a PrintWriter that wrapped an", 
   "OutputStreamWriter -- to do the character encoding conversions -- around", 
   "the ServletOutputStream implementation that writes directly to the", 
   "response buffer.", 
   "The problem:  The java.io.OutputStreamWriter implementation includes a", 
   "non-configurable buffer (8kb per instance in the Sun JDK!!!).  When you", 
   "\"print\" output to this buffer, the ServletResponse does not know it has", 
   "happened, and you get incorrect results from calls like setBufferSize().", 
   "The solution:  Create a customized PrintWriter, to be returned when you", 
   "call response.getWriter().  This version causes the OutputStreamWriter to", 
   "be \"flushed\" to the underlying ServletOutputStream, which simply writes", 
   "directly to the response buffer, on every write() or print().  Now, the", 
   "response is aware of what bytes have *really* been written.  In addition,", 
   "response.reset() and response.resetBuffer() can now work correctly even", 
   "when using a writer.", 
   "The performance impact of this change is certainly worth being concerned", 
   "about, but correct functionality has to come first -- now we can optimize."
  ], 
  "revision_id": "285452"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-13T17:10:39.000000Z", 
  "msg": [
   "Correct the log output generated by addConnector() if debugging is on.", 
   "Submitted by: Christian Mallwitz <c.mallwitz@intershop.de>"
  ], 
  "revision_id": "285451"
 }, 
 {
  "author": "nacho", 
  "date": "2000-12-12T18:41:38.000000Z", 
  "msg": [
   "this is the 4.X branch!!!"
  ], 
  "revision_id": "285450"
 }
]