[
 {
  "author": "remm", 
  "date": "2000-12-07T07:23:05.000000Z", 
  "msg": [
   "- Increased the maximum tree depth from 6 to 10."
  ], 
  "revision_id": "285414"
 }, 
 {
  "author": "remm", 
  "date": "2000-12-07T05:15:08.000000Z", 
  "msg": [
   "- Status update.", 
   "- Warp connector is now packaged in a separate ./server/warp.jar file", 
   "(as per Pier's request)."
  ], 
  "revision_id": "285413"
 }, 
 {
  "author": "pier", 
  "date": "2000-12-06T11:20:49.000000Z", 
  "msg": [
   "Modified wa_request structure to store new request items.", 
   "Modified how callbacks work from a WebAppLib perspective.", 
   "Added a new callback (serverinfo).", 
   "The wa_provider_info now dumps more interesting informations.", 
   "Disabled warp since it makes the Apache process go around in loop. (Will fix)", 
   "Modified how the library should be initialized.", 
   "Fixed a couple of memory leaks (after 50.000 requests the process doesn't grow)", 
   "Documented a couple of functions left undocumented.", 
   "Added mapping on how servlet methods are reflected in the library.", 
   "Added name and version.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285412"
 }, 
 {
  "author": "remm", 
  "date": "2000-12-06T06:46:39.000000Z", 
  "msg": [
   "- Fix a chunking parsing bug on input. Basically, the hexadecimal number may", 
   "have some extra spaces, which would make the conversion to an int fail.", 
   "I found that one while toying with my HTTP client and being unable to get", 
   "the whole entity body of jakarta.apache.org/tomcat/index.html. Note that", 
   "it only happened on that page, not on all the jakarta.org pages, although all", 
   "were transfered using chunking.", 
   "Since Catalina's HttpRequestStream is based on the code I wrote for the", 
   "client, it has the same bug. It should be a rare bug, though, since it only", 
   "happens when the client uses chunking for the request, and extra blanks", 
   "are present on the line where the chunk size is given."
  ], 
  "revision_id": "285411"
 }, 
 {
  "author": "", 
  "date": "2000-12-05T12:23:46.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'J2EE_13_01'."
  ], 
  "revision_id": "285410"
 }
]