[
 {
  "author": "horwat", 
  "date": "2001-01-05T22:33:03.000000Z", 
  "msg": [
   "If the JSP page can't be found have the compiler remove any previously", 
   "generated .class file.  This will happen if a JSP page is removed after", 
   "it has been previously compiled.", 
   "Added test to isOutDated() to check for the existence of the JSP page in", 
   "addtion to checking the timestamps.  If the JSP page has been removed", 
   "a 404 error is returned to the client and the associated .class file", 
   "is removed.", 
   "Added a method to remove the generated .class file.  This will be called", 
   "to remove generated files in the event that the associated JSP page is", 
   "removed.", 
   "PR: 698", 
   "Submitted by Marc Saegesser."
  ], 
  "revision_id": "285534"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-04T20:05:39.000000Z", 
  "msg": [
   "Ripple down configuration of the parent class loader when processing the", 
   "server.xml file.  This is necessary due to timing considerations during", 
   "startup processing, and solves the \"Class xxx is not a servlet\" exception", 
   "when a sysadmin configures a <Loader> with non-default properties."
  ], 
  "revision_id": "285533"
 }, 
 {
  "author": "remm", 
  "date": "2001-01-04T20:00:35.000000Z", 
  "msg": [
   "- Enhanced path normalization (before, only %20 was supported), with", 
   "Unicode decoding of \"escaped\" characters in the URL (%xx char codes).", 
   "Path submitted by David Weinrich."
  ], 
  "revision_id": "285532"
 }, 
 {
  "author": "remm", 
  "date": "2001-01-04T19:49:22.000000Z", 
  "msg": [
   "- Added an error flag to the Response. If the flag is set to true, then the", 
   "response is an error report.", 
   "- The error flag is set to true if :", 
   "- An exception is thrown by the servlet", 
   "- sendError is used by the servlet", 
   "- The reporter can now not return a writer if :", 
   "- The response is not an error report", 
   "- The \"client\" servlet had used the output stream", 
   "In that case, no status report is shown (and it's the responsability of the", 
   "servlet to take care of that). Also, the getReporter actually sends the wrapped", 
   "input stream, instead of directly using the socket output."
  ], 
  "revision_id": "285531"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-03T20:07:30.000000Z", 
  "msg": [
   "Correct the default class name for <Loader> elements in the server.xml file.", 
   "Submitted by:  Jon Stevens <jon@latchkey.com>", 
   "NOTE:  I also removed the configuration of a <Loader> or <Manager> element", 
   "nested under an <Engine> or a <Host> -- loaders and session managers can only", 
   "be nested inside a <Context>."
  ], 
  "revision_id": "285530"
 }
]