[
 {
  "author": "craigmcc", 
  "date": "2001-03-14T02:26:51.000000Z", 
  "msg": [
   "Reset debugging detail level back to zero."
  ], 
  "revision_id": "285704"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-14T02:17:22.000000Z", 
  "msg": [
   "Restore the correct operation of form-based login.", 
   "The problem was caused by the following scenario:", 
   "- Form based login authenticator would create a session in which to", 
   "cache the original request while sending the login page", 
   "- The access() method of the new session was being called, which set", 
   "the \"isNew\" property to false, even though the session id had not", 
   "yet been communicated to the client", 
   "- Because isNew was false, the session id cookie was never sent", 
   "- When the form login page was received and processed, and the user", 
   "correctly authenticated, no session id was included -- so the cached", 
   "original request could not be recovered.  This triggered an", 
   "\"Error 400 - Bad Request\" error", 
   "As a side effect of this change, the last accessed time of a session is", 
   "now correctly updated at the beginning of each request, whether or not the", 
   "servlet actually calls request.getSession() to acquire a reference to it.", 
   "See Servlet Specification, version 2.3 (PFD), Section 7.6 (p. 51)."
  ], 
  "revision_id": "285703"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-13T19:10:42.000000Z", 
  "msg": [
   "Repeat the JNDI tests after an application restart, to ensure that the web", 
   "application's naming context has been reinitialized correctly."
  ], 
  "revision_id": "285702"
 }, 
 {
  "author": "", 
  "date": "2001-03-13T19:06:22.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch", 
   "'J2EE_13_BRANCH'."
  ], 
  "revision_id": "285701"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-13T19:06:22.000000Z", 
  "msg": [
   "Add a test to prove that we can run a web application using Xerces (which", 
   "is installed under WEB-INF/lib) in a Tomcat 4.0 environment.", 
   "Also, added debugging attributes on all remaining tests that did not", 
   "include it.", 
   "Submitted by:  Amy Roh <amyroh@eng.sun.com>"
  ], 
  "revision_id": "285700"
 }
]