[
 {
  "author": "craigmcc", 
  "date": "2001-03-24T20:52:07.000000Z", 
  "msg": [
   "Add a naming context resource factory for javax.mail.Session resources", 
   "(compliant with J2EE requirements) so that web applications can look up", 
   "and utilize a preconfigured javax.mail.Session instance.  The resource is", 
   "configured by creating <Resource> and <ResourceParams> elements nested in", 
   "the <Context> or <DefaultContext> element in \"conf/server.xml\" -- the", 
   "example application will be updated to demonstrate this shortly.", 
   "NOTE:  the mechanism by which new object factories are registered needs to", 
   "be generalized."
  ], 
  "revision_id": "285764"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-24T01:23:23.000000Z", 
  "msg": [
   "Add a special version of the jaxp.jar and crimson.jar files (from JAXP/1.1", 
   "final release) that have had the \"sealed\" attribute removed.  These JARs", 
   "are used for the XML parser that Jasper uses (in directory \"jasper\"), to", 
   "avoid \"package sealing violation\" errors that occurred when the sealed", 
   "versions were used on JDK 1.3 systems when a web application loaded its", 
   "own parser from WEB-INF/lib.", 
   "WARNING:  you MUST NOT replace jasper/jaxp.jar and jasper/crimson.jar with", 
   "versions from a different (even if newer) release of JAXP, unless the", 
   "\"sealed\" attribute has been removed from those files.", 
   "WARNING:  The Tomcat 4.0 build process now ignores any JASPER_JAXP_HOME", 
   "and JASPER_JAXP_PARSER_JAR environment variables you may have set.  The", 
   "scripts are hard coded to use the files in the \"lib\" directory being", 
   "checked in with this patch.", 
   "PR: Bugzilla #1002", 
   "Submitted by:\tdavid@i2a.com"
  ], 
  "revision_id": "285763"
 }, 
 {
  "author": "remm", 
  "date": "2001-03-23T02:55:44.000000Z", 
  "msg": [
   "- Now adding the parameters before sending a redirect.", 
   "Bug reported by Stefan Schmidt <stefan at schmidt1.de>"
  ], 
  "revision_id": "285762"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-23T01:12:12.000000Z", 
  "msg": [
   "Undo the previous fix on where servlet API javadocs are copied from,", 
   "because it causes other compatibility problems.  Instead, correct the", 
   "instructions in the README on setting SERVLETAPI_HOME if you are building", 
   "the Servlet API classes from source.", 
   "Also, establish a reasonable default value if SERVLETAPI_HOME is not set,", 
   "rather than requiring it in the build.sh and build.bat scripts."
  ], 
  "revision_id": "285761"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-23T00:07:36.000000Z", 
  "msg": [
   "Correct the source of jakarta-servletapi-4 Javadocs when building the", 
   "\"dist\" target."
  ], 
  "revision_id": "285760"
 }
]