[
 {
  "author": "horwat", 
  "date": "2001-04-13T21:51:34.000000Z", 
  "msg": [
   "Fixed mapping between JSP and XML syntax according to Section 5.3 of JSP 1.2 specification:", 
   "- tag library namespaces are now added to root element instead of using the \"directive.taglib\" syntax", 
   "- fixed character data handling", 
   "Bugzilla #1221"
  ], 
  "revision_id": "285869"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-04-13T21:18:42.000000Z", 
  "msg": [
   "Initial version of a Realm implementation for Tomcat 4.0 that utilizes a", 
   "directory server (accessed via JNDI) to perform user authentication and", 
   "access control for container-managed security.  This code is based in", 
   "large part on the proposed code (on TOMCAT-DEV) by John Holman, with some", 
   "additions and refactoring by me.", 
   "Use of this realm would be configured in \"conf/server.xml\" by an entry", 
   "like this to connect to an LDAP server on the same host that Tomcat is", 
   "running on:", 
   "<Realm className=\"org.apache.catalina.realm.JNDIRealm\"", 
   "connectionName=\"admin-username\"", 
   "connectionPassword=\"admin-password\"", 
   "connectionURL=\"ldap://localhost:389\"", 
   "userPattern=\"cn={0},dc=mycompany,dc=com\"", 
   "userPassword=\"userPassword\"", 
   "roleBase=\"dc=groups,dc=mycompany,dc=com\"", 
   "roleName=\"cn\"", 
   "roleSearch=\"(|(uniqueMember={0})(member={0}))\"", 
   "roleSubtree=\"false\"", 
   "/>", 
   "TODO:  Update the configuration documentation to describe the above.", 
   "TODO:  Support an operational mode where the Realm attempts to bind to the", 
   "directory server using the user's username and password (instead of a", 
   "system administrator username and password).  This is a different enough", 
   "style that it probably should be a separate implementation class.", 
   "TODO:  Support connection pooling (for both this and JDBCRealm) so that", 
   "the authenticate() method does not have to be synchronized."
  ], 
  "revision_id": "285868"
 }, 
 {
  "author": "amyroh", 
  "date": "2001-04-13T21:00:37.000000Z", 
  "msg": [
   "Bug 1272 Fixed -- submitted by Vanitha Venkatraman.", 
   "Takes care of single quotes inside of double quotes in errmsg.", 
   "Added handling of null parameters so that it displays an error message instead of throwing ServletException."
  ], 
  "revision_id": "285867"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-04-13T19:57:45.000000Z", 
  "msg": [
   "Refactor so that this class can be easily specialized by subclassing (including", 
   "the creation of an implementation that uses a connection pool instead)."
  ], 
  "revision_id": "285866"
 }, 
 {
  "author": "kief", 
  "date": "2001-04-12T20:24:36.000000Z", 
  "msg": [
   "Fixed an error I made in applying Bip's patch which had neutered the", 
   "backup() method."
  ], 
  "revision_id": "285865"
 }
]