[
 {
  "author": "craigmcc", 
  "date": "2001-04-17T19:27:14.000000Z", 
  "msg": [
   "Restore the ability to save and reload active sessions across a web app", 
   "restart.  This was broken by the refactoring of the load() and unload() calls", 
   "that was recently done in the session manager code.", 
   "The problem was a ClassNotFoundException (on a class found in WEB-INF/classes)", 
   "when the session manager attempted to load the saved session.  This was in turn", 
   "due to the fact that the URLStreamHandler for the directory context was not", 
   "initialized when this attempt was happening.  Rearranging the order of the", 
   "steps fixes the problem.", 
   "PLEASE run the entire \"tester\" suite, as well as the Watchdog 4.0 tests, to", 
   "ensure that we do not introduce regressions like this on future changes."
  ], 
  "revision_id": "285889"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-04-17T17:07:04.000000Z", 
  "msg": [
   "Add some debugging messages to the Manager implementations.", 
   "NOTE:  The recent refactoring of where session storing and loading occurs", 
   "has broken saving and restoring sessions across restarts (to prove it, use", 
   "the \"tester\" suite and run target \"HttpSession\").  Kief/Bip/et. al., could", 
   "you help me look at this, please?"
  ], 
  "revision_id": "285888"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-04-17T16:35:03.000000Z", 
  "msg": [
   "Add a separate Filter to reset the static logger at the beginning of each", 
   "request, so that nothing can accidentally leak through from previous", 
   "requests."
  ], 
  "revision_id": "285887"
 }, 
 {
  "author": "pier", 
  "date": "2001-04-17T14:54:54.000000Z", 
  "msg": [
   "Added license file", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285886"
 }, 
 {
  "author": "pier", 
  "date": "2001-04-17T13:17:02.000000Z", 
  "msg": [
   "New module for apache 1.3", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "285885"
 }
]