[
 {
  "author": "remm", 
  "date": "2001-06-23T22:38:03.000000Z", 
  "msg": [
   "- The webapp CL now implements lifecycle.", 
   "- The CL will clear all its repositories, and release all JAR file objects after", 
   "being shut down.", 
   "- The CL will always throw CNF exception after being stopped."
  ], 
  "revision_id": "286199"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-23T22:30:04.000000Z", 
  "msg": [
   "- Don't copy the JARs to the work directory if filesystem based."
  ], 
  "revision_id": "286198"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-23T21:56:38.000000Z", 
  "msg": [
   "- Make sure the old CL is bound after loading the servlet class. If there was", 
   "an exception, the new CL could remain bound."
  ], 
  "revision_id": "286197"
 }, 
 {
  "author": "remm", 
  "date": "2001-06-23T21:55:39.000000Z", 
  "msg": [
   "- Reset the Jasper class loader when reloading, so that a new one will be", 
   "created. Jasper was always using the old (destroyed) CL before.", 
   "- Make the work directory attribute a protected attribute (since its value will", 
   "never have to change). That protects it when clearing the attributes during a", 
   "reload (before, the CL setup was failing after a reload because it couldn't find", 
   "the work attribute).", 
   "- Cleaned up a bit the binding / unbing order. Before, the old CL was still", 
   "bound when reloading the classes for the listeners. This shouldn't have", 
   "any real world effect, but it still is more correct this way."
  ], 
  "revision_id": "286196"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-23T19:50:30.000000Z", 
  "msg": [
   "When reloading an application, call the init() method of all", 
   "load-on-startup servlets so that they can restore any required application", 
   "specific state that is required.  These servlets will be called in the", 
   "same order as when the application was first started, based on the", 
   "<load-on-startup> values."
  ], 
  "revision_id": "286195"
 }
]