[
 {
  "author": "craigmcc", 
  "date": "2001-06-23T19:27:24.000000Z", 
  "msg": [
   "Add a set of unit tests for servlet context attributes.", 
   "NOTE:  If you uncomment the clearAttributes() call in StandardContext, and", 
   "then run the \"ServletContext\" target in tester.xml, the application", 
   "restart will fail on ClassNotFoundException errors on the listeners and", 
   "filters."
  ], 
  "revision_id": "286194"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-23T19:25:24.000000Z", 
  "msg": [
   "Add a call to clear any application-originated context attributes during a", 
   "restart, in order to avoid dangling references to object instances created", 
   "by the old class loader (after a reload, you would get a", 
   "ClassCastException trying to access such an attribute).", 
   "HOWEVER:  The call to clearAttributes() is currently commented out,", 
   "because it causes ClassNotFoundexceptions trying to restart listeners and", 
   "filters, for a reason I cannot fathom yet, on the test suite additions to", 
   "be checked in next.", 
   "There is also an additional problem -- we're not re-init()-ing the load on", 
   "startup servlets after a restart.  That will be fixed once we figure out", 
   "what's going on with clearing attributes."
  ], 
  "revision_id": "286193"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-23T00:28:33.000000Z", 
  "msg": [
   "OK, the problem with SharedSessionBean was creating a false negative on my", 
   "tests with UnsharedSessionBean.  To recap, the following things now work", 
   "using WebappClassLoader:", 
   "- Session class Session01 can reference beans loaded from", 
   "/WEB-INF/classes, /WEB-INF/lib/tester.jar (i.e. the same JAR file),", 
   "and from a JAR file in the parent class loader.", 
   "- Session attributes of all three bean classes survive a", 
   "restart of the web application."
  ], 
  "revision_id": "286192"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-23T00:22:08.000000Z", 
  "msg": [
   "With the fix to SharedSessionBean, the test now works when SSB is deployed", 
   "in $CATALINA_HOME/lib/tester-shared.jar."
  ], 
  "revision_id": "286191"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-23T00:14:44.000000Z", 
  "msg": [
   "Make SharedSessionBean independent of SessionBean.  It used to be a", 
   "subclass, but that could never work because SessionBean was only loaded", 
   "from a child classloader.", 
   "Submitted by:\tRemy Maucherat <remm@apache.org>"
  ], 
  "revision_id": "286190"
 }
]