[
 {
  "author": "remm", 
  "date": "2001-07-16T23:07:46.000000Z", 
  "msg": [
   "- Display some JRE information about the VM.", 
   "- Don't assume that NSIS is in the path. Instead, assume it's in the default", 
   "installation directory. The nsis.home variable can be used to change the", 
   "NSIS path. Thanks to Amy Roh for testing."
  ], 
  "revision_id": "286274"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-16T22:24:33.000000Z", 
  "msg": [
   "Remove cruft code that had been previously commented out.  No functional", 
   "change."
  ], 
  "revision_id": "286273"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-16T22:24:13.000000Z", 
  "msg": [
   "Modify the way that request dispatching is performed.", 
   "Previously, Catalina would create request and/or response wrappers around", 
   "the application-provided request and response objects.  However, this", 
   "violated the application assumption that a wrapper instance created by the", 
   "calling servlet would be the same one seen by a called servlet.", 
   "Now, Catalina creates wrappers as before; however they are *inserted* into", 
   "the request and response wrapper chains, just above the container-provided", 
   "request and response implementation objects (or above previously inserted", 
   "wrappers in the case of nested request dispatchers)."
  ], 
  "revision_id": "286272"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-16T21:55:17.000000Z", 
  "msg": [
   "- Quick and dirty normalization of the URI. Obviously the code is not", 
   "optimized. I will write (errr, cut & paste from TC 3.3 code, actually) an", 
   "optimized version when I refactor the connector to port it to Coyote.", 
   "Unfortunately, I lost my prototype work in my HD crash this WE, so it will get", 
   "delayed a bit (I'm lucky I had committed my Coyote changes already).", 
   "- I hope the fix is adequate (Craig ?). Since the URI gets normalized way before", 
   "going in the mapper, it should be."
  ], 
  "revision_id": "286271"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-16T07:50:33.000000Z", 
  "msg": [
   "- Forgot '-jar'."
  ], 
  "revision_id": "286270"
 }
]