[
 {
  "author": "", 
  "date": "2001-07-14T03:03:39.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'J2EE_13_18'."
  ], 
  "revision_id": "286259"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-14T03:03:39.000000Z", 
  "msg": [
   "- Plenty of fixes", 
   "- Don't try to modify the env variables in the registry", 
   "- The shortcuts should now run with Win9x (since they don't rely anymore on", 
   "CATALINA_HOME being set)", 
   "- Add a warning dialog explaining that the JAVA_HOME env variable must be set", 
   "- Added additional categories (docs, examples)", 
   "- NOTE : The default installation won't work at the moment unless Catalina", 
   "config is edited to remove references to the examples webapp", 
   "- Minimum install is 1.6M", 
   "- Desinstallation works :)"
  ], 
  "revision_id": "286258"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-13T23:15:28.000000Z", 
  "msg": [
   "- Add an experimental installer based on Nullsoft Installer. I just", 
   "started toying with it a couple hours ago, but it's so easy to use I was able", 
   "to generate an install script for Tomcat in no time.", 
   "- It's Windows-only, sorry. I like native installers a lot better. The main advantage", 
   "of using Nullsoft's is that :", 
   "- It's free (open source)", 
   "- It's easy to use", 
   "- It's small and fast", 
   "- The installer will only be able to set CATALINA_HOME under Win2k or WinXP.", 
   "Under older versions of Windows, you may have to set it manually. You need", 
   "to log off and back on before you can use Tomcat 4.0.", 
   "- The uninstaller won't remove the CATALINA_HOME env variable it creates", 
   "(attempting to do it wiped out all my user env variables on my setup, so", 
   "I removed it until I figure out how to do it right).", 
   "- I'll upload (if I have enough karma) a generated installer to the", 
   "Tomcat 4 nightly directory, so that people can easily try it (and complain :))", 
   "- Comments are welcome :)", 
   "- Download Nullsoft Installer (only needed to generate the installer) at", 
   "http://www.winamp.com/nsdn/superpimp", 
   "- Thanks to Henri for suggesting we should have a look at it."
  ], 
  "revision_id": "286257"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-13T22:37:20.000000Z", 
  "msg": [
   "- Need quotes if CATALINA_HOME contains spaces."
  ], 
  "revision_id": "286256"
 }, 
 {
  "author": "horwat", 
  "date": "2001-07-13T19:41:32.000000Z", 
  "msg": [
   "Revert to using print instead of println for new lines. Println adds unnecessary spaces."
  ], 
  "revision_id": "286255"
 }
]