[
 {
  "author": "horwat", 
  "date": "2001-07-12T23:29:33.000000Z", 
  "msg": [
   "Include and forward do not take params tag. Clear up error message and make sure that the reader doesn't simply match on \"jsp:param\".", 
   "Bugzilla #1818"
  ], 
  "revision_id": "286244"
 }, 
 {
  "author": "horwat", 
  "date": "2001-07-12T21:41:31.000000Z", 
  "msg": [
   "Enhanced compile time jsp error reporting.", 
   "A line map is created that maps the generated servlet lines to the original jsp file. The map is then used when a compile time error occurs to find the corresponding line in the original jsp file. That information is then added to the error report."
  ], 
  "revision_id": "286243"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-12T21:24:09.000000Z", 
  "msg": [
   "- Cleanup of the classpath generation.", 
   "- Implemented addRepository the way it was implemented in StandardLoader.", 
   "- Should fix integration issues with the J2EE RI."
  ], 
  "revision_id": "286242"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-12T21:22:25.000000Z", 
  "msg": [
   "- The addRepository call will now add the specified repository (if it's a valid URL)", 
   "to the superclass (URLClassLoader) so that repositories which are not", 
   "standard webapp class repositories can be added to the classloader.", 
   "- If the internal class loading fails, WebappClassLoader will now call", 
   "super.findClass.", 
   "- Implementation note : class and JAR reloading is not supported in non standard", 
   "class repositories.", 
   "- WebappClassLoader should now behave the same way StandardClassLoader", 
   "did.", 
   "- Should fix integration issues with the J2EE RI."
  ], 
  "revision_id": "286241"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-12T19:42:06.000000Z", 
  "msg": [
   "Log exception messages (with stack traces) when IOException or ClassNotFound-", 
   "Exception is encountered when unloading sessions to SESSIONS.ser, or reloading", 
   "them after a restart.", 
   "Currently, such errors are silently ignored.  This can cause problems like the", 
   "one reported in Bugzilla #2380, where the SESSIONS.ser file was created but", 
   "with zero length.  This could happen, for example, if a non-serializable", 
   "session attribute was being processed -- the NotSerializableException would", 
   "get silently swallowed and no remaining sessions would be saved."
  ], 
  "revision_id": "286240"
 }
]