[
 {
  "author": "remm", 
  "date": "2001-07-18T22:47:29.000000Z", 
  "msg": [
   "- Bundle the BootstrapService class in bootstrap.jar."
  ], 
  "revision_id": "286289"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-18T22:46:50.000000Z", 
  "msg": [
   "- Add a Bootstrap and a Catalina class which do a synchronous stop operation without", 
   "using a socket (which is a lot more secure, obviously).", 
   "- Still doesn't solve the shutdown problem unfortunately, since Catalina's", 
   "shutdown takes a very long time (without using any CPU time; I still don't know the reason for this), and", 
   "NT will kill the service after about 30s idle. With only one or two", 
   "contexts, the shutdown is faster, and will suceed.", 
   "The error message added to NT's event log is :", 
   "The Jakarta Tomcat service has timed out during a stop request and is being terminated."
  ], 
  "revision_id": "286288"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-18T20:17:18.000000Z", 
  "msg": [
   "Unit tests for creating a response wrapper and then using it with a", 
   "request dispatcher, testing both includes and forwards to servlets and JSP", 
   "pages."
  ], 
  "revision_id": "286287"
 }, 
 {
  "author": "remm", 
  "date": "2001-07-18T18:32:49.000000Z", 
  "msg": [
   "- Additional tweaks to make the shorcuts command line shorter (it's limited to", 
   "255 chars - originally, with the default install, it was 231 chars, so using any long path", 
   "for the JDK would have broken the shotcuts).", 
   "- Add an installation taget for a Windows system service (should work on", 
   "WinNT, Win2k, WinXP). It shouldn't hurt to run that under 9x / Me, but it", 
   "shouldn't do anything. The service is based on JavaService, and a binary", 
   "is now needed to build the \"installer\" target.", 
   "- Before uninstalling, stop the service !!! I'll add shell calls to stop it for you.", 
   "- Obviously, the installation should be done as root.", 
   "- More tweaks are needed for service shutdown. A specialized version", 
   "of the Bootstrap and Catalina class will be written (since with JNI we have", 
   "only one VM, no need for a socket, but the shutdown has to be syncronous).", 
   "That will improve the security too, since right now, any user can kill Tomcat", 
   "even when it's run as a service by issuing the shutdown command."
  ], 
  "revision_id": "286286"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-17T22:34:52.000000Z", 
  "msg": [
   "With the recent change in normalizing request URIs, this path now returns a", 
   "302 instead of a 404."
  ], 
  "revision_id": "286285"
 }
]