[
 {
  "author": "remm", 
  "date": "2001-08-08T20:02:17.000000Z", 
  "msg": [
   "- A HT (tab) is also considered a leading white space. It was a bit hidden in the", 
   "HTTP spec, so I had missed it."
  ], 
  "revision_id": "286394"
 }, 
 {
  "author": "pier", 
  "date": "2001-08-08T19:26:07.000000Z", 
  "msg": [
   "Fixed problem of HTTP/1.1 container returning the same version of the", 
   "HTTP protocol used in the request. As Justyn Erkerantz said, Section 3.1", 
   "of the HTTP specification (RFC-2616) mentions the fact that we should", 
   "return the higher version of the implemented protocol.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "286393"
 }, 
 {
  "author": "remm", 
  "date": "2001-08-08T00:31:54.000000Z", 
  "msg": [
   "- Cross contexts include and forwards were broken because the context", 
   "class loader wasn't appropriately set. Now, check if the current context class", 
   "loader is the same as the one in the Catalina Context's loader. If it's not, the", 
   "old context class loader value is saved, the Catalina Context class loader is", 
   "set as the context class loader, and after the wrapper has been allocated", 
   "and invoked, the old context class loader value is restored.", 
   "Bug reported by Serge Huber <shuber at xo3.com>."
  ], 
  "revision_id": "286392"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-07T20:53:06.000000Z", 
  "msg": [
   "The current implementation of logging in Jasper (using JasperLogger)", 
   "causes a background thread to be created per <jsp-file> declaration,", 
   "instead of once per web app, due to the changes needed to deal with", 
   "sealing violation problems.  Change this to use DefaultLogger instead,", 
   "which uses the request processing thread.  Messages continue to be logged", 
   "to the servlet context log, so there will be no visible behavior", 
   "difference (other than elimination of useless daemon threads).", 
   "PR: BugTraq #4488877", 
   "Submitted By:  Tony Ng <tony.ng@sun.com>"
  ], 
  "revision_id": "286391"
 }, 
 {
  "author": "jfclere", 
  "date": "2001-08-06T21:54:33.000000Z", 
  "msg": [
   "Add support from cygwin."
  ], 
  "revision_id": "286390"
 }
]