[
 {
  "author": "craigmcc", 
  "date": "2001-07-29T22:24:12.000000Z", 
  "msg": [
   "Add the forgotten sample source file to the new version of the App Dev", 
   "Guide."
  ], 
  "revision_id": "286369"
 }, 
 {
  "author": "", 
  "date": "2001-07-29T04:34:17.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'J2EE_13_23'."
  ], 
  "revision_id": "286368"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-29T04:34:17.000000Z", 
  "msg": [
   "Correct handling of web application startup so that parsing errors in the", 
   "web.xml file cause the application to be marked unavailable.  Previously,", 
   "the application was started anyway, which could cause security issues (for", 
   "example, confidential information might be visible because of an incorrect", 
   "security constraint definition that was therefore not installed at all).", 
   "PR: Bugzilla #2870", 
   "Submitted by:\tRemy Maucherat <remm@apache.org>"
  ], 
  "revision_id": "286367"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-29T03:43:54.000000Z", 
  "msg": [
   "Enhance support for \"single sign on\" to also support \"single sign off\" in", 
   "conformance to the additional spec requirements listed in Servlet Spec 2.3", 
   "PFD3, Section 12.5.3.1, page 90.  In particular, under the following", 
   "circumstances:", 
   "- Administrator has configured SingleSignOnValve on a virtual host", 
   "- Web applications on this virtual host are configured for form-based", 
   "login", 
   "- User has logged in to one of the apps (which also grants them access", 
   "to the protected areas of the other apps, because of the single sign", 
   "on support)", 
   "- A session in one of the logged-on-to apps is invalidated or times out", 
   "then, all sessions in all apps to which the user has been logged on will", 
   "be invalidated.  The next request from this user for a protected resource", 
   "in any of the apps will cause the user to be reauthenticated.", 
   "Rationale:  Consider a Yahoo-like portal server, with multiple", 
   "applications (such as mail and chat) implemented as separate web apps", 
   "under management of the single sign on facility.  If the user accesses", 
   "both mail and chat, and then logs out of mail, he or she will expect the", 
   "login to the chat application to be terminated as well.  Otherwise, the", 
   "next person to use this browser (say, at an Internet cafe) would have", 
   "access to the previous user's session in the chat application -- and, by", 
   "virtue of single sign on, access to all their other applications as well."
  ], 
  "revision_id": "286366"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-07-28T23:29:12.000000Z", 
  "msg": [
   "Add an option so that the user can request a logoff (which, with form", 
   "based login configured, should cause a new session to be created and the", 
   "user returned to the login page)."
  ], 
  "revision_id": "286365"
 }
]