[
 {
  "author": "craigmcc", 
  "date": "2001-08-25T01:14:13.000000Z", 
  "msg": [
   "Add docs for <Engine> element, and tweak the existing ones slightly."
  ], 
  "revision_id": "286444"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-25T00:01:56.000000Z", 
  "msg": [
   "Change the way that Jasper looks for the \"?jsp_precompile\" precompilation", 
   "request parameter.  Previously, it was using request.getParameter(), which", 
   "caused all of the request parameters to be parsed before the JSP page", 
   "would have the opportunity to call request.setCharacterEncoding()."
  ], 
  "revision_id": "286443"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-24T23:19:06.000000Z", 
  "msg": [
   "In the continuing saga of getting race conditions on invoked servlets", 
   "fixed, add a check for a pre-existing Wrapper for the servlet by *name* as", 
   "well as by *class*.  Much thanks to Eddie Ruvinsky for digging in to the", 
   "code and helping figure out what's going on here.", 
   "PR: Bugzilla #3188", 
   "Submitted by:\tEddie Ruvinsky <ruvinsky@yahoo.com>"
  ], 
  "revision_id": "286442"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-24T23:06:08.000000Z", 
  "msg": [
   "Add a replacement for the java.net.URL class that does the parsing and", 
   "relative-URL resolution performed by java.net.URL, but does not suffer", 
   "from the limitation that it only supports protocols for which a", 
   "URLStreamHandler is installed.  In particular, this was preventing a", 
   "Tomcat 4 install from successfully performing a response.sendRedirect() to", 
   "an SSL-enabled URL, unless the redirecting Tomcat itself had JSSE", 
   "installed.", 
   "Also added extensives JUnit tests to ensure that parsing and relative", 
   "resolution works as much as possible like java.net.URL does it.  There are", 
   "three cases where the answers are different, that are commented out.", 
   "These are really edge cases that won't matter in real life, but they", 
   "should eventually be corrected.", 
   "NOTE:  The parsing and path normalization code is horrendously inefficient", 
   "at the moment.  I focused first on getting the behavior right, and", 
   "creating a bunch of unit tests so that we can make sure we don't introduce", 
   "regressions as the string processing is optimized.", 
   "PR: Bugzilla #3139", 
   "Submitted by:\tShawn Bayern <bayern@essentially.net>"
  ], 
  "revision_id": "286441"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-24T19:08:15.000000Z", 
  "msg": [
   "Make it possible to start Catalina under a JPDA debugging environment.  If", 
   "you execute", 
   "$CATALINA_HOME/bin/catalina.sh jpda start", 
   "the options in the JPDA_OPTS environment variable are added to those", 
   "specified by CATALINA_OPTS to enable debugging.  A convenient default", 
   "value for JPDA_OPTS is made available if you do not specify it.", 
   "Submitted by:  Henning P. Schmiedehausen <mailgate@hometree.net>,", 
   "Jon Stevens <jon@latchkey.com>"
  ], 
  "revision_id": "286440"
 }
]