[
 {
  "author": "craigmcc", 
  "date": "2001-09-09T00:48:11.000000Z", 
  "msg": [
   "Add the half-completed \"jndi-resources-howto.xml\" that talks about how to", 
   "configure <Resource> and <ResourceParams> elements in server.xml.  Make", 
   "the handling of the \"override\" property on <Environment> and <Parameter>", 
   "elements match the documentation (now that it exists :-).", 
   "TODO:  Document the standard resource factories supported by Tomcat 4, and", 
   "the process for adding your own custom resource factories."
  ], 
  "revision_id": "286504"
 }, 
 {
  "author": "remm", 
  "date": "2001-09-08T16:42:00.000000Z", 
  "msg": [
   "- Raise the max number of allowed rules in the XML mapper."
  ], 
  "revision_id": "286503"
 }, 
 {
  "author": "remm", 
  "date": "2001-09-08T16:40:48.000000Z", 
  "msg": [
   "- Add rules to be able to add lifecycle listeners on the top level components", 
   "of the pipeline through server.xml."
  ], 
  "revision_id": "286502"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-09-07T22:51:26.000000Z", 
  "msg": [
   "Because JSP source and class files are now stored in a directory tree that", 
   "mirrors the context-relative path, there is no need to include the", 
   "directory path in the generated filenames as well.", 
   "This is based on the patch submitted by Kin-Man Chung", 
   "<kin-man.chung@sun.com> but modified to fix an additional bug -- the", 
   "previous algorithm would only work when JSP pages were mapped to \"*.jsp\",", 
   "but would fail when a different servlet mapping was mapped to the JSP", 
   "servlet.  In addition, name mangling is still necessary to convert", 
   "characters that are not legal Java identifiers.", 
   "PR: Bugzilla #2917", 
   "Submitted by:\taklimuk@iba.by"
  ], 
  "revision_id": "286501"
 }, 
 {
  "author": "ccain", 
  "date": "2001-09-07T20:45:12.000000Z", 
  "msg": [
   "Backs out the previous case-insensitive mod, which would have checked", 
   "non-hashed realm passwords case-insensitive as well. This correctly", 
   "returns non-hashed realm passwords to case-sensitive comparison, while", 
   "leaving hex comparisons insensitive.", 
   "Now I'm going to go write 'I will always follow code paths through to", 
   "their conclusion before committing' 100 times on the blackboard, then", 
   "it's straight to bed with no desert. =)"
  ], 
  "revision_id": "286500"
 }
]