[
 {
  "author": "remm", 
  "date": "2001-09-19T20:49:23.000000Z", 
  "msg": [
   "- Add the new \"full.dist\" property in the sample."
  ], 
  "revision_id": "286619"
 }, 
 {
  "author": "remm", 
  "date": "2001-09-19T20:30:54.000000Z", 
  "msg": [
   "- Don't copy ldap.jar.", 
   "- Copy tyrex.license if we're copying the Tyrex JAR. We could also put that file", 
   "in catalina/etc, but that's a minor issue.", 
   "- Start using some conditional compilation flags.", 
   "- It may be useful to display the flags before starting building (so that if it fails,", 
   "it's very easy to figure out why). Should I display them by default ?"
  ], 
  "revision_id": "286618"
 }, 
 {
  "author": "remm", 
  "date": "2001-09-19T20:27:45.000000Z", 
  "msg": [
   "- Add a Tyrex license copy."
  ], 
  "revision_id": "286617"
 }, 
 {
  "author": "remm", 
  "date": "2001-09-19T18:00:58.000000Z", 
  "msg": [
   "- Experiment with a more flerxible build system.", 
   "- With JDK 1.3, the plan is to be able to require only servlet.jar and regexp,", 
   "while building as many optional components as possible. The generated build will", 
   "obviously only run on JDK 1.3+ platforms.", 
   "- Add the new \"full-dist\" property. Set it to \"on\" to force a full", 
   "non-conditional build (equivalent to the current build).", 
   "- The conditional compile are not used yet, as I have to figure out the list of classes", 
   "affected."
  ], 
  "revision_id": "286616"
 }, 
 {
  "author": "jon", 
  "date": "2001-09-19T16:32:43.000000Z", 
  "msg": [
   "port sam's tyrex dependency patch back to the branch", 
   "fix things so that you don't have to hand edit this file in order to build", 
   "tomcat. the problem is that the JSSE stuff was commented out and things", 
   "wouldn't compile because of that. if you wanted to compile, you had to", 
   "hand edit this file and uncomment things. the real issue is that the JSSE", 
   "stuff is only a problem when you want to make a distribution...so don't", 
   "allow people to do that."
  ], 
  "revision_id": "286615"
 }
]