[
 {
  "author": "craigmcc", 
  "date": "2001-10-25T16:52:30.000000Z", 
  "msg": [
   "Add support for conditionally copying the jmxri.jar file (if it is", 
   "available).  All the admin/config stuff that depends on this will is", 
   "optional."
  ], 
  "revision_id": "286909"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-10-25T16:37:38.000000Z", 
  "msg": [
   "Java classes and application resources for the infrastructure of the", 
   "Config/Admin application."
  ], 
  "revision_id": "286908"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-10-25T16:36:06.000000Z", 
  "msg": [
   "Initial check-in of the infrastructure for the Admin/Config web", 
   "application.  There is no UI functionality yet -- a prototype will be", 
   "available soon for feedback before that development effort begins.", 
   "(In the absence of any further discussion on TOMCAT-DEV about the idea of", 
   "using a separate repository, I went ahead and checked it in to", 
   "jakarta-tomcat-4.0 HEAD branch for development convenience -- it can be", 
   "moved later if approproate.)"
  ], 
  "revision_id": "286907"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-10-25T00:38:49.000000Z", 
  "msg": [
   "Documentation updates for the new automatic-deployment features."
  ], 
  "revision_id": "286906"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-10-25T00:23:03.000000Z", 
  "msg": [
   "Refactor the support for on-the-fly deployment to support separating the", 
   "<Context> element (and all of its sub-elements) into separate XML files in", 
   "the \"appBase\" directory.  Now, three kinds of things get automatically", 
   "deployed form this directory (defaults to \"webapps\"):", 
   "* Directories that contain a web application (i.e. have a", 
   "/WEB-INF/web.xml file)", 
   "* WAR files (*.war), which are optionally unpacked if the unpackWARs", 
   "attribute is set to \"true\".", 
   "* XML files (*.xml) are assumed to contain a single <Context> element", 
   "(with all of the attributes and subelements that are legal nested", 
   "inside a <Context> in the \"conf/server.xml\" file).  Typically, the", 
   "docBase attribute of these entries will contain absolute pathnames", 
   "to directories or WAR files elsewhere in the disk hierarchy.", 
   "NOTE:  Autoamtic deployment has a feature I didn't even know about :-).", 
   "You can drop new directories, WAR files, or XML files into the auto-deploy", 
   "directory, and they will get picked up and deployed within a few seconds.", 
   "TODO:  Update the server configuration documentation (coming soon)."
  ], 
  "revision_id": "286905"
 }
]