[
 {
  "author": "remm", 
  "date": "2002-01-18T00:46:24.000000Z", 
  "msg": [
   "- Update the build instructions to mention OpenJMX.", 
   "- Note: OpenJMX 1.0b1, despite what its release date may lead you to believe,", 
   "won't work. However, I submitted a few patches and nagged the dev list,", 
   "so the next release (1.0b2) will work :) 1.0b2 is not released yet, so in the very", 
   "immediate future OpenJMX should be built from CVS, which is very easy to do", 
   "(checkout the repository, go in the build folder, type build)."
  ], 
  "revision_id": "287339"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-01-17T20:16:53.000000Z", 
  "msg": [
   "Update the commented-out entry that enables MBean creation to reflect the", 
   "removal of the HttpAdaptor startup logic (which was proprietary to the", 
   "JMX RI implementation)."
  ], 
  "revision_id": "287338"
 }, 
 {
  "author": "remm", 
  "date": "2002-01-17T20:02:16.000000Z", 
  "msg": [
   "- The JMX support can now be built and distributed with an alternate JMX", 
   "implmentation: OpenJMX. OpenJMX is a Sourceforge project which uses", 
   "the Apache license, so this should remove the redistribution problems", 
   "with the JMX RI. Overall, I think OpenJMX is an ideal candidate for distribution", 
   "with upcoming Tomcat releases.", 
   "- The build.properties mentions OpenJMX 1.0 b2, which is not released yet.", 
   "1.0 b1 will not work, as a few fixes were needed to work with Tomcat.", 
   "- I don't see any reason why not to enable the JMX support by default once", 
   "OpenJMX reaches 1.0 status.", 
   "- Removes use of proprietary APIs from the JMX RI.", 
   "- Rename the main JMX variable: jmxri.jar -> jmx.jar (the first one implied that the", 
   "JMX RI is required)."
  ], 
  "revision_id": "287337"
 }, 
 {
  "author": "remm", 
  "date": "2002-01-17T20:01:40.000000Z", 
  "msg": [
   "- Add license text for OpenJMX."
  ], 
  "revision_id": "287336"
 }, 
 {
  "author": "remm", 
  "date": "2002-01-17T19:49:22.000000Z", 
  "msg": [
   "- Fix path separator (causes trouble with Cygwin)."
  ], 
  "revision_id": "287335"
 }
]