[
 {
  "author": "glenn", 
  "date": "2002-03-01T16:44:32.000000Z", 
  "msg": [
   "Remove code to get workDir which wasn't used"
  ], 
  "revision_id": "287709"
 }, 
 {
  "author": "", 
  "date": "2002-03-01T05:46:52.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'jwsdp_10_ea2_06'."
  ], 
  "revision_id": "287708"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-01T05:46:52.000000Z", 
  "msg": [
   "Tweak the auto-deployment documentation to reflect the current", 
   "functionality."
  ], 
  "revision_id": "287707"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-01T03:04:44.000000Z", 
  "msg": [
   "Restore the unpackWARs behavior (but only for WAR files in the appBase", 
   "subdirectory) that was broken by previous changes to deployment and the", 
   "Manager webapp's servlet.  The WAR-expansion logic was refactored from", 
   "StandardHostDeployer to HostConfig, which is the only place that requires it.", 
   "Applications that are added via the Manager webapp's \"/install\" or \"/deploy\"", 
   "commands are *not* auto-expanded -- if you want your webapp to run from an", 
   "unpacked directory, you should install an unpacked directory.", 
   "NOTE:  You can also get auto-unpack service by simply dropping a WAR file", 
   "into the appBase directory while Tomcat is running - a background thread", 
   "will notice this and unpack it in the same way that startup works.", 
   "NOTE:  As before, any auto-unpacked directory is *never* deleted, because", 
   "the user has probably changed things and would be very annoyed if it was", 
   "removed.", 
   "I'm going to make a pass through the JavaDocs and the documentation files", 
   "to make sure that they are all up to date with respect to the actual", 
   "functionality."
  ], 
  "revision_id": "287706"
 }, 
 {
  "author": "remm", 
  "date": "2002-03-01T01:48:14.000000Z", 
  "msg": [
   "- Various changes to the buld  instructions.", 
   "- Submitted in part by Luc Vanlerberghe <lvl at bvdep.com>"
  ], 
  "revision_id": "287705"
 }
]