[
 {
  "author": "amyroh", 
  "date": "2002-03-08T06:58:17.000000Z", 
  "msg": [
   "Update removeXxxx and addXxxx to MBeanFactory.  Clean up the rest of the StandardMBeans."
  ], 
  "revision_id": "287734"
 }, 
 {
  "author": "remm", 
  "date": "2002-03-08T05:35:46.000000Z", 
  "msg": [
   "- Add the Coyote HTTP/1.1 connector in the default configuration, on port 8081.", 
   "- Request parameter handling is not ported yet (this breaks the welcome page redirects).", 
   "- Session support is not ported yet (this breaks JSPs which need a session).", 
   "- Some minor tweaks are still to be done in the OutputBuffer (to minimize the usage", 
   "of chunking a bit).", 
   "- The chunking behavior is now sane in all cases; this should fix the problems", 
   "with Cocoon 2, and help JSP a bit, also.", 
   "- Profiling has revealed NO hotspots (don't forget to disable the access log valve", 
   "before testing), and the vast majority of the CPU time is spent in java.net.*", 
   "(for simple servlets, obviously)."
  ], 
  "revision_id": "287733"
 }, 
 {
  "author": "amyroh", 
  "date": "2002-03-08T00:42:14.000000Z", 
  "msg": [
   "Update createXxxx using new logic.  Clean up StandardSererMBean and StandardServiceMBean since now removeXxx operations are moved to MBeanFactory."
  ], 
  "revision_id": "287732"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-08T00:12:30.000000Z", 
  "msg": [
   "Minor cleanups and fixes:", 
   "- When generating MBean Names for Valves, put the sequence property on", 
   "the end, so that sorting the bean names alphabetically is useful.", 
   "- Refactor common list creation activities into a new utility class.", 
   "- Respect changes to the default host property on the Services screen.", 
   "- Change back to \"(None)\" no the default host select box to indicate", 
   "that no default host is desired."
  ], 
  "revision_id": "287731"
 }, 
 {
  "author": "", 
  "date": "2002-03-07T02:48:54.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'jwsdp_10_ea2_08'."
  ], 
  "revision_id": "287730"
 }
]