[
 {
  "author": "craigmcc", 
  "date": "2002-03-05T02:01:02.000000Z", 
  "msg": [
   "Forgot one updated file for the \"liveDeploy\" update."
  ], 
  "revision_id": "287724"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-05T01:55:03.000000Z", 
  "msg": [
   "Separate the concepts of \"autoDeploy\" of applications in the appBase", 
   "subdirectory from the concept of \"liveDeploy\" (checking for new apps in a", 
   "background thread while Tomcat is running).  These can now be configured", 
   "separately in the <Host> element.", 
   "Default for both properties is \"true\" to mirror the previous behavior.", 
   "Submitted by:\tGlenn Nielsen <glenn@voyager.apg.more.net>"
  ], 
  "revision_id": "287723"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-05T01:53:11.000000Z", 
  "msg": [
   "Fix a race condition that could cause problems if two contexts are being", 
   "started simultaneously.  The start() method was already synchronized, but", 
   "this only helps you deal with two attempts to start the *same* app at the", 
   "same time.  The underlying Digester instance would still be incorrectly", 
   "shared.", 
   "The symptom was parsing failures on one or both web.xml files -- this would", 
   "happen rarely during a normal startup when you have lots of virtual", 
   "hosts, but more often when you hammer on the manager webapp deploying and", 
   "undeploying applications."
  ], 
  "revision_id": "287722"
 }, 
 {
  "author": "glenn", 
  "date": "2002-03-04T15:12:48.000000Z", 
  "msg": [
   "Fix example grants fro webapp jar's"
  ], 
  "revision_id": "287721"
 }, 
 {
  "author": "glenn", 
  "date": "2002-03-02T18:00:13.000000Z", 
  "msg": [
   "Port the SRV.3.7.1 compliance bug fix into the release branch.", 
   "This fixes a spec compliance bug, SRV.3.7.1 states that the", 
   "tempdir for a Servlet Context must be unique.", 
   "Added the Engine name as a directory path component when creating", 
   "the default work directory for a web application.  This fixes a bug", 
   "where the same work directory would be used for the http and https version", 
   "of a virtual host.", 
   "Added the workDir attribute to the Host configuration.  This makes it", 
   "easier to set the base directory where the work directories for", 
   "applications are placed when virtual hosting sites with Tomcat."
  ], 
  "revision_id": "287720"
 }
]