[
 {
  "author": "remm", 
  "date": "2002-03-16T05:28:15.000000Z", 
  "msg": [
   "- Using the URL encoded requestURI can lead to double URL encoding.", 
   "Note: Some of the redirects could be avoided. This will be done in a later", 
   "refactoring."
  ], 
  "revision_id": "287779"
 }, 
 {
  "author": "remm", 
  "date": "2002-03-15T20:18:40.000000Z", 
  "msg": [
   "- Cosmetic change, to avoid displaying some warnings during stop."
  ], 
  "revision_id": "287778"
 }, 
 {
  "author": "remm", 
  "date": "2002-03-15T19:12:49.000000Z", 
  "msg": [
   "- Add support for expectations.", 
   "- Note: This means adding a new method in the HttpResponse interface.", 
   "Unfortunately, I forgot to include it in my last proposal; hopefully, it is ok to make", 
   "the method addition.", 
   "- At the beginning of the processing of the filter pipeline, the connector will have", 
   "the opportunity to ack the request with the client.", 
   "- This is extremely useful in the case of doing a HTTP PUT in a protected area.", 
   "The client will send the PUT header, wait for the sever ack. If it gets the 100,", 
   "it will proceed with sending the body; it it gets some other status (like 401),", 
   "it will be able to handle it gracefully, without breaking the connection.", 
   "The commons HTTP client supports this (at least, it did last time I checked)."
  ], 
  "revision_id": "287777"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-15T18:37:42.000000Z", 
  "msg": [
   "Major enhancements to the JNDIRealm implementation.  While remaining", 
   "backwards compatible with the previous implementation, the following new", 
   "functionality is supported:", 
   "* The realm can authenticate a user by binding to the directory", 
   "server using the username and password specified by the user,", 
   "instead of retrieving the password attribute and performing the", 
   "comparison locally.  (Remove the \"userPassword\" property to", 
   "activate this mode, which also eliminates the need for \"connectionName\"", 
   "and \"connectionPassword\").", 
   "* The realm can search the directory for the user's entry, instead", 
   "of picking a particular one.  (Use \"userSearch\", \"userBase\", and", 
   "\"userSubtree\" for this instead of \"userPattern\".)", 
   "* The realm can combine roles held as the values of an attribute", 
   "in the user's entry with those retrieved by the search for roles.", 
   "(Use \"userRoleName\" to specify this attribute.)", 
   "John, thanks for your patience with me on getting this patch committed!", 
   "Could you also make sure that I got the facts right on my edits to the", 
   "configuration docs?  (A patch to tomcat-docs/realm-howto.xml to explain", 
   "the new options would also be cool.)", 
   "Submitted by:\tJohn Holman <j.g.holman at qmul.ac.uk>"
  ], 
  "revision_id": "287776"
 }, 
 {
  "author": "patrickl", 
  "date": "2002-03-15T18:26:32.000000Z", 
  "msg": [
   "Add back source file that was incorrectly removed. Without this file, build will fail."
  ], 
  "revision_id": "287775"
 }
]