[
 {
  "author": "vgritsenko", 
  "date": "2004-07-20T19:43:39.000000Z", 
  "msg": [
   "correct link"
  ], 
  "revision_id": "28864"
 }, 
 {
  "author": "vgritsenko", 
  "date": "2004-07-20T12:49:00.000000Z", 
  "msg": [
   "correct link to wiki"
  ], 
  "revision_id": "28863"
 }, 
 {
  "author": "unico", 
  "date": "2004-07-17T17:57:25.000000Z", 
  "msg": [
   "fix the slide samples again after stephan's refactorings of a few months ago apparently", 
   "broke half of them.  I find it unexceptable that I would have to loose half a day to fix the", 
   "fumbling failures of people that apparently don't take the time to test their dubious refactorings.", 
   "goddammit."
  ], 
  "revision_id": "28862"
 }, 
 {
  "author": "joerg", 
  "date": "2004-07-17T10:51:15.000000Z", 
  "msg": [
   "clean up after the tree processor refactoring"
  ], 
  "revision_id": "28861"
 }, 
 {
  "author": "huber", 
  "date": "2004-07-17T00:03:27.000000Z", 
  "msg": [
   "fix handling of normalizedFilename handling of \"..\", replace decrement of i by decrement of lio", 
   "this fix avoids looping in case of normalizing a filename containing \"..\", the bug was introduced in rev 1.5,", 
   "the testcase IOUtilsTestCase shall run now", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "28860"
 }
]