[
 {
  "author": "brett", 
  "date": "2005-09-15T15:29:02.234305Z", 
  "msg": [
   "PR: MNG-753", 
   "use an ordered set so that insertion order is preserved"
  ], 
  "revision_id": "289259"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-09-15T15:23:54.746785Z", 
  "msg": [
   "Add a set of XML utilities to NetUI.  These do three major things:", 
   "- provide convenience methods for dealing with DOM", 
   "- provide a way to validate XML instance documents against an XSD with the possibility of making this JVM independent", 
   "- provide an abstraction for resolving an InputStream from a resource path", 
   "All of this works using the XML parsing / validating infrastructure that is available in the Java 5 JDK.  It should be possible to switch this for other XML parsing libraries by adding JARs to the NetUI webapp and registering the correct XML handling services.", 
   "The XSD / XML validation code uses validation from the Java 5 JDK; in certain cases (like Tomcat 5.0.x), the VM environment is not configured correctly for the Java 5 JDK's XML configuration.  In this case, the root of the problem is that a SAX TransformerFactory has been registered that exists in JDK 1.4 but not in JDK 5 (they've been repackaged, as you'll recall...).  This happens because something in Tomcat steals the TransformerFactory service and registers a class that doesn't exist.  The SchemaValidatorJava5 handles this by catching TransformerFactoryConfigurationError and logging a verbose warning when an XML instance document can not be validated.  Obviously, this isn't ideal, but validation can be enabled on Tomcat 5.0 easily.", 
   "BB: self", 
   "Test: NetUI BVT pass"
  ], 
  "revision_id": "289258"
 }, 
 {
  "author": "mmarinschek", 
  "date": "2005-09-15T15:16:21.058983Z", 
  "msg": [
   "tried to get rid of <!-- in the source base - should get us a major step closer to xhtml compliance"
  ], 
  "revision_id": "289257"
 }, 
 {
  "author": "mmarinschek", 
  "date": "2005-09-15T15:15:12.803431Z", 
  "msg": [
   "tried to get rid of <!-- in the source base - should get us a major step closer to xhtml compliance"
  ], 
  "revision_id": "289256"
 }, 
 {
  "author": "mmarinschek", 
  "date": "2005-09-15T15:11:35.467233Z", 
  "msg": [
   "tried to get rid of <!-- in the source base - should get us a major step closer to xhtml compliance"
  ], 
  "revision_id": "289255"
 }
]