[
 {
  "author": "sebor", 
  "date": "2005-09-18T23:28:26.612414Z", 
  "msg": [
   "2005-09-18  Martin Sebor  <sebor@roguewave.com>", 
   "* driver.cpp: Removed _rw_opt_no_stdout, _rw_opt_verbose, and", 
   "_rw_opt_compat and replaced each with calls to the respective command", 
   "line option handler with the special arguments 1, and 0.", 
   "(_rw_setopt_verbose): Renamed to _rw_opt_verbose and allowed the handler", 
   "to be called in \"query mode\" to retrieve the state of the option.", 
   "(_rw_setopt_compat): Renamed to _rw_opt_compat and implemented query", 
   "mode.", 
   "(_rw_setopt_stdout): Renamed to _rw_opt_no_stdout and implemented", 
   "query mode.", 
   "(_rw_use_color): New function. Returns 1 when colorized output can", 
   "and should be used.", 
   "(_rw_opt_quiet): New handler for the -q|--quiet command line options.", 
   "(_rw_vissue_diag): New function called to unconditionally issue", 
   "a diagnostic.", 
   "(_rw_vdiag): Factored out code into _rw_vissue_diag for readability", 
   "and called the function to issue a diagnostic.", 
   "(rw_vtest): Used color in the summary table."
  ], 
  "revision_id": "290009"
 }, 
 {
  "author": "dblevins", 
  "date": "2005-09-18T23:23:52.701086Z", 
  "msg": [
   "Created the \"branch\" for work on geronimo-1.0-M5"
  ], 
  "revision_id": "290008"
 }, 
 {
  "author": "sebor", 
  "date": "2005-09-18T23:23:17.430458Z", 
  "msg": [
   "2005-09-18  Martin Sebor  <sebor@roguewave.com>", 
   "* opt_diags.h: Set the svn keywords Id property.", 
   "Increased the size of the buffer for escape sequences.", 
   "* opt_diags.cpp: Set the svn keywords Id property.", 
   "Initialized previously uninitialized data members.", 
   "(_rw_setopt_diags): Checked for negative (unused) indices and avoided", 
   "using them to dereference array elements."
  ], 
  "revision_id": "290007"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-09-18T23:17:49.260517Z", 
  "msg": [
   "Start the work of removing XMLBeans / JSR 173 from the Beehive distribution.", 
   "This affects the distribution by:", 
   "- removing <dist-root>/lib/common/apache-xbean.jar", 
   "- removing <dist-root>/lib/common/jsr173_1.0_api.jar", 
   "- removing all of the WSM samples", 
   "- removing \"xbean.dependency.path\" from <dist-root>/beehive-imports.xml", 
   "This change passes the distribution tests and required the following work to do so:", 
   "- significant cleanup and simplification of the NetUI Ant that drives dist testing", 
   "- significant cleanup and simplification of the Controls Ant that drives dist testing", 
   "- remove the /jws/ tests from controls/test; seems that the controls core tests shouldn't have dependencies on downstream components.  This actually requires that WSM be built previously in order for these tests to run.  Removing these required deleting a bunch of source files in controlsWeb and the drivers for the JWS tests", 
   "- add XMLBeans and the jsr173 API JAR to the beehive-test-dist/external directory.  While the runtime might not depend on XMLBeans, the test infrastructure still does.  These were also added to beehive-test-dist/controls/external because of trouble resolving these from the top-level external/ directory.  This needs to get cleaned up later.", 
   "- add an Ant <copy> to make XMLBeans available to both the controlsWeb and NetUI test webapps", 
   "- add Axis to the controls/external directory; the controls test infrastructure has a dependency on Axis (no tests depend on this)", 
   "So, there is a *lot* of stuff to cleanup above; the dependencies between things are pretty unclear and need to be untangled.  Need to go back in and remove commented out Ant blocks; just need to get this checkpoint in the tree.", 
   "But, cd ant && ant -f nightly.xml run passes, and we should be able to branch and to post a release candidate.", 
   "BB: self", 
   "Test: DRT / dist test pass"
  ], 
  "revision_id": "290006"
 }, 
 {
  "author": "scolebourne", 
  "date": "2005-09-18T23:15:41.839864Z", 
  "msg": [
   "Add bugzilla ids for v1.1"
  ], 
  "revision_id": "290005"
 }
]