[
 {
  "author": "ekoneil", 
  "date": "2005-09-24T15:28:50.827631Z", 
  "msg": [
   "Add fix for BEEHIVE-953.  This ensures that the ejb-ref and ejb-local-ref elements added to web.xml and ejb-jar.xml DD files are in the correct order relative the elements that should follow them.", 
   "This is a patch from Chad Schoettger.  Changes from the patch include:", 
   "- handling the web.xml case -- web.xml files have two additional elements that can follow the j2ee:jndiEnvironmentRefsGroup that are \"message-destination\" and \"locale-encoding-mapping-list\"", 
   "- tests to ensure that the web.xml and ejb-jar.xml cases put the ejb-ref and ejb-local-ref elements in the right place in eight cases.  Unfortunately, the result of these tests needs to be manually vefiried, but it's better than nothing.  And, they confirm that this changes should work for various DD editing cases.", 
   "- refactored the EJBControlAssembler so that the descriptor editing code can be tested without having to mock the ControlAssemblyContext.  Two classes are added -- EJBJarDescriptorHandler and WebDescriptorHandler which accept a document, EJBInfo, and ejb link name and then edit the document.  The EJBControlAssembler still writes this file back to disk.  The DomUtils also moved down into the system/ejb/internal package.", 
   "BB: self", 
   "Test: Beehive DRT pass / EJB control tests manually verified"
  ], 
  "revision_id": "291314"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-09-24T15:27:55.089513Z", 
  "msg": [
   "Added a test for decoding"
  ], 
  "revision_id": "291313"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-09-24T15:27:28.300989Z", 
  "msg": [
   "fixed the decoding to be able to handle negative values"
  ], 
  "revision_id": "291312"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-09-24T15:26:48.806778Z", 
  "msg": [
   "Fixed the test according to the modification made in the IntegerDecoder"
  ], 
  "revision_id": "291311"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-09-24T15:23:57.428076Z", 
  "msg": [
   "- Added two constructors for Value", 
   "- simplified the toString method"
  ], 
  "revision_id": "291310"
 }
]