[
 {
  "author": "andya", 
  "date": "2001-06-24T15:37:43.000000Z", 
  "msg": [
   "Defer jk initialisation until server name is known (which means when the filter or extension proc has been called). Builds, loads but not extensively tested."
  ], 
  "revision_id": "295489"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-23T19:04:34.000000Z", 
  "msg": [
   "Few fixes on Ajp14.", 
   "First, added many comments and make sure Ajp14Interceptor is fine. I", 
   "plan few more changes to make it clearer, but it should be fine for now", 
   "( it's probably better than existing code in 3.3 )", 
   "Added few debug statements ( including display of the command name ).", 
   "Started to add code from Ajp13, to avoid getting lost in inheritance.", 
   "Ajp14 will replace Ajp13 completely, there are many improvements that need", 
   "to be done to make ajp14 much faster and better.", 
   "Right now I get a failure on reading the credentials, I'll fix it later", 
   "this afternoon ( have to go now )."
  ], 
  "revision_id": "295488"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-23T16:04:12.000000Z", 
  "msg": [
   "Small fix - if validation fails ( like I forgot to add the secret ), then", 
   "destroy will try to free() a constant ( since strdup didn't happened ).", 
   "We set it to null, the init will fail if the user doesn't specify a valid", 
   "option.", 
   "( the stack trace was:", 
   "#0  0x40095ce8 in pthread_mutex_lock () from /lib/libpthread.so.0", 
   "#1  0x401230a8 in free () from /lib/libc.so.6", 
   "#2  0x401d2364 in destroy (pThis=0xbffff414, l=0x8165df8)", 
   "at ../common/jk_ajp14_worker.c:156", 
   "#3  0x401d56f8 in wc_create_worker (name=0x8168038 \"ajp14\", init_data=0x81674f8,", 
   "rc=0xbffff468, we=0x401e275c, l=0x8165df8) at ../common/jk_worker.c:170", 
   "#4 ....", 
   "...."
  ], 
  "revision_id": "295487"
 }, 
 {
  "author": "andya", 
  "date": "2001-06-23T15:56:55.000000Z", 
  "msg": [
   "Fixed isapi.dsp and added isapi.mak. Fixed some syntax errors in jk_isapi.plugin.c"
  ], 
  "revision_id": "295486"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-23T05:52:12.000000Z", 
  "msg": [
   "Added a new target to build ajp14 for tomcat33.", 
   "Added few more defaults for properties ( based on the current dir layout,", 
   "assuming the same dir is used to check out the repositories ). The", 
   "properties file can override that, but it's good to have defaults.", 
   "Added a small mkdir in the config script, cvs update -dP will remove", 
   "the build/unix dir.", 
   "Also made \"optimize\" and \"debug\" settable properties, consistent with", 
   "jakarta-tomcat and other projects.", 
   "Congrats for the ./configure scripts, it's amazing. Tommorow I'll play a bit", 
   "with ajp14, so far it compiles without problems."
  ], 
  "revision_id": "295485"
 }
]