[
 {
  "author": "costin", 
  "date": "2001-11-10T16:48:38.000000Z", 
  "msg": [
   "The GCJ compiler is now operational ( it's the GCC frontent for java ). I used", 
   "GCC3.0.1, there are still some bugs with embeded classes and .write method", 
   "( which is declared to throw exception, as in the javadocs, but doesn't in the", 
   "'official' sdk ), but after minor changes in the code I was able to compile", 
   "almost everything rhud has.", 
   "( thanks to Caltrain and my longer commute I have time to play with cool toys :-)"
  ], 
  "revision_id": "295949"
 }, 
 {
  "author": "costin", 
  "date": "2001-11-10T16:35:01.000000Z", 
  "msg": [
   "Turn CompilerAdapter into an abstract class ( from interface ), remove BaseCompiler.", 
   "The main reason for that - the interface was not defining all the expected", 
   "behaviors.", 
   "I'm not sure what method to make abstract - compile( Vector sources ) or", 
   "compileSingleFile( Source src ). While the second is used and the most convenient,", 
   "most compilers will be faster if we pass multiple sources."
  ], 
  "revision_id": "295948"
 }, 
 {
  "author": "costin", 
  "date": "2001-11-10T16:31:48.000000Z", 
  "msg": [
   "The source object ( more to be added to it as we consolidate all name mangling", 
   "and manipulations here )"
  ], 
  "revision_id": "295947"
 }, 
 {
  "author": "costin", 
  "date": "2001-11-10T16:31:05.000000Z", 
  "msg": [
   "- Allow multiple <src>. Each src will point to a base directory and include a number", 
   "of subdirs ( containing sources to be compiled ).", 
   "- To avoid future mess, all informations about a source is recorded in a Source", 
   "object - that will include source file, target, package, extensions, etc.", 
   "This will also simplify parameter passing.", 
   "- For consistency, replace the String[] with a Vector of Sources for the files that", 
   "need to be compiled.", 
   "-  The mapper is now a property of SoTask ( it is set by the compiler", 
   "adapter, to indicate what's the obj extension the compiler generates - can be", 
   ".o, .obj, etc )"
  ], 
  "revision_id": "295946"
 }, 
 {
  "author": "costin", 
  "date": "2001-11-09T18:18:18.000000Z", 
  "msg": [
   "Few fixes."
  ], 
  "revision_id": "295945"
 }
]