[
 {
  "author": "costin", 
  "date": "2001-12-12T21:52:40.000000Z", 
  "msg": [
   "Moved the 'read chunk from the web server' code to jk_requtil, it can", 
   "be used by any worker/protocol.", 
   "Removed any internal use of ajp buffers."
  ], 
  "revision_id": "296129"
 }, 
 {
  "author": "costin", 
  "date": "2001-12-12T21:51:33.000000Z", 
  "msg": [
   "Start to use the new code, reuse the endpoints."
  ], 
  "revision_id": "296128"
 }, 
 {
  "author": "costin", 
  "date": "2001-12-12T21:45:55.000000Z", 
  "msg": [
   "Quite a few changes to support the separation between protocol and api and to", 
   "use the new stuff.", 
   "The 'endpoint reuse' has been abstracted in jk_objCache and is used by other", 
   "components as well.", 
   "The login phase has been changed to use only message-passing style. Apache will", 
   "send a \"ping\" request, and then execute whatever tomcat asks him to in order to", 
   "set up the connection.", 
   "That means other login protocols could be implemented, and tomcat can use this", 
   "phase to pass config informations ( or grab config information ).", 
   "(note that the login code is broken right now, I need to change the java code", 
   "as well. The biggest priority is getting ajp13 and the 'main' code working,", 
   "any feature implementable by handlers can be finished after the code is stable )"
  ], 
  "revision_id": "296127"
 }, 
 {
  "author": "costin", 
  "date": "2001-12-12T21:40:53.000000Z", 
  "msg": [
   "Removed most of the stuff from ajp14, moved to individual handlers.", 
   "We must start making the distinction between 'protocol' and 'api'.", 
   "jk supports 'ajp13' protocol, 'jni' protocol, etc. It could also support warp", 
   "protocol or even a (minimal) IIOP.", 
   "The API is the set of messages we use - confusingly called 'ajp13', 'ajp14', etc.", 
   "All the details about message is implemented in message handlers, which are", 
   "independent ( or should be ) of the protocol."
  ], 
  "revision_id": "296126"
 }, 
 {
  "author": "costin", 
  "date": "2001-12-12T21:37:13.000000Z", 
  "msg": [
   "Moved the 'serialization' code to a separate file."
  ], 
  "revision_id": "296125"
 }
]