[
 {
  "author": "billbarker", 
  "date": "2001-12-11T03:52:35.000000Z", 
  "msg": [
   "Fix the Alias mapping in \"static by Apache\" mode.", 
   "Now the Alias directives are handled correctly, even for a Context that is declaired in the server.xml file.  Also, a Context that is based in an un-expanded WAR file gets a forwardAll in all configurations.", 
   "Based on suggestion from Incze Lajos incze@mail.matav.hu"
  ], 
  "revision_id": "296119"
 }, 
 {
  "author": "billbarker", 
  "date": "2001-12-10T03:52:02.000000Z", 
  "msg": [
   "Initial version of AutoConfig for Ajp13 and Tomcat 4.0.1.", 
   "The default forwardAll works as expected.  However, there are still some issues with the \"static files to Apache\" mode.  These are mostly having to do with getting information out of Catalina that it doesn't want to give up without a fight."
  ], 
  "revision_id": "296118"
 }, 
 {
  "author": "remm", 
  "date": "2001-12-09T22:10:47.000000Z", 
  "msg": [
   "- Request parsing.", 
   "- The initial code is toString() happy. This can be optimized, but it is unclear at", 
   "the moment if this would have a very significant impact on performance (as there", 
   "are only a few String creations).", 
   "- The connector is almost at the stage where it will be testable."
  ], 
  "revision_id": "296117"
 }, 
 {
  "author": "larryi", 
  "date": "2001-12-08T15:42:25.000000Z", 
  "msg": [
   "Fix bug where if uri is shortened by un-escaping or normalizing, the query", 
   "string gets lost.", 
   "Also converted some tabs to spaces."
  ], 
  "revision_id": "296116"
 }, 
 {
  "author": "costin", 
  "date": "2001-12-07T23:10:34.000000Z", 
  "msg": [
   "Finish jk_objCache, start using it in jk_worker.", 
   "( the code is moved from ajp13_worker ). I added it to lb_worker, not yet to", 
   "jni - but it may be usefull in few other places as well.", 
   "Make sure the 'per connection' pool in endpoint is different from the", 
   "'main' pool ( that has the same life as the endpoint ).", 
   "It seems the objCache code is a bit inefficient, I don't know why it works", 
   "the way it does ( it could just be a stack )."
  ], 
  "revision_id": "296115"
 }
]