[
 {
  "author": "costin", 
  "date": "2002-01-12T04:48:20.000000Z", 
  "msg": [
   "This is the code extracted from jni worker.", 
   "Few changes - we do now a lot of 'guessing' to avoid asking the user", 
   "for things we can find for ourself. The defaults do work now fine - it", 
   "required LD_LIBRARY_PATH to be set before starting apache ( that's required", 
   "by jni ), and if you also set TOMCAT_HOME and JAVA_HOME ( that should", 
   "be already set or easy to do ) jni will figure everything it needs.", 
   "The old settings in worker.properties can be used to override the guessed", 
   "values, but the nightmare of setting jni worker should be close to end."
  ], 
  "revision_id": "296264"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-12T04:44:32.000000Z", 
  "msg": [
   "Pointer to the vm. ( not sure if this is the best place, or if it should", 
   "be a singleton - but different components will use the vm )."
  ], 
  "revision_id": "296263"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-12T04:43:46.000000Z", 
  "msg": [
   "Small change in signature - the exact same code was duplicated in jni worker."
  ], 
  "revision_id": "296262"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-12T04:43:04.000000Z", 
  "msg": [
   "In global we have a lot of platform specific stuff, added some more.", 
   "There is absolutely no reason to ask the user to specify the file separator", 
   "and all those things when we already know them.", 
   "( workerEnv.init will add them automatically to the init properties. )"
  ], 
  "revision_id": "296261"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-12T04:33:53.000000Z", 
  "msg": [
   "I did a bit of refactoring on the jni worker. This deals with starting the vm.", 
   "There are 2 benefits of separating this:", 
   "- the code gets much simpler and cleaner. We can now use different impl.", 
   "for jni1.1 and jni1.2, add the required 'tricks' specific to each vm and", 
   "os, even support some pluggability. This will also allow a clean addition for", 
   "more different vms ( like kaffe, gcj )", 
   "- the vm code has general properties about the vm - it doesn't have to", 
   "be in-process. The code and properties could also be used to start an", 
   "out-of-process vm - and the 'auto start tomcat when apache starts', like", 
   "jserv did."
  ], 
  "revision_id": "296260"
 }
]