[
 {
  "author": "costin", 
  "date": "2002-01-06T09:01:51.000000Z", 
  "msg": [
   "Added code for unix sockets ( cut & paste from the C version ). It'll be replaced/merged", 
   "with jfc's version.", 
   "I also added few other methods to AprImpl, now pools seem to work ( it seems the first", 
   "step in using APR ). Unix sockets are using 'native' code, not APR, but I hope", 
   "it'll be integrated with apr code and we'll replace this with the plain apr socket.", 
   "Other usefull functions we should add and test from APR ( for the short term ):", 
   "- send signals", 
   "- change user id", 
   "Probably shared memory will happen in jk3."
  ], 
  "revision_id": "296229"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-06T08:58:31.000000Z", 
  "msg": [
   "Added the declaration for JkServlet. All settings for jk2 are done in web.xml", 
   "( well, not quite - probably we'll also support workers.properties so the user", 
   "changes only one place, and we may also support Interceptor/Connector style, etc ).", 
   "The use of web.xml has few big benefits:", 
   "- any servlet developer should know very well it's structure.", 
   "- any tool that is managing webapps can be used to configure jk. And to", 
   "deploy/upgrade jk, as long as it supports the 'priviledged' flag.", 
   "Also, the use of the webapp will allow us to use the predefined environment", 
   "and locations."
  ], 
  "revision_id": "296228"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-06T08:53:54.000000Z", 
  "msg": [
   "Removed the interceptor for jk2, web.xml is enough.", 
   "( the file is still needed to plug jk1 in 3.3 )"
  ], 
  "revision_id": "296227"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-06T08:52:38.000000Z", 
  "msg": [
   "Remove Ajp14Interceptor ( from jk2, it's still part of the stable jk14 ).", 
   "It is no longer needed, a simple servlet is enough.", 
   "Added the 3.3 specific servlet, the request/response adapters and", 
   "the Worker ( which receives the requests and calls ContextManager.service() )."
  ], 
  "revision_id": "296226"
 }, 
 {
  "author": "costin", 
  "date": "2002-01-06T08:50:56.000000Z", 
  "msg": [
   "JkServlet is now functional. For 3.3 you can just add jk or a symlink to modules.", 
   "For 4.0 you just need to add the declaration for the 'trusted' app in server.xml", 
   "_and_ copy the jar files in servler/lib ( that will not be needed in 4.1 ).", 
   "The 3.3 impl is working ( at least simple servlets/jsps). I still have some", 
   "lines to add to the 4.0 impl ( but it starts fine and receives the request )."
  ], 
  "revision_id": "296225"
 }
]