[
 {
  "author": "costin", 
  "date": "2002-02-06T19:11:23.000000Z", 
  "msg": [
   "Implementation of the 'secret' attribute in the request, used to", 
   "pass a key used to authenticate the sender.", 
   "This shouldn't affect in any way the current code - as long as the", 
   "secret attribute is not set on the worker, the code will behave", 
   "exactly as before and work with any tomcat from 3.2 to 4.1.", 
   "If the attribute is set, the attribute will be sent - the", 
   "receiving side should know how to deal with it, that means", 
   "it should use a recent version of jk.", 
   "On the java side, the new versions of jk will allow setting the", 
   "key - that will require any web server to send the password", 
   "in order to allow forwarding the request. The check will happen", 
   "once per tcp connection."
  ], 
  "revision_id": "296379"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-06T19:06:16.000000Z", 
  "msg": [
   "Added classes to classpath, for faster build in standalone", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "296378"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-06T19:04:28.000000Z", 
  "msg": [
   "Config file for jk2.", 
   "Right now everything is commented - the defaults will be used.", 
   "Uncomment/edit if you want to change anything."
  ], 
  "revision_id": "296377"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-06T18:26:50.000000Z", 
  "msg": [
   "Added support for the ajp13 secret. It shouldn't affect anything in the", 
   "normal use-case - it just recognizes the new request attributes if it's", 
   "sent by apache.", 
   "In addition, any attributes with a single string value ( like most", 
   "attributes are ) that is not known will be ignored, for better", 
   "backward compatibility.", 
   "Note that we don't do anything about the secret except recognizing it.", 
   "A config option in the connector will use it."
  ], 
  "revision_id": "296376"
 }, 
 {
  "author": "costin", 
  "date": "2002-02-06T18:23:25.000000Z", 
  "msg": [
   "Update for the API and JkMain changes."
  ], 
  "revision_id": "296375"
 }
]