[
 {
  "author": "costin", 
  "date": "2002-03-28T00:14:34.000000Z", 
  "msg": [
   "Remove the old jni code, no longer supported for jk2.", 
   "Jk2 uses the a jni channel and ajp13 marshalling. This minimize the amount", 
   "of JNI calls ( each cross has a performance impact ) and eliminate the allocation", 
   "and conversion on the C side ( creating the strings was hugely expensive,", 
   "almost eliminating any benefit of doing jni - the java side knows how to", 
   "avoid strings and create them efficiently, and the optimizations is hard", 
   "to reproduce in C )."
  ], 
  "revision_id": "296629"
 }, 
 {
  "author": "costin", 
  "date": "2002-03-28T00:10:30.000000Z", 
  "msg": [
   "Confusing - this file was not used ( the actual impl. is part of", 
   "jni/ dir )"
  ], 
  "revision_id": "296628"
 }, 
 {
  "author": "costin", 
  "date": "2002-03-27T18:58:57.000000Z", 
  "msg": [
   "Added 'getters' for few common proprties. More will come in the future, for any information", 
   "that is worth knowing.", 
   "Modified worker_status to use the new API instead of accessing the fields directly.", 
   "Now worker status displays 3 kind of information:", 
   "- the original config ( what the user set in jk2.properties or otherwise )", 
   "- the processed config ( include 'default' or 'guessed' values, after $() substitution)", 
   "- runtime status ( what getAttribute() returns )", 
   "We'll add some filters and probably change this to a txt form ( properties-like )", 
   "for easy parsing - this is not supposed to become a 'nice' interface, but to", 
   "be used programatically and maybe wrapped in a nicer GUI."
  ], 
  "revision_id": "296627"
 }, 
 {
  "author": "costin", 
  "date": "2002-03-26T03:04:54.000000Z", 
  "msg": [
   "Update to the interface changes, implement the vargs logging function in logger.apache2"
  ], 
  "revision_id": "296626"
 }, 
 {
  "author": "costin", 
  "date": "2002-03-26T03:04:24.000000Z", 
  "msg": [
   "Update to the new interface changes, few fixes."
  ], 
  "revision_id": "296625"
 }
]