[
 {
  "author": "remm", 
  "date": "2002-04-08T22:29:14.000000Z", 
  "msg": [
   "- Add type attribute to the handler context (as an int)."
  ], 
  "revision_id": "296689"
 }, 
 {
  "author": "remm", 
  "date": "2002-04-08T22:03:08.000000Z", 
  "msg": [
   "- It seems that remoteHost and remoteAddr shouldn't be recycled after each", 
   "request, as the connection may last for more than one request/response", 
   "(and it would be the responsability of the protocol handler to set the value", 
   "whenever necessary)."
  ], 
  "revision_id": "296688"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-08T19:17:35.000000Z", 
  "msg": [
   "Initial ( and mostly untested ) shared memory code.", 
   "It'll work only if APR is enabled ( like all 'advanced' features ).", 
   "I also added some minimal code to support it from the java side - it's", 
   "based on the rough 'long as void *' representation - not supposed to", 
   "be visible from the user side, just to keep the C code simple while", 
   "doing the data abstraction in java.", 
   "As you may notice, there's no object interface yet - I'm still exploring", 
   "how to implement this on top of 1.4 nio ( or something that is close as", 
   "interface - obviously requiring 1.4 to use shmem and APR is not the best", 
   "option :-)", 
   "In any case, the goal is to have at least worker status exposed in", 
   "a shared memory segment and java access to it.", 
   "Long term this will be used for configuring multi-process servers", 
   "( i.e. apache )."
  ], 
  "revision_id": "296687"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-08T18:47:53.000000Z", 
  "msg": [
   "Moved jk_pool_apr to common - it's not specific to apache2 ( but can be used", 
   "with any other server, if apr is enabled ).", 
   "If a server has 'native' pool, it should be used. If not, we should", 
   "use apr if possible. If APR is not available - fallback to the", 
   "old implementation."
  ], 
  "revision_id": "296686"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-08T02:35:06.000000Z", 
  "msg": [
   "Update to look for puretls.jar as the means of PureTLS detection. Include", 
   "defining a puretls.jar property so it can be overridden with a build.properties", 
   "file.  For consistency, do the same for JSSE.  Add a build.properties.sample."
  ], 
  "revision_id": "296685"
 }
]