[
 {
  "author": "costin", 
  "date": "2002-04-17T22:55:39.000000Z", 
  "msg": [
   "For those who prefer to use MSVC instead of ant :-)", 
   "( I know Nacho will be very disapointed, but I think it's the right", 
   "thing to do ... )"
  ], 
  "revision_id": "296854"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-17T22:52:14.000000Z", 
  "msg": [
   "More work on the shm object."
  ], 
  "revision_id": "296853"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-17T22:51:02.000000Z", 
  "msg": [
   "Small fix in shmAttach.", 
   "Started to add mutexes ( to support shm end not only ).", 
   "Again ( see the comments in AprImpl ) - the interfaces are not even started,", 
   "this is just the JNI code. AprImpl will have many native methods, with longs and", 
   "other strange things - not to be called by any user code.", 
   "Also note that we'll not support all APR functions - only what's missing", 
   "in java."
  ], 
  "revision_id": "296852"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-17T22:46:35.000000Z", 
  "msg": [
   "Add a JK_OK constant - JK_TRUE is the reverse of APR_SUCCESS.", 
   "I'll eventually to a regexp replacement - things are working, but", 
   "in future we may run into problems with this."
  ], 
  "revision_id": "296851"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-17T22:43:58.000000Z", 
  "msg": [
   "Added shm native calls.", 
   "Cleanup the interfaces - now use the normal JkHandler interface for", 
   "configuration.", 
   "AprImpl must be loaded in the main classloader, with common-logging and", 
   "jk.core in order to get JNI-channel to work ( that will be fixed later, it is", 
   "also possible to get around the class loaders by pushing the objects via", 
   "native calles instead of loading them with FindClass )", 
   "( normal jni will work anyway ).", 
   "For callbacks we use normal JkHandler and MsgContext - it", 
   "coresponds to an apache hook and behaves in a similar way. ( ok, the", 
   "concept is identical to a Valve for 4.0 people, with an Action for Remy,", 
   "and close enough to an Interceptor for 3.3 people )."
  ], 
  "revision_id": "296850"
 }
]