[
 {
  "author": "costin", 
  "date": "2002-04-15T23:52:41.000000Z", 
  "msg": [
   "Use a more consistent and flexible mechanism for callbacks from C to java.", 
   "Also 'consolidate' all native code in one class, to simplify loading of the .so", 
   "and avoid ClassLoader problems ( yes, there are problems even in native code )."
  ], 
  "revision_id": "296824"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-15T23:47:57.000000Z", 
  "msg": [
   "Patch from Eugene Gluzberg <drag0n2@yahoo.com>", 
   "> If a tomcat goes down, it gets taken out of the \"worker list\" for 60", 
   "> seconds, before its retried. If all the tomcats that are being load balanced", 
   "> are being restarted (one at a time to upgrade the system for instance), you", 
   "> need to wait until the tomcat that you just brought up to get back in the", 
   "> list before you shut down the next one, or you may have website downtime.", 
   "> Same problem if any intermittent network problem would occur between", 
   "> Netscape and tomcat. The downtime would be at least 60 seconds.", 
   "> To avoid that I made a fix to the load balancer worker that would be", 
   "> activated only when all the tomcat workers were taken out of the list due to", 
   "> failure.", 
   "> If all the load balanced tomcat workers are out of the list, the patched", 
   "> load balancer would go through all of the workers again once in reverse", 
   "> order of their \"last error time\" until one is found. They would be retried", 
   "> even though 60 seconds did not pass yet. If and only if all the workers have", 
   "> been tried once in this particular request and all failed an error would be", 
   "> returned to the user. The retries would continue for every request until at", 
   "> least one tomcat worker recovers. After the first tomcat worker recovers,", 
   "> the rest would be retried once every 60 seconds as before."
  ], 
  "revision_id": "296823"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-15T23:46:01.000000Z", 
  "msg": [
   "Fix from Eugene Gluzberg <drag0n2 at yahoo.com> - when all workers are down", 
   "we'll ignore the timeout and retry."
  ], 
  "revision_id": "296822"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-15T10:45:12.000000Z", 
  "msg": [
   "Fix name of \"container\" utilities jar.  Remve jtc.jar since I don't see where", 
   "it is created"
  ], 
  "revision_id": "296821"
 }, 
 {
  "author": "larryi", 
  "date": "2002-04-15T04:07:01.000000Z", 
  "msg": [
   "Include in util/build/lib a copy of the actual commons-logging.jar used in", 
   "the build.  Allows the choice of the logging jar to remain local, and an", 
   "external project can get this choice from a known location."
  ], 
  "revision_id": "296820"
 }
]