[
 {
  "author": "costin", 
  "date": "2002-04-18T19:22:54.000000Z", 
  "msg": [
   "Update the C-side config file.", 
   "Again, for things to work you _must_ set TOMCAT_HOME, JAVA_HOME and", 
   "LD_LIBRARY_PATH before starting apache ( for the JNI worker ).", 
   "Things will degrade gracefully - if some operation is not possible", 
   "a message will be displayed and the worker disabled."
  ], 
  "revision_id": "296874"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-18T19:19:02.000000Z", 
  "msg": [
   "Update the config file - most of the stuff has been removed, it was", 
   "just un-needed pain for the users, we knew already what was there.", 
   "The config file should be used only to override defaults, if you", 
   "have a good reason to. In addition added a ( I hope clear ) message", 
   "that the config file may be overrideni by config tools.", 
   "That will happen after I get to implement the Mbean for jk", 
   "or if another tools set properties via JkMain."
  ], 
  "revision_id": "296873"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-18T19:16:45.000000Z", 
  "msg": [
   "Change the manifest so we don't have to setup the classpath. JDK1.2 is required", 
   "for the manifest to work."
  ], 
  "revision_id": "296872"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-18T19:13:02.000000Z", 
  "msg": [
   "Add the localId."
  ], 
  "revision_id": "296871"
 }, 
 {
  "author": "costin", 
  "date": "2002-04-18T19:12:36.000000Z", 
  "msg": [
   "Allow a 'range' of ports to be used.", 
   "This allows multiple tomcats to be started on the same machine with the", 
   "same configuration - and get consecutive sockets ( tcp and unix ) automatically.", 
   "Needed for jni, it also simplify the configuration of lb workers - no need", 
   "to use separate config files for each worker ( on a machine ).", 
   "The port will also determine the local part of the instance ID ( the hostname", 
   "or address should form the other part - and we need a way to push this up", 
   "into the coyote and container ).", 
   "If Shm is detected it'll set the instance id based on the shared memory", 
   "protocol ( i.e. each worker will get a unique id based on the position", 
   "of the worker def in the shared mem ) ."
  ], 
  "revision_id": "296870"
 }
]