[
 {
  "author": "costin", 
  "date": "2002-05-09T21:09:41.000000Z", 
  "msg": [
   "Much cleaner and easier to read report, remove duplicated code and", 
   "generalize a bit.", 
   "We'll display a table for each object type ( that we care about ):", 
   "- ajp workers", 
   "- uris", 
   "- endpoints", 
   "For each object we display all we can get via 'getters' ( if you want more", 
   "info, just add a new attribute for getAttribute ).", 
   "The workers are the important piece - the state and counters.", 
   "Note that at this moment we display only the info in the apache instance", 
   "that is active. It'll change to use the shmem scoreboard."
  ], 
  "revision_id": "297124"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-09T21:06:48.000000Z", 
  "msg": [
   "That's the big one.", 
   "Please review !", 
   "It changes the handling of lb_value to int. I also cleaned up the logic so", 
   "it's easier ( I hope ) to understand what's happening. \"Levels\" replace", 
   "the 'local worker', I thing I got the logic straight for those.", 
   "I started to add a 'introspection' data, to validate and better report", 
   "the config.", 
   "We use one table per level. At the moment the maximum number of workers", 
   "is hardcoded ( to 255 ), we could make it dynamic but that would make things", 
   "pretty complex when we add workers dynamically ( it won't work without", 
   "a CS or atomic operations )"
  ], 
  "revision_id": "297123"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-09T21:03:45.000000Z", 
  "msg": [
   "Clean up the debuging.", 
   "Started to add the 'introspection' info, it'll be exposed in the status."
  ], 
  "revision_id": "297122"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-09T21:03:07.000000Z", 
  "msg": [
   "Slight change in workerEnv initialization - ajp workers will be initialized", 
   "at the same time with the channels. That means lb init will report the right", 
   "number of workers.", 
   "Filter messages based on the debug level of the worker or current uri", 
   "( I tried to make everything that is worker-specific depend on worker debug,", 
   "high level messages depend on uri debug - but we may check both )"
  ], 
  "revision_id": "297121"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-09T21:00:53.000000Z", 
  "msg": [
   "Remove the old code.", 
   "Be less verbose ( unless config.debug property is set ).", 
   "Add another 'magic' attribute, \"info\". It'll allow some comments to be", 
   "associated with each object, and persisted automatically.", 
   "( now the config will save the workers.properties whenever it receives", 
   "a request to do so - curently via shm, but we can easyly add the other", 
   "channels - what used to be called 1.4 is pretty close )"
  ], 
  "revision_id": "297120"
 }
]