[
 {
  "author": "costin", 
  "date": "2002-05-09T20:58:13.000000Z", 
  "msg": [
   "Switch the lb_factor/lb_value to int. For now we'll just use a small int ( 0..255 )", 
   "to represent the lb_value, and roll back to 0. The only role of lb_value", 
   "is to make sure all workers get a similar amount of requests - with lb_factor", 
   "giving more priority to some workers. There is little benefit on using floats", 
   "for that, and a small int avoids the need for atomic operations.", 
   "Note that we can still enhance the model to use the number of 'active connections'", 
   "and favor the tomcat instances that have fewer active connections. We", 
   "can also use the average response time ( after we add this info :-)", 
   "Add multiple 'levels' - a genaralization of the 'local worker concept.", 
   "At init time the channels are sorted by level in different tables", 
   "( currently we have 4 levels only, hardcoded - but I doubt we need more than 2 ).", 
   "If all workers in a lower level are in error state, we move to the next.", 
   "That removes the sepcial meaning of '0',"
  ], 
  "revision_id": "297119"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-09T20:52:54.000000Z", 
  "msg": [
   "- removed old 'pull' apis from config, now everything works using the 'push' model", 
   "( i.e. setters ).", 
   "- removed unused stuff from config.", 
   "- removed duplicated 'debug' from uriEnv, uriMap"
  ], 
  "revision_id": "297118"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-09T20:51:29.000000Z", 
  "msg": [
   "Add a state, to prevent double initialization and simplify things.", 
   "Add 'introspection' info about multi-value properties.", 
   "I'm still looking into that ( the issue is how we save/restore/change dynamically", 
   "multi-valued properties )", 
   "Added a 'version' field for each object - it will allow 'targeted'", 
   "updates. I'm trying to generalize the mechanism used to update workes,", 
   "so any attribute of any object can be set at runtime ( like in JMX world ),", 
   "and to persist this automatically."
  ], 
  "revision_id": "297117"
 }, 
 {
  "author": "jfclere", 
  "date": "2002-05-09T09:29:05.000000Z", 
  "msg": [
   "Remove the cache file otherwise autoconf uses old (cached) m4 files."
  ], 
  "revision_id": "297116"
 }, 
 {
  "author": "jfclere", 
  "date": "2002-05-09T09:26:33.000000Z", 
  "msg": [
   "Fix a typo."
  ], 
  "revision_id": "297115"
 }
]