[
 {
  "author": "costin", 
  "date": "2002-05-22T23:40:36.000000Z", 
  "msg": [
   "Stupid mistake..."
  ], 
  "revision_id": "297309"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-22T23:40:02.000000Z", 
  "msg": [
   "Added IIS to the build targets ( if detected ). We'll look for MSVC, as the", 
   "required headers are included - you don't need IIS to compile the DLL ( and", 
   "I think it'll work with the personal web server as well, probably any ISAPI", 
   "server with a bit more work ).", 
   "Added detection for solaris and hpux.", 
   "Few more tweaks.", 
   "As soon as I have some time I'll integrate the ant types that are used", 
   "in the cc-tasks ( that would be a good first step into merging, if we", 
   "use the same DTD that's already a big step forward ). This will allow", 
   "us to specify the includes, flags, etc only once.", 
   "I got it to compile on a Windows, I still have few problems with solaris", 
   "and HPUX.  More targets are wellcomed - also someone should test on netware.", 
   "After we merge the syntax with cc-tasks ( on sourceforge/ant-contrib ) we", 
   "might be able to support all the compilers they support and more", 
   "environments."
  ], 
  "revision_id": "297308"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-22T23:34:53.000000Z", 
  "msg": [
   "Hpux doesn't support -W.", 
   "( or at least it has a different meaning ).", 
   "Long term - we should start using <includeset> <defineset> <flagset>", 
   "like in ant-contrib cc tasks, it's much easier to do this in the xml", 
   "file."
  ], 
  "revision_id": "297307"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-22T21:30:09.000000Z", 
  "msg": [
   "Removed the extra settings ( now set in build.xml )", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "297306"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-22T21:26:22.000000Z", 
  "msg": [
   "Reduce the ammount of user interaction. Based on Anthony's sugestion, we", 
   "set 'linux' ( and win32, netware, etc ) based on os.name and the", 
   "presence of the NDK ( since netware is cross-compiled ).", 
   "We also have reasonable defaults ( i.e. the default install location", 
   "on windows ) and a platfrom-specific init section can be added.", 
   "( you still need to set the PATH before runnint ant to include", 
   "mssdk.home/Common/MSDev98/bin - cl.exe is looking for a DLL and I can't", 
   "find any other way to deal with that right now )"
  ], 
  "revision_id": "297305"
 }
]