[
 {
  "author": "costin", 
  "date": "2002-05-26T07:31:12.000000Z", 
  "msg": [
   "Remove the duplicated init method in channel.", 
   "The AJP13 callback ( used in JNI mode ) that was supposed to be use", 
   "by the unix channel should work with all channels."
  ], 
  "revision_id": "297359"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-26T07:30:01.000000Z", 
  "msg": [
   "Moved channels to use the init() method in jk_bean.", 
   "( all jk components will eventually be useable from java using", 
   "the ajp 'bridge', but channels are important and need to be initialized", 
   "corectly )"
  ], 
  "revision_id": "297358"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-26T07:13:59.000000Z", 
  "msg": [
   "Update the unix socket channel.", 
   "Make sure the endpoint is initialized ( thanks Nacho )"
  ], 
  "revision_id": "297357"
 }, 
 {
  "author": "costin", 
  "date": "2002-05-26T07:13:02.000000Z", 
  "msg": [
   "- removed the mutex code, the normal invocation mechanism will be used ( i.e.", 
   "the ajp 'bridge' ).", 
   "- cleanup a bit the unix socket, preparing for the removal ( again the same", 
   "mechanism will be used - I don't want to do the direct buffer and optimizations", 
   "in 2 places )", 
   "- added some of the methods that were missing. Note that signal is not complete,", 
   "I want ( again ) to use the same code for java-C invocation.", 
   "Based on the various tests I made so far and what I've seen in other systems,", 
   "'straight' use of JNI is not a good solution ( look at Mozilla and all other", 
   "projects that integrate java with C applications ). There are some fine", 
   "optimizations that can be made in JDK1.4, and some other that would", 
   "work in 1.3 - but it's easier to code the critical code in few methods", 
   "( the 2 methods that call java from C and C from java )."
  ], 
  "revision_id": "297356"
 }, 
 {
  "author": "nacho", 
  "date": "2002-05-24T15:17:27.000000Z", 
  "msg": [
   "* EOL Problems", 
   "* Bug: If not compiled with iis5 support in, then doesnt need to check the iis version at all"
  ], 
  "revision_id": "297355"
 }
]