[
 {
  "author": "jfarcand", 
  "date": "2002-12-03T16:04:02.000000Z", 
  "msg": [
   "As Bill's recommends, do not set a default locale in Response directly."
  ], 
  "revision_id": "298209"
 }, 
 {
  "author": "jfarcand", 
  "date": "2002-12-03T02:29:14.000000Z", 
  "msg": [
   "Servlet 2.4 section 5.4 will be modified:", 
   "A servlet should set the locale and the character encoding of a", 
   "response. The locale is set using the ServletResponse.setLocale method,", 
   "and communicated to the client using the Content-Language header. The", 
   "character encoding can be set explicitly using the ServletResponse", 
   "methods setCharacterEncoding and setContentType, or implicitly using the", 
   "ServletResponse.setLocale method, and is communicated to the client", 
   "using the charset parameter of the Content-Type header. Explicit", 
   "specifications take precedence over implicit specifications.", 
   "[...]", 
   "The character encoding should be specified before the getWriter method", 
   "of the ServletResponse interface is called; otherwise the default", 
   "ISO-8859-1 is used.", 
   "---------------------", 
   "That means if setContentType is called, then setLocale should do reset the content type. Same for setCharacterEncoding. If getWriter is called, then ignore any call to setContentType, setCharacterEncoding and setLocale.", 
   "Please review."
  ], 
  "revision_id": "298208"
 }, 
 {
  "author": "jfclere", 
  "date": "2002-11-28T15:54:51.000000Z", 
  "msg": [
   "Set top_builddir to make sure that libtool is found."
  ], 
  "revision_id": "298207"
 }, 
 {
  "author": "remm", 
  "date": "2002-11-28T15:16:31.000000Z", 
  "msg": [
   "- Small reorganization of the code so that the next accept is called sooner", 
   "when not using the connection cache."
  ], 
  "revision_id": "298206"
 }, 
 {
  "author": "remm", 
  "date": "2002-11-28T15:15:02.000000Z", 
  "msg": [
   "- On the initial blocking call, I think the default socket timeout should be used.", 
   "- Make another call conditional on the disableUploadTimeout flag."
  ], 
  "revision_id": "298205"
 }
]