[
 {
  "author": "costin", 
  "date": "2003-01-11T06:53:43.000000Z", 
  "msg": [
   "Moved ThreadWithAttribute out of ThreadPool.", 
   "All attribute operations are guarded by ThreadPool - if an application", 
   "has a reference to ThreadPool, it can get/set attributes.", 
   "The cost is one cast and a method access."
  ], 
  "revision_id": "298304"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-11T06:52:27.000000Z", 
  "msg": [
   "Added a \"JMX\" extension to threadpool.", 
   "This will keep the ThreadPool independent of JMX.", 
   "Also added few \"informative\" methods to display the threads and", 
   "the status of each thread. ( I need to commit few changes in", 
   "http and jk connector to take provide this info )"
  ], 
  "revision_id": "298303"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-11T00:05:10.000000Z", 
  "msg": [
   "Add jmx deps in gump.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "298302"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-11T00:03:01.000000Z", 
  "msg": [
   "Add the jmx dependency.", 
   "Add a separate target that just builds for tomcat5, to avoid", 
   "all the detection."
  ], 
  "revision_id": "298301"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-10T22:36:43.000000Z", 
  "msg": [
   "Added a base implementation of ActionHook - with some small additions :-)", 
   "First, there is a getNext/setNext to allow multiple hooks to be chained.", 
   "Both recursive and iterative will be supported - you can call next directly or", 
   "just return it ( still need to tune this - only recursive works now )", 
   "In addition, the hook implements MBeanRegistration ( again: we did vote on", 
   "JMX dependency ). Tomcat3.3 may be a problem ( since it's using the same code),", 
   "but if someone wants to use the new connector he can also add jmx in the", 
   "path. If anyone has a problem with that - please let me know, I can hack", 
   "some conditional compilation, but I would like to keep it simple.", 
   "I'll change the 2 hook implementations to extend this after it settles down.", 
   "Feel free to make changes - or ask for changes or just say -1.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "298300"
 }
]