[
 {
  "author": "costin", 
  "date": "2003-03-04T07:12:13.000000Z", 
  "msg": [
   "Few fixes to get it to compile with the default redhat apache.", 
   "As is common those days, RedHat decided to make the life easy for developers", 
   "by messing out the file locations used by apache - since they know better", 
   "how files should be named..."
  ], 
  "revision_id": "298434"
 }, 
 {
  "author": "costin", 
  "date": "2003-03-04T07:02:37.000000Z", 
  "msg": [
   "First cleanup/refactoring.", 
   "Instead of | separated values ( I can't believe I did that ! ) use the same", 
   "format as the config. This way I may get around and implement it for config", 
   "too ( part of modeler probably ).", 
   "Added initial support for methods - init/destroy is all I care for jk, but", 
   "it seems like this may become a very nice piece of reusable code to manage", 
   "multiple instances.", 
   "One thing that may be very interesting is to do a set on startup and", 
   "shutdown ( disabled ? ).", 
   "Testing mod_jk from the JMX console showed a lot of small problems", 
   "in config - mostly ordering. The \"classic\" config is still the best,", 
   "but this will be really cool."
  ], 
  "revision_id": "298433"
 }, 
 {
  "author": "jfarcand", 
  "date": "2003-03-04T01:57:06.000000Z", 
  "msg": [
   "Re-design the way doPrivileged block are created when the SecurityManager is on.", 
   "ApplicationContext no longer have privileged block. Since this class is used via the Facade, the doPrivileged blocks are now there. To avoid having too many inner classes, I have implemented a cache where method objects are stored.", 
   "Also add some missing doPrivileged blocks in coyote and removed unused jasper one.", 
   "I didn't implement the cache for the coyote classes since it might affect performance.", 
   "Please review. I have ran the watchdog test, jsp examples and servlet examples."
  ], 
  "revision_id": "298432"
 }, 
 {
  "author": "", 
  "date": "2003-03-03T15:24:38.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'TOMCAT_5_0_1'."
  ], 
  "revision_id": "298431"
 }, 
 {
  "author": "costin", 
  "date": "2003-03-03T15:24:38.000000Z", 
  "msg": [
   "A couple of fixes and small enhancements.", 
   "Clean up on destroy(), fix the last bean, reload after set, allow explicit", 
   "control of loading meta and values, etc.", 
   "I think the code is mostly stable."
  ], 
  "revision_id": "298430"
 }
]