[
 {
  "author": "remm", 
  "date": "2004-10-04T13:48:11.000000Z", 
  "msg": [
   "- Attribute translation is now useless (readd it if TC 3 needs it).", 
   "- Remove the * 1000 in setTimeout, which messes with the java bean semantics, and is screwing up JMX."
  ], 
  "revision_id": "299809"
 }, 
 {
  "author": "remm", 
  "date": "2004-10-04T09:25:55.000000Z", 
  "msg": [
   "- Fix issue with getProperty in IntrospectionUtils (somehow, it took me forever to spot it)."
  ], 
  "revision_id": "299808"
 }, 
 {
  "author": "remm", 
  "date": "2004-10-03T11:48:59.000000Z", 
  "msg": [
   "- Oops, made a mistake with what the default should be. Probably I set that to the wrong value during early testing."
  ], 
  "revision_id": "299807"
 }, 
 {
  "author": "remm", 
  "date": "2004-10-01T23:46:57.000000Z", 
  "msg": [
   "- Hack in an alternate thread pool strategy (which is basically the TC 4.0 thread pool).", 
   "- The problem is that there are some environments where the default thread pool doesn't work well, and there's some black magic", 
   "involved with it.", 
   "- Another advantage of the thread pool is that its simple design allows server socket restart to mostly work (at least in TC 4.0 it worked), so", 
   "I think this is a good endpoint for not-that-stable VMs/OS combinations. A drawback is that the thread pool won't scale back (OTOH, scaling", 
   "back is dangerous as it could cause memory leaks depending on what the application is doing).", 
   "- I think in the future we could try to use the Java 5 thread pool (although for now, I haven't figured out a way to use it efficiently with", 
   "our stuff).", 
   "- Similarly, I haven't found a way to use ThreadPool efficiently with a dedicated socket listener thread. So the code is in PTcpEndpoint.", 
   "- From an efficiency standpoint, there's no measureable difference between the two thread pools on a 1 CPU machine (no big surprise).", 
   "- The default obviously remains the current thread pool."
  ], 
  "revision_id": "299806"
 }, 
 {
  "author": "remm", 
  "date": "2004-10-01T23:36:15.000000Z", 
  "msg": [
   "- Fix a oops with my usage of \"constant\" bytes arrays. So, ok, I can't do that.", 
   "- Use a byte array for server."
  ], 
  "revision_id": "299805"
 }
]