[
 {
  "author": "remm", 
  "date": "2005-03-03T01:51:12.000000Z", 
  "msg": [
   "- Implement delegation in getProperty (when the current classloader does not have any configuration).", 
   "- Read useParentHandlers property.", 
   "- Code cleanup in FileHandler."
  ], 
  "revision_id": "300329"
 }, 
 {
  "author": "remm", 
  "date": "2005-03-03T00:23:00.000000Z", 
  "msg": [
   "- Fix NPE caused by my last change.", 
   "- Use ',' as separator for the handler lists.", 
   "- Just noticed that java.util.logging does support a handlers property on loggers, and that I reinvented it", 
   "(I had been looking at the JDK 1.4 config files all along)."
  ], 
  "revision_id": "300328"
 }, 
 {
  "author": "remm", 
  "date": "2005-03-02T21:40:00.000000Z", 
  "msg": [
   "- The java.util.logging javadocs imply that the configuration of the handler (filter, formatter, etc) should be done by the handler itself."
  ], 
  "revision_id": "300327"
 }, 
 {
  "author": "remm", 
  "date": "2005-03-02T18:30:45.000000Z", 
  "msg": [
   "- Add JULI, a Java Util Logging Implementation.", 
   "- It supports per classloader configuration, using standard JDK properties files, with optional extensions to be able to flexibly assign handlers to loggers.", 
   "- The package includes a rotating handler, since zillions of people have lamented its departure in 5.5.x (even if it didn't contain anything useful anymore).", 
   "- This builds a small JAR, which is then added to the classpath by bootstrap.jar.", 
   "- I may need to fix packaging a little after that change; sorry for the trouble.", 
   "- I'll add comments and docs soon.", 
   "- This is based on code subimmted by Lachlan O'Dea in bug 33143, and is likely to move to commons (once I get comfortable enough with svn)."
  ], 
  "revision_id": "300326"
 }, 
 {
  "author": "keith", 
  "date": "2005-02-27T21:30:51.000000Z", 
  "msg": [
   "Backport to 50 branch of fix to allow servlets to return", 
   "multi-gb content-length headers", 
   "- allow servlets to set content-length > Integer.MAX_VALUE via setHeader()", 
   "- if servlet sets a content length in this manner, getContentLength will", 
   "return -1 if cl > Integer.MAX_VALUE, so test getContentLengthLong to see", 
   "if the cl was set."
  ], 
  "revision_id": "300325"
 }
]