[
 {
  "author": "amyroh", 
  "date": "2002-08-26T23:01:31.000000Z", 
  "msg": [
   "CGIServlet had problems in the case of a CGI script which prints a large", 
   "amount of data to stdout; while the CGIServlet was waiting for the end of", 
   "stderr, the CGI script would fill up the stdout buffer and then wait for it to be", 
   "drained, causing a deadlock between the two processes.", 
   "This patch solves this problem by having a single loop which", 
   "reads stderr if it's ready, or stdout if ready.  If neither handle has queued", 
   "data and the CGI script has exited, the servlet pauses a couple of times for", 
   "half a second to make sure that all output has been delivered, then it exits.", 
   "Fixes Bug 12041.  Patch submitted by Dave Glowacki (dglo@ssec.wisc.edu)"
  ], 
  "revision_id": "301189"
 }, 
 {
  "author": "amyroh", 
  "date": "2002-08-26T21:06:27.000000Z", 
  "msg": [
   "Update createConnector methods to work with Tomcat 5 connectors."
  ], 
  "revision_id": "301188"
 }, 
 {
  "author": "horwat", 
  "date": "2002-08-24T02:27:28.000000Z", 
  "msg": [
   "Implementation of extension version checking as defined by the Optional Package Versioning mechanism (http://java.sun.com/j2se/1.4/docs/guide/extensions).", 
   "During deployment, declared dependencies in manifest entries of library JARs and WARs are now recognized. If these dependencies are not satisfied, the applicati on is rejected with an informative log message.", 
   "Removed the broken dependency checking mechanism.", 
   "Submitted by: Justyna Horwat and Greg Murray"
  ], 
  "revision_id": "301187"
 }, 
 {
  "author": "bobh", 
  "date": "2002-08-24T00:17:22.000000Z", 
  "msg": [
   "- reversed order of if elements to correspond correctly to if's test"
  ], 
  "revision_id": "301186"
 }, 
 {
  "author": "bobh", 
  "date": "2002-08-24T00:11:23.000000Z", 
  "msg": [
   "- calling toString() gets a NPE if the container isn't set", 
   "- remove some log() messages that I left behind (oops)"
  ], 
  "revision_id": "301185"
 }
]