[
 {
  "author": "jfarcand", 
  "date": "2002-11-04T05:12:56.000000Z", 
  "msg": [
   "Use the catalina.properties file to customize the package protection/access. This new security mechanism enable the customization, at runtime, of which package should be protected.", 
   "the following package will be protected by default:", 
   "o.a.catalina", 
   "o.a.jasper(*)", 
   "o.a.coyote", 
   "o.a.tomcat.util", 
   "(*) Tomcat 5 is broken when a JSP use a class from jsp20el.jar and when the SecurityManager is turned on. Even if you remove all the protection, Tomcat fail to properly runs the example.", 
   "o.a.coyote.tomcat5 has been securized in order to support package protection."
  ], 
  "revision_id": "301309"
 }, 
 {
  "author": "bobh", 
  "date": "2002-11-01T19:01:18.000000Z", 
  "msg": [
   "- missing a few casts and needed to get to the real Request.. details details.."
  ], 
  "revision_id": "301308"
 }, 
 {
  "author": "bobh", 
  "date": "2002-11-01T18:48:52.000000Z", 
  "msg": [
   "To allow the underlying SSL implementation to perform the certificate", 
   "exchange, the socket must be completely read.  If the request was a", 
   "POST, then there is data still waiting on the socket.  We should read", 
   "the entire POST and hold on to it.  This change just takes care of the", 
   "case where the posted ContentType is application/x-www-form-urlencoded.", 
   "I will work over the next few days to implement a more general", 
   "solution.  Kinda hairy, cause if someone posts a huge document - like", 
   "a movie file, then were do we buffer that? on disk?  So if the POST is", 
   "bigger than size X, then start saving to a temporary file?  Then", 
   "change Request.getInputStream() to read from the file?  Joy."
  ], 
  "revision_id": "301307"
 }, 
 {
  "author": "remm", 
  "date": "2002-10-29T08:21:29.000000Z", 
  "msg": [
   "- Port patch."
  ], 
  "revision_id": "301306"
 }, 
 {
  "author": "remm", 
  "date": "2002-10-26T12:29:56.000000Z", 
  "msg": [
   "- Fix service functionality."
  ], 
  "revision_id": "301305"
 }
]