[
 {
  "author": "tcurdt", 
  "date": "2003-10-07T15:13:20.000000Z", 
  "msg": [
   "always encode to UTF-8 but only sometimes quote as Java String,", 
   "fixes bug #18900"
  ], 
  "revision_id": "30134"
 }, 
 {
  "author": "upayavira", 
  "date": "2003-10-07T09:59:17.000000Z", 
  "msg": [
   "Checksum testing of pages once generated. They're now only saved if the checksum is different.", 
   "This allows improved uploading, e.g. with Ant, but does not speed the building of the site itself.", 
   "It is accessed by adding a <checksums-uri> node into cli.xconf containing a filename referring to a file to store the checksums.", 
   "Note: this should not be considered stable - I will probably improve upon it which will change the way it is configured."
  ], 
  "revision_id": "30133"
 }, 
 {
  "author": "sylvain", 
  "date": "2003-10-06T16:42:39.000000Z", 
  "msg": [
   "Fix bug#<don't remember...>"
  ], 
  "revision_id": "30132"
 }, 
 {
  "author": "stefano", 
  "date": "2003-10-06T16:36:15.000000Z", 
  "msg": [
   "applying patch 20298", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "30131"
 }, 
 {
  "author": "jeremy", 
  "date": "2003-10-06T16:30:41.000000Z", 
  "msg": [
   "Applied patch to CocoonCrawler.java and SimpleCocoonCrawlerImpl.java from unico@hippo.nl (Unico Hommes)"
  ], 
  "revision_id": "30130"
 }
]