[
 {
  "author": "costin", 
  "date": "2003-01-27T23:36:16.000000Z", 
  "msg": [
   "Remove debugging message."
  ], 
  "revision_id": "301489"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-27T23:35:47.000000Z", 
  "msg": [
   "Added a \"type\" attribute, corresponding to the j2eeType or type from the name.", 
   "Make the j2eesuffix ( used internally ) protected, so it won't show in the console."
  ], 
  "revision_id": "301488"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-27T23:33:10.000000Z", 
  "msg": [
   "Remove unneeded param.", 
   "Store the startup time instead of displaying it ( will be visible in the jmx console )", 
   "added missing getter.", 
   "Removed the final - duplication the code inside is too painfull.", 
   "BTW - in the previous commit, I also made StandardContext serializable. It won't", 
   "work ( a lot of other classes are not serializable ), but in time we may get to a point", 
   "where we can cache the configured state of the context and avoid parsing unless needed."
  ], 
  "revision_id": "301487"
 }, 
 {
  "author": "costin", 
  "date": "2003-01-27T23:27:26.000000Z", 
  "msg": [
   "Few changes - sorry for mixing them up in a single commit.", 
   "- use commons-logging", 
   "- one small experiment: change the logger on context startup, so each context can", 
   "log in a separate log. The 'experimental' part is the namming of the log - I'm not", 
   "sure which is best", 
   "- merged the code from mbeans/ directory - the ContextMBean is no longer needed ( but", 
   "some code needs to be fixed - some of the added methods have names that conflict with the", 
   "base class )", 
   "- fixed registration so all servlets will be registered", 
   "- added code to support dynamic addition of Contexts as mbeans ( i.e. using only JMX", 
   "registration ). The Context mbean will register itself with the server.", 
   "- use TldCache to read the Tlds."
  ], 
  "revision_id": "301486"
 }, 
 {
  "author": "amyroh", 
  "date": "2003-01-27T22:19:24.000000Z", 
  "msg": [
   "Fix to return MalformedURLException when the path doesn't begin with a \"/\".", 
   "Bugtraq 4806986."
  ], 
  "revision_id": "301485"
 }
]