[
 {
  "author": "jfarcand", 
  "date": "2003-03-05T21:42:22.000000Z", 
  "msg": [
   "New Servlet 2.4 PDF 2 features:", 
   "- remove web.xml extensibility support", 
   "- add support for SRV.12.3:", 
   "<quote>", 
   "The sub elements under web-app can be in an arbitrary order in this version of the specification. Because of the restriction of XML Schema, The multiplicity of the elements distributable, session-config, welcome-file-list, jsp-config, login-config, and locale-encoding-mapping-list was changed from optional to 0 or more. The containers must inform the developer with a descriptive error message when the deployment descriptor contains more than one element of session-config, jsp-con-fig, and login-config. The container must concatenate the items in welcome-file-list and locale-encoding-mapping-list when there are multiple occurrences. The multiple occurrence of distributable must be treated exactly in the same way as the single occurrence of distributable.", 
   "</quote>"
  ], 
  "revision_id": "301574"
 }, 
 {
  "author": "remm", 
  "date": "2003-03-05T19:09:26.000000Z", 
  "msg": [
   "- Fix incorrect logging.", 
   "- Submitted by Jonathan Baker <jbaker at intac.com>"
  ], 
  "revision_id": "301573"
 }, 
 {
  "author": "remm", 
  "date": "2003-03-05T18:20:04.000000Z", 
  "msg": [
   "- Fix incorrect logging.", 
   "- Submitted by Jonathan Baker <jbaker at intac.com>"
  ], 
  "revision_id": "301572"
 }, 
 {
  "author": "jfarcand", 
  "date": "2003-03-05T05:01:06.000000Z", 
  "msg": [
   "When Tomcat is embedded, there are situations where appBase could be equals to null. In that case, do not set the config file (or most important, do not died)."
  ], 
  "revision_id": "301571"
 }, 
 {
  "author": "jfarcand", 
  "date": "2003-03-05T02:31:47.000000Z", 
  "msg": [
   "Servlet 2.4 new features:", 
   "===================================================", 
   "Add the following methods in ServletRequest, SRV.14.2.16.1.", 
   "public int getRemotePort()", 
   "Returns the Internet Protocol (IP) source port of the client", 
   "or last proxy that sent the request.", 
   "public java.lang.String getLocalName()", 
   "Returns the host name of the Internet Protocol (IP) interface on", 
   "which the request was received.", 
   "public java.lang.String getLocalAddr()", 
   "Returns the Internet Protocol (IP) address of the interface on", 
   "which the request  was received.", 
   "public int getLocalPort()", 
   "Returns the Internet Protocol (IP) port number of the interface", 
   "on which the request was received.", 
   "===================================================", 
   "Please review the patch and let me know if it brokes other Connectors.", 
   "Specifically, is ActionCode.ACTION_REQ_HOST_ATTRIBUTE is an appropriate hook event or should I create one specifically for localAddr and localPort?"
  ], 
  "revision_id": "301570"
 }
]