[
 {
  "author": "costin", 
  "date": "2003-03-12T06:49:50.000000Z", 
  "msg": [
   "Few small improvements.", 
   "If not appname is specified - take the name of the embeding container ( less", 
   "config for the user )", 
   "IMPORTANT: the thread class loader must be set to find login modules", 
   "in container ( like MemoryLoginModule ). For JAAS1.0 - that doesn't", 
   "help ( LoginModules must be in CLASSPATH - jboss actually has a hack", 
   "around it, but it's too complex ), but in JDK1.4 it does work fine.", 
   "If no principal is found ( but login succeded ) - use the user name to create", 
   "a principal.", 
   "Implement the \"Roles\" Group - I'll revert if anyone -1."
  ], 
  "revision_id": "301599"
 }, 
 {
  "author": "costin", 
  "date": "2003-03-12T06:45:32.000000Z", 
  "msg": [
   "Fixes.", 
   "The digester that reads the users.xml file expects a MemoryRealm ( there is", 
   "a cast ) - and a lot is duplicated, so I just extended it.", 
   "Added a lot of debug - I may remove it after it's tested a bit more.", 
   "( it is quite difficult to figure out what's broken without debug,", 
   "and this is a tricky subsystem )", 
   "The last part is just duplicating MemoryRealm."
  ], 
  "revision_id": "301598"
 }, 
 {
  "author": "costin", 
  "date": "2003-03-12T06:41:09.000000Z", 
  "msg": [
   "Deal with the case when Service is used to start the server ( no Server ).", 
   "Remove one more use of the ServerFactory - we already know the Server ( its", 
   "the lifecycle instance )", 
   "Sorry for the extra diff - it seems they had some whitespaces and my editor", 
   "removed them ( I'll try to fix that setting )"
  ], 
  "revision_id": "301597"
 }, 
 {
  "author": "costin", 
  "date": "2003-03-12T06:33:37.000000Z", 
  "msg": [
   "Few getters ( Remy: don't panic, I'm not changing the loader ! ).", 
   "The array will collect the loaders that are set into the class loader", 
   "and allow JMX to view the actual classpath ( if the loader is registered ).", 
   "I also added a bit more info in case something is missing.", 
   "Knowing the exact classpath of a webapp can be extremely usefull when debugging", 
   "strange bugs..."
  ], 
  "revision_id": "301596"
 }, 
 {
  "author": "costin", 
  "date": "2003-03-12T06:28:55.000000Z", 
  "msg": [
   "- remove unused imports", 
   "- switch to commons-logging", 
   "- lazy creation of the deployer. I did it because of some class loader problems ( but", 
   "the problem was elsewere ) - however it is good because we may use a different mechanism.", 
   "The \"deployment\" should be done using JMX - registering / unregistering mbeans", 
   "with JSR77 names should be enough.", 
   "- moved the extra JMX getters from the wrapper in mbeans/", 
   "- when the host mbean is created directly by JMX, register with the engine"
  ], 
  "revision_id": "301595"
 }
]