[
 {
  "author": "remm", 
  "date": "2003-05-22T18:20:03.000000Z", 
  "msg": [
   "- Experiment: Reload = stop + start. This would obviously", 
   "simplify processing. The performance impact is not too big overall (IMO).", 
   "Comments ?", 
   "- Fix a bug where the context is not registered again in JMX after a stop/start,", 
   "which would break mapping."
  ], 
  "revision_id": "301894"
 }, 
 {
  "author": "billbarker", 
  "date": "2003-05-22T03:43:37.000000Z", 
  "msg": [
   "Initial version of the proposal to pass-through all attributes to the protocolHandler, and let it deal.", 
   "Now, only explictly configured attributes are passed through to the Protocol.  It is the Protocol's responsibility to have the correct default attributes configured.  This way, the HTTP/1.1 connector can default the value of \"connectionTimeout\" to one value, and the Jk-Coyote connector can default it to another.", 
   "For now, I'm leaving the getters and setters for all of the different attributes, so that they can still be seen from the JMX consol.  In the transistion, some of the values shown may be wrong because of the paragraph above.", 
   "For now, I'm leaving in the SSL SocketFactory support (for backwards compatibility).  It should be deprecated.  You can configure SSL support without it by e.g. specifying \"property[keystore]=/path/to/my/.keystore\" on the connector."
  ], 
  "revision_id": "301893"
 }, 
 {
  "author": "jfarcand", 
  "date": "2003-05-21T19:04:03.000000Z", 
  "msg": [
   "Fix java.lang.UnsupportedOperationException (seems the Set doesn't support adding new element)."
  ], 
  "revision_id": "301892"
 }, 
 {
  "author": "remm", 
  "date": "2003-05-21T17:49:03.000000Z", 
  "msg": [
   "- Remove the mapping hack for context mapping.", 
   "- Pass the request URI as a parameter, as this avoids rebuilding it."
  ], 
  "revision_id": "301891"
 }, 
 {
  "author": "jfarcand", 
  "date": "2003-05-21T00:54:34.000000Z", 
  "msg": [
   "Unify the way we shutdown the server. Fix a classloading problem when the digester file are under common/lin instead of server/lib."
  ], 
  "revision_id": "301890"
 }
]