[
 {
  "author": "jfarcand", 
  "date": "2003-07-23T00:38:34.000000Z", 
  "msg": [
   "Fix NPE exception when instances attribute is null."
  ], 
  "revision_id": "302039"
 }, 
 {
  "author": "luehe", 
  "date": "2003-07-22T21:05:38.000000Z", 
  "msg": [
   "Moved X-Powered-By property for servlets from Host/Context to", 
   "CoyoteConnector.  If property is set to TRUE, CoyoteAdapter adds", 
   "X-Powered-By response header with value \"Servlet/2,4\".", 
   "Turned X-Powered-By property for JSPs into a configurable Jasper compilation", 
   "option. If set to TRUE, the generated servlet will add X-Powered-By", 
   "response header with value \"JSP/2.0\"."
  ], 
  "revision_id": "302038"
 }, 
 {
  "author": "remm", 
  "date": "2003-07-22T19:02:50.000000Z", 
  "msg": [
   "- Similar to the other logging changes.", 
   "- Log the root cause."
  ], 
  "revision_id": "302037"
 }, 
 {
  "author": "remm", 
  "date": "2003-07-22T18:51:22.000000Z", 
  "msg": [
   "- Use the context logger for all webapp related error messages.", 
   "- Remove RequestListenerValve and merge into StandardContextValve.", 
   "This is a needed feature for servlet compliance, so this should be in the core.", 
   "- Note: maybe separate arrays should be introduced for the distinct listener", 
   "types, since some have a significant performance impact (such as", 
   "RequestAttributeListener). A lot of listener types were introduced in Servlet 2.4", 
   "and the original TC 4.0 design should probably be extended."
  ], 
  "revision_id": "302036"
 }, 
 {
  "author": "luehe", 
  "date": "2003-07-21T19:05:51.000000Z", 
  "msg": [
   "Added support for X-Powered-By response header, as defined by the", 
   "Servlet 2.4 and JSP 2.0 specs.", 
   "The Servlet 2.4 spec defines a special", 
   "X-Powered-By: Servlet/2.4", 
   "header, which containers may add to servlet-generated responses. This", 
   "is complemented by the JSP 2.0 spec, which defines a", 
   "X-Powered-By: JSP/2.0", 
   "header to be added (on an optional basis) to responses utilizing JSP", 
   "technology.", 
   "The goal of these headers is to aid in gathering statistical data", 
   "about the use of Servlet and JSP technology"
  ], 
  "revision_id": "302035"
 }
]