[
 {
  "author": "remm", 
  "date": "2003-08-06T17:50:21.000000Z", 
  "msg": [
   "- Cleanup URL handling, to be consistent with the HTML manager.", 
   "- Don't send extra \"OK\" messages.", 
   "- Fix update flag (which was always false; I think this was pointed out by", 
   "someone before).", 
   "- Use refactored code from the HTML manager so that the config URL is null", 
   "if there's no context file."
  ], 
  "revision_id": "302124"
 }, 
 {
  "author": "remm", 
  "date": "2003-08-06T17:47:46.000000Z", 
  "msg": [
   "- Allow passing a regular path instead of a URL for the WAR to upload.", 
   "- Actually pass the right URL string, including the \"update\" flag."
  ], 
  "revision_id": "302123"
 }, 
 {
  "author": "remm", 
  "date": "2003-08-06T08:58:19.000000Z", 
  "msg": [
   "- Fix problems with the Eclipse test case by extracting all non class resources", 
   "from a JAR on access.", 
   "- This of course has a performance penalty, but is the only way to have", 
   "this use case work. It is not very valid, but I gave up trying to get people to", 
   "change their code.", 
   "- This is needed, because it is the only way to save valuable server resources", 
   "(file descriptors and memory on Unix, plus JAR locking on Windows preventing", 
   "webapp management without a Tomcat restart)."
  ], 
  "revision_id": "302122"
 }, 
 {
  "author": "funkman", 
  "date": "2003-08-05T18:41:50.000000Z", 
  "msg": [
   "Experiment: Use PropertyUtils to obtain the rootCause. This way we can", 
   "also drill into nested JspExceptions or another Throwable object", 
   "which has a 'rootCause' property which returns a Throwable."
  ], 
  "revision_id": "302121"
 }, 
 {
  "author": "remm", 
  "date": "2003-08-05T13:22:03.000000Z", 
  "msg": [
   "- Fix for three related bugs.", 
   "- Bug 22013: The wrapped request must actually override", 
   "getRequestDispatcher. Thanks to Stephane Riviere for the test case.", 
   "- Bug 4690: Fix for cross context sessions scoping (previously, the visible", 
   "session would be the one from the context which first recieved the request).", 
   "- Fix ServletContext.getContext(...) when using the root context. (but the spec should", 
   "really be modified so that it says that only exact matches of the target context", 
   "are allowed)."
  ], 
  "revision_id": "302120"
 }
]