[
 {
  "author": "remm", 
  "date": "2004-06-24T15:28:28.000000Z", 
  "msg": [
   "- More casting removals.", 
   "- Remove logger conflicts between ContainerBase and StandardContext.", 
   "- Redo ContainerBase.logName(), with new category names."
  ], 
  "revision_id": "302979"
 }, 
 {
  "author": "remm", 
  "date": "2004-06-23T16:59:42.000000Z", 
  "msg": [
   "- Tweak some of the pipeline processing to decrease the stack size a little bit more.", 
   "- Remove more debug fields, and replace with checks on the logger."
  ], 
  "revision_id": "302978"
 }, 
 {
  "author": "remm", 
  "date": "2004-06-23T14:00:04.000000Z", 
  "msg": [
   "- Remove another debug flag."
  ], 
  "revision_id": "302977"
 }, 
 {
  "author": "remm", 
  "date": "2004-06-23T13:51:38.000000Z", 
  "msg": [
   "- Remove Logger and all related elements I could find. Some stale stuff is still likely there.", 
   "- Remove as many \"debug\" fields as I could find. Obviously, this is replaced by Log.isDebugEnabled", 
   "so that it is possible to enable debug from one location.", 
   "- Remove useless log methods a little bit everywhere.", 
   "- One big TODO: come up with a nice default log configuration for either JDK 1.4 logging or log4j.", 
   "- I put in some categories names for containers which seemed relatively reasonable for a start,", 
   "but I think these will be changed."
  ], 
  "revision_id": "302976"
 }, 
 {
  "author": "remm", 
  "date": "2004-06-23T08:25:04.000000Z", 
  "msg": [
   "- Move Coyote adapter to o.a.catalina.connector.", 
   "- Remove interfaces for Request/Response and move to concrete classes.", 
   "- Remove a lot of RTTI and casts on Request/Response. I likely missed some, so this is a WIP.", 
   "- I'm using version number 5.5 for this refactoring, as an indication that this is no longer 5.0.x.", 
   "- Move back to the valve pattern of Tomcat 4.0 beta 1 (I feel old now :( ), but without the double chaining.", 
   "The extra robustness of the valve context is nice, but it added complexity (and was slower) and overall wasn't needed.", 
   "- In the end, I didn't remove Logger yet (it'll be my next commit :) )."
  ], 
  "revision_id": "302975"
 }
]