[
 {
  "author": "remm", 
  "date": "2004-07-26T19:34:59.000000Z", 
  "msg": [
   "- Update server minimal as well."
  ], 
  "revision_id": "303034"
 }, 
 {
  "author": "billbarker", 
  "date": "2004-07-26T17:04:04.000000Z", 
  "msg": [
   "Fix version #.", 
   "What ever the next version is that is released from here, it is not going to be called 5.0.x."
  ], 
  "revision_id": "303033"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-26T16:04:02.000000Z", 
  "msg": [
   "- As I discussed earlier, switch to a nicer looking syntax for naming stuff, using setAllProperties. This simplifies the code a lot.", 
   "- Example:", 
   "<Resource name=\"UserDatabase\" auth=\"Container\"", 
   "type=\"org.apache.catalina.UserDatabase\"", 
   "description=\"User database that can be updated and saved\"", 
   "factory=\"org.apache.catalina.users.MemoryUserDatabaseFactory\"", 
   "pathname=\"conf/tomcat-users.xml\" />", 
   "- Remove the horrible ResourceParams, and add new objects for transaction and resourceRefs.", 
   "- At the same time, big cleanup of the code.", 
   "- Removing the (completely useless) facading the Context was doing for the NamingResources object. This is something I couldn't do", 
   "in 4.1.x because we didn't want to change the API. The last thing I didn't remove is some messaging stuff. What's that ?", 
   "- Some tweaking will likely be needed (for example, the save-to-XML code needs to save all the extra properties). However, a lot", 
   "of stuff won't need to be adjusted, as it was using NamingResources (I don't think the naming support in the admin webapp is going", 
   "to need anything).", 
   "- I'm wondering how useful it is to be able to dynamically update the associated naming context. I think we should remove that, and", 
   "just reload the webapp (since I think most webapps won't be able to handle dynamic changes in the ENC). I'll post about that in my", 
   "next progress email."
  ], 
  "revision_id": "303032"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-26T15:54:38.000000Z", 
  "msg": [
   "- When using the antiLocking flag, attempt to remove as much of the temp files when stopping.", 
   "- As it was the case before, remove the work dir when undeploying."
  ], 
  "revision_id": "303031"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-26T15:52:17.000000Z", 
  "msg": [
   "- Update to use a flag for the anti JAR locking code. It isn't as foolproof as the other one, since you can't just delete a WAR or expanded", 
   "folder to undeploy (on Windows, of course).", 
   "- I think the two flags together will cover all the needs."
  ], 
  "revision_id": "303030"
 }
]