[
 {
  "author": "billbarker", 
  "date": "2004-07-24T07:07:37.000000Z", 
  "msg": [
   "Load the Connector classes from their new package, with their new names."
  ], 
  "revision_id": "303024"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-23T22:57:35.000000Z", 
  "msg": [
   "- First part of the refactoring of the deployer, where HostConfig will be the only entry point for automated deployments", 
   "(= deployments where Container.addChild isn't directly used, as in the embedded world) and redeployments.", 
   "- This will allow removing a lot of the complexity involved with the fact that there was 3 components which had", 
   "deployment logic inside (HostConfig, StdHostDeployer, and the manager webapp). Now the manager webapp will \"talk\"", 
   "to the HostConfig.", 
   "- Some hooks on HostConfig are not there yet.", 
   "- Auto redeploy checks aren't done in HostConfig yet.", 
   "- ContextConfig is now (logically) in charge of parsing the context config files.", 
   "- New default web.xml and context config files have been added. This is not tested (actually, little of this is testedright now: the default", 
   "setup deploys ok, but more complex setups might not). Having default context config files should allow removing DefaultContext and its", 
   "complexity.", 
   "- The new default context config files are:", 
   "- conf/context.xml (so this is for all contexts)", 
   "- conf/<engine>/<host>/context.xml.default (per host)", 
   "- The new default web.xml is:", 
   "- conf/<engine>/<host>/web.xml.default (per host)", 
   "- Some of the paths to files are hardcoded, but I think I'll add configurability for most of them."
  ], 
  "revision_id": "303023"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-23T22:46:08.000000Z", 
  "msg": [
   "- enum -> enumeration (JDK 1.5 update)."
  ], 
  "revision_id": "303022"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-23T22:38:29.000000Z", 
  "msg": [
   "- JDK 1.5 compat."
  ], 
  "revision_id": "303021"
 }, 
 {
  "author": "yoavs", 
  "date": "2004-07-23T14:13:41.000000Z", 
  "msg": [
   "Addressed Bugzilla 30245, Connector documentation.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "303020"
 }
]