[
 {
  "author": "yoavs", 
  "date": "2004-07-26T15:39:13.000000Z", 
  "msg": [
   "Addressed Bugzilla 29831.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "303029"
 }, 
 {
  "author": "yoavs", 
  "date": "2004-07-26T15:34:31.000000Z", 
  "msg": [
   "Addressed Bugzilla 29826.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "303028"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-26T10:56:54.000000Z", 
  "msg": [
   "- Add logic for avoiding locking on Windows. This takes a very heavy handed approach, but after trying many other methods, I think it's the", 
   "only way to properly address the issue and allow real hot (re)deployment.", 
   "- It's disabled by default, and there's a new antiResourceLocking attribute on Context.", 
   "- I think I'll leave in the lighter anti JAR locking code in the CL, but disabled by default (and with another similar flag on Context). It could", 
   "address different needs, and is less intrusive, as the webapp stays where it is."
  ], 
  "revision_id": "303027"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-26T08:09:21.000000Z", 
  "msg": [
   "- Add code to handle resource relaoding.", 
   "- Add one extra element to Context (I couldn't find a way to avoid it).", 
   "- Add a global context.xml file, to define two basic reload resources.", 
   "- Now, I'll do the new anti locking code."
  ], 
  "revision_id": "303026"
 }, 
 {
  "author": "remm", 
  "date": "2004-07-25T23:35:37.000000Z", 
  "msg": [
   "- Implement a significant amount of reload/redeployment.", 
   "- Since I'm a happy (?) user of MickeyMouse(TM) OS (aka Windows), I can't really test stuff without the anti-locking code", 
   "which I haven't implemented yet. I'll do that tomorrow (this seems simple).", 
   "- I used some ideas from Peter, and managed to notice code I could remove. Thanks.", 
   "- Please don't file bugs on this until I've at least tested a bit :)", 
   "- I need to add one extra method and refactor a bit to allow usage through the manager webapp (the manager webapp", 
   "will want synced operation, I think, so the background thread won't do it in that case - although it would do the job", 
   "eventually).", 
   "- I'll also add the new extra configuration items tomorrow, such as the \"watchedfile\" feature (that's simple)."
  ], 
  "revision_id": "303025"
 }
]