[
 {
  "author": "luehe", 
  "date": "2005-03-02T19:27:11.000000Z", 
  "msg": [
   "Consider the case where original request was mapped to welcome page.", 
   "In this case, the mapped welcome page (and not the original request", 
   "URI!) needs to be the target of hasResourcePermission().", 
   "This is consistent with the change that had been made in findSecurityConstraints().", 
   "BTW, shouldn't request.getDecodedRequestURI() return the mapped", 
   "welcome page (instead of the original URI) in this case?", 
   "In other words, shouldn't the path passed to", 
   "mappingData.requestPath.setString(pathStr)", 
   "in Mapper.java be propagated to the request object associatd with the", 
   "mappingData?"
  ], 
  "revision_id": "303729"
 }, 
 {
  "author": "remm", 
  "date": "2005-03-02T18:30:45.000000Z", 
  "msg": [
   "- Add JULI, a Java Util Logging Implementation.", 
   "- It supports per classloader configuration, using standard JDK properties files, with optional extensions to be able to flexibly assign handlers to loggers.", 
   "- The package includes a rotating handler, since zillions of people have lamented its departure in 5.5.x (even if it didn't contain anything useful anymore).", 
   "- This builds a small JAR, which is then added to the classpath by bootstrap.jar.", 
   "- I may need to fix packaging a little after that change; sorry for the trouble.", 
   "- I'll add comments and docs soon.", 
   "- This is based on code subimmted by Lachlan O'Dea in bug 33143, and is likely to move to commons (once I get comfortable enough with svn)."
  ], 
  "revision_id": "303728"
 }, 
 {
  "author": "remm", 
  "date": "2005-03-02T18:14:06.000000Z", 
  "msg": [
   "- Fix context classloader binding during loader initialization (it was set to null before).", 
   "- The webapp loader should only be retrieved when the context classloader is set to the webapp's classloader. The initialization of", 
   "StandardContainer violates this by having its basic valve instantiated, which in turns gets the logger right away. This means it will use", 
   "whatever logging configuration is defined for the server classloader :("
  ], 
  "revision_id": "303727"
 }, 
 {
  "author": "billbarker", 
  "date": "2005-03-01T05:46:17.000000Z", 
  "msg": [
   "Update for new Struts structure (so Gump can be happy again someday).", 
   "This won't stop the nags until Gump starts building struts-taglib, but it's a start."
  ], 
  "revision_id": "303726"
 }, 
 {
  "author": "keith", 
  "date": "2005-02-27T21:33:48.000000Z", 
  "msg": [
   "Backport to 50 branch of fix to allow servlets to return", 
   "multi-gb content-length headers", 
   "- allow servlets to set content-length > Integer.MAX_VALUE via setHeader()", 
   "- if servlet sets a content length in this manner, getContentLength will", 
   "return -1 if cl > Integer.MAX_VALUE, so test getContentLengthLong to see", 
   "if the cl was set."
  ], 
  "revision_id": "303725"
 }
]