[
 {
  "author": "costin", 
  "date": "2001-06-06T05:54:11.000000Z", 
  "msg": [
   "The initial step in creating a generator-independent AST and improving", 
   "the modularity of the generator.", 
   "Not used right now, work in progress."
  ], 
  "revision_id": "304759"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-06T05:53:17.000000Z", 
  "msg": [
   "This used to be TagCache. Now the information about the tag is stored", 
   "in the TagInfoImpl, a lot of code will be much simpler ( and it's symetrical", 
   "with TagLibraryInfoImpl )"
  ], 
  "revision_id": "304758"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-06T05:52:10.000000Z", 
  "msg": [
   "Moved from generator, are basically informations associated with the", 
   "jsp page.", 
   "The TagLibraries is important because the parser will depend on it", 
   "( it needs to validate and change behavior based on the declarations )"
  ], 
  "revision_id": "304757"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-06T05:50:28.000000Z", 
  "msg": [
   "Informations collected about the JSP page - including the tree of generators", 
   "that will be used to generate the code ( soon to be changed to visitors", 
   "instead of hardcoded )", 
   "This used to be part of JspParseEventListener.", 
   "It'll simplify a lot the SAX parser, etc."
  ], 
  "revision_id": "304756"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-06T05:48:38.000000Z", 
  "msg": [
   "Refactoring of JspParseEventLisener - this is the jasper-independent", 
   "java code generator. It manage the line number, indentation, etc. More will", 
   "come to simplify the generation.", 
   "It is prefered to use specialized methods ( setClassName, setPakage, etc ) -", 
   "instead of prinln(\"package foo;\") - that will help with direct code generation", 
   "( since a similar pattern will be used ), and may even allow using the", 
   "same code.", 
   "( nothing says that JavaSourceGenerator can generate only java, and not", 
   "directly bytecode ).", 
   "The intention is to create a AST and do some post-processings, detect if", 
   "we \"understand\" everything and generate bytecode directly ( if in development", 
   "mode - i.e. compilation times matters. For deployment it's still better", 
   "to compile via java )"
  ], 
  "revision_id": "304755"
 }
]