[
 {
  "author": "costin", 
  "date": "2001-06-16T20:11:40.000000Z", 
  "msg": [
   "Removed the (old) loader and mangler.", 
   "It'll be replaced with Mangler33 for versioned names and Glenn's separate", 
   "URL/jsp file for unversioned names.", 
   "( right now only the first option is implmented )"
  ], 
  "revision_id": "304819"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-13T01:11:37.000000Z", 
  "msg": [
   "2 bug fixes.", 
   "- JspInterceptor - need to reset depend manager after compiling. Before", 
   "compiling the DM set expired ( shouldReload=true ), and unless we reset it", 
   "the field will remain as expired, even if we recompile.", 
   "- In Char writer, the line number fix introduced a regression - it does", 
   "print() then println() ( which indents ). ( previous code had a \\n - that", 
   "was bad because it braked the line numbering ). Now use printlnNI ( non-indent)"
  ], 
  "revision_id": "304818"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-12T15:45:28.000000Z", 
  "msg": [
   "Same kind of changes to tomcat33 adapter.", 
   "A lot of code still need to be moved either in the base class for", 
   "JavaCompiler ( detection, etc) or in toolbox.", 
   "Note: there is a small bug in JspInterceptor reloading introduced by the", 
   "refactoring, I'm working on it ( the deps system need a bit of abstraction", 
   "in order to allow the same toolbox aproach and integrate with Glenn's one", 
   "class loader per jsp )."
  ], 
  "revision_id": "304817"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-12T15:42:17.000000Z", 
  "msg": [
   "EmbededServletOptions - transformed in a toolbox component, in", 
   "liaison.", 
   "JspCompiler - no longer needed, we can use the base class in core.", 
   "ServletEngine/TomcatServletEngine - not used in the current code, the", 
   "idea moved to ContainerLiaison.", 
   "JspLoader - not needed as a base class for JasperLoader, didn't provide", 
   "any benefit but confused things."
  ], 
  "revision_id": "304816"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-12T15:39:25.000000Z", 
  "msg": [
   "Implement the changes in core and toolbox.", 
   "Few changes in JasperLoader to make it independent of jasper ( try to make", 
   "it an independent tool, might be usefull )", 
   "Prepare to remove the deps on JasperLoader from JspServlet and start using", 
   "URLClassLoader ( or SimpleClassLoader ) via jdkcompat."
  ], 
  "revision_id": "304815"
 }
]