[
 {
  "author": "costin", 
  "date": "2001-06-16T20:43:24.000000Z", 
  "msg": [
   "More duplicated code is out.", 
   "Prepare to add the jikes autodetection ( to be shared by all users of JavaCompiler ).", 
   "The out is managed by JavaCompiler automatically.", 
   "Prepare for recycling the object.", 
   "Prepare to consolidate all the code related with compilation and simplify the interfaces."
  ], 
  "revision_id": "304824"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T20:41:12.000000Z", 
  "msg": [
   "Adapt to the changed signature in JspPageInfo ( it was very confusing to", 
   "have different method names for the same thing - and the same info in 2 classes ).", 
   "Mangler is now used for all info related with the java/class file names."
  ], 
  "revision_id": "304823"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T20:39:46.000000Z", 
  "msg": [
   "Eliminate some duplicated code ( all implementations were checking for null", 
   "and default to java.io.tmpdir )"
  ], 
  "revision_id": "304822"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T20:38:41.000000Z", 
  "msg": [
   "Few more comments.", 
   "Few signature changes to allow \"singleton\" per webapp ( one ContainerLiaiason", 
   "instance per contextin instead of page - a lot of savings, plus we can cache things in", 
   "it)", 
   "Start to convert the last static methods to instance ( messages ). Also the", 
   "pattern for logging no longer require expensive object allocations.", 
   "logKey method is a replacement for log( containerL.getString( key ), new Object[] )...", 
   "( right now is doing exactly the same thing - but later on we can optimize it in", 
   "one place )"
  ], 
  "revision_id": "304821"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T20:35:20.000000Z", 
  "msg": [
   "Compiler is the main helper to convert jsp to java and to class.", 
   "This fix eliminates a lot of duplicated code from various liaisons, moves logging", 
   "and all common operations here and cleans up ( a bit ) the process.", 
   "The compile() method was removed - it didn't provide enough control on error", 
   "reporting and guessing.", 
   "To compile java files you need to create a JavaCompiler and use it - then we", 
   "can access the message ( and process it to extract line numbers and map them )."
  ], 
  "revision_id": "304820"
 }
]