[
 {
  "author": "costin", 
  "date": "2001-06-16T22:06:28.000000Z", 
  "msg": [
   "Fewer messages in JspInterceptor.", 
   "Started to add the mappings in JSG, to enable compiler error mapping to", 
   "jsp lines."
  ], 
  "revision_id": "304834"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T21:11:17.000000Z", 
  "msg": [
   "A small change, jars are created in the same target ( it's easier to", 
   "work with while testing JspSerlvet, where the location and content of the", 
   "jars might be different )"
  ], 
  "revision_id": "304833"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T21:09:47.000000Z", 
  "msg": [
   "Fixes to make it compile - I haven't tested it so far.", 
   "One big change - I split the very long methods in simpler ones, and tried to", 
   "simplify a bit the code to make it easier to understand ( so it can be fixed later ).", 
   "Important: both cli and servlet are ( temporarily ) using URLClassLoader ( i.e", 
   "do not work with JDK1.1 ). This can be fixed without too much effort, but it's not", 
   "a big priority ( since we still have JspInterceptor supporting JDK1.1 )."
  ], 
  "revision_id": "304832"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T21:06:14.000000Z", 
  "msg": [
   "The first serious cleanup for JspServlet.", 
   "I tested it and it seems to work fine ( assuming you get the right classpath :-).", 
   "I'll send a mail with the details on using JspServlet, it needs jasper.jar", 
   "and all required deps in the classpath ( not available in tomcat33, since the", 
   "container is isolated - so you can either put it in common or in the webapp ).", 
   "There are few issues regarding the use of JspServlet, the code is still far behind", 
   "the interceptor - but could be used for simple things.", 
   "The good news is that most of the spaghetti that ended up in JspServlet is", 
   "gone, I hope most people will be able to understand the code now ( I had big problems", 
   "with that )."
  ], 
  "revision_id": "304831"
 }, 
 {
  "author": "costin", 
  "date": "2001-06-16T21:02:35.000000Z", 
  "msg": [
   "Split JspServletWrapper out of JspServlet, cleaned up a bit.", 
   "JspServlet acts as a servlet container for the generated JSPs, since the container", 
   "might not expose the needed API.", 
   "( if it does - it's better to implement the Liaison and use the JspIntereptor model)", 
   "This needs more testing and merging of fixes from the real container."
  ], 
  "revision_id": "304830"
 }
]