[
 {
  "author": "kinman", 
  "date": "2002-05-24T00:35:41.000000Z", 
  "msg": [
   "- Applied the patch by Denis Benoit, with the following changes.", 
   "1. Setting the state back to RELEASE in the \"if\" branch.", 
   "2. Move the tag stack cleanup from the catch to the finally block.", 
   "The reason for 2. is to handle the case where the doAfterBody returns", 
   "a SKIP_BODY, and the when the stack needs to be properly clean up.", 
   "There may still be problems when exceptions ouccur, and the catch block", 
   "would be executed before the finally block.  The \"out\" referenced in", 
   "in the catch block may be the wrong one.  But I can image anyone can do", 
   "anything with out when this happen, so i left the code the way it is now."
  ], 
  "revision_id": "304909"
 }, 
 {
  "author": "remm", 
  "date": "2002-05-23T23:34:45.000000Z", 
  "msg": [
   "- Misc improvements (non static, no sync)."
  ], 
  "revision_id": "304908"
 }, 
 {
  "author": "kinman", 
  "date": "2002-05-23T21:29:38.000000Z", 
  "msg": [
   "- Set the default content type only after all page directives are processed.", 
   "Also, the top level page sets the default, i.e. if a non-xml page includes", 
   "a xml page, the default content type is \"text/html\" and not \"text/xml\"."
  ], 
  "revision_id": "304907"
 }, 
 {
  "author": "remm", 
  "date": "2002-05-23T06:53:23.000000Z", 
  "msg": [
   "- Add the System.err capture class, as well as the new Ant based compiler.", 
   "- Appears to be working, including compilation error reports, and fixes", 
   "problems with JSTL (at least on JDK 1.3 and 1.4; on JDK 1.2, some compiler", 
   "other than javac will have to be used).", 
   "- Using something other than the Ant default Java compiler is not", 
   "implemented yet.", 
   "- Known issue: will refuse to compile JSPs (even valid ones) if one JSP failed", 
   "to compile before, until it is corrected.", 
   "To fix this, the generated Java file should be moved to a separate", 
   "directory before compiling, as Jasper is unable to compile", 
   "individual files."
  ], 
  "revision_id": "304906"
 }, 
 {
  "author": "kinman", 
  "date": "2002-05-20T18:02:56.000000Z", 
  "msg": [
   "- Fixed 8565. resolveEntity returns null instead of throwing an exception"
  ], 
  "revision_id": "304905"
 }
]