[
 {
  "author": "remm", 
  "date": "2004-08-16T23:52:11.000000Z", 
  "msg": [
   "- Move dependencies and stuff around.", 
   "- Add download for JDT (the poor server is going to suffer ...), with repackaging (the JDT JAR is quite big, and", 
   "we only need a fraction of it). The JDT packaging isn't very good overall, and unfortunately there's a 14MB download", 
   "to end up with a 900KB JAR in the end.", 
   "- Move JMX and Xerces to the compat bundle."
  ], 
  "revision_id": "306039"
 }, 
 {
  "author": "remm", 
  "date": "2004-08-16T23:48:36.000000Z", 
  "msg": [
   "- Add JDT support.", 
   "- The plugin system is quite bad but works (I did this on the train, which was very late, but still not late enough", 
   "for me to come up with something better): if JDT isn't there, use Ant.", 
   "- Error mapping is implemented with JDT.", 
   "- JDT is about twice as fast as javac, while being less than 1MB, and loading source dependencies from the", 
   "context classloader (this should help a lot for servers with disk trashing during compilation; of course, the code", 
   "generation is a very expensive step as well). This will allow Tomcat to run on a JRE only as well.", 
   "- I didn't test the speed of the generated bytecode yet against the javac generated bytecode for the same class", 
   "(Jikes used to be bad at that).", 
   "- The code was stolen from Cocoon (which removed their author tags so I can't credit anyone for the good code :( )."
  ], 
  "revision_id": "306038"
 }, 
 {
  "author": "kinman", 
  "date": "2004-08-16T22:35:37.000000Z", 
  "msg": [
   "- Close any InputStream open in JspDocumentParser."
  ], 
  "revision_id": "306037"
 }, 
 {
  "author": "", 
  "date": "2004-08-11T00:50:28.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'TOMCAT_5_0_28'."
  ], 
  "revision_id": "306036"
 }, 
 {
  "author": "luehe", 
  "date": "2004-08-11T00:50:28.000000Z", 
  "msg": [
   "Ported fixes for:", 
   "- Bugzilla 30291 (\"Smap for a tag should not include its body\")", 
   "- Bugzilla 30289 (\"Incorrect Smap for multiple line java expression\")"
  ], 
  "revision_id": "306035"
 }
]