[
 {
  "author": "brett", 
  "date": "2005-10-07T04:22:08.337315Z", 
  "msg": [
   "remove release poms"
  ], 
  "revision_id": "306999"
 }, 
 {
  "author": "bodewig", 
  "date": "2005-10-07T04:21:43.393401Z", 
  "msg": [
   "cleanup provided by Kev Jackson"
  ], 
  "revision_id": "306998"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-10-07T04:18:44.134271Z", 
  "msg": [
   "changes ...", 
   "o added new accessControlEnabled property to the startup configuration", 
   "this property controls whether or not the authorization subsystem is", 
   "enabled or not - by default it is disabled and must be turned on", 
   "o made admin user bypass all permission checks", 
   "o added entryACI and subentryACI to the apache schema", 
   "o implemented and passed tests for authz with add ops .. still need more tests", 
   "o fixed bug in ACDFEngine where on add ops entry lookups in database were", 
   "failing", 
   "o fixed bug in SubentryService where we were trying to clone null objects", 
   "and were getting a NPE", 
   "o added public operation in SubentryService to determine the set of subentry", 
   "operational attributes within an entry that is about to be added ... other", 
   "services like authz cannot figure this out since they do not have access to", 
   "the subtree cache.  This service must be offered to other services that need", 
   "to determine if an entry to be added is included in the collections of", 
   "subentries."
  ], 
  "revision_id": "306997"
 }, 
 {
  "author": "rwatler", 
  "date": "2005-10-07T04:14:26.404965Z", 
  "msg": [
   "- correct recursion bug when nested menu was constructed for empty folder", 
   "- extend folder view test to include visibility, (i.e. hidden), test on children", 
   "to prevent empty folders to be returned as valid children when forming", 
   "site views for menu construction"
  ], 
  "revision_id": "306996"
 }, 
 {
  "author": "brett", 
  "date": "2005-10-07T04:13:42.130824Z", 
  "msg": [
   "remove left over from release"
  ], 
  "revision_id": "306995"
 }
]