[
 {
  "author": "geirm", 
  "date": "2005-10-08T04:16:58.742992Z", 
  "msg": [
   "register contribution to harmony by daniel lydick (harmony-6 in JIRA)"
  ], 
  "revision_id": "307254"
 }, 
 {
  "author": "nadiramra", 
  "date": "2005-10-08T04:10:15.376263Z", 
  "msg": [
   "Casting of a return object of class AXIS_ARRAY not correct.", 
   "In the code, an attempt is made to cast the AXIS_ARRAY to a", 
   "reference of type xsd__[TYPE]_Array which is impossible since", 
   "there is no relationship between the two classes.", 
   "Instead, a temp variable will be used followed my a memcpy", 
   "from the temp variable to the xsd__[TYPE]_Array variable.", 
   "This is what is done on other places in the code."
  ], 
  "revision_id": "307253"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-10-08T03:59:52.295420Z", 
  "msg": [
   "Migrate the WSM sandbox into the trunk/ line.", 
   "This significantly changes the architecture of the build-time of WSM to using the APT Mirror APIs with a pluggable abstraction for creating the web service object model from Java reflection info or from an XMLBean.", 
   "This is a *work in progress*; I wouldn't be surprised if this broke existing .jws files, though the change passes both the WSM and web service control test suites.  In fact, the JSR 181 annotation processing isn't even fully implemented yet.", 
   "Help welcom on making this real, but this is a good start.  I'll continue working on cleaning this up; the messiest part is the handling of type information.  One of the big changes here was switching from using java.lang.Class to java.lang.String when representing types.  There's an aptly named class HackUtils that is used to do simple conversion from Class -> String, but this needs lots more work and cleanup.", 
   "BB: self", 
   "Tests: WSM + system controls pass"
  ], 
  "revision_id": "307252"
 }, 
 {
  "author": "pquerna", 
  "date": "2005-10-08T03:52:53.175496Z", 
  "msg": [
   "Make sure the data we are copying from is big enough."
  ], 
  "revision_id": "307251"
 }, 
 {
  "author": "gregames", 
  "date": "2005-10-08T03:47:15.338860Z", 
  "msg": [
   "remove the recycled_pool variable to keep it more in sync with worker.", 
   "event already had logic in the listener thread error legs to prevent", 
   "leaking ptrans, so this is mostly cosmetic."
  ], 
  "revision_id": "307250"
 }
]