[
 {
  "author": "psmith", 
  "date": "2003-09-01T02:00:19.000000Z", 
  "msg": [
   "Additional support/delegate class to handle the work", 
   "load of the LoggerNameModel.  Other class that", 
   "wish to implement the model interface but don't wish", 
   "to burden themselves with the effort can delegate to this", 
   "class."
  ], 
  "revision_id": "307559"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-01T01:59:19.000000Z", 
  "msg": [
   "For consistency, this Listener interface should extend", 
   "from EventListener interface (and the swing EventListenerList", 
   "support/delegate class requires this, handy for marking anyway)."
  ], 
  "revision_id": "307558"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-29T05:53:36.000000Z", 
  "msg": [
   "Added LoggerNameTreeModel and associated infrastructure.", 
   "Work in progress.", 
   "The rationale here is to provide a thin interface", 
   "that represents something containing a set of Logger names", 
   "which can notify listeners when a new, unique Logger name", 
   "turns up in the container.", 
   "The Model side of thing then can be notified of the new", 
   "Logger name arriving via the receiving events, and", 
   "adjust itself accordingly.", 
   "This TreeModel will then be used to allow the user to", 
   "specify which Logger's to display, and at what Level", 
   "to display them"
  ], 
  "revision_id": "307557"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-28T23:56:57.000000Z", 
  "msg": [
   "When there is no Receivers defined, it was saying \"(Unknow Type)::...\" which is a bit silly", 
   "Also ensured appropriate Icon is used, a couple of spots", 
   "it was using inappropriate icons.", 
   "Also added Tooltip text to each Receiver node so the user", 
   "has a bit more idea about what they can do."
  ], 
  "revision_id": "307556"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-28T23:55:42.000000Z", 
  "msg": [
   "* Added support for creating SocketHubReceiver via GUI", 
   "* Refactored the generic Receiver creation process slightly, added separators between Receivers with different first characters.", 
   "* Updated some docs"
  ], 
  "revision_id": "307555"
 }
]