[
 {
  "author": "psmith", 
  "date": "2003-09-03T00:44:55.000000Z", 
  "msg": [
   "fix for LogPanel registering itself as a listener for all", 
   "identifiers.  This would have the affect of all Log tabs", 
   "receiving all events.", 
   "LogPanel now is just interested in it's own identifier's events."
  ], 
  "revision_id": "307584"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-03T00:39:29.000000Z", 
  "msg": [
   "This is a checkpoint commit on the way to converting", 
   "from the use of Vectors for event information, into native LoggingEvent", 
   "objects.", 
   "The ChainsawAppenderHandler now does no conversion", 
   "of the incoming events, but bundles them up into batches", 
   "and dispatches them to listeners, leaving it up to the", 
   "listener to do any needed conversion as necessary.", 
   "LogUI and LogPanel are now a little more decoupled.  LogUI", 
   "now has an inner helper class that is a batch listener that is", 
   "there purely to listen for new pane identifiers and create", 
   "new LogPanels as necessary.", 
   "LogPanel now implements the event batch listener interface", 
   "and gets added as listener on creation time and from that", 
   "point on is responsible for receiving it's own events.", 
   "At this point LogPanel still decodes/formats each LoggingEvent", 
   "into a Vector as a final step, but that will change shortly-ish."
  ], 
  "revision_id": "307583"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-03T00:31:17.000000Z", 
  "msg": [
   "disable the Edit Logger action while it does nothing."
  ], 
  "revision_id": "307582"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-02T22:24:08.000000Z", 
  "msg": [
   "Added accelerator to the toggle of the Logger tree (ALT-T), plus updated", 
   "the Welcome html to reflect that.", 
   "Modified the Expand/Collapse icons to be just +/- characters", 
   "rather than the magnify icon, as this is more intuitive.", 
   "Will use the Magnify etc icons for a \"Focus On..\" concept", 
   "similar to Eclipse's Hierarchy view, which effectively places a simple", 
   "logger filter on the model."
  ], 
  "revision_id": "307581"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-02T08:19:59.000000Z", 
  "msg": [
   "Added collapse current node's children action, button, and icon."
  ], 
  "revision_id": "307580"
 }
]