[
 {
  "author": "psmith", 
  "date": "2003-09-11T09:42:31.000000Z", 
  "msg": [
   "If the selected L&F is not Metal, then the No Receiver Warning dialog", 
   "looks out of place, as it was initialised before the L&F is loaded from", 
   "the preferences."
  ], 
  "revision_id": "307629"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-11T04:59:24.000000Z", 
  "msg": [
   "Can now view the full Stack trace in a pop up dialog."
  ], 
  "revision_id": "307628"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-11T03:35:05.000000Z", 
  "msg": [
   "Modifications so that the Throwable Column can be", 
   "\"edited\", and by that I mean that selected a Throwable", 
   "cell entry displays a non-editable label, with an associated", 
   "\"...\" button that can be clicked.", 
   "This mechanism will be used to display a Popup containing", 
   "the display of the full stack trace, in standard format.", 
   "Eventually this class will be refactored somewhat to share", 
   "functionality to be used for NDC, MDC, and Properties."
  ], 
  "revision_id": "307627"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-10T23:03:07.000000Z", 
  "msg": [
   "Refactored LogPanel and Menu & Toolbar class so they are decoupled.", 
   "LogPanel is now responsible for it's own undocked Toolbar", 
   "actions.", 
   "The find option now at least doens't cause a ClassCastException,", 
   "but it's still operating a little oddly.  Will replace this mechanism", 
   "with a series of Finder-style objects."
  ], 
  "revision_id": "307626"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-10T03:18:33.000000Z", 
  "msg": [
   "a large number of changes done as a further effort to decouple", 
   "LogPanel from LogUI.  LogPanel now only needs a reference", 
   "to the StatusBar, and this too can be eventually removed", 
   "by replacing with a listener style framework. (coming", 
   "soon).", 
   "LogPanel now contains all the unique values of LoggingEvents", 
   "in the new FilterModel.", 
   "One caveat of this change is that the Undocked window now", 
   "has no Toolbar, further effort required to relink this in, but", 
   "the undocked window is is still usable if you use the right", 
   "click menu."
  ], 
  "revision_id": "307625"
 }
]