[
 {
  "author": "psmith", 
  "date": "2003-12-11T22:31:29.000000Z", 
  "msg": [
   "Refactored the LogPanelPreferencePanel so that we can", 
   "have a common preference style panel.", 
   "Added an application-wide Preference panel to expose", 
   "a GUI for the user to tweak the ApplicationPreferenceModel.", 
   "Currently there is a bug where the \"ShowNoReceiver\" checkbox", 
   "is not tracking with the models actual value, but if you uncheck", 
   "it and exit Chainsaw, the correct value is saved. The", 
   "next time you start Chainsaw the warning dialog is not displayed", 
   "as per the models value, but the checkbox is still ticked."
  ], 
  "revision_id": "307764"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-12-11T06:30:56.000000Z", 
  "msg": [
   "Added assertions to rules to prevent problems during parsing of the stack (used by expressionrule).  Note that the 'focus on' textfield's tooltip displays the expression's error."
  ], 
  "revision_id": "307763"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-12-11T06:10:27.000000Z", 
  "msg": [
   "removed debug msgs"
  ], 
  "revision_id": "307762"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-12-11T05:45:59.000000Z", 
  "msg": [
   "added 'identifierExpression' support for tab routing to accept any set of space-delimited text or fields supported by LoggingEventFieldResolver.", 
   "You currently need to change chainsaw.settings.properties in your .chainsaw directory (not while it's running) if you want to change the value, but an application-wide preferences panel will be available soon."
  ], 
  "revision_id": "307761"
 }, 
 {
  "author": "psmith", 
  "date": "2003-12-11T02:59:01.000000Z", 
  "msg": [
   "Modified so LogUI (the 'app') uses an ApplicationPreferenceModel", 
   "which will load and save it-' own settings.  We can", 
   "add new properties to this.", 
   "Also added a \"Don't show me this again\" option for", 
   "the No Receivers warning panel.", 
   "Eventually there will be an application wide settings", 
   "Preference panel in a similar style to the LogPanel's", 
   "preferences."
  ], 
  "revision_id": "307760"
 }
]