[
 {
  "author": "sdeboy", 
  "date": "2003-11-09T09:59:28.000000Z", 
  "msg": [
   "added color rule support to chainsaw", 
   "* implemented support for expression-based color rules and a colorpanel UI for building the expressions and defining the colors.  Colors aren't yet written to disk so color support is a work in progress, but seems very usable.", 
   "* updated welcomepanel load process to avoid null pointer in html load step", 
   "* modified rules to clarify parameters, increased visibility where necessary", 
   "* refactored expression rule context (a popup menu which assists in building rule expressions) and added support in colorpanel UI", 
   "* made the chainsawsplash a child of the main window", 
   "* modified tablecolorizingrenderer - changed colorizer (passed in now from logpanel)", 
   "* removed socket exception throws from log output on socketreceiver/xmlsocketreceiver - logged as a warn without stack trace"
  ], 
  "revision_id": "307734"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-11-02T19:53:48.000000Z", 
  "msg": [
   "Bug fix commit", 
   "Changes:", 
   "* build.xml - copy logger.dtd into jar", 
   "* locationinfo - non-log4j apps may only specify a subset of the locationinfo fields (the rest would be null), a check was added to prevent an NPE on each accessor", 
   "* loggingevent - Added locationInformationExists method (getLocationInfo creates a location info if it does not exist), and added exist checks to code as needed to prevent location info construction", 
   "* loggingevent - modified setProperty behavior, if value is null, the property is removed", 
   "* receiverpanel - add xmlsocketreceiver support(built-in support for reception of xml-formatted log4j events via tcp socket)", 
   "* utillogginglevel - modified intvalues so that the lowest value is greater than log4j's debug level intvalue (so the appender skeleton would forward the events correctly with threshold set to debug)", 
   "* fileloadaction - when attempting to load an xml file, directories are displayed as well as xml files", 
   "* modified thread code in chainsawappenderhandler in an attempt to improve performance", 
   "* multicastappender/udpappender - removing internally specified properties (log4japp/log4jmachine name) so the rest of the appenders in the appender chain could specify these properties themselves or the default behavior of using the remote machine could be used", 
   "* multicastappender/receiver, udpappender/receiver added encoding support (chartset) as a property.  If none set, the default system encoding is used.", 
   "* xmlsocketreceiver/udpreceiver/multicastreceiver - added pausable support (useful in receiver panel)"
  ], 
  "revision_id": "307733"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-10-31T08:29:53.000000Z", 
  "msg": [
   "Added selection replacement from expression builder's context menu, corrected minor context menu-related bugs (scroll bar, attempting to load a tablemodel for fields that aren't supported)"
  ], 
  "revision_id": "307732"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-10-30T08:10:27.000000Z", 
  "msg": [
   "added event field and operator support to expression builder's context menu"
  ], 
  "revision_id": "307731"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-10-30T07:04:27.000000Z", 
  "msg": [
   "updated context menu code - now support for context menu via right mouse button or ctrl-space", 
   "mdc lookup now functions correctly"
  ], 
  "revision_id": "307730"
 }
]