[
 {
  "author": "psmith", 
  "date": "2004-04-20T00:39:40.000000Z", 
  "msg": [
   "This change adds a new Global property which defines a complete URL to a log4j.xml file", 
   "that will be used at startup by Chainsaw as a way of initialising any Receivers", 
   "the user usually deals with.  Saves having to bother with that NoReceiver warning dialog for users", 
   "who are using Chainsaw frequently.", 
   "This is somewhat of a duplicate effort to what the 'log4j.configuration' option would do", 
   "but exposes the functionality via the GUI.", 
   "The ApplicationPreferenceModelPanel is getting a bit messy now.  Might need to rethink", 
   "how this is structured to make it easier to add changable properties to the GUI.", 
   "Right now if you type a dud URL into the text field it is not 'accepted', but there is no visual", 
   "clue that it has been rejected.  In fact, while the underlying preference model does not accept", 
   "the change, the GUI seems to keep the value, which will be confusing!  :(", 
   "I hope to add some decoration to indicate when the value entered has been accepted and", 
   "to properly discard any old values correctly on Cancel."
  ], 
  "revision_id": "307909"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-04-15T04:54:48.000000Z", 
  "msg": [
   "Attempting to prevent an exception during layout of detail pane."
  ], 
  "revision_id": "307908"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-04-14T05:54:30.000000Z", 
  "msg": [
   "Prevent layout exceptions when trying to set the caret position on a detail pane with an empty string."
  ], 
  "revision_id": "307907"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-04-13T07:24:43.000000Z", 
  "msg": [
   "corrected expression examples"
  ], 
  "revision_id": "307906"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-04-13T07:13:42.000000Z", 
  "msg": [
   "Added information on color filters, display filters and expressions to tutorial.  Also added note to bottom of welcome panel pointing to tutorial for futher information."
  ], 
  "revision_id": "307905"
 }
]