[
 {
  "author": "ceki", 
  "date": "2004-05-27T12:16:57.000000Z", 
  "msg": [
   "- Moved socketServer witness and input files into a net/ subdiectory.", 
   "- Moved o.a.l.Decoder to o.a.l.spi.Decoder"
  ], 
  "revision_id": "307979"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-05-27T07:50:58.000000Z", 
  "msg": [
   "Minor change to correct scroll to bottom case where last & first indexes are same"
  ], 
  "revision_id": "307978"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-05-27T07:22:27.000000Z", 
  "msg": [
   "Fixed 'scroll to bottom' no longer scrolling if log panel's events were cleared.  Thanks to Steven Kearns for finding this.", 
   "Modified shutdown of UDPReceiver - closing socket earlier and notifying threads in order to shut down gracefully."
  ], 
  "revision_id": "307977"
 }, 
 {
  "author": "ceki", 
  "date": "2004-05-26T17:19:38.000000Z", 
  "msg": [
   "- Moved most of log4j tests and internal code to use", 
   "JoranConfigurator.", 
   "JoranConfigrator has many more capabilities than DOMConfigurator.  It", 
   "can do everything DOMConfigurator can do with the exception of support", 
   "for ErrorHanlder configruation. This is a very marginal point and will", 
   "be dealt with in the futre.", 
   "JoranConfigrator can read and correctly parse config files intended", 
   "for DOMConfigurator. Unfortunately, any previous DOCTYPE reference to", 
   "log4j.dtd must be removed. This is a small yet annoying problem."
  ], 
  "revision_id": "307976"
 }, 
 {
  "author": "psmith", 
  "date": "2004-05-25T22:37:38.000000Z", 
  "msg": [
   "This series of changes allows Chainsaw to be able to create a JMSReceiver.", 
   "The JMSReceiver class has now been added to the list of 'known' receivers, but", 
   "at run-time, should the class or any of it's dependant classes not be available", 
   "it will degrade gracefully, output an error message, and move on.  In this", 
   "case the JMSReceiver is not presented as an option when creating a Receiver.", 
   "The JMS jar, if available, has been added to the classpath of the 'chainsaw' ant", 
   "run target.", 
   "When creating a Java Web start distribution, the distribution creator _should_ make sure they", 
   "have the JMS libraries present, otherwise the Web start version will not have the JMSReceiver", 
   "class bundled with it."
  ], 
  "revision_id": "307975"
 }
]