[
 {
  "author": "ceki", 
  "date": "2004-05-10T09:48:54.000000Z", 
  "msg": [
   "- Modified UtilLoggingXMLDecoder and XMLDecoder to conform to the", 
   "LoggingEvent setter API.", 
   "- Continued work on DBAppender"
  ], 
  "revision_id": "307919"
 }, 
 {
  "author": "ceki", 
  "date": "2004-05-09T18:37:57.000000Z", 
  "msg": [
   "- Added a properties map to LoggerRepository", 
   "- Merged MDC properties and LoggerRepository properties into a single", 
   "property map in LoggingEvent. As such, the MDC related get/set", 
   "properties methods have been removed.", 
   "- All fields of LoggingEvent now have setters. The complicated", 
   "constructors required to create a LoggingEvent in one shot are now deprecated."
  ], 
  "revision_id": "307918"
 }, 
 {
  "author": "psmith", 
  "date": "2004-05-04T22:45:04.000000Z", 
  "msg": [
   "Changes to Chainsaw so that it can support how the PluginRegistry is now located.", 
   "Code compiles, Chainsaw can run, and tested Tutorial receivers etc, seems to work pretty well.", 
   "HOWEVER, found 2 issues during this still to be resolved.", 
   "1) Any Receiver started by the automatic external configuration file APPEAR in the Receiver Tree,", 
   "and can be stopped, but the GUI does not remove the visual node from the tree, which is confusing.", 
   "I have left that as a TODO.", 
   "2) Stopping the Tutorial causes an ArrayIndexOutOfBoundsException within Swing, possibly", 
   "because the removal of the tree node is not being done in the correct thread, or something. Not sure yet.", 
   "This is all I could do at this time.  Sorry."
  ], 
  "revision_id": "307917"
 }, 
 {
  "author": "ceki", 
  "date": "2004-05-04T19:04:38.000000Z", 
  "msg": [
   "Changed PluginRegistry to be a LoggerRepository instance instead of a static."
  ], 
  "revision_id": "307916"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-05-03T08:00:48.000000Z", 
  "msg": [
   "- Initial help-about content, with version, bug report/mailing list link, attributions (feel free to change content or add attributions if I've forgotten to include someone)", 
   "- Changed size of find text field", 
   "- minor change to tutorial"
  ], 
  "revision_id": "307915"
 }
]