[
 {
  "author": "sdeboy", 
  "date": "2004-09-09T08:34:14.000000Z", 
  "msg": [
   "Rewrote LogFilePatternReceiver to add support for multi-line messages and improved parsing logic.  To use this receiver you must now have the ORO library in your classpath."
  ], 
  "revision_id": "308029"
 }, 
 {
  "author": "ceki", 
  "date": "2004-09-07T17:16:05.000000Z", 
  "msg": [
   "- Created a new o.a.l.spi.location package", 
   "- Moved o.a.l.spi.LocationInfo class to o.a.l.spi.location.LocationInfo", 
   "- Updated many classes to reflect the name change", 
   "- The location info extraction code has beed factored out to its own class. New and improved extraction strategies to follow.", 
   "- Previously \"transient\" fields in LocationInfo are now serialized."
  ], 
  "revision_id": "308028"
 }, 
 {
  "author": "psmith", 
  "date": "2004-09-02T00:30:19.000000Z", 
  "msg": [
   "* Added Drag & Drop (rudimentary) support to Chainsaw.   You can drag any File to Chainsaw's", 
   "Tabbed Pane area and it will try to load it.  If there are no events in the file, not a lot happens...", 
   "* Fixed a condition where loading an XML configuration file did not properly use the", 
   "correct classloader", 
   "* Changed the way the Tabbed Pane functionality works, new tabs are added at the end and", 
   "the new tab is not made active."
  ], 
  "revision_id": "308027"
 }, 
 {
  "author": "psmith", 
  "date": "2004-08-19T22:36:44.000000Z", 
  "msg": [
   "This adds the DBReceiver to the list of know Receivers."
  ], 
  "revision_id": "308026"
 }, 
 {
  "author": "psmith", 
  "date": "2004-08-04T03:48:13.000000Z", 
  "msg": [
   "Changes for Bugs 30443 & 30444", 
   "30443 - The FileLoadAction class ignored the user's cancel action and loaded the file anyway", 
   "30444 - An XML file containing log4j events that were over 100 lines would not be imported correctly and generate an NPE.   Changed the logic", 
   "to keep reading in lines until it reached the end of record, or end of file before attempting to decode the text.", 
   "PR: 30443 30444"
  ], 
  "revision_id": "308025"
 }
]