[
 {
  "author": "psmith", 
  "date": "2005-02-25T03:23:48.000000Z", 
  "msg": [
   "Using CVS tricks suggested by Ceki, I have already copied over the chainsaw source file history,", 
   "so you won't see any of that here.", 
   "These are just misc other files needed by Chainsaw that was easier to do by hand (had already", 
   "done the move last night), plus a fixed up build process.", 
   "I copied the NOTICES and LICENSE file from logging-log4j, which I figured was the correct", 
   "thing to do.", 
   "One can build an run Chainsaw via Ant if one plonks log4j jars in a lib/ subdirectory", 
   "and run \"ant chainsaw\", or if in Eclipse, you can just make logging-chainsaw", 
   "depend on your logging-log4j project, and just run the LogUI as the main class."
  ], 
  "revision_id": "308064"
 }, 
 {
  "author": "", 
  "date": "2005-02-21T23:32:13.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'TAG_CHAINSAW2_MOVE'."
  ], 
  "revision_id": "308063"
 }, 
 {
  "author": "psmith", 
  "date": "2005-02-21T23:32:13.000000Z", 
  "msg": [
   "* Modifications to the Chainsaw build process to ensure the Webstart & non-webstart bundles are built correctly.", 
   "* Tweaked chainsaw.bat to include the correct jars (now that there's more of them)", 
   "* Added chainsaw.sh for \"Nix users", 
   "* updated the Webstart JNLP template file to reflect the required jars", 
   "* Update the Version and release notes"
  ], 
  "revision_id": "308062"
 }, 
 {
  "author": "ceki", 
  "date": "2005-02-18T17:23:45.000000Z", 
  "msg": [
   "- Added the isClosed(), activate(), isActive() methods to the Appender interface.", 
   "Ther idea is to avoid using appenders which are not in working order. Moreover, in future version, we would like to introduce", 
   "the capability for appenders suffering from temporary error conditions to have a recovery lifecycle.", 
   "- Added getNonFloodingLogger method to ComponentBase. This method returns a NOPLogger if called too frequently.", 
   "- Other minor changes."
  ], 
  "revision_id": "308061"
 }, 
 {
  "author": "", 
  "date": "2005-01-19T18:56:48.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'v1_3alpha_6'."
  ], 
  "revision_id": "308060"
 }
]