[
 {
  "author": "oburn", 
  "date": "2003-02-25T12:51:16.000000Z", 
  "msg": [
   "Patch from Raymond DeCampo:", 
   "Chainsaw is now capable of remembering the size and position of the main", 
   "window, the position of the table/details divider, the width and order", 
   "of all the columns, whether or not each column is displayed, the state", 
   "of the filtes and a recent files list.  The number of files in the", 
   "recent files list is configurable, as is the whether the state of the", 
   "filters is preserved.  These preferences are accessible from the", 
   "File->Preferences menu option.  The preference dialog also allows the", 
   "user to select which columns are shown.  Mnemonic shortcuts have been", 
   "added to all menu items.  The recent files submenu is under the File", 
   "menu.  The preferences are stored under the user's home directorey by", 
   "default but the preference file and any individual preference may be", 
   "overridden by the system properties.  Chainsaw will handle the absence", 
   "of the preferences file by creating it; no errors should arise from any", 
   "preference not being defined."
  ], 
  "revision_id": "309754"
 }, 
 {
  "author": "oburn", 
  "date": "2003-02-24T05:38:08.000000Z", 
  "msg": [
   "Patch from Paul Smith to fix annoying bug in the initial display under", 
   "JDK1.4+. Not sure why the patch fixes the problem, but it does."
  ], 
  "revision_id": "309753"
 }, 
 {
  "author": "ceki", 
  "date": "2003-02-21T13:57:07.000000Z", 
  "msg": [
   "Added to link log4PHP, updated link to jdbcappender", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "309752"
 }, 
 {
  "author": "mwomack", 
  "date": "2003-02-20T07:18:32.000000Z", 
  "msg": [
   "Jalopy-ized and checkstyle-d versions of the plugin files."
  ], 
  "revision_id": "309751"
 }, 
 {
  "author": "mwomack", 
  "date": "2003-02-20T07:12:53.000000Z", 
  "msg": [
   "Checked in property settings for checkstyle task.  Allow \"public\" modifier in interfaces.  Allow protected members in classes."
  ], 
  "revision_id": "309750"
 }
]