[
 {
  "author": "psmith", 
  "date": "2003-09-01T04:00:00.000000Z", 
  "msg": [
   "added the builder code when the user selects the", 
   "Simple Socket option when no receivers are defined.", 
   "A new SocketReceiver is created with the chosen port", 
   "and activated via the PluginRegistry."
  ], 
  "revision_id": "309939"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-01T03:59:06.000000Z", 
  "msg": [
   "added another option to the No Receiver warning panel.", 
   "Now the user is presented with an option to create a", 
   "simple Socket Receiver on one of the standard ports.", 
   "This is the most likely option for new Chainsaw users,", 
   "and is a more user friendly option then having to specify", 
   "it via configs, or even create one via the GUI.", 
   "Very handy for testing purposes too."
  ], 
  "revision_id": "309938"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-01T03:57:33.000000Z", 
  "msg": [
   "Modified root tree node to say \"Root Logger\" (more logical).", 
   "Removed commented out code."
  ], 
  "revision_id": "309937"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-01T03:56:51.000000Z", 
  "msg": [
   "Rather than encapsulate the Logger name tree in just", 
   "a tree component, encapsulate it in a Panel so", 
   "we can add some other functionality similar", 
   "to the way the Receiver panel works (a mini-toolbar etc)."
  ], 
  "revision_id": "309936"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-01T02:07:14.000000Z", 
  "msg": [
   "Table model is notified of new logger/category names arriving in the batch.", 
   "LogPanel now contains a new JTree component that", 
   "sits to the West of the Events panel, sizeable via a Split Pane and", 
   "scroll bar.", 
   "As of this version the tree does nothing but display", 
   "the Logger hierarchy in tree form, with no functionality", 
   "but Right click popup menu is coming to set levels, filters etc.", 
   "Right now I am not 100% certain whether it should stay", 
   "where it is sittingbut regardless the component", 
   "should be used somewhere (another thought is", 
   "in the Preferences area).", 
   "IMHO, I think it's useful where it sits, but any feedback appreciated."
  ], 
  "revision_id": "309935"
 }
]