[
 {
  "author": "psmith", 
  "date": "2003-09-01T01:59:19.000000Z", 
  "msg": [
   "For consistency, this Listener interface should extend", 
   "from EventListener interface (and the swing EventListenerList", 
   "support/delegate class requires this, handy for marking anyway)."
  ], 
  "revision_id": "309929"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-29T05:53:36.000000Z", 
  "msg": [
   "Added LoggerNameTreeModel and associated infrastructure.", 
   "Work in progress.", 
   "The rationale here is to provide a thin interface", 
   "that represents something containing a set of Logger names", 
   "which can notify listeners when a new, unique Logger name", 
   "turns up in the container.", 
   "The Model side of thing then can be notified of the new", 
   "Logger name arriving via the receiving events, and", 
   "adjust itself accordingly.", 
   "This TreeModel will then be used to allow the user to", 
   "specify which Logger's to display, and at what Level", 
   "to display them"
  ], 
  "revision_id": "309928"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-28T23:58:59.000000Z", 
  "msg": [
   "Marked the SocketHubReceiver as implementing the PortBased", 
   "interface, since it already supported all the methods", 
   "of that interface it was just a matter of marking it as such.", 
   "Chainsaw uses the interface to determine what actions", 
   "are allowed/appropriate for the GUI."
  ], 
  "revision_id": "309927"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-28T23:57:44.000000Z", 
  "msg": [
   "exposed as public the default port number for this appender.", 
   "This is useful for Chainsaw etc.  Since it is static final,", 
   "it should be ok."
  ], 
  "revision_id": "309926"
 }, 
 {
  "author": "psmith", 
  "date": "2003-08-28T23:56:57.000000Z", 
  "msg": [
   "When there is no Receivers defined, it was saying \"(Unknow Type)::...\" which is a bit silly", 
   "Also ensured appropriate Icon is used, a couple of spots", 
   "it was using inappropriate icons.", 
   "Also added Tooltip text to each Receiver node so the user", 
   "has a bit more idea about what they can do."
  ], 
  "revision_id": "309925"
 }
]