[
 {
  "author": "psmith", 
  "date": "2003-09-10T23:03:07.000000Z", 
  "msg": [
   "Refactored LogPanel and Menu & Toolbar class so they are decoupled.", 
   "LogPanel is now responsible for it's own undocked Toolbar", 
   "actions.", 
   "The find option now at least doens't cause a ClassCastException,", 
   "but it's still operating a little oddly.  Will replace this mechanism", 
   "with a series of Finder-style objects."
  ], 
  "revision_id": "310009"
 }, 
 {
  "author": "ceki", 
  "date": "2003-09-10T16:28:19.000000Z", 
  "msg": [
   "Joran starts doing more. It already handles errors better than DOMConfigurator.", 
   "More actions to follow."
  ], 
  "revision_id": "310008"
 }, 
 {
  "author": "ceki", 
  "date": "2003-09-10T15:10:47.000000Z", 
  "msg": [
   "In the substVat method changed the order of replacement. The props", 
   "argument is seached first and only if that fails the system properties are", 
   "searched.", 
   "This is in agreement with the principle whereby locals values override", 
   "globals and not the other way around."
  ], 
  "revision_id": "310007"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-10T03:18:33.000000Z", 
  "msg": [
   "a large number of changes done as a further effort to decouple", 
   "LogPanel from LogUI.  LogPanel now only needs a reference", 
   "to the StatusBar, and this too can be eventually removed", 
   "by replacing with a listener style framework. (coming", 
   "soon).", 
   "LogPanel now contains all the unique values of LoggingEvents", 
   "in the new FilterModel.", 
   "One caveat of this change is that the Undocked window now", 
   "has no Toolbar, further effort required to relink this in, but", 
   "the undocked window is is still usable if you use the right", 
   "click menu."
  ], 
  "revision_id": "310006"
 }, 
 {
  "author": "psmith", 
  "date": "2003-09-10T03:16:03.000000Z", 
  "msg": [
   "now fires a PropertyChangeEvent when the docked property", 
   "is modified."
  ], 
  "revision_id": "310005"
 }
]