[
 {
  "author": "psmith", 
  "date": "2003-12-12T02:25:53.000000Z", 
  "msg": [
   "Fixed previous bug of a checkbox being out of state with", 
   "the pref model.", 
   "moved the responiveness property into tho Pref model, and", 
   "removed it from the View menu and placed it in the", 
   "Preference panel.", 
   "Responsiveness is now a value from 1-4, older style", 
   "values in Milliseconds are automatically converted. (This", 
   "change seems to look nicer, a bit friendlier)", 
   "Other View menu options will be moved into the pref Model, but", 
   "some will still be changable via the view menu directly", 
   "as well as the Pref panel."
  ], 
  "revision_id": "310204"
 }, 
 {
  "author": "psmith", 
  "date": "2003-12-11T22:31:29.000000Z", 
  "msg": [
   "Refactored the LogPanelPreferencePanel so that we can", 
   "have a common preference style panel.", 
   "Added an application-wide Preference panel to expose", 
   "a GUI for the user to tweak the ApplicationPreferenceModel.", 
   "Currently there is a bug where the \"ShowNoReceiver\" checkbox", 
   "is not tracking with the models actual value, but if you uncheck", 
   "it and exit Chainsaw, the correct value is saved. The", 
   "next time you start Chainsaw the warning dialog is not displayed", 
   "as per the models value, but the checkbox is still ticked."
  ], 
  "revision_id": "310203"
 }, 
 {
  "author": "ceki", 
  "date": "2003-12-11T16:24:33.000000Z", 
  "msg": [
   "A possible solution to the object-based logging problem put foth by", 
   "Scott Melcher.", 
   "See", 
   "http://marc.theaimsgroup.com/?t=107115775500005&r=1&w=2", 
   "for further details."
  ], 
  "revision_id": "310202"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-12-11T06:30:56.000000Z", 
  "msg": [
   "Added assertions to rules to prevent problems during parsing of the stack (used by expressionrule).  Note that the 'focus on' textfield's tooltip displays the expression's error."
  ], 
  "revision_id": "310201"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-12-11T06:10:27.000000Z", 
  "msg": [
   "removed debug msgs"
  ], 
  "revision_id": "310200"
 }
]