[
 {
  "author": "psmith", 
  "date": "2004-06-14T22:53:56.000000Z", 
  "msg": [
   "Added a PRE tag to wrap around the Throwable so that it looks prettier.  This was suggested by someone", 
   "on one of the log4j lists but I confese to forgetting who it was.  It certainly improves the readability,", 
   "so thank you to whoever suggested it."
  ], 
  "revision_id": "310679"
 }, 
 {
  "author": "sdeboy", 
  "date": "2004-06-12T05:18:20.000000Z", 
  "msg": [
   "rule factory now behaves as if the 'like' (regular expression) rule doesn't exist if the Perl5Compiler ORO class is not available."
  ], 
  "revision_id": "310678"
 }, 
 {
  "author": "ceki", 
  "date": "2004-06-11T19:43:36.000000Z", 
  "msg": [
   "Jetty based unit tests.", 
   "At this time we are only testing JNDI behaviour in different web-apps"
  ], 
  "revision_id": "310677"
 }, 
 {
  "author": "psmith", 
  "date": "2004-06-10T07:28:10.000000Z", 
  "msg": [
   "This fixes an NPE that can occur.", 
   "Stephen Pain noticed that when a Receiver is restarted in Chainsaw, the GUI looks fine, but no events are displayed", 
   "from that point onwards.  A real bummer.", 
   "It turns out that it is during the restart of Socket based Receivers, an LoggingEvent is sent through", 
   "describing the socket close issue.  Unfortunately the event has no properties set.", 
   "Currently the LoggingEvent.getProperties() method could return null.  It might be worth changing this so that", 
   "it return an empty Map instead, but I was not prepared to make that call right now.", 
   "I might also consider checking out why the Thread that gets that NPE causes Chainsaw to become useless, it", 
   "should try and deal with those sort of issues in much the same way as the Swing EventDispatch thread does, it", 
   "seems to go merrily along even after exceptions."
  ], 
  "revision_id": "310676"
 }, 
 {
  "author": "ceki", 
  "date": "2004-06-09T15:22:42.000000Z", 
  "msg": [
   "Doc improvements"
  ], 
  "revision_id": "310675"
 }
]