[
 {
  "author": "sdeboy", 
  "date": "2004-08-10T06:16:56.000000Z", 
  "msg": [
   "Fixed typos in SocketNode log output", 
   "Examining read length in XMLSocketNode and exiting loop if value is -1 (Thanks to Davidson Hutton for catching this one)"
  ], 
  "revision_id": "310729"
 }, 
 {
  "author": "ceki", 
  "date": "2004-08-09T14:29:32.000000Z", 
  "msg": [
   "Javadoc fixes"
  ], 
  "revision_id": "310728"
 }, 
 {
  "author": "psmith", 
  "date": "2004-08-08T23:28:11.000000Z", 
  "msg": [
   "Commiting patch contributed by Stephen Pain that fixes the patch that I committed last week to fix a problem Stephen found originally.....", 
   "Maybe I should have just let Stephen do it in the first place... :)", 
   "It sucks that this won't support unlimited XML size for an event, but it is better than taking forever to load a file, or causing an error.", 
   "My only change is that I append a \"\\n\" after every line so the stack traces appear nicely inside Chainsaw."
  ], 
  "revision_id": "310727"
 }, 
 {
  "author": "yoavs", 
  "date": "2004-08-05T19:25:51.000000Z", 
  "msg": [
   "Modified variables named \"enum\" to \"enumeration\" to avoid a JDK 1.5 compilation error (enum is a reserved keyword in JDK 1.5).", 
   "Undid the removal of PassByJNDI.java from the tests/build.xml compilation.  I committed that by accident before.  I still don't like needing Jetty to build, though.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "310726"
 }, 
 {
  "author": "yoavs", 
  "date": "2004-08-05T17:45:45.000000Z", 
  "msg": [
   "Added TRACE level: modified Level class to have TRACE as a native level,", 
   "between ALL and DEBUG.  Modified Category class to add trace(..) methods", 
   "like the existing debug(...) methods.  Modified LoggerTestCase and", 
   "StressCategory tests to do a bit of TRACE-specific testing.", 
   "Inspected but did not modify UGLI classes.  They don't include the FATAL", 
   "level, so I didn't want to inculde TRACE level without further discussion", 
   "which I will start on log4j-dev shortly.", 
   "Ensured everything compiles.  Ran unit tests: the relevant unit tests", 
   "pass.  Both the \"regression\" and \"runAll\" targets fail on a size-based", 
   "rolling policy test, which was also failing before I made my modifications", 
   "and anyways doesn't touch Level-related stuff, so I don't think it's", 
   "related.", 
   "There will probably be an additional coding pass in this area (if not", 
   "multiple) to further integrate TRACE, modify JavaDocs, modify tests, etc.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "310725"
 }
]