[
 {
  "author": "sdeboy", 
  "date": "2003-06-03T06:32:59.000000Z", 
  "msg": [
   "* Removed menus used to save filter/display settings - moved save process to window closing event", 
   "* Level column now supports display of either text or icon via a saved preference/menu", 
   "* Changed 'ID' column semantics from 'row number' back to reception-order ID (wasn't working right when a display filter was applied - will re-add row number support later)"
  ], 
  "revision_id": "311749"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-06-02T04:23:09.000000Z", 
  "msg": [
   "Added save support for column order and width via File-Save Settings menu.", 
   "Selecting this menu item will save the column order and width for the currently active tab.", 
   "Also updated column selector and manual column move support for managing the currently active sort column.", 
   "Removed save/load settings from profileable since it extends SettingsListener, which already has these methods.", 
   "Made the getSettingsDirectory method on SettingsManager public so serialized Java objects storing settings may save the files to the same directory (filters and other settings are now saved to this directory with new extensions)."
  ], 
  "revision_id": "311748"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-05-30T05:08:14.000000Z", 
  "msg": [
   "JEditorPane is very picky about HTML - made welcome.html well-formed"
  ], 
  "revision_id": "311747"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-05-28T16:52:50.000000Z", 
  "msg": [
   "fixed bug where if welcome panel was closed prior to any events being delivered (via F1), an exception was thrown.", 
   "also removed unused imports", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "311746"
 }, 
 {
  "author": "sdeboy", 
  "date": "2003-05-28T07:34:57.000000Z", 
  "msg": [
   "removed management of displayed columns from displayfilter and updated columnselector to add/remove columns from the table (previously managed in displayfilter)", 
   "(more work needs done - need to replace functionality with preferences support for displayed columns, including col width)", 
   "corrected tooltipselector bug"
  ], 
  "revision_id": "311745"
 }
]