[
 {
  "author": "hoju", 
  "date": "2003-08-27T07:54:38.000000Z", 
  "msg": [
   "Finally broke the logic for initializing and shutting down Log4j loggers and appenders into a separate class to be used by the InitcontextListener, the InitServlet, and any other class that wants to use this functionality.  All configuration is done via context params (even for the InitServlet).  For arbitrary classes using the new InitShutdownController class, configuration can be done via manipulating context params in memory at runtime before sending the ServletContext object to the InitShutdownController.initializeLog4j(ServletContext) method.  Keys for the various context params are provided as static constants in InitShutdownController.", 
   "This change allowed for a significant cleanup of the InitContextListener and InitServlet making both vastly simpler.  Updated Javadoc in all files and Jalopied and checkstyled everything.  All is well :-)", 
   "Jake"
  ], 
  "revision_id": "311894"
 }, 
 {
  "author": "hoju", 
  "date": "2003-08-26T23:00:11.000000Z", 
  "msg": [
   "Update InitServlet with updated code from InitContextListener.  I really need to put this into a separate class that can be shared between these two configurations.", 
   "Jake"
  ], 
  "revision_id": "311893"
 }, 
 {
  "author": "hoju", 
  "date": "2003-08-26T15:42:12.000000Z", 
  "msg": [
   "Committing servlet.ServletContextLogAppender and servlet.ServletContextLogAppenderListener submitted by Aleksei Valikov to the log4j-dev list.  I modified these classes to key upon the servlet context path (eg... \"/MyContext\") rather than the servlet context name which not only can be null, but also may not even be unique in the server.  Added Javadoc documentation to these and corrected javadoc in a few other classes.  Also added package.html files to keep checkstyle from complaining.  Added overview.html so that the one specified in the <javadoc> task will actually exist.  Upated the build.xml file to exclude the jdbc package which doesn't currently compile.  Added JDK detection to determine whether to add the -breakiterator flag for JDK1.4+ to output javadoc without all the warnings.", 
   "jalopy'ed and checkstyled everything.  All except the unimplemented hashcode() method in ConfigurationServlet passes checkstyle-3.1.", 
   "Jake"
  ], 
  "revision_id": "311892"
 }, 
 {
  "author": "yoavs", 
  "date": "2003-07-29T00:36:14.000000Z", 
  "msg": [
   "- Added web.xml example"
  ], 
  "revision_id": "311891"
 }, 
 {
  "author": "psmith", 
  "date": "2003-06-29T21:59:48.000000Z", 
  "msg": [
   "Updates to show that Chainsaw has moved from the Sandbox", 
   "into jakarta-log4j module.", 
   "Have kept the build file for chainsaw for anyone expecting it, but", 
   "all it does now is output a messages that indicates that Chainsaw has", 
   "moved.", 
   "We can remove it completely in a short time."
  ], 
  "revision_id": "311890"
 }
]