[
 {
  "author": "andyc", 
  "date": "2000-01-12T20:10:01.000000Z", 
  "msg": [
   "Earlier, a bug related to multi-threading was fixed in the", 
   "UTF8DataChunk. A temp buffer was inadvertantly made static", 
   "with no associated synchronized access to the variable which", 
   "created the possibility of multiple thread each writing to", 
   "the temp buffer at the same time causing data corruption.", 
   "The solution to this previous problem was to remove the", 
   "static (which wasn't meant to be there in the first place).", 
   "However, this meant that each data chunk contained its own", 
   "16K temp buffer which added a lot of extra memory used", 
   "during parsing of files.", 
   "Upon further investigation, it was discovered that the temp", 
   "buffer was only used within one method so the variable was", 
   "returned to static and access to the method was synchronized", 
   "to provide multi-thread safety.", 
   "No noticeable performance penalties arise from the use of", 
   "synchronized so, for now, this seems like a good solution", 
   "to the memory problem."
  ], 
  "revision_id": "315164"
 }, 
 {
  "author": "lehors", 
  "date": "2000-01-11T21:42:18.000000Z", 
  "msg": [
   "fixed Makefiles regarding domx change, patch from Timm Sean, STimm@mailgo.com"
  ], 
  "revision_id": "315163"
 }, 
 {
  "author": "rpfeiffe", 
  "date": "2000-01-10T23:37:57.000000Z", 
  "msg": [
   "This file changed to reflect  org.w3c.dom.events and", 
   "org.w3c.dom.traversal"
  ], 
  "revision_id": "315162"
 }, 
 {
  "author": "andyc", 
  "date": "2000-01-07T23:32:28.000000Z", 
  "msg": [
   "Added feature so that user can decide whether or not ignorable", 
   "whitespace text nodes appear in the DOM tree. By default, the", 
   "text nodes are there and, thus, there appears to be no change", 
   "from current behavior.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "315161"
 }, 
 {
  "author": "lehors", 
  "date": "2000-01-07T19:23:46.000000Z", 
  "msg": [
   "removed obsolete domx stuff"
  ], 
  "revision_id": "315160"
 }
]