[
 {
  "author": "andyc", 
  "date": "2000-05-18T02:46:08.000000Z", 
  "msg": [
   "Update Schema support information for upcoming build 1.1.0"
  ], 
  "revision_id": "315654"
 }, 
 {
  "author": "andyc", 
  "date": "2000-05-18T02:25:45.000000Z", 
  "msg": [
   "Updated release information for upcoming build of 1.1.0"
  ], 
  "revision_id": "315653"
 }, 
 {
  "author": "andyc", 
  "date": "2000-05-18T02:10:33.000000Z", 
  "msg": [
   "Bumped version number from 1.0.4 to 1.1.0 for upcoming build."
  ], 
  "revision_id": "315652"
 }, 
 {
  "author": "andyc", 
  "date": "2000-05-18T01:52:00.000000Z", 
  "msg": [
   "Xerces 2.0 Preliminary Architecture Documentation", 
   "I'm committing the thoughts that are happening towards re-organizing", 
   "the internal components and re-defining the interfaces between them", 
   "for Xerces 2.0. These designs are not final and should only be", 
   "considered a work in progress.", 
   "The design points are functionality, performance, modularity, and", 
   "simplicity. The new design, when completed, will allow the parser", 
   "to communicate additional information through the internals;", 
   "enable the caching of grammars in a pool of parser objects; and", 
   "allow the user to construct new types of parsers by plugging the", 
   "modules together like puzzle pieces.", 
   "Additional design documents will be added later.", 
   "The following files are being committed:", 
   "design.css  CSS for resulting HTML", 
   "design.dtd  Design grammar", 
   "design.xml  Design", 
   "design.xsl  Stylesheet to convert to HTML"
  ], 
  "revision_id": "315651"
 }, 
 {
  "author": "andyc", 
  "date": "2000-05-18T01:45:42.000000Z", 
  "msg": [
   "XML documents with \"wide\" branches causes an array out of bounds", 
   "exception to be thrown. The validator, when resizing the array", 
   "of children QNames at a given level, was adding new QNames to", 
   "the original children array instead of the new, resized array.", 
   "Since the array size was initially sized to 256, this problem", 
   "appeared as soon as a branch was 256 elements wide. This bug is", 
   "now fixed.", 
   "Also, after tweaking the numbers a little bit, I see no", 
   "noticable difference in performance between an initial array", 
   "size of 128 and 256, so I changed the default size to be 128.", 
   "However, this really needs to be REVISITed because it is a", 
   "waste of memory."
  ], 
  "revision_id": "315650"
 }
]