[
 {
  "author": "andyc", 
  "date": "2000-06-16T16:54:47.000000Z", 
  "msg": [
   "1) Fixed minor bug in DFAContentModel for <any namespace='NS'/>.", 
   "I was only handling <any/>.", 
   "2) Reported limitation of \"processContents\" attribute through", 
   "error handler.", 
   "3) Added reminders in TraverseSchema to go back and localize the", 
   "error message. TODO: Remove all output to System.out/err."
  ], 
  "revision_id": "315789"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-06-16T03:45:13.000000Z", 
  "msg": [
   "Fixed logical error that caused DOM Serialization bug - please do not change - It may seem counterIntuitive but we really it makes sense - Any node which has not been fluff needs to be fluff up before we serialize"
  ], 
  "revision_id": "315788"
 }, 
 {
  "author": "andyc", 
  "date": "2000-06-15T23:45:16.000000Z", 
  "msg": [
   "The CMAll class should have been called CMAny. Oops! Also, it needed", 
   "to be added to the Makefile."
  ], 
  "revision_id": "315787"
 }, 
 {
  "author": "andyc", 
  "date": "2000-06-15T22:05:06.000000Z", 
  "msg": [
   "Schema grammar wasn't being added to the GrammarResolver."
  ], 
  "revision_id": "315786"
 }, 
 {
  "author": "andyc", 
  "date": "2000-06-15T22:04:21.000000Z", 
  "msg": [
   "Phase one of implementing the <any/> element in XML Schema.", 
   "The content spec node was updated to include special ANY types. Then", 
   "the TraverseSchema was modified to build these content spec types", 
   "into the grammar when \"compiling\" the Schema. Then the grammar was", 
   "modified to be able to recognize the ANY types in the content spec", 
   "tree. This would shortcut the model into using a DFAContentModel and", 
   "a new CMNode tree was built. This content model node tree contained", 
   "a new kind of node, CMAll. Finally, the DFAContentModel was modified", 
   "in order to perform validation with these new ANY types.", 
   "As I said, this is phase one. We still have the problem with the", 
   "validator not knowing that something was matched as an ANY and", 
   "therefore not trying to resolve the element and validate it. In", 
   "addition, the \"processContents\" attribute on the <any/> element", 
   "is not implemented. Both of these problems will cause changes", 
   "to be made in the XMLValidator code. Fun fun fun!"
  ], 
  "revision_id": "315785"
 }
]