[
 {
  "author": "andyc", 
  "date": "2000-09-15T21:57:24.000000Z", 
  "msg": [
   "1) Since the documentation was starting to build up, I", 
   "re-organized the tree by moving things into separate", 
   "directories. (Hopefully I didn't break any links", 
   "doing so).", 
   "2) Also incorporated comments from the mailing list into", 
   "the architecture overview.", 
   "a) Ed Staub commented that XInclude operates on the", 
   "XML Infoset. So I changed the text to read that an", 
   "XInclude filter can be inserted either before *or", 
   "after* the validator and added a lengthy note", 
   "regarding the problem of working on an Infoset.", 
   "This will be part of an open issues document to be", 
   "added soon.", 
   "b) Ed also wanted a clarification on the parser being", 
   "both the manager and a component. Added some text", 
   "to the Configuration section regarding this point.", 
   "I still have a lot of comments from Ted Leung to address."
  ], 
  "revision_id": "316104"
 }, 
 {
  "author": "lehors", 
  "date": "2000-09-15T17:01:42.000000Z", 
  "msg": [
   "This is an experiment at changing the internal DOM structure", 
   "from a linked list based structure to an array based structure.", 
   "The array based structure comes from Crimson.", 
   "This structure is inherently more compact, but the gain in memory can only", 
   "be achieved at the expense of a performance hit. Indeed, the problem with", 
   "arrays is that you never know what size to give them in the first place.", 
   "Crimson's implementation uses an original size of 5, and doubles this size", 
   "every time it reaches the limit. In addition, it provides for a method to be", 
   "called when additions to the node are finished to resize the array the size", 
   "actually needed. This is called for instance by the parser in the endElement", 
   "callback. But, if this leads to less memory waste it also means a bigger", 
   "performance hit.", 
   "At any rate, I was expecting quite a bit of improvement but the tests I've", 
   "run so far have been very disappointing. It is much slower, and it appears", 
   "to use more memory. I just don't understand what's going on. Nevertheless,", 
   "I'm checking this into a CVS branch so this work isn't completely lost and", 
   "can possibly be looked at further some other time."
  ], 
  "revision_id": "316103"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-09-15T00:56:06.000000Z", 
  "msg": [
   "Oops put wrong fix, here again.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "316102"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-09-15T00:49:26.000000Z", 
  "msg": [
   "Fixed message problem reported by Doug Smith 09/14/2000", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "316101"
 }, 
 {
  "author": "andyc", 
  "date": "2000-09-14T23:02:01.000000Z", 
  "msg": [
   "Update source so that stylesheets render better on Netscape", 
   "Navigator. Added a special \"netscape\" class of styles and", 
   "applied them to troublesome areas for Netscape. Also broke", 
   "out the following \"border: solid black 1\" to \"border-style:", 
   "solid; border-color: black; border-width: 1\" because", 
   "Netscape couldn't handle them together."
  ], 
  "revision_id": "316100"
 }
]