[
 {
  "author": "lehors", 
  "date": "2000-10-10T17:07:51.000000Z", 
  "msg": [
   "updated to the new version of XMLDTDHandler"
  ], 
  "revision_id": "316244"
 }, 
 {
  "author": "andyc", 
  "date": "2000-10-10T08:06:04.000000Z", 
  "msg": [
   "Some simple updates to the Makefile and XMLEntityManager."
  ], 
  "revision_id": "316243"
 }, 
 {
  "author": "andyc", 
  "date": "2000-10-10T08:04:59.000000Z", 
  "msg": [
   "1) Made modifications to XMLDTDHandler to remove isPE parameter", 
   "from internal and external entity declaration callbacks. Since", 
   "parameter entity names start with '%', this parameter is not", 
   "needed.", 
   "2) Added complete javadoc to XNI interfaces and classes. This", 
   "should help a lot in understanding what the core interfaces", 
   "and classes have and how they relate to each other. I also", 
   "added the javadoc comments to those classes that implement", 
   "either the document or dtd/dtd content model handler", 
   "interfaces. There's still more to do, though.", 
   "3) Removed filter callbacks from DTDGrammar. The DTD grammar", 
   "object is no longer a filter, just another handler. It is", 
   "assumed that the DTD scanner would call *both* the DTD", 
   "grammar (so that it can populate the validation structures", 
   "in the grammar) as well as the registered dtd/dtd content", 
   "model handler so that DTD information can be reported. It", 
   "was too complicated when the DTD grammar was a filter that", 
   "would pass on the DTD information. And the new design is", 
   "all about simplicity.", 
   "4) Did I forget anything for this log message?"
  ], 
  "revision_id": "316242"
 }, 
 {
  "author": "andyc", 
  "date": "2000-10-10T07:38:39.000000Z", 
  "msg": [
   "Updated XMLDTDHandler interface to remove isPE parameter", 
   "from the internal and external entity declaration callbacks.", 
   "This parameter is no longer needed because all parameter", 
   "entity names start with '%' while general entity names are", 
   "just the entity name.", 
   "The next commit will contain the updates to the code to", 
   "comply with this change."
  ], 
  "revision_id": "316241"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-10-09T23:08:31.000000Z", 
  "msg": [
   "Work in progress - connected the Handlers, added ElementDecl and AttributeDecl grammar"
  ], 
  "revision_id": "316240"
 }
]