[
 {
  "author": "andyc", 
  "date": "2000-10-05T01:59:30.000000Z", 
  "msg": [
   "1) Removed \"actualEncoding\" parameter from xmlDecl/textDecl", 
   "callbacks in the XMLDocumentHandler. Updated all of the", 
   "implementors of this interface and the document scanner", 
   "to make the correct callback. This information is now", 
   "passed during the startEntity callback of the", 
   "XMLEntityHandler interface.", 
   "2) Updated the document scanner to allow an EOFException to", 
   "occur during the TrailingMiscDispatcher. I just remembered", 
   "that well-formedness of comments and PIs appearing in the", 
   "trailing miscellaneous section is NOT being checked on", 
   "EOFException -- this change needs to go in later.", 
   "3) Continued work on the XMLEntityManager/Scanner. Filled in", 
   "some more methods and worked out a system for handling the", 
   "auto-detection of input stream encodings while keeping", 
   "that transparent from the entity scanner. Next I'll be", 
   "re-writing the entity scanner instance to improve perf", 
   "and provide a complete implementation of the entity", 
   "scanner API."
  ], 
  "revision_id": "316209"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-10-04T21:30:53.000000Z", 
  "msg": [
   "Due to lack of interest and contributors RevalidatingDOMParser is being removed.", 
   "It usually causes more frustration among users who have to remove it from their IDE file list.", 
   "If somebody is willing to supported I will resurrect it but from now RIP.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "316208"
 }, 
 {
  "author": "ericye", 
  "date": "2000-10-04T20:45:37.000000Z", 
  "msg": [
   "1.sets the fCurrentEntity field in XMLEntityManager  2. remove duplidate fEntityManager field in XMLDocumentParser"
  ], 
  "revision_id": "316207"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-10-04T12:16:55.000000Z", 
  "msg": [
   "XMLEntityHandler startEntity takes a fourth parameter ...encoding", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "316206"
 }, 
 {
  "author": "jeffreyr", 
  "date": "2000-10-04T11:19:26.000000Z", 
  "msg": [
   "This also was broken because of remove of domExceptionImpl", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "316205"
 }
]