[
 {
  "author": "andyc", 
  "date": "2001-01-16T09:11:16.000000Z", 
  "msg": [
   "Updated Xerces2 design documents. Separated out the various design", 
   "parts so that we can generate separate design documents targeted", 
   "at different kinds of users. NOTE: I think that the stylesheet is", 
   "broken -- need to fix later."
  ], 
  "revision_id": "316784"
 }, 
 {
  "author": "andyc", 
  "date": "2001-01-16T05:29:34.000000Z", 
  "msg": [
   "1) Added methods to XMLAttributes so that the non-normalized value", 
   "of an attribute can be stored. This is needed otherwise the", 
   "attribute entity locations don't mean much. NOTE: The code still", 
   "needs to be added to XMLScanner and DOMParser to add/use this", 
   "information correctly.", 
   "2) Added missing method to XMLDocumentFragmentHandler interface to", 
   "report textDecl information for external parsed entities."
  ], 
  "revision_id": "316783"
 }, 
 {
  "author": "andyc", 
  "date": "2001-01-16T04:36:49.000000Z", 
  "msg": [
   "Typos in targets."
  ], 
  "revision_id": "316782"
 }, 
 {
  "author": "andyc", 
  "date": "2001-01-16T04:36:06.000000Z", 
  "msg": [
   "Implementation of framework to support XML Schema identity constraints.", 
   "This code can be used to represent identity constraint information", 
   "while still allowing them to be cached with their respective grammars.", 
   "It can also be used to interact with the validator in order to validate", 
   "identity constraints in instance documents.", 
   "More code is required in the validator to actually use these classes.", 
   "The validator is responsible for activating identity constraint selectors", 
   "when the element comes into scope; activating fields when the selector", 
   "is matched; storing data values associated to fields; and ensuring that", 
   "the data values are valid with respect to the identity constraint.", 
   "Adding the code to the validator is the \"hard\" part -- the easy part", 
   "is populating the grammar with the identity constraint information.", 
   "And that's what these classes are designed for.", 
   "NOTE: Waiting for Schema support to be enabled in Xerces2 for", 
   "this code to be used."
  ], 
  "revision_id": "316781"
 }, 
 {
  "author": "andyc", 
  "date": "2001-01-16T04:25:30.000000Z", 
  "msg": [
   "Simple XPath implementation that can be matched in a serial", 
   "manner. While this implementation could be better/more complete,", 
   "for now it'll act as a placeholder for basic XPath support to", 
   "implement XML Schema identity constraints.", 
   "NOTE: Waiting for Schema support to be enabled in Xerces2 for", 
   "this code to be used."
  ], 
  "revision_id": "316780"
 }
]