[
 {
  "author": "andyc", 
  "date": "2001-01-18T07:10:55.000000Z", 
  "msg": [
   "Adding support for Schema identity constraints.", 
   "1) Ported the limited XPath code from Xerces2 to Xerces 1.x.", 
   "2) Added identity constraint info to grammar and element decl.", 
   "3) Updated TraverseSchema to populate the grammar with the", 
   "identity constraint information.", 
   "NEXT: Modifying the validator to use this information. Yay!"
  ], 
  "revision_id": "316789"
 }, 
 {
  "author": "elena", 
  "date": "2001-01-17T21:29:58.000000Z", 
  "msg": [
   "Fix for simpleTypes (CR Schema implementation): use getLocalName", 
   "instead of getNodeName.."
  ], 
  "revision_id": "316788"
 }, 
 {
  "author": "lmartin", 
  "date": "2001-01-17T21:09:49.000000Z", 
  "msg": [
   "Cleanup of complexType code and some bug fixes"
  ], 
  "revision_id": "316787"
 }, 
 {
  "author": "elena", 
  "date": "2001-01-17T20:46:07.000000Z", 
  "msg": [
   "The changes allow enumeration facet to be checked against value space of a content.", 
   "Previously, we would only do string comparison which would give", 
   "incorrect results.", 
   "Similar changes should be done for RecurringDuration (as well as any other", 
   "datatypes for which two or more literal denote the same value)."
  ], 
  "revision_id": "316786"
 }, 
 {
  "author": "lehors", 
  "date": "2001-01-16T21:33:18.000000Z", 
  "msg": [
   "applied patch from Jay Cain:", 
   "Preserve element identifiers when a deep clone is performed.", 
   "Also, a minor change was made for DOM conformity. importNode now throws", 
   "NOT_SUPPORTED_ERR instead of HIERARCHY_REQUEST_ERR when an import of a", 
   "document node is attempted, which is according the DOM specifications. This", 
   "shouldn't cause any problems, especially if the DOM Java bindings were used", 
   "as the reference. If it will cause problems, it's only one line of code to", 
   "change.", 
   "The tests passed and the documentation has been updated."
  ], 
  "revision_id": "316785"
 }
]