[
 {
  "author": "andyc", 
  "date": "2000-12-28T09:44:31.000000Z", 
  "msg": [
   "Adding these files in preparation of identity constraint support", 
   "(serial/streaming only). Besides, the new code for Namespace-", 
   "Support already implements NamespaceContext. And I think that the", 
   "document fragment interface is a generally useful thing to have", 
   "as part of the native interface."
  ], 
  "revision_id": "316764"
 }, 
 {
  "author": "andyc", 
  "date": "2000-12-28T09:41:29.000000Z", 
  "msg": [
   "1) Fixes done for namespace support. Seems to work correctly", 
   "and pass the correct values now.", 
   "2) Fixed validation problems with DTDs and namespaces.", 
   "3) In process of performing massive code cleaning -- prepare", 
   "for more."
  ], 
  "revision_id": "316763"
 }, 
 {
  "author": "andyc", 
  "date": "2000-12-28T08:23:55.000000Z", 
  "msg": [
   "1) Fixed some sample bugs.", 
   "2) Updated samples to provide stack trace in case of really", 
   "bad error -- exception was thrown out from parser or by", 
   "some application handler registered with the parser during", 
   "a callback."
  ], 
  "revision_id": "316762"
 }, 
 {
  "author": "andyc", 
  "date": "2000-12-28T07:13:12.000000Z", 
  "msg": [
   "Makefile fixed to reflect new sample class files."
  ], 
  "revision_id": "316761"
 }, 
 {
  "author": "andyc", 
  "date": "2000-12-27T10:15:12.000000Z", 
  "msg": [
   "Fix for SAX2 startDTD callback so that it has the root element name", 
   "and public and system identifiers in the case where there is an", 
   "internal subset. This is a change in behavior from the previous", 
   "Xerces2 where it would wait until it verified that the entire", 
   "doctype decl line had been parsed (including internal subset)", 
   "before making the notification.", 
   "NOTE: I don't like calling the doctypeDecl callback until end of the", 
   "*full* doctype line (including internal subset) is parsed", 
   "correctly but SAX2 requires that it knows the root element", 
   "name and public and system identifier for the startDTD call.", 
   "It's not that bad; it just feels wrong to notify the handler", 
   "of the doctype line when we haven't finished parsing it, yet."
  ], 
  "revision_id": "316760"
 }
]