[
 {
  "author": "lehors", 
  "date": "2001-01-23T17:54:44.000000Z", 
  "msg": [
   "This change is an optimized version of the patch from Jay Cain:", 
   "This patch modifies AttributeMap.java, AttrImpl.java, ElementImpl.java, and", 
   "ParentNode.java to optimize normalization. This is done by performing a", 
   "check when the set of a parent node's children have changed (inserted,", 
   "removed). If the change causes the parent to be unnormalized, it is flagged", 
   "as so, and its ancestors are inherently flagged as unnormalized.", 
   "Effectively, a call to the normalize method normalizes only the nodes that", 
   "need it, rather than walking through the entire subtree doing a brute-force", 
   "check.", 
   "This optimization is most effective on documents that are several levels", 
   "deep or for applications that blindly and frequently call normalize (such as", 
   "Cocoon). I did some tests using Cocoon and achieved an average performance", 
   "increase of 10% with a best-case scenario yielding close to 20%."
  ], 
  "revision_id": "316804"
 }, 
 {
  "author": "neilg", 
  "date": "2001-01-23T15:49:15.000000Z", 
  "msg": [
   "small fix to allow for compilation under Sun's JDK1.3"
  ], 
  "revision_id": "316803"
 }, 
 {
  "author": "andyc", 
  "date": "2001-01-23T04:47:54.000000Z", 
  "msg": [
   "Bug fix."
  ], 
  "revision_id": "316802"
 }, 
 {
  "author": "lehors", 
  "date": "2001-01-20T00:51:40.000000Z", 
  "msg": [
   "Applied patch from Mark Diekhans:", 
   "This patch provides for hiding the NodeList DOM methods when necessary.", 
   "The approach adds a method getChildNodesUnoptimized() to ParentNode", 
   "that return an anonymous class implementing NodeList.  If a subclass", 
   "has a conflicting method getLength() or item(int); it must implement", 
   "getChildNodes() and then call this method to get a NodeList.", 
   "This was done for a couple of reasons:", 
   "(1) Avoided duplicate code (in different files).", 
   "(2) Avoided needing to make various private fields in ParentNode", 
   "protected."
  ], 
  "revision_id": "316801"
 }, 
 {
  "author": "lehors", 
  "date": "2001-01-20T00:43:44.000000Z", 
  "msg": [
   "added authorship"
  ], 
  "revision_id": "316800"
 }
]