[
 {
  "author": "elena", 
  "date": "2001-02-01T16:06:45.000000Z", 
  "msg": [
   "Changes to DOM parser to *activate* DOM Level 3 (partial) support"
  ], 
  "revision_id": "316854"
 }, 
 {
  "author": "elena", 
  "date": "2001-02-01T16:04:40.000000Z", 
  "msg": [
   "Implemented some DOM Level 3 features.", 
   "Note: This implementation is experimental. DOM Level 3 is is in working", 
   "draft stage: it is still possible that changes in the specification occur.", 
   "Added features are:", 
   "EntityImpl", 
   "*encoding of type DOMString", 
   "An attribute specifying, as part of the text declaration, the encoding of", 
   "this entity, when it is an external parsed entity. This is null otherwise.", 
   "*version of type DOMString", 
   "An attribute specifying, as part of the text declaration, the version number", 
   "of this entity, when it is an external parsed entity. This is null otherwise.", 
   "- getEncoding(), getVersion(), setEncoding(), setVersion()", 
   "DocumentImpl:", 
   "*encoding of type DOMString", 
   "An attribute specifying, as part of the XML declaration, the encoding of", 
   "this document. This is null when unspecified.", 
   "*standalone of type boolean", 
   "An attribute specifying, as part of the XML declaration, whether this", 
   "document is standalone.", 
   "*version of type DOMString", 
   "An attribute specifying, as part of the XML declaration, the version", 
   "number of this document. This is null when unspecified.", 
   "- getEncoding(), getVersion(), setEncoding(), setVersion(), getStandalone(), setStandalone()"
  ], 
  "revision_id": "316853"
 }, 
 {
  "author": "andyc", 
  "date": "2001-02-01T09:58:44.000000Z", 
  "msg": [
   "Some massive bug fixes. All subtle but very important.", 
   "1) Fixed (hopefully all) inconsistencies with dealing with", 
   "unbound QName URIs. Parts of the code used the identifier", 
   "0 while other parts of the code use -1 and always mapped", 
   "it to 0 before using it. As expected, this is a very", 
   "fragile situation so I blitzed the code and changed all", 
   "occurrences to 0 so that we're now consistent. This", 
   "change touched a *lot* of files.", 
   "2) Did some additional work on the identity constraint", 
   "support. I'm working on a) enabling namespaces to work", 
   "in identity constraints, and b) comparing field values", 
   "in the values space instead of the lexical space which", 
   "is the current implementation."
  ], 
  "revision_id": "316852"
 }, 
 {
  "author": "", 
  "date": "2001-01-31T21:44:52.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'Xerces-J_1_3_0'."
  ], 
  "revision_id": "316851"
 }, 
 {
  "author": "neilg", 
  "date": "2001-01-31T21:44:52.000000Z", 
  "msg": [
   "fix for bad documentation file from last commit"
  ], 
  "revision_id": "316850"
 }
]