[
 {
  "author": "twl", 
  "date": "2001-02-14T15:56:21.000000Z", 
  "msg": [
   "basic stab at a 1.3.1 release plan", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "316904"
 }, 
 {
  "author": "lehors", 
  "date": "2001-02-14T02:26:09.000000Z", 
  "msg": [
   "fixed typo"
  ], 
  "revision_id": "316903"
 }, 
 {
  "author": "lehors", 
  "date": "2001-02-14T02:10:31.000000Z", 
  "msg": [
   "Finish up previous change.", 
   "The old constructors are back to avoid having to change too much code around", 
   "and the XMLDocumentScanner is again a concrete class so it can still be", 
   "used in places like the XPathMatcher."
  ], 
  "revision_id": "316902"
 }, 
 {
  "author": "lehors", 
  "date": "2001-02-13T22:51:26.000000Z", 
  "msg": [
   "Components are no longer created from the Parser constructor. Instead they", 
   "are created from an initialize method that is called before the first parse.", 
   "In addition, the initialize method only creates components that are not", 
   "already registered. This effectively allows an application to specify", 
   "through the relevant properties any components it wants. For instance, one", 
   "can do something like:", 
   "SAXParser parser = new SAXParser();", 
   "parser.setProperty(DOCUMENT_SCANNER, mydocscanner);", 
   "...", 
   "parser.parse(arg);", 
   "Also, the components are now stored in a Vector which is used to call", 
   "reset(), setFeature(), and setProperty() on every component, directly from", 
   "the base class. This saves us some code."
  ], 
  "revision_id": "316901"
 }, 
 {
  "author": "lehors", 
  "date": "2001-02-13T19:04:58.000000Z", 
  "msg": [
   "Moved the \"pipeline\" setup from XMLDocumentScanner to the lowest classes in", 
   "the hierarchy so that it can be changed without having to rewrite the whole", 
   "SAX and DOM parser classes.", 
   "This is achieved through the introduction of two new classes", 
   "AbstractSAXParser and AbstractDOMParser which implement the appropriate", 
   "callbacks independently of the actual pipeline being used.", 
   "While this allows some code to be reused it is still not 100% satisfactory", 
   "because the pipeline setup code can no longer be shared between different", 
   "parsers. So we end up duplicating some code anyway. For this reason, We", 
   "might want to move to using some kind of \"ParserConfiguration\" object."
  ], 
  "revision_id": "316900"
 }
]