[
 {
  "author": "elena", 
  "date": "2001-05-10T21:25:08.000000Z", 
  "msg": [
   "Redesigned datatype registry for the parser, to avoid dropping and recreating obj with each parse() call on the same parser instance. Now there are 3 datatype registries:", 
   "[1] dtd datatype registry - initialized if XML document contains a dtd", 
   "[2] schema datatype registry - initialized XML document contains a schema", 
   "[3] user-defined registry - includes user-defined schema datatypes", 
   "Note: dtd and schema registry will be initialized only once per parser instance (previously we would drop all the datatypes on the floor before each new parse())", 
   "user-defined registry will be reset between parse().", 
   "Another change include - creating only one DOMParser for parsing schema file. Yes.. we were creating new parser instance to parse each schema grammar.", 
   "After initial testing  (running same instance of parser 100 times, validating 2 XML documents with schema grammar), the results were:", 
   "Xerces Build CVS (05.09.2001): 767K objects were created", 
   "With the above changes results were: 497K Objects were created. [~25% less]", 
   "Things to do:", 
   "-- test :)", 
   "-- look at GrammarResolver (clearGrammarResolver() - should we try to have some grammar cashing? )"
  ], 
  "revision_id": "317119"
 }, 
 {
  "author": "lehors", 
  "date": "2001-05-10T18:11:10.000000Z", 
  "msg": [
   "our parser now uses accross the board an empty string on elements", 
   "and attributes with no namepace, the DOM still needs to return null though,", 
   "this fixes this. - bug #1164"
  ], 
  "revision_id": "317118"
 }, 
 {
  "author": "lmartin", 
  "date": "2001-05-10T17:50:57.000000Z", 
  "msg": [
   "more derivation by restriction constraint checking"
  ], 
  "revision_id": "317117"
 }, 
 {
  "author": "neilg", 
  "date": "2001-05-10T16:11:02.000000Z", 
  "msg": [
   "added support for the schema Identity constraints union operator."
  ], 
  "revision_id": "317116"
 }, 
 {
  "author": "lehors", 
  "date": "2001-05-10T15:51:24.000000Z", 
  "msg": [
   "fixed bug in handling of PE decls - bug #881"
  ], 
  "revision_id": "317115"
 }
]