[
 {
  "author": "andyc", 
  "date": "2001-08-02T08:49:04.000000Z", 
  "msg": [
   "Fixed bug in calling the parser with an input source that has", 
   "the same systemId and baseSystemId. The parser does a double", 
   "resolve which adds a base directory when it shouldn't. In", 
   "reality, though, this bug should be fixed in the parser", 
   "itself so that this can't happen in the future."
  ], 
  "revision_id": "317419"
 }, 
 {
  "author": "andyc", 
  "date": "2001-08-02T07:37:27.000000Z", 
  "msg": [
   "XNI samples weren't being included in the xercesSamples.jar file."
  ], 
  "revision_id": "317418"
 }, 
 {
  "author": "andyc", 
  "date": "2001-08-02T05:47:38.000000Z", 
  "msg": [
   "Fixed possible \"leak\" of XNIException in the setting and query of", 
   "features and properties. Because XNIException is derived from", 
   "RuntimeException, it doesn't have to be explicitly caught which", 
   "means that if not properly protected, these exceptions could", 
   "leak to the outside application using the parser. Since these", 
   "exceptions are meant to signal an internal error, they should", 
   "always be caught and either wrapped or properly handled before", 
   "they leak outside the parser. This patch fixes one such", 
   "possibility."
  ], 
  "revision_id": "317417"
 }, 
 {
  "author": "andyc", 
  "date": "2001-08-02T05:37:33.000000Z", 
  "msg": [
   "Added API JavaDoc into the documentation. Instead of just having", 
   "a single section that's either under-documented or over-documented,", 
   "I separated the javadocs into 4 categories:", 
   "* Standard APIs (JAXP, DOM, SAX)", 
   "* Xerces Native Interface (Core and Parser Configuration)", 
   "* Xerces2 Implementation", 
   "* Other Classes", 
   "Also updated the build.xml file to build these four sets of", 
   "javadocs separately."
  ], 
  "revision_id": "317416"
 }, 
 {
  "author": "andyc", 
  "date": "2001-08-02T05:35:08.000000Z", 
  "msg": [
   "Added package overviews to DOM and SAX source directories."
  ], 
  "revision_id": "317415"
 }
]