[
 {
  "author": "andyc", 
  "date": "2001-09-14T13:04:32.000000Z", 
  "msg": [
   "Added a non-normalized value to the XMLDTDHandler#internalEntityDecl", 
   "method in XNI and implemented it in Xerces2. Also implemented the", 
   "non-normalized attribute values as well. Next: remove the entities", 
   "methods from the XMLAttributes interface."
  ], 
  "revision_id": "317579"
 }, 
 {
  "author": "lehors", 
  "date": "2001-09-13T23:34:13.000000Z", 
  "msg": [
   "Improved memory footprint by moving out the NodeList cache fields into a", 
   "separate object and implementing a pool of those on the Document.", 
   "Tests show an improvement of up to 7% without any degradation of the perfs.", 
   ":-)", 
   "Thanks to Andy Heninger for his help in designing this one!"
  ], 
  "revision_id": "317578"
 }, 
 {
  "author": "sandygao", 
  "date": "2001-09-13T22:17:24.000000Z", 
  "msg": [
   "1. Changed the place to call handleOccurrences (now checkOccurrences).", 
   "2. Added XSAttributeUse class."
  ], 
  "revision_id": "317577"
 }, 
 {
  "author": "neilg", 
  "date": "2001-09-13T21:26:00.000000Z", 
  "msg": [
   "Added identity constraint code, ported from the v1 package.  Several", 
   "things to note:", 
   "1.  Broke out an xpath package from the original \"identity\" package.", 
   "I did this so that, should we need the xpath code for something other", 
   "than identity constraint support (such as DOM level 3), it's there.", 
   "2.  I've merged the unique and key classes and also their traversers.", 
   "I did this because, from a schema compilation prospective, they're", 
   "virtually identical; the differences with respect to validation can be", 
   "accomodated with the type field of the base class.", 
   "3.  I've also changed the storage implementation in the grammar class", 
   "from being Vector'based to being array based.  This allows <keyref>s", 
   "to store indeces of the keys they reference rather than object", 
   "references."
  ], 
  "revision_id": "317576"
 }, 
 {
  "author": "elena", 
  "date": "2001-09-13T21:02:04.000000Z", 
  "msg": [
   "move all schema related code to v2"
  ], 
  "revision_id": "317575"
 }
]