[
 {
  "author": "sandygao", 
  "date": "2001-08-24T18:55:25.000000Z", 
  "msg": [
   "Updated (and cleaned) version of all schema symbols."
  ], 
  "revision_id": "317504"
 }, 
 {
  "author": "neilg", 
  "date": "2001-08-24T15:24:18.000000Z", 
  "msg": [
   "This class is the successor to the", 
   "org.apache.xerces.validators.schema.XUtil class from Xerces1.  The", 
   "purpose of both classes was to provide a partial abstraction from the", 
   "DOM to be used by the schema parser, so that, should we ever decide to", 
   "use some representation other than the DOM for schema documents, the", 
   "job of porting would be easier.", 
   "This class has additional functionality to serve this purpose.", 
   "Specifically, it adds generic methods to get at the owner document and", 
   "for dealing with attributes.  It also provides some methods dealing", 
   "with \"hidden\" Elements; this will have particular significance for the", 
   "new schema design, but might possibly be handy for other applications.", 
   "We decided to move this class into the util package because it's", 
   "possible that other applications might want to abstract themselves", 
   "somewhat from the DOM and might find this useful.", 
   "Since there's nothing specific about the class to the new schema", 
   "design, we decided to add it in to a live package without making a", 
   "branch; it doesn't hurt anything and can always be removed."
  ], 
  "revision_id": "317503"
 }, 
 {
  "author": "elena", 
  "date": "2001-08-24T12:06:40.000000Z", 
  "msg": [
   "Adding design stubs for XML Schema component traversers.", 
   "These could be changed or modified later."
  ], 
  "revision_id": "317502"
 }, 
 {
  "author": "", 
  "date": "2001-08-24T06:47:45.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'Xerces-J_2_0_0_beta2'."
  ], 
  "revision_id": "317501"
 }, 
 {
  "author": "andyc", 
  "date": "2001-08-24T06:47:45.000000Z", 
  "msg": [
   "Putting back Edwin Goei's changes made from xerces_j_2 branch."
  ], 
  "revision_id": "317500"
 }
]