[
 {
  "author": "rahuls", 
  "date": "2002-01-23T15:31:22.000000Z", 
  "msg": [
   "Cleaning Javadoc comments related to recent XNI changes."
  ], 
  "revision_id": "318124"
 }, 
 {
  "author": "neeraj", 
  "date": "2002-01-23T15:27:11.000000Z", 
  "msg": [
   "Cleaning Javadoc comments for the recent XNI changes done."
  ], 
  "revision_id": "318123"
 }, 
 {
  "author": "edwingo", 
  "date": "2002-01-23T01:09:59.000000Z", 
  "msg": [
   "Synced up code to work w/ Xerces2beta4 in the area of JAXP schemaLanguage", 
   "property.  The code sets the appropriate internal features correctly now.", 
   "Also, returned the Xerces2 SAX parser directly for the SAX1 getParser()", 
   "call instead of wrapping it in a SAX2 ParserAdapter()."
  ], 
  "revision_id": "318122"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-01-22T23:45:09.000000Z", 
  "msg": [
   "Now we use property files for error codes."
  ], 
  "revision_id": "318121"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-01-22T23:37:26.000000Z", 
  "msg": [
   "Solving many problems related to schema document resolution:", 
   "1. Bug[5849]: can't validate schema documents against the schema for", 
   "schemas;", 
   "2. We failed to report an error when the importing and the imported schema", 
   "documents have the same target namespace;", 
   "3. We failed to report an error when the including and the included schema", 
   "documents have different non-absent target namespaces;", 
   "4. We should use different error codes for similar errors related to importing,", 
   "including, redefining, and reference from the instance document;", 
   "5. We failed to deal with the case where the same schema document without", 
   "a target namespace is included by two other schema documents with", 
   "different target namespaces. We only considered one of the inclusions.", 
   "(Similar problem occurred for <redefine>.)", 
   "6. Bug[4421]: We failed to deal with the case where the same schema", 
   "document (with no target namespace) is both included and imported by the", 
   "same schema document. We only considered the first reference. (Similar problem occurred for <redefine>.)", 
   "7. In DOMASBuilderImpl, we should convert a URI input to an InputSource,", 
   "not the other way around;", 
   "8. If the input is a DOMInputSource, we need to create an XMLInputSource", 
   "accordingly;", 
   "9. For grammar-preparsing methods, we shouldn't call EntityResolver for the", 
   "locations."
  ], 
  "revision_id": "318120"
 }
]