[
 {
  "author": "neeraj", 
  "date": "2002-02-19T21:03:39.000000Z", 
  "msg": [
   "Adding default grammar caching implementation support. If grammar is not", 
   "available with the parser, validator component gives a chance to the", 
   "application", 
   "1. to supply initial set of grammars to begin parsing with.", 
   "2. to supply the required grammar as per description.", 
   "3. to cache different grammars, validator component ended up with after current", 
   "validation attempt. Application can provide these cached grammar, available", 
   "to the parser before the next validation attempt.", 
   "Current changes include schema validator and related components. Loading", 
   "of the schema grammar is deferred until there is actual reference to a component from", 
   "that namespace. Default implementation caches the Schema Grammar using namespace", 
   "as key. Application can always *over-ride* this behavior by providing its own", 
   "version of XMLGrammarPool impl or extending default XMLGrammarPoolImpl and can", 
   "choose to cache/supply Schema Grammars based on namespace & triggering component", 
   "or namespace & context etc.. or other information available through XSDDescription.", 
   "Next set of changes (DTDValidator) need to be done for caching of DTD grammars.", 
   "Default implementaion will cache the DTD grammar as per the root element..", 
   "which can always be over-ridden by the application :-)", 
   "Thanks to pavani for her part of changes. Pavani, i have integrated my changes", 
   "with yours."
  ], 
  "revision_id": "318229"
 }, 
 {
  "author": "elena", 
  "date": "2002-02-19T19:36:12.000000Z", 
  "msg": [
   "add tests to verify correctness of namespace algorithm"
  ], 
  "revision_id": "318228"
 }, 
 {
  "author": "rahuls", 
  "date": "2002-02-19T11:27:32.000000Z", 
  "msg": [
   "Using constants defined in impl.Constants.java and removing hardcodings for features and properties."
  ], 
  "revision_id": "318227"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-02-18T22:30:26.000000Z", 
  "msg": [
   "Now we have line/column numbers for all schema errors!"
  ], 
  "revision_id": "318226"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-02-18T21:00:21.000000Z", 
  "msg": [
   "The two files were moved to dv.util package."
  ], 
  "revision_id": "318225"
 }
]