[
 {
  "author": "elena", 
  "date": "2002-03-12T22:13:24.000000Z", 
  "msg": [
   "We failed to report an error if element was undeclared in the case DTD was", 
   "declaring some attributes for this undeclared element. DTD grammar always", 
   "create \"dummy\" element declaration to store attributes. The only way for us", 
   "to know if element was declared or not, is if elementDecl has a content spec type.", 
   "This fixes http://nagoya.apache.org/bugzilla/show_bug.cgi?id=6911."
  ], 
  "revision_id": "318269"
 }, 
 {
  "author": "neilg", 
  "date": "2002-03-12T21:32:48.000000Z", 
  "msg": [
   "Fix for some performance problems relating to the way in which encodings are detected.  Two parts to the fix:", 
   "1.  We now read only a small number (64 bytes) one at a time at the beginning of external entities in order to correctly process their encoding declarations.  Formerly, in certain cases we would end up reading at least 2K bytes one at a time, particularly when using default Java Reader classes.", 
   "2.  Previously, there were cases in which we did not turn off this one-byte-at-a-time behaviour.  Now it is turned off for all kinds of external entity once the encoding is finally determined."
  ], 
  "revision_id": "318268"
 }, 
 {
  "author": "elena", 
  "date": "2002-03-12T18:41:49.000000Z", 
  "msg": [
   "Applying patch suggested by Joe Kesselman. This fixes the following bug:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=6888"
  ], 
  "revision_id": "318267"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-03-12T14:52:49.000000Z", 
  "msg": [
   "Fixing bug [7039]. Error rmessage typo."
  ], 
  "revision_id": "318266"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-03-07T19:19:59.000000Z", 
  "msg": [
   "Fixing bug [6894]: in DOMASBuilderImpl, we can't assume a grammar pool", 
   "implementation is already available. In fact, we need to revisit the place:", 
   "we always need to create our own grammar pool."
  ], 
  "revision_id": "318265"
 }
]