[
 {
  "author": "sandygao", 
  "date": "2002-04-04T18:49:45.000000Z", 
  "msg": [
   "1. Storing imported schema grammars in SchemaGrammar objects;", 
   "2. When a grammar is retrieved from a grammar pool, recursively get all", 
   "grammars imported by this grammar, and add all of them to the bucket.", 
   "3. REVISIT: When a grammar from grammar pool has the same target", 
   "namespace as one of the grammars in the bucket, issue a warning, and", 
   "ignore the grammar."
  ], 
  "revision_id": "318314"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-04-04T18:36:34.000000Z", 
  "msg": [
   "Cleaned up some error messages:", 
   "1. Remove (old) error codes that are not used;", 
   "2. Convert references to old codes to new ones (defined by the spec.)", 
   "Now only error codes of Identity Constraint are not from the spec."
  ], 
  "revision_id": "318313"
 }, 
 {
  "author": "elena", 
  "date": "2002-04-04T15:35:10.000000Z", 
  "msg": [
   "The documentations in the Java source files contained errors and", 
   "formatting issues. Updated interfaces using published zips on DOM Level 2", 
   "Errata page: http://www.w3.org/2000/11/DOM-Level-2-errata"
  ], 
  "revision_id": "318312"
 }, 
 {
  "author": "elena", 
  "date": "2002-04-04T00:00:06.000000Z", 
  "msg": [
   "Fix for class cast exception. ASDOMImplementationImpl now inherits from DOMImplementationImpl."
  ], 
  "revision_id": "318311"
 }, 
 {
  "author": "elena", 
  "date": "2002-04-03T23:48:27.000000Z", 
  "msg": [
   "Tried to optimize XML Schema parsing code:", 
   "1. Implemented XSDeclarationPool.", 
   "2. Modified impl.xs.DOMParser to use NonValidatingConfiguration and specify CoreDocumentImpl", 
   "as DocumentClassName for parsers.DOMParser.", 
   "3. Implemented DOMNodePool that manages the pool of DOM nodes that are", 
   "used for parsing XML Schemas.", 
   "I wrote a small program that was parsing and validating 6 files for about 20 times each.", 
   "The test showed ~7.8% decrease in object creation. The speed of the parser remained the same."
  ], 
  "revision_id": "318310"
 }
]