[
 {
  "author": "elena", 
  "date": "2002-06-01T16:36:36.000000Z", 
  "msg": [
   "-- To preserve backwards compatibility with Xerces1, XMLSerializer no longer fixes namespaces by default.", 
   "Users will have to call setNamespaces(true) on XMLSerializer to activate namespace fixup algorithm.", 
   "DOMWriter by default attempts to fix namespaces.", 
   "-- Add implementation of ShadowedSymbolTable to utils: it is used in DOM Revalidation and for Cashing parser configuration.", 
   "-- Modify DOMNormalizer to add symbols to a symbol table before calling the XMLSchemaValidator."
  ], 
  "revision_id": "318429"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-05-31T22:20:57.000000Z", 
  "msg": [
   "Potential NPE. When the returned grammar from grammar loader is null,", 
   "return null from parseAS methods."
  ], 
  "revision_id": "318428"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-05-31T21:40:11.000000Z", 
  "msg": [
   "- Implement the updated ElementPSVI interface to expose [schema information] proeprty;", 
   "- A new interface XSNamespaceItem to mode the [namespace schema information item];", 
   "- A new method in XSModel to return a list of XSNamespaceItem", 
   "Now users can:", 
   "1. Get an ElementPSVI from the XNI augmentation of the validation root (normally the root element);", 
   "2. Get XSModel from it by calling ElementPSVI#getSchemaInformation();", 
   "3. Get a list of XSNamespaceItem by XSModel#getNamespaceItems;", 
   "4. From each XSNamespaceItem, get its target namespace, components of that namespace,", 
   "and document locations that contribute to that namespace."
  ], 
  "revision_id": "318427"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-05-31T21:30:56.000000Z", 
  "msg": [
   "Added a new method on the element psvi item interface to return the", 
   "[schema information] property. This property is only available on the", 
   "validation root."
  ], 
  "revision_id": "318426"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-05-30T18:28:36.000000Z", 
  "msg": [
   "Didn't mean to commit the two sample files in my previous commit. :-P", 
   "Now I'm taking them out.", 
   "Also a faq for pull-parsing was (accidentally) commited with the last commit."
  ], 
  "revision_id": "318425"
 }
]