[
 {
  "author": "lehors", 
  "date": "2002-08-01T01:45:49.000000Z", 
  "msg": [
   "new version without any static table to avoid static mutability problems"
  ], 
  "revision_id": "318579"
 }, 
 {
  "author": "neilg", 
  "date": "2002-07-31T22:03:45.000000Z", 
  "msg": [
   "Got rid of old dtdjar* targets because they did not seem to be useful; renamed tinyjar* to dtdjar*.  Also added a new target, xml11jars, so that a xercesImpl can be built which transparently uses the new (experimental!) XML 1.1 support.  Finally, renamed the output of the various new targets so that the resulting jars have somewhat self-describing names, and so that everything is not xercesImpl.jar."
  ], 
  "revision_id": "318578"
 }, 
 {
  "author": "neilg", 
  "date": "2002-07-31T21:25:24.000000Z", 
  "msg": [
   "This commit addresses several things:", 
   "- adds entries for a number of encodings that some", 
   "JDK's support which we previously didn't;", 
   "- adds support for IBM1047.  This is not yet part of the IANA", 
   "registry, but there is a proposal to add it; see", 
   "http://lists.w3.org/Archives/Public/ietf-charsets/2002JulSep/0049.html", 
   "- Add a number of aliases that contain dashes.  This proposal", 
   "has also yet to be accepted by IANA; details can be found at:", 
   "http://lists.w3.org/Archives/Public/ietf-charsets/2002JulSep/0058.html", 
   "If either proposal is rejected, the change can be reverted", 
   "easily enough."
  ], 
  "revision_id": "318577"
 }, 
 {
  "author": "neilg", 
  "date": "2002-07-31T14:08:12.000000Z", 
  "msg": [
   "Implemented a test platform on which XML 1.1 can be implemented.", 
   "Here, I have only implemented XML 1.1 whitespace handling and support for the new version number.  But, using this architecutre, it should be possible to implement the rest of the new features without disturbing the current XML 1.0 default.", 
   "The implementation is based on a new configuration (XML11Configuration) which extends StandardParserConfiguration by creating a new XMLEntityManager, XMLDocumentScanner and XMLDTDScanner components which implement XML 1.1 functionality.  This is not the most efficient approach from the XML 1.1 perspective, but it allows the current code to remain (almost completely) unchanged--particularly advantageious given the performance challenges of some XML 1.1 features.  Still to do will be to properly extend XMLChar to take into account things like the new XML 1.1 definition of Name/NCName."
  ], 
  "revision_id": "318576"
 }, 
 {
  "author": "neilg", 
  "date": "2002-07-31T14:00:08.000000Z", 
  "msg": [
   "making this class somewhat more extensible by providing a method for the constructor to call to create an instance of the EntityScanner implementation."
  ], 
  "revision_id": "318575"
 }
]