[
 {
  "author": "sandygao", 
  "date": "2002-10-25T16:17:34.000000Z", 
  "msg": [
   "Use a different way to convert the file path to a URI. This approach is similar", 
   "to what's in XMLEntityManager, and it can handle non-ASCII characters.", 
   "When \"ConvertToURI\" is updated to be able to handle non-ASCII characters,", 
   "we can come back and choose the better solution."
  ], 
  "revision_id": "318799"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-10-24T15:56:35.000000Z", 
  "msg": [
   "Performance fix: we don't always need to append textual content to", 
   "the buffer. It's only neccesary when the element decl has a fixed value", 
   "constraint, or the type is simple."
  ], 
  "revision_id": "318798"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-10-24T15:19:53.000000Z", 
  "msg": [
   "1. Fixing validation bug: need to a flag to indicate whether textual data appeared", 
   "in the content of an element. We used to check the length of fBuffer, but for", 
   "perforance reasons, we don't always want to append textual data into such", 
   "buffer, and sometimes the buffer is normalized, hence could be empty even", 
   "if there were character data (all whitespaces).", 
   "2. We don't need to know the could of sub-elements. Using a boolean", 
   "fSubElement to replace the integer fChildCount."
  ], 
  "revision_id": "318797"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-10-23T23:00:51.000000Z", 
  "msg": [
   "Fixing bugs related to PSVI properties \"validity\" and \"validation attempted\":", 
   "1. it's not invalid if an element decl/type definition can't be found for the root", 
   "element. for historical reasons, we still report an error in this case, but in PSVI,", 
   "the validity should be unknown.", 
   "2. if an sub-element/attribute is invalid, then the containing element should be", 
   "invalid too.", 
   "3. if an element is laxly assessed, its validity should be unknown, instead of", 
   "valid.", 
   "4. if an element is laxly assessed, and it doesn't have any children, its \"validation", 
   "attempted\" should be \"none\", not \"full\"."
  ], 
  "revision_id": "318796"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-10-23T22:57:05.000000Z", 
  "msg": [
   "Fixing a bug in traversing wildcards: a static value was updated when multiple", 
   "wildcards are traversed, if none of them specifies the \"namespace\" attribute."
  ], 
  "revision_id": "318795"
 }
]