[
 {
  "author": "elena", 
  "date": "2002-09-12T21:56:57.000000Z", 
  "msg": [
   "Add a specialized scanner implementation that is also responsible for binding the namespace.", 
   "This scanner will not bind namespaces if DTD grammar is available since it might add", 
   "some default namespace attribute.", 
   "Add a new DTD Validator that is responsible to bind namespaces, in case the scanner", 
   "could not do it.", 
   "Create a new parser configuration that uses this scanner and DTD validator and does not include the XMLNamespaceBinder", 
   "in the pipeline.", 
   "This should increase the spead of parsing from 6%-12% (depending on the size of the document and document structure).", 
   "More changes will be added later -- to optimize namespace binding in the DTD, and in the scanner."
  ], 
  "revision_id": "318704"
 }, 
 {
  "author": "neilg", 
  "date": "2002-09-12T20:44:11.000000Z", 
  "msg": [
   "processing instruction targets were not being reset.  This should fix Xalan smoketests."
  ], 
  "revision_id": "318703"
 }, 
 {
  "author": "sandygao", 
  "date": "2002-09-12T02:50:27.000000Z", 
  "msg": [
   "Some cleanup in the schema validator:", 
   "1. Removed some code/variable that are never used;", 
   "2. Moved some one-time initialization code from \"reset()\" to the constructor;", 
   "3. Moved PSVI-related code closer to each other to improve readability."
  ], 
  "revision_id": "318702"
 }, 
 {
  "author": "neilg", 
  "date": "2002-09-11T20:22:35.000000Z", 
  "msg": [
   "this change attempts to address poor performance parsing documents with very large comments.", 
   "I observed between 10% and 15% improvement (depending on the kind of parser being used) on a 200K file with a 100K comment."
  ], 
  "revision_id": "318701"
 }, 
 {
  "author": "neilg", 
  "date": "2002-09-11T14:13:08.000000Z", 
  "msg": [
   "make the XNI samples use our classloading mechanism, rather than", 
   "simply relying on Class.forName()."
  ], 
  "revision_id": "318700"
 }
]