[
 {
  "author": "mrglavas", 
  "date": "2004-01-29T22:26:00.000000Z", 
  "msg": [
   "Fixing Bug #26437:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=26437.", 
   "When the schema loader is used for preparsing schemas we", 
   "weren't attaching a message formatter for the schema", 
   "domain. We also weren't using the user's error reporter.", 
   "Thanks to Lucian Holland for providing this patch."
  ], 
  "revision_id": "319729"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-01-29T21:13:09.000000Z", 
  "msg": [
   "Support 'infoset' parameter in DOM core. Also fixing a bug.", 
   "We don't currently support setting element-content-whitespace", 
   "to false so we should be reporting that it isn't supported."
  ], 
  "revision_id": "319728"
 }, 
 {
  "author": "elena", 
  "date": "2004-01-29T21:11:30.000000Z", 
  "msg": [
   "Adding support for \"well-formed\" and \"infoset\" features for serialization. Currently,", 
   "\"well-formed\" features is implemented inefficiently -- we walk the tree twice, in the future", 
   "we should perform well-formness checking as we serialize the tree. Fixed some minor bugs", 
   "in hangling \"cdata-sections\" and \"entities\" features.", 
   "Reorganized code in DOMSerializerImpl on how to handle parameters. The code still needs more work:", 
   "we need to try consolidate different configurations impls (for serializer, parser, core normalizeDocument).", 
   "Added new LSException for write* methods."
  ], 
  "revision_id": "319727"
 }, 
 {
  "author": "elena", 
  "date": "2004-01-29T21:06:04.000000Z", 
  "msg": [
   "Some cleanup as well as making methods for well-formness check public, to allow serializer to", 
   "access those methods (LSSerializer needs it for \"well-formed\" checking)."
  ], 
  "revision_id": "319726"
 }, 
 {
  "author": "elena", 
  "date": "2004-01-29T21:03:06.000000Z", 
  "msg": [
   "Let DOMMessageFormatter also support reporting XML messages (needed for well-formness check)."
  ], 
  "revision_id": "319725"
 }
]