[
 {
  "author": "sandygao", 
  "date": "2004-04-12T20:13:42.000000Z", 
  "msg": [
   "Committing Mike Boos' PSVI writer patches to fix various problems."
  ], 
  "revision_id": "319879"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-04-08T22:24:52.000000Z", 
  "msg": [
   "Infrastructure work in the scanners to support the SAX2 Extensions 1.1", 
   "interface EntityResolver2, specifically getExternalSubset which", 
   "allows an application to provide an external subset for a document", 
   "which doesn't otherwise have one.", 
   "The scanners are now able to handle all three cases where a resolver", 
   "may be queried for external subset:", 
   "1) Neither an external or internal subset exist.", 
   "2) Only an internal subset exists.", 
   "3) No DOCTYPE declaration in the document.", 
   "In the third case, scanning of the root element is broken up into", 
   "three segments:", 
   "1) Scan the root element QName.", 
   "2) Query the resolver with the root name and base URI, if it", 
   "locates an external subset then read it.", 
   "3) Scan the remainder of the start tag.", 
   "If an external subset is located the public id and system id", 
   "from the XMLInputSource returned from the resolver are", 
   "reported to doctypeDecl. This is what SAX expects."
  ], 
  "revision_id": "319878"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-04-07T15:42:05.000000Z", 
  "msg": [
   "Fixing a bug.", 
   "Back out preformance improvement made in Xerces 2.6.2 to", 
   "prevent the iterative search over an attribute list for", 
   "namespace attributes when no namespaces have been", 
   "declared in the current context. Testing if there are no", 
   "declared prefixes doesn't work in the case where an instance", 
   "document contains the declaration", 
   "xmlns:xml='http://www.w3.org/XML/1998/namespace' on an", 
   "element with no other namespace declarations. Since we don't", 
   "report this mapping to the namespace context such declarations", 
   "would be missed and then appear in the SAX event stream in", 
   "error.", 
   "Since the strings of a QName are always interned, use reference", 
   "comparison instead of equals to buy a little performance back."
  ], 
  "revision_id": "319877"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-04-06T18:37:57.000000Z", 
  "msg": [
   "List SAX and DOM licenses among files included in the", 
   "source and binary distributions."
  ], 
  "revision_id": "319876"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-04-06T17:34:55.000000Z", 
  "msg": [
   "Package W3C software and documentation licenses in", 
   "the source and binary distributions."
  ], 
  "revision_id": "319875"
 }
]