[
 {
  "author": "mrglavas", 
  "date": "2004-03-09T23:30:33.000000Z", 
  "msg": [
   "Fixing a typo."
  ], 
  "revision_id": "319834"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-03-09T23:21:06.000000Z", 
  "msg": [
   "Update references to XML Schema API."
  ], 
  "revision_id": "319833"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-03-05T22:17:00.000000Z", 
  "msg": [
   "Fixing Bug #27083 & #27422:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=27083", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=27422", 
   "Malformed UTF-8 and US-ASCII byte sequences encountered", 
   "while parsing a document are well-formedness errors. Report", 
   "them to the error reporter like every other well-formedness", 
   "violation instead of letting the IOException propogate the", 
   "user.", 
   "This fixes a bug in XInclude processing where the processor", 
   "would treat an IOException thrown because one of our", 
   "readers detected a bad byte sequence as a ResourceError,", 
   "causing the XInclude processor to look for a fallback to", 
   "parse instead of failing. The result of this would be a", 
   "malformed stream of events.", 
   "For ASCII, we were only using our built-in reader if the", 
   "encoding specified was the canonical name US-ASCII. For", 
   "aliases the Java InputStreamReader was being picked up", 
   "which doesn't seem to report bad ASCII bytes. Now we", 
   "look into the EncodingMap so that we cover all of ASCII's", 
   "aliases."
  ], 
  "revision_id": "319832"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-03-04T22:48:08.000000Z", 
  "msg": [
   "Partial fix for Bug #27422:", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=27422", 
   "Report a fatal error for malformed byte sequences in a", 
   "given encoding, specifically UTF-8 and US-ASCII."
  ], 
  "revision_id": "319831"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-03-04T19:27:13.000000Z", 
  "msg": [
   "As a first step towards fixing Bug #27083 and #27422", 
   "modify our internal readers so that they throw a new", 
   "exception class which exposes the necessary fields", 
   "required for generating localized error messages. This", 
   "allows these exceptions to be caught where appropriate", 
   "so that the error which occured may be reported to", 
   "an error reporter."
  ], 
  "revision_id": "319830"
 }
]