[
 {
  "author": "mrglavas", 
  "date": "2004-07-20T04:07:17.000000Z", 
  "msg": [
   "Applying a few bug fixes.", 
   "An xi:include element must not contain any elements from", 
   "the XInclude namespace other than xi:fallback.", 
   "An xi:fallback element must not contain any elements from", 
   "the XInclude namespace other than xi:include."
  ], 
  "revision_id": "319994"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-07-20T04:04:38.000000Z", 
  "msg": [
   "Updating test document. Must unbind namespace on", 
   "'child4' element. An xi:fallback element must not", 
   "contain any elements from the XInclude namespace", 
   "other than xi:include."
  ], 
  "revision_id": "319993"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-07-20T02:30:16.000000Z", 
  "msg": [
   "Fixing an AIOOBE which may occur when an xi:include", 
   "element appears as the top-level document element.", 
   "Since no members of the array were marked as valid", 
   "we were running off the front of the array. Now, if", 
   "we reach the root we always stop."
  ], 
  "revision_id": "319992"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-07-19T02:22:50.000000Z", 
  "msg": [
   "Fixing Jira Bug #843:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-843", 
   "To ensure that only the aggregate document is schema validated, the", 
   "XInclude handler sets the schema feature to false to keep the child", 
   "pipeline it creates from containing a schema validator. This will activate", 
   "the DTD validator on the child pipeline if the validation feature was set", 
   "to true, causing the include to be validate against a (probably", 
   "non-existent) DTD.", 
   "This should now be fixed. In addition to turning the schema validation", 
   "feature off, turn off other related validation features."
  ], 
  "revision_id": "319991"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-07-18T20:06:41.000000Z", 
  "msg": [
   "Fixing Jira Bug #950:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-950", 
   "Eliminating the check to see what the value of 'schema-type'", 
   "is before setting schema-location is needed since the order in", 
   "which they are set does not matter. schema-location should", 
   "be \"ignored\" if schema-type has not been set, but it still must", 
   "be allowed to be set. Patch thanks to Naela Nissar."
  ], 
  "revision_id": "319990"
 }
]