[
 {
  "author": "mrglavas", 
  "date": "2004-06-03T19:41:50.000000Z", 
  "msg": [
   "Grammar Caching and SAX's EntityResolver2:", 
   "Do not bother checking the grammar pool if no public or system identifier was provided.", 
   "Since so many different DTDs have roots in common, using only a root name as the", 
   "key may cause the wrong grammar to be retrieved from the grammar pool. This scenario", 
   "would occur when an ExternalSubsetResolver has been queried and the", 
   "XMLInputSource returned contains an input stream but no external identifier.", 
   "This can never happen when the instance document specified a DOCTYPE."
  ], 
  "revision_id": "319934"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-06-03T16:13:39.000000Z", 
  "msg": [
   "Some cleanup, minor performance improvements.", 
   "1) Reuse XMLDTDDescription object instead of creating a new one every time.", 
   "2) Marking fields of reusable temp objects as final as they are never reassigned."
  ], 
  "revision_id": "319933"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-06-03T15:30:49.000000Z", 
  "msg": [
   "Fixing a bug reported to xerces-j-user by Robert Houben:", 
   "http://marc.theaimsgroup.com/?l=xerces-j-user&m=108587697229050&w=2", 
   "We were performing reference comparison with the namespace name", 
   "passed into getComponentsByNamespace. The XML Schema API does not", 
   "constrict users to using internalized strings so we must use equals.", 
   "Should also be returning an empty map when a grammar does not exist", 
   "for a given namespace instead of null.", 
   "Both of these problems are now fixed."
  ], 
  "revision_id": "319932"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-06-01T17:20:42.000000Z", 
  "msg": [
   "Fixing Jira Bug #974:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-974", 
   "The code samples in the DOM documentation attempt to", 
   "retrieve an instance of DOMImplementationLS with the", 
   "\"LS-Load\" feature.  This was changed to \"LS\". Fixed", 
   "thanks to the patch by Jonathan Au."
  ], 
  "revision_id": "319931"
 }, 
 {
  "author": "venu", 
  "date": "2004-05-31T05:31:30.000000Z", 
  "msg": [
   "Fix for  http://issues.apache.org/jira/browse/XERCESJ-971"
  ], 
  "revision_id": "319930"
 }
]