[
 {
  "author": "mrglavas", 
  "date": "2004-08-16T01:27:29.000000Z", 
  "msg": [
   "Propagate buffer size to child pipelines."
  ], 
  "revision_id": "320029"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-08-16T01:05:01.000000Z", 
  "msg": [
   "The XInclude 1.0 CR [1] states that: \"It is a fatal error to attempt to", 
   "replace an xi:include element appearing as the document (top-level)", 
   "element in the source infoset with something other than a list of zero", 
   "or more comments, zero or more processing instructions, and one", 
   "element.\"", 
   "We were allowing merged infosets with multiple or no root elements", 
   "to pass through as well as those containing non-whitespace", 
   "characters and unexpanded entity references outside of the root.", 
   "This should be fixed for now except for an edge case involving", 
   "text includes.", 
   "[1] http://www.w3.org/TR/xinclude/#creating-result"
  ], 
  "revision_id": "320028"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-08-15T21:22:16.000000Z", 
  "msg": [
   "All classes which extend java.lang.Throwable implement", 
   "java.io.Serializable.  Adding serialVersionUIDs to all", 
   "Exception and Error classes which didn't have them.", 
   "When not explicitly specified, the serialVersionUID is", 
   "computed using a variety of properties of the class.", 
   "Making a compatible change such as adding a new method", 
   "would change this generated ID.  Explicitly specifying them", 
   "now should help us avoid possible interoperability problems", 
   "in the future."
  ], 
  "revision_id": "320027"
 }, 
 {
  "author": "nddelima", 
  "date": "2004-08-13T21:24:25.000000Z", 
  "msg": [
   "Fixing a bug in RangeImpl related to the effect of DOM mutations (insertions) on Ranges."
  ], 
  "revision_id": "320026"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-08-13T19:15:30.000000Z", 
  "msg": [
   "Fixing a number of bugs regarding namespace fixup:", 
   "1) When adding an attribute for the default namespace", 
   "we were reporting that the prefix was 'xmlns' instead of null.", 
   "2) When adding a namespace declaration which unbinds", 
   "a namespace we were reporting null as the value of this", 
   "attribute instead of the empty string.", 
   "3) Start and end prefix mappings were not being reported", 
   "in SAX because the prefix was not being declared in the", 
   "current context."
  ], 
  "revision_id": "320025"
 }
]