[
 {
  "author": "mrglavas", 
  "date": "2004-07-30T22:15:22.000000Z", 
  "msg": [
   "Fixing Jira Bug #997:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-997", 
   "Fixing an NPE which may occur in the hashCode method", 
   "when either the localpart or rawname fields are null. This", 
   "seems to only be a problem for external users of this class."
  ], 
  "revision_id": "320004"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-07-30T22:10:54.000000Z", 
  "msg": [
   "JIRA Issue #998:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-998", 
   "Improve the performance of the symbol table by", 
   "dynamically resizing it and rehashing it once it", 
   "reaches some threshold. Previously the SymbolTable", 
   "did not scale well, since the size of the table was", 
   "fixed.  Neeraj had started looking at this a couple", 
   "years ago.  Thanks to John Kim for contributing", 
   "this performance improvement."
  ], 
  "revision_id": "320003"
 }, 
 {
  "author": "sandygao", 
  "date": "2004-07-23T22:55:21.000000Z", 
  "msg": [
   "Fixing Jira bug [XERCESJ-994].", 
   "When the values for features/properties don't change between parses,", 
   "we don't bother getting those values again in \"reset\".", 
   "The parser has a list of external schema locations, which is cleared in \"reset\".", 
   "We need to re-parse the external schema location properties in \"reset\" to", 
   "rebuild such list, regardless of whether the values of the properties changed.", 
   "Also removing an unused variable, whose resetting algorithm looks suspecious", 
   "too."
  ], 
  "revision_id": "320002"
 }, 
 {
  "author": "sandygao", 
  "date": "2004-07-23T22:49:52.000000Z", 
  "msg": [
   "Formatting changes: Converting leading tabs to 4 spaces. They look really", 
   "ugly in some editors."
  ], 
  "revision_id": "320001"
 }, 
 {
  "author": "sandygao", 
  "date": "2004-07-23T22:16:09.000000Z", 
  "msg": [
   "Fixing Jira bug [XERCESJ-991].", 
   "Sometimes, due to some schema errors, we try to remove a particle from", 
   "another particle which is empty. We didn't check for this case, and got an NPE.", 
   "Note that this commit includes many accidental whitespace changes.", 
   "The really changes are between lines 1655 and 1665."
  ], 
  "revision_id": "320000"
 }
]