[
 {
  "author": "mrglavas", 
  "date": "2004-10-25T16:09:07.000000Z", 
  "msg": [
   "Fixing JIRA Bug #1016:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-1016", 
   "Before scanning data we assert that the number of characters", 
   "left in the current entity is at least as long as the end", 
   "delimiter for the structure. Previously if the number of", 
   "characters left in the entity was equal to the delimeter", 
   "length we incorrectly flagged this as an error."
  ], 
  "revision_id": "320114"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-10-22T21:11:11.000000Z", 
  "msg": [
   "Fixing JIRA Bug #1023:", 
   "http://nagoya.apache.org/jira/browse/XERCESJ-1023", 
   "The previous fix masked the real bug here. If the root node", 
   "being serialized has no children we were walking up the tree", 
   "instead of stopping immediately. The old fix just prevented", 
   "the NullPointerException but didn't stop well-formedness", 
   "checking of the root node's following siblings and following", 
   "siblings of its ancestors."
  ], 
  "revision_id": "320113"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-10-22T14:41:04.000000Z", 
  "msg": [
   "Update the release doc."
  ], 
  "revision_id": "320112"
 }, 
 {
  "author": "nddelima", 
  "date": "2004-10-21T21:51:05.000000Z", 
  "msg": [
   "Patch that fixes some DOM Level 2 events problems such as:", 
   "- Dispatching of events to a subtree was being stopped from reaching descendants when a higher node in the tree did not have a registered listener.", 
   "- Sibling of the target node and its descendants were receiving events during dispatch to the target node's subtree.", 
   "- During replaceData, only one event to mark the replacement rather than two for insert and delete is fired.", 
   "- DOMAttrModified was not being fired when the text node child of an attribute was modified.", 
   "- Adds a total field to LCount to tell whether any listeners are registered rather than checking captures + bubbles + default", 
   "Thanks to Nalea for her contribution [1].", 
   "[1] http://nagoya.apache.org/eyebrowse/ReadMsg?listName=xerces-j-dev@xml.apache.org&msgNo=4662"
  ], 
  "revision_id": "320111"
 }, 
 {
  "author": "mrglavas", 
  "date": "2004-10-21T03:40:43.000000Z", 
  "msg": [
   "Reduce overhead of creating a ScannedEntity by reusing", 
   "character buffers. This is accomplished with a buffer pool.", 
   "Buffers are returned to the pool once scanning of the", 
   "entity is complete. Also reducing the internal entity buffer", 
   "size to 512 from 1024.", 
   "XMLEntityManager$ScannedEntity creation time:", 
   "Xerces 2.6.2 :  0.8 sec for 674 invocations (avg)", 
   "New              :  0.02 sec for 674 invocations (avg)", 
   "That translates to a 7-9% improvement in the overall", 
   "speed of parsing. This performance improvement is", 
   "thanks to the patch by Ankit Pasricha."
  ], 
  "revision_id": "320110"
 }
]