[
 {
  "author": "nddelima", 
  "date": "2005-06-13T21:37:49.000000Z", 
  "msg": [
   "PR: http://issues.apache.org/jira/browse/XERCESJ-916", 
   "Submitted by:\tNaela Nissar / nnissar@ca.ibm.com"
  ], 
  "revision_id": "320459"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-13T21:29:37.000000Z", 
  "msg": [
   "Hooking in ValidatorHandlerImpl."
  ], 
  "revision_id": "320458"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-13T21:28:55.000000Z", 
  "msg": [
   "Delegate to ValidatorHandlerImpl for SAX validation.", 
   "Make this class an implementer of PSVIProvider to allow", 
   "applications to access PSVI during a SAX validation", 
   "episode."
  ], 
  "revision_id": "320457"
 }, 
 {
  "author": "mrglavas", 
  "date": "2005-06-13T21:25:07.000000Z", 
  "msg": [
   "Merging in ValidatorHandlerImpl from the JAXP 1.3 RI with the following fixes, enhancements and other changes:", 
   "- made the class an implementer of PSVIProvider; PSVI provided by the TypeInfoProvider", 
   "- made the class an implementer of DTDHandler and EntityState to support the xs:ENTITY type", 
   "- made the class an implementer of ValidatorHelper to support SAX input from a Validator", 
   "- made the class an implementer of XMLDocumentHandler; receives events directly from the schema validator rather than going through XNI2SAX", 
   "- delegate all set/getFeature set/getProperty calls to a component manager which supports all features and properties supported by the schema validator", 
   "- if an instance of Attributes2 is passed to startElement store specified/declared in XMLAttributes", 
   "- to provide base URI to LSResourceResolver make ResolutionForwarder implement EntityResolver2", 
   "- if SAXSource is empty and we create a SAXParser attempt to set a security manager if one was installed on the ValidatorHandler", 
   "- performance: avoid creating QName and XMLString objects for each XNI call which takes these parameters", 
   "- performance: avoid symbol table lookups when we know the strings have already been internalized", 
   "- performance: send startPrefixMapping/endPrefixMapping calls directly to the content handler rather than iterating over the NamespaceContext later", 
   "- bug fix: skippedEntity should call the method on the ContentHandler not itself", 
   "- bug fix: startPrefixMapping/endPrefixMapping, prefix and URI must be passed to the SymbolTable"
  ], 
  "revision_id": "320456"
 }, 
 {
  "author": "nddelima", 
  "date": "2005-06-13T21:12:48.000000Z", 
  "msg": [
   "Additional updates to DOMConfiguration in support of the DOMNormalizer bug fix", 
   "http://cvs.apache.org/viewcvs.cgi/xml-xerces/java/src/org/apache/xerces/dom/DOMNormalizer.java?r1=1.60&r2=1.61&diff_format=h"
  ], 
  "revision_id": "320455"
 }
]