[
 {
  "author": "akarasulu", 
  "date": "2005-10-15T17:54:41.482911Z", 
  "msg": [
   "changes ...", 
   "o added rename, move and combined test cases", 
   "o added modify test cases", 
   "o added more utility functions to the AbstractAuthorizationTest", 
   "o commented out code for requiring grantRemove/grantAdd perms on old RDN", 
   "deletes in modifyRdn operations that change the RDN - this does not", 
   "comply with X.501 although it makes a lot of sense", 
   "o OldAuthenticationService now disables itself for its static rules when", 
   "the basic authorization service is enabled.", 
   "o fixed bug in move operation handling to make sure import/export/rename", 
   "permissions are correctly mandated for respective overloads", 
   "o fixed bug in AbstractAuthorizationTest: was not looking up operational", 
   "attribute administrativeRole properly to create subentries under ou=system", 
   "o fixed bug in MicroOperationFilter: filter accepted ACI without testing", 
   "the presence of all required micro operation permissions.", 
   "o fixed bug in GroupCache: group cache was not properly updating the cache on", 
   "modify operations on groups that are a groupOfNames and groupOfUniqueNames", 
   "o fixed NPE in GroupCache", 
   "o fixed bug in AuthorizationService in lookup(Name, String[]) where the", 
   "attribute ids where not being used for nexus lookups.", 
   "TODO:", 
   "o more testing with different kinds of ACI constructs should add to the total", 
   "number of tests per operation", 
   "o doco badly needed", 
   "o need to make the code not use the nexus for search list and lookups - the", 
   "next interceptor should be used"
  ], 
  "revision_id": "321394"
 }, 
 {
  "author": "brett", 
  "date": "2005-10-15T17:45:44.352073Z", 
  "msg": [
   "[maven-release-plugin] prepare for next development iteration"
  ], 
  "revision_id": "321393"
 }, 
 {
  "author": "brett", 
  "date": "2005-10-15T17:45:06.257541Z", 
  "msg": [
   "[maven-scm] copy for tag maven-assembly-plugin-2.0-beta-2"
  ], 
  "revision_id": "321392"
 }, 
 {
  "author": "brett", 
  "date": "2005-10-15T17:44:58.777593Z", 
  "msg": [
   "[maven-release-plugin] prepare release maven-assembly-plugin-2.0-beta-2"
  ], 
  "revision_id": "321391"
 }, 
 {
  "author": "brett", 
  "date": "2005-10-15T17:40:25.742950Z", 
  "msg": [
   "update snapshot"
  ], 
  "revision_id": "321390"
 }
]