[
 {
  "author": "jeremy_a", 
  "date": "2003-04-21T14:51:06.000000Z", 
  "msg": [
   "Fix for bug 19191 -- Add to Proxy Server exclude list actually adds to include list.  Bug introduced by fix to 19129.", 
   "PR: 19191", 
   "CVS: ----------------------------------------------------------------------", 
   "CVS: PR:", 
   "CVS:   If this change addresses a PR in the problem report tracking", 
   "CVS:   database, then enter the PR number(s) here.", 
   "CVS: Obtained from:", 
   "CVS:   If this change has been taken from another system, such as NCSA,", 
   "CVS:   then name the system in this line, otherwise delete it.", 
   "CVS: Submitted by:", 
   "CVS:   If this code has been contributed to Apache by someone else; i.e.,", 
   "CVS:   they sent us a patch or a new module, then include their name/email", 
   "CVS:   address here. If this is your work then delete this line.", 
   "CVS: Reviewed by:", 
   "CVS:   If we are doing pre-commit code reviews and someone else has", 
   "CVS:   reviewed your changes, include their name(s) here.", 
   "CVS:   If you have not had it reviewed then delete this line."
  ], 
  "revision_id": "323179"
 }, 
 {
  "author": "jeremy_a", 
  "date": "2003-04-20T22:56:07.000000Z", 
  "msg": [
   "Write message and stack trace to log when error occurs loading data."
  ], 
  "revision_id": "323178"
 }, 
 {
  "author": "jeremy_a", 
  "date": "2003-04-20T21:53:38.000000Z", 
  "msg": [
   "Updated timer GUIs to use title panel and border from superclass.  And some general code cleanup."
  ], 
  "revision_id": "323177"
 }, 
 {
  "author": "jeremy_a", 
  "date": "2003-04-20T20:46:18.000000Z", 
  "msg": [
   "Further GUI refactoring -- get Border from superclass, and let superclass make the title area (including the title and the name panel)."
  ], 
  "revision_id": "323176"
 }, 
 {
  "author": "jeremy_a", 
  "date": "2003-04-20T18:13:11.000000Z", 
  "msg": [
   "Updated modifiers GUIs to use title panel from superclass.  And some general code cleanup."
  ], 
  "revision_id": "323175"
 }
]