[
 {
  "author": "jsalvata", 
  "date": "2004-01-08T22:22:14.000000Z", 
  "msg": [
   "* Undid an erroneous change in TestBeanGui.configure, which I did just out of analogy with TestBean.prepare.", 
   "* Moved wrapInProperty to where it can be private.", 
   "* Internationalized bean name in menu.", 
   "* The ultimate beanification challenge: removed the addTestElement from the HTTPSamplerBean and added generic code in the TestBean that should be able to perform the same function (hopefully).", 
   "* Also made an attempt to put multiple properties per line, but failed, so it's not committed.", 
   "* Added the possibility to provide a non-null initial value for the property editors.", 
   "* Added the possibility to supress the Edit and/or Undefined options in the property editor combo. This had lots of consequences...", 
   "* Had to move the control of correctness for keyed-in values to the itemStateChange event processing. Not easy, you'll see...", 
   "Obvious TODO: support the case with no tags, noEdit and noUndefined."
  ], 
  "revision_id": "324019"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-08T22:11:09.000000Z", 
  "msg": [
   "Fix possible NPE."
  ], 
  "revision_id": "324018"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-08T21:50:31.000000Z", 
  "msg": [
   "Catalan localization of the HttpSamplerBean", 
   "-- for test & demo purposes only."
  ], 
  "revision_id": "324017"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-08T21:49:03.000000Z", 
  "msg": [
   "Bean display name i18n."
  ], 
  "revision_id": "324016"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-08T21:43:48.000000Z", 
  "msg": [
   "Fix errors that occured when I tried the new", 
   "GTK Look & Feel. Not that they are important, but", 
   "they may bite us in the future.", 
   "BTW, it turns out that \"name\" is a very bad name choice for", 
   "a property of an object that subclasses an AWT Component,", 
   "because Components already have such property..."
  ], 
  "revision_id": "324015"
 }
]