[
 {
  "author": "sebb", 
  "date": "2004-01-07T23:45:03.000000Z", 
  "msg": [
   "Added constructor to allow tests to work"
  ], 
  "revision_id": "324004"
 }, 
 {
  "author": "sebb", 
  "date": "2004-01-07T23:34:38.000000Z", 
  "msg": [
   "Initialise strings as empty rather than null to avoid NPEs", 
   "don't try to disconnect null connection"
  ], 
  "revision_id": "324003"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-07T19:54:55.000000Z", 
  "msg": [
   "* Reimplementation of the FileEditor reusing the WrapperEditor. Much nicer!", 
   "* Fixed some further bugs in the WrapperEditor."
  ], 
  "revision_id": "324002"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-07T19:03:08.000000Z", 
  "msg": [
   "Making WrapperEditor more reusable... and fixing a few", 
   "things which, as I had promised, I had broken."
  ], 
  "revision_id": "324001"
 }, 
 {
  "author": "jsalvata", 
  "date": "2004-01-07T18:20:19.000000Z", 
  "msg": [
   "* Made property groups visible in the GUI.", 
   "* Moved the responsability of wrapping/unwrapping JMeterProperties from the WrapperEditor to the TestBeanGUI. The WrapperEditor is more reusable this way -- and will survive an eventual removal of the JMeterProperty concept.", 
   "* Make WrapperEditor used only when the available editor does not provide a custom GUI component. Use the original editor's custom GUI component directly if available.", 
   "* Have WrapperEditor fire property change events when due.", 
   "* Created a FileEditor and changed the HTTPSampler's filename property to be a File.", 
   "* Added full internationalization support: property names and descriptions and group names are now localizable.", 
   "* Had the TestBeanGUI use the whole width of the edit panel for multi-line editors (a little hackish), putting the property title at the top... plus a little trick to remove the property label if you so wish (just set the property's displayName to \"\").", 
   "* Probably broken a few things in the process...", 
   "* ... maybe some more..."
  ], 
  "revision_id": "324000"
 }
]