[
 {
  "author": "ruchithf", 
  "date": "2005-10-18T04:46:27.165333Z", 
  "msg": [
   "removed MTOMStAXSOAPModelBuilder dependancy on OMTextimpl, this will enable us to use this builder with OM-DOM impl as well"
  ], 
  "revision_id": "326029"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-10-18T04:41:59.012009Z", 
  "msg": [
   "noting delete of interceptor-bypass branch"
  ], 
  "revision_id": "326028"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-10-18T04:40:57.552461Z", 
  "msg": [
   "removing branch which has been merged back"
  ], 
  "revision_id": "326027"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-10-18T04:35:27.381420Z", 
  "msg": [
   "overview ...", 
   "Added a new feature to the interceptor mechanism which allows interceptors to be", 
   "bypassed when calls are made to the nexus proxy.  This feature allows interceptors", 
   "to issue operations against the proxy with the names of interceptors to be", 
   "bypassed.  A wildcard is also included which bypasses all interceptors in the", 
   "chain.", 
   "This feature is exposed to interceptors through alterations to the Invocation", 
   "class which now exposes the nexus proxy as well as other information about the", 
   "call.  It is intended to be used to prevent possible infinite recursion when", 
   "interceptors access the DIT.  It may also be used to allow privileged access", 
   "as well as to prevent incurring unnecessary inefficiencies.", 
   "changes ...", 
   "o merging back changes made on the \"interceptor-bypass\" branch onto", 
   "the trunk", 
   "o added the nexus proxy to the Invocation object", 
   "o added a collection of Interceptor names to Invocation to bypass", 
   "o modified InterceptorChain to skip Interceptors when determining", 
   "the next interceptor and when determining the starting interceptor", 
   "o overloaded operations on the proxy to also take a collection of", 
   "interceptor names to bypass"
  ], 
  "revision_id": "326026"
 }, 
 {
  "author": "chinthaka", 
  "date": "2005-10-18T04:30:15.481215Z", 
  "msg": [
   "BookMark : Completed fixing attribute events support with a test case. Namespace support is not there for attributes. It seems bit complex o handle in this instance. Keeping that as a TODO.", 
   "Moving on to Array serialization ..."
  ], 
  "revision_id": "326025"
 }
]