[
 {
  "author": "niq", 
  "date": "2005-10-18T09:01:02.879443Z", 
  "msg": [
   "Faffing about with colon-delimiters (originally copied from mod_authn_dbm)", 
   "is deeply superfluous in an SQL context."
  ], 
  "revision_id": "326054"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-10-18T08:40:54.458002Z", 
  "msg": [
   "Documenting what's still missing:", 
   "- border and padding conditionality on table-cell", 
   "- empty blocks break stacking constraints (form a fence) although they shouldn't."
  ], 
  "revision_id": "326053"
 }, 
 {
  "author": "cziegeler", 
  "date": "2005-10-18T08:26:08.092945Z", 
  "msg": [
   "Syncing status files"
  ], 
  "revision_id": "326052"
 }, 
 {
  "author": "cziegeler", 
  "date": "2005-10-18T08:19:11.733138Z", 
  "msg": [
   "Remove all author tags from portal block"
  ], 
  "revision_id": "326051"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-10-18T08:19:14.959402Z", 
  "msg": [
   "changes ...", 
   "o started using new APIs on the Nexus proxy", 
   "o retrofited nextInterceptor calls with calls to proxy", 
   "o modified authz support classes to now take the proxy as their argument", 
   "rather than passing in NextInterceptor", 
   "o fixed test cases accordingly", 
   "o might be a problem but I exposed access to the nexus proxy from the", 
   "ServerContext.  This could potentially be a major security flaw", 
   "since users can now bypass security in embedded mode and within", 
   "stored procedures.  We have to find a way around this or to protect", 
   "access to this resource via a security manager.", 
   "o calls on the nexus proxy made by authz support classes now bypass", 
   "the authz service to avoid possible infinate recursion", 
   "todos ...", 
   "o perhaps we could pass the Invocation object to the filter instead of", 
   "the JNDI context so that we do not need to expose access to the Nexus", 
   "proxy from the JNDI context", 
   "o all calls to the proxy in the authz supporting classes need to be", 
   "reviewed to make them more efficient perhaps bypassing more interceptors", 
   "o need to replace all nextInterceptor.xxxx() calls with calls to the", 
   "nexus proxy with bypass instructions", 
   "o need to replace calls directly to the nexus with calls to the proxy", 
   "while bypassing interceptors"
  ], 
  "revision_id": "326050"
 }
]