[
 {
  "author": "ips", 
  "date": "2005-10-19T21:48:42.356229Z", 
  "msg": [
   "various"
  ], 
  "revision_id": "326719"
 }, 
 {
  "author": "kmarsden", 
  "date": "2005-10-19T21:47:26.832744Z", 
  "msg": [
   "DERBY-498 - Result set holdability defined inside stored procedures is ignored by server/client", 
   "The attached patch 'derby-498.diff' changes network server to use statement holdability set within stored procedures. The patch does the following:", 
   "1. For callable statements, the execute method in DRDAStatement gets holdability from the statement that produced the resultset.", 
   "2. Added getResultSetHoldability method which takes a resultset and returns holdability.", 
   "3. execute method passes this holdability to addResultSet method, which sets DRDAResultSet.withHoldCursor with this value.", 
   "4. writeOPNQRYRM method in DRDAConnThread is changed to use the holdability of the current DRDAResultSet for setting SQLCSRHLD.", 
   "5. Added tests in lang/holdCursorJava.java. Created a new master file for DerbyNetClient.", 
   "Ran derbyall on WinXP Sun jdk1.4.2. No failures. However, in a previous run of derbyall I got failures in few encryption tests. The failures did not seem related to my change. So I ran the encryption suites again and they passed. Then ran derbyall again and all tests passed.", 
   "Also attaching an additional patch \"xa_proc_test.diff\" for xa tests. It does the following:", 
   "1. Adds procedure test to jdbcapi/xaSimplePositive.sql.", 
   "2. Updates master files.", 
   "Contributed by Deepa Remesh dremesh@gmail.com"
  ], 
  "revision_id": "326718"
 }, 
 {
  "author": "markt", 
  "date": "2005-10-19T21:43:58.903443Z", 
  "msg": [
   "Create the sandbox. A readme explaining how to use it will follow as soon as I write it."
  ], 
  "revision_id": "326717"
 }, 
 {
  "author": "sylvain", 
  "date": "2005-10-19T21:44:41.420302Z", 
  "msg": [
   "Refactor XSLT error handling. We now have *all* messages!"
  ], 
  "revision_id": "326716"
 }, 
 {
  "author": "rgardler", 
  "date": "2005-10-19T21:35:23.370888Z", 
  "msg": [
   "add note about meaning of minimum forrst version"
  ], 
  "revision_id": "326715"
 }
]