[
 {
  "author": "scamp", 
  "date": "2005-10-20T18:59:59.561890Z", 
  "msg": [
   "jalopified"
  ], 
  "revision_id": "326974"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-10-20T18:57:04.258959Z", 
  "msg": [
   "Now point to the last version of MINA (0.8.0-SNAPSHOT) instead of 0.7.4"
  ], 
  "revision_id": "326973"
 }, 
 {
  "author": "nbubna", 
  "date": "2005-10-20T18:56:13.263300Z", 
  "msg": [
   "update generated docs in prep for a 1.2 release"
  ], 
  "revision_id": "326972"
 }, 
 {
  "author": "elecharny", 
  "date": "2005-10-20T18:56:18.826107Z", 
  "msg": [
   "Replaced the TODO.txt file by the original file, which has been lost during a merge"
  ], 
  "revision_id": "326971"
 }, 
 {
  "author": "slive", 
  "date": "2005-10-20T18:44:57.445077Z", 
  "msg": [
   "1. Introduce the appr namespace for the <appr:pmc> tag.", 
   "2. Change the default namespace to doap in order to make the markup much cleaner.", 
   "3. Group all the simple properties up top.", 
   "4. Introduce categories, using the eventual category index page as their definition.", 
   "5. Point <browse> at viewcvs rather than the repository.", 
   "6. Point the license at the canonical doap definition of the apache license.  No need to fork this.", 
   "7. Properly? define mailing-list properties in the appr namespace. Although this fits doap as much as possible by continuing to use the <mailing-list> property, I'm sure that other doap consumers will not be able to understand it.  They should, however, be able to ignore it and continue.", 
   "8. Split into two releases, because the rdf/xml striping model doesn't allow two objects to be used in the same property.", 
   "9. Remove the complicated mailing list stuff and fall back to just a URL.", 
   "I know David is not going to like this.", 
   "10. Simplify the xsl into three output sections instead of five.", 
   "11. Change the titles of the releases to something more descriptive.", 
   "12. Add a third apache httpd release.", 
   "13. Update the description of the project.", 
   "14. Other small xsl updates."
  ], 
  "revision_id": "326970"
 }
]