[
 {
  "author": "woolfel", 
  "date": "2005-10-25T03:45:17.221312Z", 
  "msg": [
   "checking in part of the contribution submitted by Lars Krog-Jensen.", 
   "I still need to go over the visualizer and change it to use JCharts", 
   "peter lin"
  ], 
  "revision_id": "328249"
 }, 
 {
  "author": "samisa", 
  "date": "2005-10-25T03:42:46.720681Z", 
  "msg": [
   "More changes related to calling convention of create methods"
  ], 
  "revision_id": "328248"
 }, 
 {
  "author": "deepal", 
  "date": "2005-10-25T03:40:10.941822Z", 
  "msg": [
   "Introduced a class called SynapseEngine which currently does RuleEngine population. And the most ineteredted thing is that you can dynamically change rules (mediator hot deployment), RuleEngine etc..."
  ], 
  "revision_id": "328247"
 }, 
 {
  "author": "kmarsden", 
  "date": "2005-10-25T03:26:28.053639Z", 
  "msg": [
   "DERBY-597 - Enhance ij connect statement to work in J2ME/CDC/FP", 
   "ummary of patch:", 
   "* If ij.dataSource property is set and the url in the 'connect' statement does not start with 'jdbc:', ij calls util.getDataSourceConnection to get connection (instead of using DriverManager).", 
   "* Added getDataSourceConnection(String dsName,String user,String password,String dbName,boolean firstTime) to util.java. This returns a connection using the data source passed in ij.dataSource property. This method is called by startJBMS in util.java and ConnectStatement() in ij. The parameter firstTime indicates whether this method is called at start of test by startJBMS or by ConnectStatement.", 
   "* getDataSourceConnection method in turn calls setupDataSource which calls the set methods of data source. If firstTime=true, it uses values of ij.dataSource.* properties to set up the data source object. Otherwise, the properties ij.dataSource.databaseName and ij.dataSource.createDatabase are ignored. Instead, value of 'dbName' parameter is used. [In first version of this patch, parameter 'firstTime' was called 'create']", 
   "* Removed J2ME excludes from 13 tests which pass with this patch. Some tests needed changes in the connect statement url and master files.", 
   "Contributed by Deepa Remesh"
  ], 
  "revision_id": "328246"
 }, 
 {
  "author": "crossley", 
  "date": "2005-10-25T03:26:07.377711Z", 
  "msg": [
   "Explain using the Cocoon LogTransformer."
  ], 
  "revision_id": "328245"
 }
]