[
 {
  "author": "ajith", 
  "date": "2005-10-25T04:28:50.558977Z", 
  "msg": [
   "1. Added a new post goal to the maven build that generates schemas", 
   "2. Added some test cases (based on reflection) to populate the generated beans", 
   "3. Refactored some test cases"
  ], 
  "revision_id": "328254"
 }, 
 {
  "author": "akarasulu", 
  "date": "2005-10-25T04:20:27.451908Z", 
  "msg": [
   "changes ...", 
   "VNV = ValueNormalizationVisitor", 
   "NS = NormalizationService", 
   "o made the VNV prune away bogus leaves that contain undefined attributes", 
   "instead of throwing an exception - even branches may now be pruned if", 
   "they are left bare or with a single node in case of AND/OR branches", 
   "o cleaned up NS considerably", 
   "- parser need not be synchronized anymore since the parse method is", 
   "synchronized", 
   "- removed unnecesary constructs in inner class when I added the attribute", 
   "type registry as a member to the NS class", 
   "- doco for members", 
   "- logger added", 
   "o added code in search() method of NS to check if the pruned filter makes sense", 
   "if not it is altered.  i.e. if it is a leaf node and undefined an", 
   "EmptyEnumeration is returned and likewise if the filter is a branch node", 
   "without children.  If the filter is an AND or OR node and has one child", 
   "the child is returned instead of the filter node.", 
   "o added test cases which failed before the changes and pass now with changes"
  ], 
  "revision_id": "328253"
 }, 
 {
  "author": "bodewig", 
  "date": "2005-10-25T04:18:44.224947Z", 
  "msg": [
   "try to add xstream, used to be provided by jmeter"
  ], 
  "revision_id": "328252"
 }, 
 {
  "author": "bodewig", 
  "date": "2005-10-25T03:53:06.581024Z", 
  "msg": [
   "skip tests until we get headless mode working in Maven builds"
  ], 
  "revision_id": "328251"
 }, 
 {
  "author": "woolfel", 
  "date": "2005-10-25T03:49:28.185459Z", 
  "msg": [
   "adding comment to the properties for the new statistical mode"
  ], 
  "revision_id": "328250"
 }
]