[
 {
  "author": "jm", 
  "date": "2005-10-31T04:36:32.580613Z", 
  "msg": [
   "let's try that again"
  ], 
  "revision_id": "329734"
 }, 
 {
  "author": "mikem", 
  "date": "2005-10-31T04:33:42.426738Z", 
  "msg": [
   "merging fix for DERBY-662 from trunk to 10.1 codeline, which was committed", 
   "as svn 329494.", 
   "The change is an obvious fix to BaseDataFileFactory.java code which creates", 
   "a conglomerates container file name given it's conglomerate number.  This is", 
   "a simple hex conversion which was missing from one of the paths through the", 
   "code.", 
   "The path is almost never taken, but in the following circumstance during", 
   "redo crasch recovery this bug", 
   "could cause derby to delete the underlying file of a table.  The circumstances", 
   "are as follows:", 
   "1) The OS/filesystem must be case insensitive such that a request to delete", 
   "a file named C2080.dat would also remove c2080.dat. This is true in", 
   "windows default file systems, not true in unix/linux filesystems that", 
   "I am aware of.", 
   "2) The system must be shutdown not in a clean manner, such that a subsequent", 
   "access of the database causes a REDO recovery action of a drop table", 
   "statement. This means that a drop table statement must have happened", 
   "since the last checkpoint in the log file. Examples of things that cause", 
   "checkpoints are:", 
   "o clean shutdown from ij using the \"exit\" command", 
   "o clean shutdown of database using the \"shutdown=true\" url", 
   "o calling the checkpoint system procedure", 
   "o generating enough log activity to cause a regularly scheduled checkpoint.", 
   "3) If the conglomerate number of the above described drop table is TABLE_1,", 
   "then for a problem to occur there must also exist in the database a table", 
   "such that it's HEX(TABLE_2) = TABLE_1", 
   "4) Either TABLE_2 must not be accessed during REDO prior to the REDO operation", 
   "of the drop of TABLE_1 or there must be enough other table references during", 
   "the REDO phase to push the caching of of the open of TABLE_2 out of cache.", 
   "The fix adds a test case which before the fix will force a container not", 
   "found error on an existing table."
  ], 
  "revision_id": "329733"
 }, 
 {
  "author": "jm", 
  "date": "2005-10-31T04:29:41.195885Z", 
  "msg": [
   "update MANIFEST files"
  ], 
  "revision_id": "329732"
 }, 
 {
  "author": "jm", 
  "date": "2005-10-31T04:28:09.293981Z", 
  "msg": [
   "forgot the script"
  ], 
  "revision_id": "329731"
 }, 
 {
  "author": "jm", 
  "date": "2005-10-31T04:26:55.337285Z", 
  "msg": [
   "implement a singleton-locking system for singleton actions in buildbot; move corpus-populating script into svn; some minor tweaks and fixes"
  ], 
  "revision_id": "329730"
 }
]