[
 {
  "author": "otis", 
  "date": "2005-11-09T06:44:10.493318Z", 
  "msg": [
   "- Applied Yonik's patch from http://issues.apache.org/jira/browse/LUCENE-441"
  ], 
  "revision_id": "331964"
 }, 
 {
  "author": "wsmoak", 
  "date": "2005-11-09T06:25:25.979753Z", 
  "msg": [
   "Removed MyFaces Listener from web.xml as it is no longer needed in version 1.1.", 
   "Fixed typo in properties file.", 
   "Made cancel button immediate so it will skip validation."
  ], 
  "revision_id": "331963"
 }, 
 {
  "author": "wsmoak", 
  "date": "2005-11-09T06:20:50.584006Z", 
  "msg": [
   "Added Maven build files for the mailreader example webapp."
  ], 
  "revision_id": "331962"
 }, 
 {
  "author": "ekoneil", 
  "date": "2005-11-09T06:17:08.453947Z", 
  "msg": [
   "Fix for BEEHIVE-994.  This adds the appropriate property value encoding for the client manifest file; the implementation follows the rules defined for the Properties.store() method.", 
   "Since this .properties file is encoded through APT, it's not possible to use the Properties.store method, which would encode these name / value pairs automatically.", 
   "The original patch included a test, but the test can't be added since it breaks the build (without setting a special encoding) on win32.  Need to look at that further at some point...", 
   "BB: self", 
   "Test: Controls pass"
  ], 
  "revision_id": "331961"
 }, 
 {
  "author": "karl", 
  "date": "2005-11-09T06:04:20.555027Z", 
  "msg": [
   "* rivet/packages/dio/dio.tcl: Add new \"update\" method that works", 
   "just like \"store\" except that it assumes you're doing an update", 
   "and, unlike store, does not check to see if the row is already", 
   "there or not.", 
   "Also modified the \"store\" method, when doing an update, to not", 
   "attempt to change row fields that are specified in the where clause.", 
   "* doc/rivet.xml: Documented all undocumented public DIO methods, such", 
   "as count, db, forall, interface, insert, makekey, quote, search", 
   "and update."
  ], 
  "revision_id": "331960"
 }
]