[
 {
  "author": "joerg", 
  "date": "2005-11-09T18:03:04.918339Z", 
  "msg": [
   "regenerated: portal missed dependency on ajax, javaflow missed dependency on forms"
  ], 
  "revision_id": "332094"
 }, 
 {
  "author": "jheymans", 
  "date": "2005-11-09T18:02:56.493328Z", 
  "msg": [
   "- adding our repo", 
   "- fixed cforms pom", 
   "- added example settings.xml , allowing one to build using a clean repository. \"mvn -s settings.xml install\""
  ], 
  "revision_id": "332093"
 }, 
 {
  "author": "sebor", 
  "date": "2005-11-09T17:59:37.724606Z", 
  "msg": [
   "2005-11-09  Martin Sebor  <sebor@roguewave.com>", 
   "* SIZE_T.cpp: Initialized all local variables before copying them", 
   "to function arguments to prevent MSVC 8.0 debugging assertions", 
   "when the /RTC1 option (Run-Time Error Checks) is used."
  ], 
  "revision_id": "332092"
 }, 
 {
  "author": "joerg", 
  "date": "2005-11-09T17:57:29.254368Z", 
  "msg": [
   "removed superfluous references to cocoon-testcase.jar:", 
   "- actually reverting commit r329819", 
   "- problem was not the missing jar, but the exclusion of files when building the jar", 
   "javaflow block has a dependency on forms block"
  ], 
  "revision_id": "332091"
 }, 
 {
  "author": "davidvc", 
  "date": "2005-11-09T17:46:52.083113Z", 
  "msg": [
   "Changes for DERBY-689, contributed by Rick Hillegas (rick.hillegas@sun.com)", 
   "Rick says:", 
   "Various improvements to compatibility test:", 
   "1) Moved all JUnit tests under a ...functionTests/tests/junitTests as Myrna and John requested.", 
   "2) Made the test harness sanity check the classpath as David requested.", 
   "3) Abstracted a CompatibilitySuite out of the original test to make it easier to add more test classes, as Francois requested.", 
   "4) Added combinations for the 10.1.2.0 client and server", 
   "5) The derbyall diff tool was enhanced to fabricate an empty canon file if one doesn't exist in the codeline. This eliminates the need to create empty canons for JUnit tests.", 
   "===", 
   "David says:", 
   "I made a slight modification -- I moved the CompatibilityTest to", 
   "derbynetclientmats instead of derbynetmats, as it's intended only for", 
   "the network client, not for the DB2 driver", 
   "I'd also like to clarify that the \"empty canon file\" is not created on", 
   "disk -- it's only created as an InputStream within the test harness.  Nice", 
   "fix, no more empty files to create for tests that have no output."
  ], 
  "revision_id": "332090"
 }
]