[
 {
  "author": "jeremias", 
  "date": "2005-11-11T13:44:40.284413Z", 
  "msg": [
   "Fop.java gets two new constructors: Fop(String) and Fop(String, FOUserAgent) where the String is the MIME type for the desired output format.", 
   "MimeConstants provides a comprehensive list of MIME types used in Fop.java.", 
   "Non-standard, FOP-specific MIME types changed to a uniform pattern: application/X-fop-awt-preview, application/X-fop-print and application/X-fop-areatree.", 
   "RendererFactory now supports manual registration and dynamic discovery of Renderers and FOEventHandlers by their MIME types. Instantitation is done using MIME types everywhere.", 
   "The RENDER_* constants are mapped to MIME types in Fop.java.", 
   "RendererFactory is now an instantiable class whose reference is held by FOUserAgent just like it is done for the XLMHandlers.", 
   "Renderers and FOEventHandlers now each have a *Maker class which is a kind of factory class which is used to register a Renderer/FOEventHandler and additionally serves to provide additional information about the thing, such as the MIME types it supports and if the implementation requires an OutputStream.", 
   "The command-line gets a new option: -out application/pdf myfile.pdf is the generic way to create an output file. If someone created a WordML output handler and provided the right service resource file he could specify \"-out text/xml+msword out.xml\". \".out list\" lists all MIME types that are available for output.", 
   "Renderers can now potionally expose a Graphics2DAdapter which in concert with Graphics2DImagePainter can be used by FOP extensions to paint their content directly using a Graphics2D instance. That makes it possible to avoid a detour via SVG/Batik in certain cases."
  ], 
  "revision_id": "332549"
 }, 
 {
  "author": "husted", 
  "date": "2005-11-11T13:34:21.364877Z", 
  "msg": [
   "OVR-21", 
   "* Refactor for GidConfig", 
   "* Add support for programatic templates. Still need to set default value. Should also change from DDList to CheckBox.", 
   "OVR-24", 
   "* Use FindControlParam to obtain value for DDList (sigh)."
  ], 
  "revision_id": "332548"
 }, 
 {
  "author": "rgardler", 
  "date": "2005-11-11T13:32:24.848408Z", 
  "msg": [
   "use locationmap for resources (fixes FOR-693)"
  ], 
  "revision_id": "332547"
 }, 
 {
  "author": "husted", 
  "date": "2005-11-11T13:31:56.569922Z", 
  "msg": [
   "OVR-21", 
   "* Add support for programatic templates to GridControl", 
   "OVR-24", 
   "* Add FindControlParam method to workaround DataGridCommandEventArgs issue."
  ], 
  "revision_id": "332546"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-11-11T13:27:34.725749Z", 
  "msg": [
   "Made the FO tree a little more consistent by renaming getName() to getLocalName() and adding additional methods like: getNamespaceURI() and getNormalNamespacePrefix(). getName() now returns the fully qualified name combined from getLocalName() and getNormalNamespacePrefix(). For special cases you can call getName(String) to return a different namespace prefix."
  ], 
  "revision_id": "332545"
 }
]