[
 {
  "author": "jkesselm", 
  "date": "2000-09-20T23:33:12.000000Z", 
  "msg": [
   "Just the start of an experiment in compiling stylesheets to Java.", 
   "Only handles ElemTemplate and ElemLiteralElement at this time;", 
   "other nodes continue to run interpreted. Generated code is", 
   "not yet efficient, nor serializable, nor (sigh) reeentrant; working", 
   "on all those issues. Currently relies on a routine in BSF to invoke", 
   "the Java compiler; we should probably adopt that into", 
   "synthetic.Class.", 
   "To try it out, change the trax.processor.xslt to", 
   "org.apache.xalan.processor.CompiledStylesheetProcessor", 
   "It does pass our regression tests; the only known differences are", 
   "in attribute order."
  ], 
  "revision_id": "333359"
 }, 
 {
  "author": "jkesselm", 
  "date": "2000-09-20T21:19:39.000000Z", 
  "msg": [
   "synthetic.Class: IBM-developed reverse-reflection experiment, used in the compiled-Template experiment.", 
   "Incomplete but I had 'em on hand and have been meaning to publish anyway.", 
   "Arguably overkill for current compilation code, but may simplify later work."
  ], 
  "revision_id": "333358"
 }, 
 {
  "author": "jkesselm", 
  "date": "2000-09-20T21:14:28.000000Z", 
  "msg": [
   "synthetic.Class: IBM-developed \"reverse reflection\" wrappers,", 
   "used in the compiled-Template experiment. These are", 
   "also experimental and are known to have some holes, and", 
   "for the simple compilations now being attempted they don't", 
   "have huge advantages over generating directly into a stringbuffer,", 
   "but I had 'em on hand and we've been planning to publish 'em anyway."
  ], 
  "revision_id": "333357"
 }, 
 {
  "author": "dleslie", 
  "date": "2000-09-20T14:01:21.000000Z", 
  "msg": [
   "Added introductory info on XPathAPI and the ApplyXPath sample."
  ], 
  "revision_id": "333356"
 }, 
 {
  "author": "dleslie", 
  "date": "2000-09-19T21:49:17.000000Z", 
  "msg": [
   "Added AppplyXPath sample to samples target"
  ], 
  "revision_id": "333355"
 }
]