[
 {
  "author": "sboag", 
  "date": "2000-12-21T06:22:19.000000Z", 
  "msg": [
   "Small, ugly hack in getClassForName to substitute the", 
   "\"org.apache.xalan.xslt.extensions.Redirect\" with", 
   "\"org.apache.xalan.lib.Redirect\", for backwards compatibility", 
   "with XalanJ1 stylesheets."
  ], 
  "revision_id": "334084"
 }, 
 {
  "author": "sboag", 
  "date": "2000-12-21T05:52:21.000000Z", 
  "msg": [
   "Changed the composed variables to non-transient.  I'm not totally", 
   "sure why Gary had these listed as transient.  Perhaps he was thinking", 
   "that we would recompose on readObject?  I was thinking the opposite,", 
   "that we would throw away all uncomposed stuff if you serialized.", 
   "In any case, this seems to make serialization work OK, though", 
   "surely not optimized for storage space!!!"
  ], 
  "revision_id": "334083"
 }, 
 {
  "author": "sboag", 
  "date": "2000-12-21T05:21:45.000000Z", 
  "msg": [
   "Moved unparsed entity task to completed, and added two performance", 
   "related tasks, and one error handling task to be done for beta2."
  ], 
  "revision_id": "334082"
 }, 
 {
  "author": "sboag", 
  "date": "2000-12-21T05:04:11.000000Z", 
  "msg": [
   "Add dfactory.setNamespaceAware(true); to d2d flavor, so it will", 
   "work correctly!!!"
  ], 
  "revision_id": "334081"
 }, 
 {
  "author": "sboag", 
  "date": "2000-12-21T04:21:21.000000Z", 
  "msg": [
   "Absolutize the URL for unparsed entity URIs.  From the sped:", 
   "\"The root node has a mapping that gives the URI for each unparsed entity declared in the document's DTD. The URI is generated from the system identifier and public identifier specified in the entity declaration. The XSLT processor may use the public identifier to generate a URI for the entity instead of the URI specified in the system identifier. If the XSLT processor does not use the public identifier to generate the URI, it must use the system identifier; if the system identifier is a relative URI, it must be resolved into an absolute URI using the URI of the resource containing the entity declaration as the base URI [RFC2396].\"", 
   "Note that this will cause problems with the testsuite.  We should", 
   "probably try and do something with the public ID to avoid this, both in the", 
   "code and in the test?"
  ], 
  "revision_id": "334080"
 }
]