[
 {
  "author": "curcuru", 
  "date": "2001-01-04T17:04:49.000000Z", 
  "msg": [
   "Add try..catch(SecurityException) around getting user.dir;", 
   "Reported by: morad@db.informatik.uni-kassel.de", 
   "Reviewed by: sboag"
  ], 
  "revision_id": "334179"
 }, 
 {
  "author": "dleslie", 
  "date": "2001-01-04T16:47:16.000000Z", 
  "msg": [
   "Remove until connection pooling revised to work with jdk 1.8."
  ], 
  "revision_id": "334178"
 }, 
 {
  "author": "sboag", 
  "date": "2001-01-04T10:23:24.000000Z", 
  "msg": [
   "Moved xsl:strip-space task for generic DOMs and SQL work", 
   "integration to completed."
  ], 
  "revision_id": "334177"
 }, 
 {
  "author": "sboag", 
  "date": "2001-01-04T10:10:09.000000Z", 
  "msg": [
   "John Gentilin &lt;johnglinux@eyecatching.com> work.  From note", 
   "that John sent:", 
   "Accomplished so far:", 
   "Connection Pools,", 
   "The way I implemented Connection Pools was to provide", 
   "a controller that contains a list of named pools. This list is", 
   "static, so as long as someone has an instance of the controller,", 
   "the pools will  remain intact.  The Connection Pool is defined", 
   "as a minimal interface. If you want to use you own  connection", 
   "pool all you have to do is create an adapter class that implements", 
   "the interface and register it with the controller. All of the original", 
   "functionality was left intact to hold backward compatibility. There", 
   "is a default connection pool that is implemented as part of the", 
   "extension so the code will work without any external pool.", 
   "I plan to  implement a wrapper around Apache Turbine pools", 
   "as a sample.", 
   "There are several examples. I used a database that I am currently", 
   "working on. Is there a way to distribute samples that work stand alone.", 
   "i.e. Do you know of a small DBMS implemented as a JAR that we can", 
   "distribute in the lib dir ??", 
   "As a helper function, I added a constructor that allows a single xpath", 
   "statement to point to the DB connection Info. Its value is questionable,", 
   "I was unaware that a function could take multiple xpath statements", 
   "as arguments until Gary pointed it out. I thought you had to create", 
   "several variables and pass them in separately which seemed messy.", 
   "I still need to do the documentation, I have a design spec in a format", 
   "that", 
   "I am using internally but I need to reformat it for the apache code.", 
   "I took a quick stab at it in the samples dir but it is know where", 
   "complete.", 
   "Parameterized Queries,", 
   "You can set your query to contain the \"?\" that are used in", 
   "PreparedStatements. Then pass in the matching parameters", 
   "using data from the source document. The type information", 
   "can either be passed in as a comma separated string as a", 
   "second parameter of the pquery statement or as part of the", 
   "data. You will have to look at the code comments for this one", 
   "as I have not even touched the docs on this one.", 
   "Error handling through XML formatted responses.", 
   "This is experimental code, I just wanted to see how it works.", 
   "The information in the XML document is minimal, if we decide", 
   "that this is a valid approach, the implementation need quite a bit", 
   "of clean up."
  ], 
  "revision_id": "334176"
 }, 
 {
  "author": "sboag", 
  "date": "2001-01-04T10:01:00.000000Z", 
  "msg": [
   "John Gentilin &lt;johnglinux@eyecatching.com> work,", 
   "for SQL Extensions."
  ], 
  "revision_id": "334175"
 }
]