[
 {
  "author": "dleslie", 
  "date": "2001-02-27T14:56:15.000000Z", 
  "msg": [
   "Returning to Xerces 1.2.3. Release 1.3 generates the following error:", 
   "[java] http://www.w3.org/1999/XSL/Transform grammar not found", 
   "[java] java.lang.NoSuchMethodError: org.w3c.dom.Node: method", 
   "isSupported(Ljava/lang/String;Ljava/lang/String;)Z not found..."
  ], 
  "revision_id": "334469"
 }, 
 {
  "author": "dleslie", 
  "date": "2001-02-23T15:49:05.000000Z", 
  "msg": [
   "extract from SPR database"
  ], 
  "revision_id": "334468"
 }, 
 {
  "author": "dleslie", 
  "date": "2001-02-23T15:40:09.000000Z", 
  "msg": [
   "version 1.3 from Xerces-J-Tools.1.3.0.zip"
  ], 
  "revision_id": "334467"
 }, 
 {
  "author": "dleslie", 
  "date": "2001-02-23T13:43:59.000000Z", 
  "msg": [
   "Changed version to 2.0.1"
  ], 
  "revision_id": "334466"
 }, 
 {
  "author": "sboag", 
  "date": "2001-02-23T01:18:33.000000Z", 
  "msg": [
   "Fix for bug originally reported by Daryl Beattie <DarylB@screamingmedia.com>", 
   "on 02/14/2001 04:16 PM.  A hang was occuring inside the use", 
   "of a Result Tree Fragment.  When the result tree fragement was", 
   "being created, the Redirect extension was being called, which", 
   "called createResultContentHandler which set the ContentHandler", 
   "in the Transformer, but not in the ResultTreeHandler.  Then, Redirect", 
   "called Transformer#executeChildTemplates(", 
   "ElemTemplateElement elem, Node sourceNode, QName mode, ContentHandler handler)", 
   "which saves the reference to the original content handler in", 
   "the transformer, and then sets the new one by calling setContentHandler,", 
   "which sets the ContentHandler in the ResultTreeHandler as well", 
   "as the Transformer.  When it tried to restore the old ContentHandler,", 
   "it restored the value in the ResultTreeHandler to a Serializer, instead", 
   "of the correct ContentHandler.  When transformToRTF then called", 
   "endDocument on it's resultTreeFragment, the event was sent", 
   "to the Serializer instead of the SourceTreeHandler, and thus the", 
   "isComplete flag was not set, and thus the hang.  (whew!)", 
   "The fix is in executeChildTemplates save the value of the", 
   "resultTreeHandler's contentHandler as well as Transformer's", 
   "content handler, and restore them both.  A more architectual fix", 
   "could be made, but not without high risk, so I think this is the best", 
   "and safest way to fix it."
  ], 
  "revision_id": "334465"
 }
]