[
 {
  "author": "dleslie", 
  "date": "2001-03-07T13:05:29.000000Z", 
  "msg": [
   "Updated to refer to bugzilla bug reports, with link to XalanJ2 open", 
   "bugs."
  ], 
  "revision_id": "334484"
 }, 
 {
  "author": "garyp", 
  "date": "2001-03-07T08:06:05.000000Z", 
  "msg": [
   "Correct operation when length of content to be appended is zero."
  ], 
  "revision_id": "334483"
 }, 
 {
  "author": "garyp", 
  "date": "2001-03-07T04:27:18.000000Z", 
  "msg": [
   "The field Arg.isParamVar was attempting to serve two functions: to indicate variable Frame entries which are not currently activated and to indicate Frames containing parameters passed with xsl:with-param.  When processing was finished for a node in a node-set, the isParamVar flag was turned on to indicate the Frame slot was available.  Unfortunately, this also indicated that the item was passed as a parameter which it wasn't.  This fix changes isParamVar into to fields, isAvailable which indicates that the slot is available and isFromWithParam indicating the Frame slot came from an xsl:with-param or a top-level parameter passed in via the tranformerImpl.setParameter() API.", 
   "I have tested this change against the conformance suite and had no regression.  I've also submitted a test case which fails on the existing codebase but works okay after this fix.", 
   "It is possible that I've missed something with regard to the API setParameter calls but we can fix those if problems are reported."
  ], 
  "revision_id": "334482"
 }, 
 {
  "author": "sboag", 
  "date": "2001-03-06T05:50:24.000000Z", 
  "msg": [
   "Fix for http://nagoya.apache.org/bugzilla/show_bug.cgi?id=741.", 
   "1) ResultTreeHandler now implements the TransformState interface.", 
   "2) Queued state such as the current node and the current template is stored as part of QueuedStartElement.  Storage will only occur if the ContentHandler implements TransformClient.", 
   "3) When state is requested (for instance TransformState#getCurrentElement()), if the queued element is null or not pending (for instance, in a characters event), it will get the state from the transformer, otherwise it will get the state from the queued element.", 
   "Other fixes were attempted for this problem, including trying to", 
   "get rid of queueing altogether, and flushing a bit earlier before", 
   "the state was pushed on the various stacks, but both of", 
   "these had show-stopping issues (see discussions", 
   "on xalan-dev).", 
   "Note that for the moment the ContextNodeList is node", 
   "cloned as it needs to be in order for", 
   "TransformState#getContextNodeList."
  ], 
  "revision_id": "334481"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-03-05T19:55:00.000000Z", 
  "msg": [
   "New approach to FastStringBuffer, and changes needed to support it.", 
   "We still need to do some serious work on both the initial values of the", 
   "tuning parameters and the heuristics driving the \"chunk growth\" algorithms.", 
   "Currently set for fixed-sized chunks of 8Kch in main tree, .5Kch in RTF."
  ], 
  "revision_id": "334480"
 }
]