[
 {
  "author": "dleslie", 
  "date": "2001-03-13T14:50:09.000000Z", 
  "msg": [
   "Periodic extract of commit messages from local Notes database."
  ], 
  "revision_id": "334504"
 }, 
 {
  "author": "costin", 
  "date": "2001-03-12T22:20:07.000000Z", 
  "msg": [
   "Removed ( commented out ) dump() method and the imports in ExtensionError.", 
   "So far the method doesn't seem to be used ( no warning in the compile ).", 
   "The problem is that this method is breaking the build with crimson ( since", 
   "it uses xerces-specific classes ). It is possible to implement it on top", 
   "of the serialization classes that are part of xalan - if someone needs the", 
   "method I'll try to port it."
  ], 
  "revision_id": "334503"
 }, 
 {
  "author": "sboag", 
  "date": "2001-03-12T06:29:29.000000Z", 
  "msg": [
   "Xerces at some point decided to use \"\" instead", 
   "of null for null namespaces.  There has been a", 
   "discussion between Gary Peskin in", 
   "Joe Kessleman on xalan-dev about this,", 
   "but I hadn't been fully keeping up the the", 
   "thread that well, and missed it's relation to", 
   "this problem.  I include some of the discussion", 
   "at the end of this note.  I made Xalan be able to", 
   "compare a \"\" namespace to null for now, until", 
   "we get this resolved.", 
   "The gist of the discussion on xalan-dev regarding this is:", 
   ">>1.  Declare the Xerces-J support of schemas to have a bug and ask that", 
   ">>Xerces be corrected to always use a null namespace URI to indicate that", 
   ">>there is no default namespace.  Even if the Xerces people change this", 
   ">>behavior, is this correct?", 
   ">", 
   "> Yes. If your description of the problem is accurate (you should probably", 
   "> submit a more detailed case so it can be reproduced in the lab), this is a", 
   "> parser/DOM-builder bug."
  ], 
  "revision_id": "334502"
 }, 
 {
  "author": "sboag", 
  "date": "2001-03-12T02:12:59.000000Z", 
  "msg": [
   "The DOM2Helper#isNodeAfter(Node node1, Node node2) method", 
   "has been fixed so that it no longer does the try/catch thing if one", 
   "of the nodes doesn't implement DOMOrder, but instead does an", 
   "instanceof test.  In StreeDOMHelper, it overloads this method and", 
   "*does* do the try/catch business, since almost always both nodes", 
   "will implement DOMOrder in this case, and this will be faster than", 
   "an instanceof test.  Also, in various classes, I did some stuff to try", 
   "and make sure that a DOM2Helper wasn't being created and used", 
   "when a StreeDOMHelper is needed.", 
   "This addresses http://nagoya.apache.org/bugzilla/show_bug.cgi?id=800", 
   "and should give a good performance fix for foreign DOM processing."
  ], 
  "revision_id": "334501"
 }, 
 {
  "author": "sboag", 
  "date": "2001-03-12T02:04:10.000000Z", 
  "msg": [
   "These are John Gentilin <johnglinux@eyecatching.com>", 
   "patches for connection pooling and parameterized", 
   "queries.  These should be considered to be unstable", 
   "right now, as we are still working on some things."
  ], 
  "revision_id": "334500"
 }
]