[
 {
  "author": "dleslie", 
  "date": "2001-04-23T18:53:37.000000Z", 
  "msg": [
   "1.  Updated per comments by Albert Tsun about including", 
   "charset=UTF-8 in the SimpleServlet ContentType prior to gettting", 
   "a Print Writer from the response object.", 
   "2. Updated ApplyXSLT to use default output properties for anything", 
   "that the stylesheet does not supply for setting the ContentType.", 
   "3. Updated ApplyXSLT to be able to use a default Templates object", 
   "when an xslURL parameter is not included in the request", 
   "and the XML source doc does not include a stylesheet PI.", 
   "Useful for cases where the same stylesheet is being used for", 
   "many/most transformations performed by the servlet."
  ], 
  "revision_id": "334634"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-04-22T22:08:27.000000Z", 
  "msg": [
   "Many changes related to supporting the DTM Builder.", 
   "String pool and coroutine parser layers now have built-in", 
   "unit-test drivers; see their main()s.", 
   "The calls from DTMBuilder to DTM still need a lot of work to", 
   "polish exactly what pools are used and what filtering goes on", 
   "during DTM build. More importantly, the whole startup sequence", 
   "needs to be properly architected -- the DTM, builder and", 
   "parser have cross-awareness of each other and someone", 
   "needs to decide who creates what and/or connects to what", 
   "in what order.", 
   "In Progress!"
  ], 
  "revision_id": "334633"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-04-20T15:33:25.000000Z", 
  "msg": [
   "Built-in unit test (rough, but sufficient as a sanity check)"
  ], 
  "revision_id": "334632"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-04-20T13:49:52.000000Z", 
  "msg": [
   "1:1 int-to-string-to-int map, used to hold semantically meaningful", 
   "(and probably frequently reused) strings in the DTM model."
  ], 
  "revision_id": "334631"
 }, 
 {
  "author": "curcuru", 
  "date": "2001-04-19T20:42:42.000000Z", 
  "msg": [
   "Major cleanup and integration of basic XSLTC stuff;", 
   "Simplify batch script to only setup parser and ant.jar;", 
   "Cleanup unused targets and organize variables;", 
   "Added xsltc.compile, .jar targets, but they're not quite complete yet"
  ], 
  "revision_id": "334630"
 }
]