[
 {
  "author": "curcuru", 
  "date": "2001-05-23T17:05:36.000000Z", 
  "msg": [
   "Updated for xalan-j_2_1_0 release - hack to remove misc javadoc files longer than 100 chars", 
   "Should be removed once we have a permanent solution!"
  ], 
  "revision_id": "334859"
 }, 
 {
  "author": "tmiller", 
  "date": "2001-05-23T15:23:25.000000Z", 
  "msg": [
   "bug fix 1403, output escaping fixed"
  ], 
  "revision_id": "334858"
 }, 
 {
  "author": "morten", 
  "date": "2001-05-23T14:57:45.000000Z", 
  "msg": [
   "Added a new demo. This one demonstrates how pre-compiled translets can be", 
   "invoked by an EJB (another way of offering compiled XSL transformations as", 
   "a web service). Very simple, nothing fancy, but it works."
  ], 
  "revision_id": "334857"
 }, 
 {
  "author": "sboag", 
  "date": "2001-05-23T02:57:56.000000Z", 
  "msg": [
   "Moved DTM implementation classes down a directory, into a", 
   "\"ref\" package (for reference implementation).  I wanted to clearly", 
   "seperate the interfaces from the implementation, and make it", 
   "clear which are which.  SAX2DTM and DOM2DOM went down", 
   "a level also.  We might want to think about pulling them directly", 
   "into the ref directory, since I don't think their packaging serves", 
   "a real purpose at this point.", 
   "Also, pulled the inner iterator and traverser classes into derived", 
   "classes of DTMDefaultBase, DTMDefaultBaseTraversers and", 
   "DTMDefaultBaseIterators  (which derives from DTMDefaultBaseTraversers)", 
   "so that DTMDefaultBase isn't so cluttered.  DOM2DTM and", 
   "SAX2DTM now derive from DTMDefaultBaseIterators.", 
   "Added a few more traverser classes for MatchIterator use,", 
   "and did the basic StepPattern construction for NodeIterators.", 
   "This work is, unfortunately, still in progress."
  ], 
  "revision_id": "334856"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-05-22T23:04:18.000000Z", 
  "msg": [
   "Javadocs. Some namespace issues need a closer look."
  ], 
  "revision_id": "334855"
 }
]