[
 {
  "author": "sboag", 
  "date": "2001-05-27T03:05:16.000000Z", 
  "msg": [
   "Myriam's merges from the main branch."
  ], 
  "revision_id": "334869"
 }, 
 {
  "author": "sboag", 
  "date": "2001-05-27T02:28:53.000000Z", 
  "msg": [
   "Added onestep iterators which use DTM traversers or iterators, and are", 
   "applicable to any one-step path.  Added self iterator for \".\" (can't", 
   "believe I didn't do this before).  Moved walker portion of LocationPathIterator", 
   "to WalkingIterator, and made LocationPathIterator abstract.  Removed", 
   "the waiting logic from AxisWalker (thank god and good riddence).", 
   "Added many functions to WalkerFactory to determine the structure", 
   "of the LocationPath, and added much logic to choose the right", 
   "iterator, including looking into predicates to determine if they could", 
   "have a proximity predicate or function, and, if not, use a descendant", 
   "iterator if everything else is right.  Also, detirmine if path steps", 
   "can criss-cross, and, if so, use the MatchIterator (this let me", 
   "get rid of waiting walkers).  Also, made many fixes to DTM traversers", 
   "and iterators."
  ], 
  "revision_id": "334868"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-05-25T20:39:03.000000Z", 
  "msg": [
   "Foolish fencepost error."
  ], 
  "revision_id": "334867"
 }, 
 {
  "author": "sboag", 
  "date": "2001-05-25T17:37:05.000000Z", 
  "msg": [
   "I finally got inverted select patterns passing for 100% of", 
   "the test suite, except I have them turned off for", 
   "namespaces, which simply can't be done", 
   "because of our broken parantage of namespace", 
   "nodes, and functions, which are easy enough,", 
   "I've just had it for the time being.", 
   "This was really nasty, though the code itself isn't", 
   "too bad.  Inverted select patterns and match", 
   "patterns share exactly the same code, though", 
   "the construction is, of course, different.  I think I", 
   "found a few bugs in the original match code, so", 
   "hopefully match patterns will be somewhat more", 
   "robust in general now.", 
   "In reality, though I have them working for", 
   "everything, these will only be used in limited", 
   "circumstances, i.e. criss-crossed patterns, and a", 
   "few other things.  They are horribly inefficient for", 
   "some types of selections.", 
   "Right now the MatchIterator creation is turned off", 
   "in the WalkerFactory, since blanket enabling of this", 
   "makes thing several times slower.  Also, I didn't want", 
   "to cause any unneeded instability for Myriam and", 
   "Joe."
  ], 
  "revision_id": "334866"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-05-23T21:01:45.000000Z", 
  "msg": [
   "Clarifying known-issue comments again."
  ], 
  "revision_id": "334865"
 }
]