[
 {
  "author": "garyp", 
  "date": "2001-05-31T16:03:17.000000Z", 
  "msg": [
   "Fixed removeAttribute bug pointed out by by dims.  This should be fixed in the next release of SAX.", 
   "Made the same change to both Xalan and xml-commons."
  ], 
  "revision_id": "334884"
 }, 
 {
  "author": "sboag", 
  "date": "2001-05-30T20:31:26.000000Z", 
  "msg": [
   "Minor performance tweaks for getNodeType.", 
   "Minor tweaks for StepPattern#execute.", 
   "For the moment don't use MatchIterator, but use WalkerIteratorSorted instead.", 
   "Minor tweaks for DTMWSFilter to pass DTM.", 
   "Direct call to get string characters for templates if only child is", 
   "a text literal."
  ], 
  "revision_id": "334883"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-05-29T22:17:02.000000Z", 
  "msg": [
   "Are we officially abandoning VJ++?"
  ], 
  "revision_id": "334882"
 }, 
 {
  "author": "sboag", 
  "date": "2001-05-29T14:31:54.000000Z", 
  "msg": [
   "Implemented new isNodesetExpr and asNode methods on Expression,", 
   "and getArg0AsNode and Arg0IsNodesetExpr on FunctionDef1Arg.", 
   "This allows functions that just take a single node to get that node", 
   "without creating an XNodeset or iterator if the expression is a simple", 
   "one-step LocationPath (more complicated LocationPaths still need", 
   "iterators, at least for the moment).  There will be more to come along", 
   "these lines, trying to reduce the number of XObject derivatives that are", 
   "are created during function evaluation.", 
   "Added sendNormalizedSAXcharacters to the FastStringBuffer, and", 
   "a param on DTM#dispatchCharactersEvents to enable normalization", 
   "of the characters.  This allows us to send normalized characters", 
   "without copying.  I think the sendNormalizedSAXcharacters may", 
   "need a little tuning.", 
   "Added tweak/hack to DTMDefaultBase which is a flag telling", 
   "if a namespace has been seen, and, if it has not, always return", 
   "immediately from getFirstNamespaceNode, which, as it turns", 
   "out, is called a lot in the course of copy operations.  We need to", 
   "come up with something better than this.  I suggested to Joe", 
   "that we use a bitset for namespaces and attributes that will", 
   "tell us if a given element has these nodes (I think it would help", 
   "for getFirstAttribute as well)."
  ], 
  "revision_id": "334881"
 }, 
 {
  "author": "sboag", 
  "date": "2001-05-28T20:13:57.000000Z", 
  "msg": [
   "Fix  bug with findGTE where it wasn't properly checking to see", 
   "if the low was higher than the end."
  ], 
  "revision_id": "334880"
 }
]