[
 {
  "author": "sboag", 
  "date": "2001-05-18T07:17:24.000000Z", 
  "msg": [
   "I have implemented the basic XMLString architecture.  Only getStringValue", 
   "returns an XMLString.  getNodeValue continues to return a string,", 
   "especially since this is usually used with attribute values, which", 
   "are already strings from SAX.", 
   "An XMLStringFactory is set on the DTMManager.  This factory is", 
   "passed to the DTM implementations.  The factory implemented by", 
   "Xalan is in org.apache.xpath.objects.XMLStringFactoryImpl.  This", 
   "creates XString objects which implement the XMLString interface.", 
   "The XStringForFSB and XStringForChars classes subclass", 
   "XString.  Any methods not implemented by those classes will", 
   "fall back to the XString class, which will cause a conversion", 
   "to string by calling the str() method.  If str() is called on these", 
   "classes, they will cache the string they create.  Still, there may", 
   "be some circumstances where more strings are created than", 
   "before.  We'll have to address this during performance tuning.", 
   "In general, many less strings should be created, and this should", 
   "help a lot with performance.", 
   "There is a XMLStringWrapperForString in org.apache.xml.utils,", 
   "but it isn't used... I may or may not delete it at some point.", 
   "I also added a couple of methods to the FastStringBuffer.  After", 
   "we get past this next release, I have some requests for Joe for", 
   "this class.  Also, Joe needs to review my implementation of the", 
   "charAt function.", 
   "I also fixed the SAX2DOM charactersFlush method, which,", 
   "ahem, Joe broke with his last check in.  Simple fix to do with the", 
   "m_data setting, which he did have a flag that it needed review.", 
   "All stream-based conformance tests pass (with the exception", 
   "of the excluded tests)."
  ], 
  "revision_id": "334804"
 }, 
 {
  "author": "curcuru", 
  "date": "2001-05-17T22:29:05.000000Z", 
  "msg": [
   "Update Javadoc and remove commented out reference to properties file", 
   "PR:Bugzilla1627"
  ], 
  "revision_id": "334803"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-05-17T21:43:55.000000Z", 
  "msg": [
   "Revised text-coalescence code, improved handling of CDATA Sections."
  ], 
  "revision_id": "334802"
 }, 
 {
  "author": "curcuru", 
  "date": "2001-05-17T21:15:50.000000Z", 
  "msg": [
   "Remove outdated, unused files: old makefiles"
  ], 
  "revision_id": "334801"
 }, 
 {
  "author": "dleslie", 
  "date": "2001-05-17T16:46:38.000000Z", 
  "msg": [
   "Removed printline"
  ], 
  "revision_id": "334800"
 }
]