[
 {
  "author": "sboag", 
  "date": "2001-06-12T02:54:52.000000Z", 
  "msg": [
   "Removed StringKey, and references to such.  Minor item that's been", 
   "long outstanding on my todo list."
  ], 
  "revision_id": "334944"
 }, 
 {
  "author": "sboag", 
  "date": "2001-06-12T01:56:14.000000Z", 
  "msg": [
   "Just going back to the older str() function (the one that doesn't", 
   "use BigDecimal.  I believe personally that the one that uses BigDecimal", 
   "is correct, but right now it will fail the conformance test, and we", 
   "have to figure out the validation for this once and for all, including", 
   "in regards to the datapower metrics.xsl test."
  ], 
  "revision_id": "334943"
 }, 
 {
  "author": "sboag", 
  "date": "2001-06-11T20:17:16.000000Z", 
  "msg": [
   "This check-in is probably too large to rightfully do in a single commit.  Sorry.", 
   "The variable mechanism is been redone, so that references do", 
   "direct index lookup, instead of lookup by QName comparison.  The", 
   "variable stack is completely redesigned so that link/unlink is called", 
   "on the stack before an apply templates or call templates.  I still don't", 
   "like how parameters are being pushed on the stack... but I'm not", 
   "sure there's a viable alternative.  All the static variable resolution is", 
   "done in the compose() methods, which is different from the original", 
   "design I posted to the list.", 
   "transformSelectedNodes is now implemented seperately in ElemApplyTemplates", 
   "and ElemForEach... they no longer share the function.", 
   "A bug was  fixed in relation to problems discovered running", 
   "the datapower suite: UnionPaths had trouble sorting.", 
   "Other tweaks for performance were made."
  ], 
  "revision_id": "334942"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-06-11T19:26:17.000000Z", 
  "msg": [
   "Revised namespace support"
  ], 
  "revision_id": "334941"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-06-11T19:05:05.000000Z", 
  "msg": [
   "Namespace support changes; requires alterations to DOM2DTM and SAX2DTM"
  ], 
  "revision_id": "334940"
 }
]