[
 {
  "author": "morten", 
  "date": "2001-06-29T14:58:56.000000Z", 
  "msg": [
   "Added a fix for local variables inside nested xsl:for-each elements.", 
   "Local variables are usually not initialized to any default value (such as", 
   "with general Java classes), because code compiled for <xsl:variable>", 
   "elements always assign values to variable slots before they are accessed.", 
   "But the code structure generated by nested <xsl:for-each> elements is too", 
   "much for the JVMs verifier to get around, so we have to initialize all", 
   "local variables inside such loops to zero, false, null, whatever.", 
   "This takes care some of our runtime-errors caused by apparent corrupt code.", 
   "(The JVMs verifier thinks that it is corrupt, but it isn't really.)", 
   "PR:\t\tnone", 
   "Obtained from:\tn/a", 
   "Submitted by:\tmorten@xml.apache.org", 
   "Reviewed by:\tmorten@xml.apache.org"
  ], 
  "revision_id": "335114"
 }, 
 {
  "author": "sboag", 
  "date": "2001-06-29T12:39:00.000000Z", 
  "msg": [
   "Add getVariable(QName qname) method, for reply to bug 2355."
  ], 
  "revision_id": "335113"
 }, 
 {
  "author": "morten", 
  "date": "2001-06-29T12:04:35.000000Z", 
  "msg": [
   "Fix for element-available() and function-available() calls. Ties these", 
   "calls to tables in the XSL parser and the symbol-table (the actual", 
   "implementation) instead of using redundant and not-up-to-date tables", 
   "in the classes that implement the X-avaiable() calls.", 
   "I also cleaned up the Choose call so that it now properly handles", 
   "all types of function calls in the xsl:when elements' test clause.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "335112"
 }, 
 {
  "author": "", 
  "date": "2001-06-28T21:33:57.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'xalan-j_2_2_D04'."
  ], 
  "revision_id": "335111"
 }, 
 {
  "author": "mmidy", 
  "date": "2001-06-28T21:33:57.000000Z", 
  "msg": [
   "Make sure we get the template mode for the trace event."
  ], 
  "revision_id": "335110"
 }
]