[
 {
  "author": "garyp", 
  "date": "2001-07-10T23:23:49.000000Z", 
  "msg": [
   "Modify distinct() extension so that it no longer relies on DOMHelper which is deprecated but uses ExpressionContext.toString()."
  ], 
  "revision_id": "335154"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-07-10T22:23:50.000000Z", 
  "msg": [
   "Quick patch to handle case where someone wants to build a DTM from", 
   "an Element rather than from a Document. The Attr handling might want to", 
   "move down into addNode.", 
   "This opens several cans of worms -- what if the next user wants the", 
   "root of their DTM to be an EntityReference node, which has no DTM", 
   "node equivalent -- but we'll eat those when we get to them."
  ], 
  "revision_id": "335153"
 }, 
 {
  "author": "morten", 
  "date": "2001-07-10T17:46:26.000000Z", 
  "msg": [
   "A wide range of fixes provided by Erwin Bolwidt.", 
   "o) fix for long IF and GOTO instructions inside translets.", 
   "'wide' GOTOs are now used (GOTO_W) instead of plain GOTO", 
   "to allow longer jump offsets", 
   "o) fix for illegal field/method names in the translet.", 
   "Methods and fields no longer contain the '.' or '-' characters", 
   "o) source filenames (and if possible also line numbers) are now", 
   "provided with error and warning messages", 
   "o) external functions that are not supported by XSLTC do not cause", 
   "compile errors. They will still cause a warning message at", 
   "compile-time if they are not wrapped in proper <xsl:if> or", 
   "<xsl:when> elements that test on the availability of the function,", 
   "and will cause a runtime error if the function is attempted called.", 
   "o) added type cast from reference-type to node-type", 
   "o) some other smaller fixes to prevent null-pointer exceptions", 
   "Other changes:", 
   "o) code cleanup and some added comments", 
   "PR:\t\tn/a", 
   "Obtained from:\tn/a", 
   "Submitted by:\tErwin Bolwidt <ejb@klomp.org>", 
   "Reviewed by:\tMorten Jorgensen <morten@xml.apache.org>"
  ], 
  "revision_id": "335152"
 }, 
 {
  "author": "mmidy", 
  "date": "2001-07-10T17:14:20.000000Z", 
  "msg": [
   "Fix problem with descendant-or-self and from root pattern. When from root, descedant or self was not recognized."
  ], 
  "revision_id": "335151"
 }, 
 {
  "author": "garyp", 
  "date": "2001-07-10T08:38:30.000000Z", 
  "msg": [
   "Resolve bugzilla 2523 <http://nagoya.apache.org/bugzilla/show_bug.cgi?id=2523>.  evaluate extension function was not refactored with DTM.  Also need to add function to XPathContext.XPathExpressionContext to allow an extension to obtain the associated XPathContext."
  ], 
  "revision_id": "335150"
 }
]