[
 {
  "author": "sboag", 
  "date": "2001-08-06T22:17:17.000000Z", 
  "msg": [
   "This checkin hopefully fixes many problems with bad diagnostics lately, but", 
   "at the expense of a slight change in behavior.  The rule now is, the", 
   "DefaultErrorHandler never outputs location info for error and fatalError... this has to be done", 
   "by the catcher of the exception.  Convenience methods for this are", 
   "in DefaultErrorHandler#printLocation.  This method will unwrap the", 
   "exception as close to the originating source as possible."
  ], 
  "revision_id": "335339"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-08-06T21:10:31.000000Z", 
  "msg": [
   "Performance improvement; avoid scanning the same list twice."
  ], 
  "revision_id": "335338"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-08-06T18:38:28.000000Z", 
  "msg": [
   "Playing a hunch, I moved the Context objects out of NamespaceSupport2.", 
   "They're now a second class in the same file rather than being an inner class.", 
   "That reduces the size of the Context2 object, and its initialization time, by", 
   "removing the need for it to carry a reference to the NamespaceSupport2", 
   "object that created it.", 
   "Performance seems significantly improved... even (surprisingly!) on the", 
   "getDeclaredPrefixes operation. Memory usage also seems better, as", 
   "expected.", 
   "NamespaceSupport2 is still acounting for about 5%", 
   "of the time spent in the ResultTreeHandler, according", 
   "to my latest trace. Apparently we are calling", 
   "getDeclaredPrefixes an obscenely large number of", 
   "times, and the Vector.elements call is adding up. We", 
   "may want to look at where this is being called from", 
   "and whether we can reduce the number of invocations."
  ], 
  "revision_id": "335337"
 }, 
 {
  "author": "sboag", 
  "date": "2001-08-06T17:15:21.000000Z", 
  "msg": [
   "Made _maxAncestors not static, as this is", 
   "not compatible with 1.1.8 (reported by", 
   "Gary Peskin)."
  ], 
  "revision_id": "335336"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-08-06T14:56:32.000000Z", 
  "msg": [
   "Don't create caches unless used (which I don't think they are, in Xalan)."
  ], 
  "revision_id": "335335"
 }
]