[
 {
  "author": "sboag", 
  "date": "2001-08-10T19:20:24.000000Z", 
  "msg": [
   "Try to support getRoot.  Fixes problem with TransformStateTest."
  ], 
  "revision_id": "335374"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-08-10T17:58:04.000000Z", 
  "msg": [
   "Increasing the number of bits used to identify DTM nodes, at the expense of decreasing the number of DTMs that a DTMManager can track simultaneously. Some other code has been updated to track this change (and to better track posible future changes), as have the IDKEY testcases."
  ], 
  "revision_id": "335373"
 }, 
 {
  "author": "amiro", 
  "date": "2001-08-10T17:56:14.000000Z", 
  "msg": [
   "Updating these \"release note/readme\" files on xsltc for the next release.", 
   "They have become very rusty. The section on TrAX still has to be rewritten.", 
   "I updated the \"todo\" list based on the current bug list, but I'm not", 
   "sure we should have fixing-different-sets-of-bugs as 'todo' items, since", 
   "it is very hard to keep them up-to-date. Along those lines, I replaced", 
   "the \"Known Problems\" content with a reference to the bugs in Bugzilla.", 
   "After all, the reported bugs are the know problems."
  ], 
  "revision_id": "335372"
 }, 
 {
  "author": "amiro", 
  "date": "2001-08-10T16:35:58.000000Z", 
  "msg": [
   "PR: 2591", 
   "Obtained from: padraig", 
   "Submitted by: Tom Amiro", 
   "Reviewed by:", 
   "Fix references in doc to org.apache.xalan.xsltc.runtime where they should", 
   "be org.apache.xalan.xsltc.trax. The initial trax implementation was in", 
   "the \"runtime\" subdirectory, but later moved to the \"trax\" directory."
  ], 
  "revision_id": "335371"
 }, 
 {
  "author": "garyp", 
  "date": "2001-08-10T16:21:10.000000Z", 
  "msg": [
   "ResultTreeHandler was pushing a new namespace context but failing to note that result in more pushes than pops.  Cleaned up the execute() method of ElemElement to make it more understandable (to me) and added a few comments.  The DefaultErrorHandler was not flushing Writers that it created.  Since the Writers are never closed (and cannot be as there is no close method), error messages were failing to appear."
  ], 
  "revision_id": "335370"
 }
]