[
 {
  "author": "morten", 
  "date": "2001-08-21T09:04:28.000000Z", 
  "msg": [
   "Protected some methods in our TrAX code that are not defined in the TrAX API.", 
   "These methods were never intended for public use and should have been defined", 
   "as \"protected\" to begin with.", 
   "PR:\t\tn/a", 
   "Obtained from:\tn/a", 
   "Submitted by:\tmorten@xml.apache.org", 
   "Reviewed by:\tmorten@xml.apache.org"
  ], 
  "revision_id": "335424"
 }, 
 {
  "author": "morten", 
  "date": "2001-08-21T09:01:19.000000Z", 
  "msg": [
   "An attempt to optimise the building of the ID index. The previous version of", 
   "this code would traverse the DOM once for each type of element that had a", 
   "defined ID attribute. The new version traverses the DOM once, and looks up", 
   "each element's type in a hashtable to determine its ID attribute type (if any).", 
   "The new version of the code does not use string comparisons, like the old one.", 
   "This update was done to compensate for the possible performance degradation of", 
   "having implemented an element/attribute prefix array in the internal DOM.", 
   "PR:\t\tn/a", 
   "Obtained from:\tn/a", 
   "Submitted by:\tmorten@xml.apache.org", 
   "Reviewed by:\tmorten@xml.apache.org"
  ], 
  "revision_id": "335423"
 }, 
 {
  "author": "sboag", 
  "date": "2001-08-21T03:06:45.000000Z", 
  "msg": [
   "Fix for problem reported by Mike Starr <mike.starr@air2web.com>,", 
   "where the transformation hangs for \"foo[2] | bang\"", 
   "patters, i.e. unions with positional predicates.  The fix", 
   "is to have the iterators#nextNode() set m_lastFetched to DTM.NULL", 
   "when m_foundLast is found to be true on function entry", 
   "(after the cache check).  This allows getCurrentNode() to", 
   "fullfill it's contract of returning null if the last fetch was", 
   "null.  The bug occured after an optimization for positional", 
   "predicates to have them not continue searching once", 
   "the positional node was found, by setting m_foundLast", 
   "to true."
  ], 
  "revision_id": "335422"
 }, 
 {
  "author": "sboag", 
  "date": "2001-08-20T23:48:10.000000Z", 
  "msg": [
   "Call new XPathContext#getCurrentNodeList.  Fixes", 
   "http://nagoya.apache.org/bugzilla/show_bug.cgi?id=3031."
  ], 
  "revision_id": "335421"
 }, 
 {
  "author": "sboag", 
  "date": "2001-08-20T23:47:11.000000Z", 
  "msg": [
   "Added getCurrentNodeList() for getting the current node list as defined", 
   "by http://www.w3.org/TR/xslt#dt-current-node-list.", 
   "This looks up the stack of the SubContextLists to find the top-level", 
   "LocPathIterator.  I'm fairly unhappy with this fix, and hope to restructure", 
   "the context list stuff a bit to avoid the casts in the getCurrentNodeList(),", 
   "and to fix getCurrentNode() so that it properly defines the current", 
   "node as defined by the XSLT spec.  As a matter of fact, I would", 
   "like to break up XPathContext into an XSLTContext.", 
   "Part of the http://nagoya.apache.org/bugzilla/show_bug.cgi?id=3031", 
   "fix."
  ], 
  "revision_id": "335420"
 }
]