[
 {
  "author": "jkesselm", 
  "date": "2001-11-26T22:08:28.000000Z", 
  "msg": [
   "Another fairly large change in the DTM architexture (sic)....", 
   "We've changed DTM's internal behavior so it can now assign", 
   "more than one \"DTM ID\" to a single document, cascading from", 
   "one ID to the next. This means that the size of a single DTM is", 
   "no longer limited by the bits available in the low part of the DTM", 
   "Node Handle. This means we can support larger documents.", 
   "That has allowed us to reduce the number of bits reserved", 
   "for that portion of the node addresing scheme... which in turn has", 
   "increased the number of bits available for use in the DTM ID. This", 
   "means we can now have many more documents active at once.", 
   "The trade-off is that huge documents will require more than one", 
   "DTM ID and thus cut into the number of documents, But since we", 
   "now have 16 bits of DTM ID space, I don't think we're really likely", 
   "to run into both limits at once. And the changes are essentially", 
   "limited to the DTM layer; the rest of Xalan should be unaffected.", 
   "In the process of making this change, I've also encapsulated the", 
   "conversions between DTM API node handles and DTMDefaultBase's", 
   "internal node indices. That should be safer all 'round.", 
   "NOTE: One side effect of this change is that the strings", 
   "generated by the key() function have changed again.", 
   "I've updated the IDKEY testcases to reflect this.", 
   "Smoketest is currently passing everything except", 
   "axes109 and the API's TraceListenerTest . But I believe", 
   "those failures are due to a glitch in my test directory", 
   "since they also happen when I run the D13 code there,", 
   "whereas D13 runs fine in the directory where I built it.", 
   "I'm going to assume that \"same result is no new bug\"", 
   "for now."
  ], 
  "revision_id": "335859"
 }, 
 {
  "author": "jkesselm", 
  "date": "2001-11-26T18:51:48.000000Z", 
  "msg": [
   "Sigh. The XML Namespaces spec it itself imperfectly", 
   "namespace-aware. While there's a plan to fix that, it's", 
   "safer for now if we test the QName when looking for", 
   "explicit instances of xmlns:xml in the source document."
  ], 
  "revision_id": "335858"
 }, 
 {
  "author": "curcuru", 
  "date": "2001-11-26T14:08:32.000000Z", 
  "msg": [
   "Bump D version number just in case; update handling of patternsets for", 
   "xml-commons related files; fix 'clean' target to delete (most) xml-commons related files;", 
   "update BCEL and JLex Ant propertynames to be all lower case"
  ], 
  "revision_id": "335857"
 }, 
 {
  "author": "morten", 
  "date": "2001-11-26T14:03:09.000000Z", 
  "msg": [
   "Added a new method to the DOM interface for retrieving the DOM as a single", 
   "string. This method is different from the existing getStringValue() in the", 
   "way that it generates element brackets and copies PIs and comments.", 
   "PR:\t\tbugzilla 4874", 
   "Obtained from:\tn/a", 
   "Submitted by:\tmorten@xml.apache.org", 
   "Reviewed by:\tmorten@xml.apache.org"
  ], 
  "revision_id": "335856"
 }, 
 {
  "author": "morten", 
  "date": "2001-11-26T12:57:44.000000Z", 
  "msg": [
   "A small fix needed after a fix for stripping/preserving text nodes. The fix", 
   "for text-nodes caused us to insert text nodes before <xsl:attribute> elements", 
   "in the AST, which again caused the XslAttribute class to complain.", 
   "PR:\t\tn/a", 
   "Obtained from:\tn/a", 
   "Submitted by:\tmorten@xml.apache.org", 
   "Reviewed by:\tmorten@xml.apache.org"
  ], 
  "revision_id": "335855"
 }
]