[
 {
  "author": "tmiller", 
  "date": "2002-01-14T19:34:49.000000Z", 
  "msg": [
   "added new target xsltc.bundledjar that creates a", 
   "single jar file containing xsltc impl and support jars (bcel, java cup, etc)"
  ], 
  "revision_id": "335964"
 }, 
 {
  "author": "amiro", 
  "date": "2002-01-14T15:35:14.000000Z", 
  "msg": [
   "fixed style problems so xsltc doc would build"
  ], 
  "revision_id": "335963"
 }, 
 {
  "author": "curcuru", 
  "date": "2002-01-14T15:03:12.000000Z", 
  "msg": [
   "Fix Bugzilla#4678 and Bugzilla#5533: call setSystemId on StreamResult", 
   "in Process command line class; ignored if using System.out", 
   "This should enable the redirect extension to properly put it's redirected", 
   "output in a location relative to the output if possible; previously it", 
   "always put redirected output relative to the input since it", 
   "never had the systemId of where the output should be"
  ], 
  "revision_id": "335962"
 }, 
 {
  "author": "curcuru", 
  "date": "2002-01-13T21:25:06.000000Z", 
  "msg": [
   "Fix Bugzilla#5701: incorrect resolution of certain kinds of absolute file: URIs", 
   "Note: This definitely seems to be more correct in terms of resolving URIs", 
   "vis-a-vis RFC 2396 than it used to be. The only user case which might now", 
   "fail where it used to work is a user that supplies an incorrect", 
   "'file:subdir/blah' that they intended to be a relative URI (technically", 
   "it is an absolute URI no matter which way you look at it); this might", 
   "lead to a change in behavior in this particular case, although the behavior", 
   "before was incorrect.", 
   "The major risk factor could be if there are other parts of Xalan code that rely", 
   "on the previously incorrect behavior, but I can't find any, and the whole test", 
   "suite runs and passes normally."
  ], 
  "revision_id": "335961"
 }, 
 {
  "author": "curcuru", 
  "date": "2002-01-11T19:31:37.000000Z", 
  "msg": [
   "Reference new bin/xml-apis.jar file; skip compiling the xml-apis code;", 
   "added skipcompat flag to ignore building 1.x compatibility-related items;", 
   "bumped version number to 2.2.0 for possible release next week"
  ], 
  "revision_id": "335960"
 }
]