[
 {
  "author": "tmiller", 
  "date": "2002-01-24T17:55:55.000000Z", 
  "msg": [
   "bug 1520 fix, escape chars over 0080 instead of 00FF"
  ], 
  "revision_id": "335994"
 }, 
 {
  "author": "jkesselm", 
  "date": "2002-01-23T22:53:47.000000Z", 
  "msg": [
   "These changes allow us to store multiple Result Tree Fragment (RTF)", 
   "document trees (used when an XSLT variable contains a constructed", 
   "set of nodes)  into a single DTM object rather than using a new DTM", 
   "for each RTF. They also permit \"tail-pruning\" this shared DTM to", 
   "reuse that space as the variables go out of scope.", 
   "The result is a slight performance improvement, and a much more", 
   "significant improvement in storage efficiency. Stylesheets which", 
   "use RTFs heavily should now run in much less memory; in", 
   "one testcase, our \"working set\" heap size (storage actually in", 
   "use, not counting objects released but not yet GC'd) dropped", 
   "from 12-15MB down to 3-6MB, and heap churn (how quickly", 
   "storage was being allocated and discarded) also reduced", 
   "substantially.", 
   "The code changes needed to support this new scheme are", 
   "surprisingly small. And I believe it may be possible to reduce them", 
   "further, if we're willing to merge the SAX2RTFDTM subclass back", 
   "into its SAX2DTM superclass.  I believe that could be done with", 
   "very little adverse impact on other uses of SAX2DTM... but I felt it", 
   "was safer to defer that decision for now."
  ], 
  "revision_id": "335993"
 }, 
 {
  "author": "dleslie", 
  "date": "2002-01-22T21:10:49.000000Z", 
  "msg": [
   "Interim update"
  ], 
  "revision_id": "335992"
 }, 
 {
  "author": "dleslie", 
  "date": "2002-01-22T18:25:38.000000Z", 
  "msg": [
   "For XercesParser, use JAXP DocumentBuilder to parse XML documents and return a", 
   "Document."
  ], 
  "revision_id": "335991"
 }, 
 {
  "author": "dleslie", 
  "date": "2002-01-22T17:25:36.000000Z", 
  "msg": [
   "Doc updates for 2.3"
  ], 
  "revision_id": "335990"
 }
]