[
 {
  "author": "", 
  "date": "2002-04-03T15:05:10.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch", 
   "'jaxp-ri-1_2_0-fcs-branch'."
  ], 
  "revision_id": "336219"
 }, 
 {
  "author": "", 
  "date": "2002-04-02T23:50:25.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'jaxp-ri-1_2_0-fcs-branch-xsltc-merge'."
  ], 
  "revision_id": "336218"
 }, 
 {
  "author": "santiagopg", 
  "date": "2002-04-02T23:50:25.000000Z", 
  "msg": [
   "Adding text nodes (even if they are just whitespace) as children of root", 
   "causes a DOM006 exception in the document builder. Hence, these text nodes", 
   "are now ignored."
  ], 
  "revision_id": "336217"
 }, 
 {
  "author": "santiagopg", 
  "date": "2002-04-02T21:52:29.000000Z", 
  "msg": [
   "Fix for attribset24."
  ], 
  "revision_id": "336216"
 }, 
 {
  "author": "sboag", 
  "date": "2002-04-02T19:29:55.000000Z", 
  "msg": [
   "Fix for http://nagoya.apache.org/bugzilla/show_bug.cgi?id=7622.", 
   "1) Transform#1 creates an XRTreeFrag.  This has a reference to a DTM, that in turn is registered with a DTMManager.  The DTM will need to be deleted from the DTMManager when the XRTreeFrag is deleted.  The XRTreeFrag  also contains a reference to the XPathContext.", 
   "2) Transform#1 completes.  The XPathContext is reset... namely the a bunch of structures are reset or rebuilt, including DTMManagerDefault#m_dtms.  BUT, the XRTreeFrags are still hanging around, waiting to unregister themselves.", 
   "3) Transform#2 starts humming along.  It builds a XRTreeFrag and installs that RTF DTM into DTMManagerDefault#m_dtms[2].", 
   "4) The finalizer thread wakes and decides to delete some of those old XRTreeFrags from Transform#1.", 
   "5) The XRTreeFrag#finalize() method references through the XPathContext, and deletes what it thinks is it's DTM from  DTMManagerDefault#m_dtms[2] (via getDTMIdentity(dtm)).", 
   "6) Transform#2 tries to reference DTMManagerDefault#m_dtms[2], finds it is null, and chaos results.", 
   "...so, before calling xctxt.release, etc., check to make sure the DTM is actually", 
   "entered in the current DTMManager."
  ], 
  "revision_id": "336215"
 }
]