[
 {
  "author": "jkesselm", 
  "date": "2002-04-12T18:26:19.000000Z", 
  "msg": [
   "Creating a new branch, Xalan3, for experimentation with XPath2 support.", 
   "Currently the changes are limited to org.apache.xml.dtm -- enabling", 
   "datatype support by tying into Xerces' low-level XNI layer, which", 
   "includes experimental support for  post-schema-validation Infoset", 
   "(PSVI) information. Eventually we'll be patching other portions of", 
   "Xalan to actually retrieve and use this data.", 
   "The code I'm now checking in is NOT in final form. Known issues:", 
   "1) The logic in DTMManager which enables this behavior is", 
   "something of a kluge -- it only kicks in if you parse incrementally", 
   "from a StreamSource. The getDTM() method really wants to be", 
   "rationalized somewhat, which will make adding XNI easier.", 
   "2) The storage for datatype information currently adds another", 
   "column to the DTM table. We really want to switch to associating", 
   "the datatype with the Expanded Type table, and using some form", 
   "of sparse array to record local overrides.", 
   "3) The XNI code won't compile without Xerces2. We need to think", 
   "about whether we want to accept that as a dependency, or use", 
   "reflection to bind at run time rather than compile time.", 
   "Note that typed values are currently computed on demand, with the", 
   "DTM storing only the sting values. An argument could be made for", 
   "precomputing some or all of this information and instead generating", 
   "strings on demand (see the XPath2 Data Model spec for discussion", 
   "of that alternative). But that's a considerably larger change, and", 
   "would affect non-type-based users of XSLT as well since it would", 
   "present values in their normalized form rather than as entered; I'd", 
   "rather not go that route until we have a string-based alternative", 
   "fully functional."
  ], 
  "revision_id": "336244"
 }, 
 {
  "author": "", 
  "date": "2002-04-12T18:26:19.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch 'Xalan3'."
  ], 
  "revision_id": "336243"
 }, 
 {
  "author": "mmidy", 
  "date": "2002-04-10T20:33:58.000000Z", 
  "msg": [
   "Change extended types to be an integer and use a structure with a localname, a namespace and a nodetype to represent the node extended type. We no longer need to do the shifting left and right that we did for the previous extended types."
  ], 
  "revision_id": "336242"
 }, 
 {
  "author": "jkesselm", 
  "date": "2002-04-10T13:30:42.000000Z", 
  "msg": [
   "Cleaner disabling of experimental code. Sorry 'bout that."
  ], 
  "revision_id": "336241"
 }, 
 {
  "author": "pauldick", 
  "date": "2002-04-10T13:29:44.000000Z", 
  "msg": [
   "Moved into Test directory"
  ], 
  "revision_id": "336240"
 }
]