[
 {
  "author": "santiagopg", 
  "date": "2002-10-15T17:55:07.000000Z", 
  "msg": [
   "New implementation of xsl:element that properly handles the case where", 
   "the namespace URI computed at runtime is \"\". Some of the code implementing", 
   "the xsl:element instruction has been factored out from the translet into", 
   "the basis library."
  ], 
  "revision_id": "336879"
 }, 
 {
  "author": "ilene", 
  "date": "2002-10-15T14:15:44.000000Z", 
  "msg": [
   "Patch for bugzilla #13305.  Moved initalization code into a static initializer.", 
   "TransformerFactory.newInstance() can now be called safely from multiple", 
   "threads."
  ], 
  "revision_id": "336878"
 }, 
 {
  "author": "tmiller", 
  "date": "2002-10-15T13:22:50.000000Z", 
  "msg": [
   "bug fix 13550, for multiple <xsl:output> elements, cdata-section-elements attrs are now merged"
  ], 
  "revision_id": "336877"
 }, 
 {
  "author": "santiagopg", 
  "date": "2002-10-14T17:07:52.000000Z", 
  "msg": [
   "(1) Fixed some dynamic typing problems with idkeys. Values are now properly", 
   "converted to strings before they are compared.", 
   "(2) Eliminated the use of BitArrays in KeyIndex (better space efficiency).", 
   "(3) All idkey tests now pass with flavor=stream (the 6 failures that are", 
   "reported are due to the use of a different algorithm to generate ids)."
  ], 
  "revision_id": "336876"
 }, 
 {
  "author": "mmidy", 
  "date": "2002-10-11T21:23:20.000000Z", 
  "msg": [
   "Patch from Lionel Villard to extend xalan for tooling purposes. The patch contains the following changes:", 
   "The internal representation of stylesheets is now built using an external definition of classes (see ClassesDef.java). This allows externals applications to extend easily the capabilities of stylesheets modeling and processing. This feature relies on the declaration of the system property ClassesDef.CLASSES_DEF_KEY, its value contains the class name of the concrete class that extends ClassesDef.java", 
   "In the ElemLiteralResult class, a trace event is now generated before and after its execution.", 
   "Correction of a bug in ApplyTemplatesElem.java: the default text template wasn't correctly handled in non-optimized mode.", 
   "The methods in the XSLTVisitor.java class are now public, so externals applications can now use the visitor pattern on XSLT."
  ], 
  "revision_id": "336875"
 }
]