[
 {
  "author": "zongaro", 
  "date": "2002-10-01T16:01:29.000000Z", 
  "msg": [
   "Added and fixed up some additional translation guidelines."
  ], 
  "revision_id": "336839"
 }, 
 {
  "author": "mkwan", 
  "date": "2002-09-30T20:01:47.000000Z", 
  "msg": [
   "XSLTC support in the Process command line - phase 2", 
   "Most of the changes appear in this class. The changes not only allow you", 
   "to use the new XSLTC options in the Process command line. It also give", 
   "you the ability to customize the XSLTC behavior using the standard TRAX API.", 
   "Previously, the XSLTC TRAX API is not aware of translets. You cannot tell it", 
   "to use translets for do transformations. Now you can customize the XSLTC bevaior", 
   "using the new attributes. For example, the following code will allow you", 
   "to use translets for transformations when the translet is newer than the xsl.", 
   "TransformerFactory tf;", 
   "tf.setAttribute(\"auto-translet\", \"true\");", 
   "Templates templates = tf.newTemplates(xslSource);", 
   "The following attributes are added:", 
   "Attributes\t\tCorresponding Process command line options", 
   "use-translet", 
   "translet-name\t\t-XO", 
   "destination-directory\t-XD", 
   "package-name\t\t-XP", 
   "jar-name\t\t-XJ", 
   "auto-translet\t\t-XT", 
   "Four of the new attributes (translet-name, destination-directory, package-name and", 
   "jar-name) are transient. They only apply to the next newTemplates() or newTransformer()", 
   "call. Their values are reset to the default after the call.", 
   "There is also a makefile like feature when you set the \"auto-translet\" attribute. It will", 
   "use the translet to do transformation when the translet is newer than the xsl. If the xsl", 
   "is modified, it will use the xsl to transform and regenerate the translet.", 
   "Unlike the XSLTC Transform command line, the new code will NOT use the existing", 
   "ClassLoader to load the translet or jar file. It directly reads the file content into a", 
   "byte array. This makes the Process command line capable of loading the translet from", 
   "any directory the xsl file might be in or any user specified destination directory, without", 
   "the need on the user to add that directory to the CLASSPATH first."
  ], 
  "revision_id": "336838"
 }, 
 {
  "author": "mkwan", 
  "date": "2002-09-30T19:33:44.000000Z", 
  "msg": [
   "The member name _defaultTransletName in TransformerFactoryImpl", 
   "has been changed to _transletName."
  ], 
  "revision_id": "336837"
 }, 
 {
  "author": "mkwan", 
  "date": "2002-09-30T19:32:06.000000Z", 
  "msg": [
   "Add a wrapper for the noExtName() method in compiler.util.Util.", 
   "The transformerFactoryImpl class makes use of it."
  ], 
  "revision_id": "336836"
 }, 
 {
  "author": "mkwan", 
  "date": "2002-09-30T19:30:11.000000Z", 
  "msg": [
   "XSLTC support in the Process command line - phase 2", 
   "Add two new output types:", 
   "- BYTEARRAY_AND_FILE_OUTPUT: return a byte array and generate the translet class", 
   "- BYTEARRAY_AND_JAR_OUTPUT:  return a byte array and generate the jar file", 
   "Add a new compile() interface which accepts the output type as the third", 
   "parameter. Use different Vectors to store bytecodes and JavaClass objects."
  ], 
  "revision_id": "336835"
 }
]