[
 {
  "author": "jkesselm", 
  "date": "2002-09-27T22:07:03.000000Z", 
  "msg": [
   "Highly experimental prototype of \"thin\" DOM2DTM2 --", 
   "rather than replicating the DOM's tree structure, we dynamically", 
   "map DOM nodes to their corresponding XPath nodes.", 
   "Should be much more space efficient, though getting equivalent", 
   "performance is going to be a challenge (this version isn't", 
   "highly optimized yet, and has definite performance issues, but", 
   "cleaning up the traversers/iterators ought to yield some gains.)", 
   "Should be most successful in applications that", 
   "only explore part of a document, since it does OUT OF SEQUENCE", 
   "incremental construction. Also hoped to have performance", 
   "advantages when repeatedly transforming the same DOM", 
   "document -- even, it is hoped, when the document has been", 
   "mutated between transformations.", 
   "Currently only works for Xerces DOM, though there's a plug-in adapter", 
   "mechanism which may be able to support other DOMs and/or", 
   "other approaches to handling this one. At this time, it's the", 
   "DTMManager's responsibility to recognize when DOM2DTM2", 
   "couldn't meet the need and get an old-style DOM2DTM instead;", 
   "we may want to encapsulate that fallback here instead.", 
   "See also DTMManagerDefault, which I'll be checking in as soon", 
   "as I've got a clean merge; if ATTEMPT_DOM2DTM2 there is", 
   "set false (as will be the default for the checked-in code), we will", 
   "continue to use \"old faithful\" DOM2DTM."
  ], 
  "revision_id": "336824"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-09-27T21:54:40.000000Z", 
  "msg": [
   "Folding changes from MAIN branch back into XSLTC_DTM branch."
  ], 
  "revision_id": "336823"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-09-27T20:23:04.000000Z", 
  "msg": [
   "Removed a duplicate error message number I inadvertently entered."
  ], 
  "revision_id": "336822"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-09-27T19:02:51.000000Z", 
  "msg": [
   "Committing changes from Gordon Chiu (grchiu@ca.ibm.com), with some tweaks from", 
   "me, to move some hard-coded XSLTC messages into the compiler and run-time", 
   "ErrorMessages classes, as appropriate.", 
   "Also, added copious comments to assist anyone who might translate these", 
   "resources in the future."
  ], 
  "revision_id": "336821"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-09-27T18:59:34.000000Z", 
  "msg": [
   "Committing changes from Gordon Chiu (grchiu@ca.ibm.com), with some tweaks from", 
   "me, to move some hard-coded XSLTC messages into the compiler and run-time", 
   "ErrorMessages classes, as appropriate."
  ], 
  "revision_id": "336820"
 }
]