[
 {
  "author": "ilene", 
  "date": "2002-11-22T14:14:36.000000Z", 
  "msg": [
   "Assign features to Igor."
  ], 
  "revision_id": "337009"
 }, 
 {
  "author": "dmarston", 
  "date": "2002-11-21T22:11:39.000000Z", 
  "msg": [
   "Clarify many entries, reorganize, and separate out more features."
  ], 
  "revision_id": "337008"
 }, 
 {
  "author": "jkesselm", 
  "date": "2002-11-20T16:04:36.000000Z", 
  "msg": [
   "Significant performance improvement achieved in DOM2DTM2", 
   "by only searching backward to the start of a logically-contiguous", 
   "block of text when we know that the node might meet those", 
   "conditions. When we know the type isn't Text, or when we've found", 
   "it by scanning forward through the document, this overhead is", 
   "suppressed. Difference on an intensive performance test is", 
   "quite substantial!", 
   "Performance is still not where I want it. Currently, the largest", 
   "bottleneck seems to be the document-order testing, which we", 
   "knew was going to be more expensive in this solution. It's", 
   "probably possible to improve that algorithm, but we aren't", 
   "likely to get close to the just-compare-node-numbers that the", 
   "old DOM2DTM supported. It's hoped that DOM2DTM2's other", 
   "advantages will make up for this.", 
   "As before, DOM2DTM2 will only be used if the flag in", 
   "DTMManagerDefault is set true; the code is checked in with", 
   "it set false, since we aren't ready to make this our", 
   "primary solution."
  ], 
  "revision_id": "337007"
 }, 
 {
  "author": "dmarston", 
  "date": "2002-11-19T16:06:13.000000Z", 
  "msg": [
   "Add in rough representation of new material in Nov. 15 drafts."
  ], 
  "revision_id": "337006"
 }, 
 {
  "author": "santiagopg", 
  "date": "2002-11-18T22:55:46.000000Z", 
  "msg": [
   "Forward namespace() event as startPrefixMapping() to the DOM builder. TODO:", 
   "additional logic is needed to emit the endPrefixMapping() event. This patch", 
   "fixes namespace141."
  ], 
  "revision_id": "337005"
 }
]