[
 {
  "author": "grchiu", 
  "date": "2002-12-19T18:45:29.000000Z", 
  "msg": [
   "Migrating fixes for bugzillas 8473, 13374, 13375, 13414 to xslt20 branch."
  ], 
  "revision_id": "337074"
 }, 
 {
  "author": "jkesselm", 
  "date": "2002-12-17T22:20:10.000000Z", 
  "msg": [
   "Changes to improve our ability to retrieve DTM handles corresponding", 
   "to DOM nodes. I've moved the getDTMHandleFromNode() method", 
   "out of DOM2DTM and up to the DTM API, and I've generalized the", 
   "code in DTMManager that invokes this. (The goal was to", 
   "make that DTMManager call work for both DOM2DTM and DOM2DTM2,", 
   "but this is cleaner than the old approach of an instanceof special", 
   "case.)", 
   "This has improved our results against Smoketest -- but DOM2DTM", 
   "apparently still has some holes; it's failing some of the cases in", 
   "ProgrammaticDOMTest and TestXPathAPI. However, it's doing", 
   "better on those than the previous version was (partly due to fixing", 
   "some bad DOM construction in the XPath tests, I must admit), so", 
   "it's a net gain and worth checking in.", 
   "We should track down the remaining glitches in that code."
  ], 
  "revision_id": "337073"
 }, 
 {
  "author": "grchiu", 
  "date": "2002-12-17T22:08:11.000000Z", 
  "msg": [
   "Patch for bugzilla 4858.", 
   "Reduces SAX2DTM memory usage by dropping m_locator after parsing is complete. Value of m_locator.getSystemId() is cached."
  ], 
  "revision_id": "337072"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-12-17T19:09:07.000000Z", 
  "msg": [
   "Renamed XSLTC DOM's getType method to getExpandedTypeID to be consistent with", 
   "DTM."
  ], 
  "revision_id": "337071"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-12-17T19:06:41.000000Z", 
  "msg": [
   "Added getFirstAttributeIdentity and getNextAttributeIdentity methods to", 
   "DTMDefaultBase that take a node identity as input and return a node identity.", 
   "That avoids some overhead of decoding a handle when iterating through", 
   "attributes."
  ], 
  "revision_id": "337070"
 }
]