[
 {
  "author": "zongaro", 
  "date": "2002-11-26T15:02:42.000000Z", 
  "msg": [
   "1) In addNode, changed code that determines whether the current node is the", 
   "first child of its parent.  Code used to check whether the first child of", 
   "the parent was previously set; changed this to check whether the new node", 
   "has a previous sibling.  This is an improvement for nodes that have many", 
   "children.  Made a similar change to endElement.", 
   "2) Changed initial size of m_data from 32 to m_initialblocksize.  I believe", 
   "the old value was only needed before RTF's shared a DTM."
  ], 
  "revision_id": "337019"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-11-26T15:02:36.000000Z", 
  "msg": [
   "Changed m_extendedTypes from a Vector to an array of type ExtendedType.  That", 
   "improves time to access the Vector and eliminates the need to cast the Object", 
   "returned by Vector.elementAt to type ExtendedType."
  ], 
  "revision_id": "337018"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-11-26T15:02:33.000000Z", 
  "msg": [
   "Changed TypedAttributeIterator to use new DTMDefaultBase.getTypedAttribute", 
   "method, which is generally faster than iterating through getFirstAttribute", 
   "and getNextAttribute to find the attribute of interest."
  ], 
  "revision_id": "337017"
 }, 
 {
  "author": "zongaro", 
  "date": "2002-11-26T15:02:29.000000Z", 
  "msg": [
   "Added a getTypedAttribute method to make the process of finding a particular", 
   "attribute quicker than using getFirstAttribute and getNextAttribute.  The", 
   "getTypedAttribute method will convert at most once to a node identity and", 
   "once to a node handle, where getFirstAttribute and getNextAttribute would for", 
   "each attribute checked."
  ], 
  "revision_id": "337016"
 }, 
 {
  "author": "ilene", 
  "date": "2002-11-25T22:15:07.000000Z", 
  "msg": [
   "Propogating patches from main branch to XSLT20 branch.", 
   "Bugs patched are #11661, 11834, 10176.", 
   "The fix for 10176 fixes testcase position102 on the XSLT20 branch."
  ], 
  "revision_id": "337015"
 }
]