[
 {
  "author": "santiagopg", 
  "date": "2003-02-05T16:40:44.000000Z", 
  "msg": [
   "New file needed for latest update."
  ], 
  "revision_id": "337219"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-02-05T16:37:11.000000Z", 
  "msg": [
   "Fix build problem with IBM JDK 1.2.2", 
   "Currently only a few interfaces are overridden in SAX2DTM2. For those that", 
   "are not overridden, the existing interfaces in DTMDefaultBase and SAX2DTM", 
   "will be used. IBM JDK 1.2.2 does not allow a protected method in a super", 
   "class to be used in a nested class of a subclass. This can be fixed by", 
   "overriding more interfaces. JDK 1.2.2 also does not like", 
   "final fields to be initialized in constructors. Remove the final modifier", 
   "as a workaround."
  ], 
  "revision_id": "337218"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-02-05T16:09:49.000000Z", 
  "msg": [
   "Committing latest update from Lionel Villard (villard@us.ibm.com) for", 
   "XPath API. This update consists of:", 
   "- the addition of an external AST node factory: applications can now", 
   "provide their own AST node implementation (but need to inherit the basic", 
   "implementation)", 
   "- the overall improvement of the documentation", 
   "Known problems:", 
   "- parentherized expressions are not correctly reduced", 
   "- the implementation is still partial"
  ], 
  "revision_id": "337217"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-02-04T23:40:05.000000Z", 
  "msg": [
   "Modified \"samples\" target so that it builds XSLTC samples that have no external", 
   "dependencies.  Also added build targets for the XSLTC samples that have build", 
   "dependencies, included all such samples under the umbrella \"extra.samples\"", 
   "target, and in the \"dist\" target."
  ], 
  "revision_id": "337216"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-02-04T23:37:20.000000Z", 
  "msg": [
   "No real change in this revision.  Comment for revision 1.58.2.2 should have", 
   "said:", 
   "Removed information that indicated that XSLTC samples have to built \"by hand\".", 
   "Also reorganized requirements for XSLTC Brazil and Servlet samples which", 
   "implied that the union of the requirements applied for both."
  ], 
  "revision_id": "337215"
 }
]