[
 {
  "author": "mkwan", 
  "date": "2003-02-13T21:06:01.000000Z", 
  "msg": [
   "Performance improvement in AncestorIterator, TypedAncestorIterator,", 
   "PrecedingIterator and TypedPrecedingIterator.", 
   "Use int array rather than NodeVector to use ancestor nodes in AncestorIterator."
  ], 
  "revision_id": "337254"
 }, 
 {
  "author": "jkesselm", 
  "date": "2003-02-13T20:49:24.000000Z", 
  "msg": [
   "Update current XDM status description."
  ], 
  "revision_id": "337253"
 }, 
 {
  "author": "jkesselm", 
  "date": "2003-02-13T18:23:48.000000Z", 
  "msg": [
   "NEW API UNDER DEVELOPMENT: eXtensible Data Model (XDM).", 
   "Axis and Sequence have been migrated into the XDM package."
  ], 
  "revision_id": "337252"
 }, 
 {
  "author": "jkesselm", 
  "date": "2003-02-13T18:20:49.000000Z", 
  "msg": [
   "NEW API UNDER DEVELOPMENT: eXtensible Data Model (XDM).", 
   "See org.apache.xml.xdm.* for details. In addition to the new", 
   "interfaces, that directory contains HTML documentation for both", 
   "DTM's  internals (an updated version of Gary's SAX2DTM", 
   "summary) and the ideas behind XDM. The former should be", 
   "posted on our website some time soon; the latter may want to wait", 
   "until we're sure XDM will fly.", 
   "Since we're hoping that XDM will replace DTM's current public", 
   "interface (if it works out), some code reorganization has been done", 
   "to move some of the DTM support interfaces, such as Axes", 
   "and Sequences, up to the XDM layer.", 
   "The initial XDM implementation is wrapped around DTM Traversers,", 
   "and hence is not yet fully optimized. (The API is also still only", 
   "\"cast in jello\" and may change.)", 
   "Our intent is that the traversal  logic would be merged into the XDM", 
   "implementation, and that the whole concept of Node Handles would", 
   "go away; all nodes would be accesssed via XDMCursors, which", 
   "are flyweight objects that combine the concepts of Iterator and", 
   "Current Node. We _think_ performance should be at least", 
   "comparable when accessing a DTM model, and superior when", 
   "accessing other source models such as a DOM. XDM should also", 
   "be more maintainable, once it stabilizes."
  ], 
  "revision_id": "337251"
 }, 
 {
  "author": "archie", 
  "date": "2005-11-13T20:55:18.851447Z", 
  "msg": [
   "- Update instructions in APACHE.README and scripts for building.", 
   "- Remove more vestiges of the Java-to-C code generator.", 
   "- Update LICENSE to be the Apache license.", 
   "- Add FreeBSD's queue.h."
  ], 
  "revision_id": "337250"
 }
]