[
 {
  "author": "jkesselm", 
  "date": "2003-02-12T16:21:39.000000Z", 
  "msg": [
   "Merge in progress"
  ], 
  "revision_id": "337239"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-02-12T16:15:41.000000Z", 
  "msg": [
   "Implementation of default node factory."
  ], 
  "revision_id": "337238"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-02-12T16:14:59.000000Z", 
  "msg": [
   "Committing latest update for the XPATH API from Lionel Villard. This", 
   "update includes performance enhancements as well as a new interface", 
   "for node factories."
  ], 
  "revision_id": "337237"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-02-11T21:39:35.000000Z", 
  "msg": [
   "Fix two bugs and make a small change in how SAX2DTM handle XMLString.", 
   "1. Use a safer algorithm in MultiDOM.addDOMAdapter() to decide whether", 
   "we need to grow the internal array. The DTM ids might not always be sequential,", 
   "as is the case when the stylesheet uses both RTFs and the document function.", 
   "The old algorithm might fail under this scenario.", 
   "2. In BasisLibrary.nodeList2Iterator(), use the same DTMManager to create", 
   "the DOMImpl. This is required to make some of the EXSLT extensions to work.", 
   "3. Make a small change in SAX2DTM2.getStringValue(). There is really no need", 
   "to override this method in SAX2DTM2, because XSLTC will not use it. However,", 
   "it is currently used by some of the EXSLT extensions. The change is to ensure", 
   "that if an XMLStringFactory is provided, we continue to create the XMLString", 
   "using the factory. This will make both Xalan and XSLTC happy."
  ], 
  "revision_id": "337236"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-02-11T19:17:18.000000Z", 
  "msg": [
   "Provide default implementations of XMLString and XMLStringFactory in org.apache.xml.utils.", 
   "The default implementation is just a simple wrapper around a real String object.", 
   "Although SAX2DTM2 no longer uses XMLString right now, some extensions and DOMImpl still", 
   "make use of XMLStrings, which we do not want to change at the moment. This seems to", 
   "be a better solution of removing the XPath dependency while keeping the semantics", 
   "of all existing interfaces."
  ], 
  "revision_id": "337235"
 }
]