[
 {
  "author": "mkwan", 
  "date": "2003-03-05T19:24:29.000000Z", 
  "msg": [
   "Add a new class SimpleResultTreeImpl as the model for simple RTF."
  ], 
  "revision_id": "337309"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-03-05T19:23:04.000000Z", 
  "msg": [
   "XSLTC_DTM performance work", 
   "Design a new DOM model (SimpleResultTreeImpl) for simple result tree", 
   "fragment (RTF). A simple RTF is an RTF which has only one Text node.", 
   "It can be generated by a combination of Text, xsl:value-of and xsl:number", 
   "instructions. It can also be generated by xsl:if or xsl:choose, as far", 
   "as the content of the control body is pure Text. The code to detect whether", 
   "an RTF is simple is in SyntaxTreeNode.isSimpleRTF().", 
   "Before this change, an RTF is represented by a SAXImpl object. SAXImpl is", 
   "a heavy-weight class in that it allocates a lot of array objects for storage.", 
   "In the case where the RTF is only one Text node, creating a SAXImpl is just", 
   "too expensive.", 
   "A SimpleResultTreeImpl has only two nodes, i.e. the root node and the Text", 
   "node. All DOM interfaces are overridden to handle this simplified model.", 
   "SimpleResultTreeImpl has a few internal iterators, which is designed to support", 
   "the nodeset() extension function.", 
   "This change brings a significant improvement to stylesheets that create", 
   "a lot of simple RTFs. Some testcases are more than 100% faster after the change."
  ], 
  "revision_id": "337308"
 }, 
 {
  "author": "villard", 
  "date": "2003-03-04T01:58:13.000000Z", 
  "msg": [
   "- NodeTest doesn't inherit of Expr anymore -> update implementation", 
   "- More javadoc comments", 
   "- Removal of some unused contants in Expr.java"
  ], 
  "revision_id": "337307"
 }, 
 {
  "author": "villard", 
  "date": "2003-03-03T16:06:19.000000Z", 
  "msg": [
   "javadoc addition"
  ], 
  "revision_id": "337306"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-03-03T15:51:43.000000Z", 
  "msg": [
   "XSLTC_DTM performance work", 
   "Implement a feature for on-demand building of the ID index table.", 
   "Before this change, the SAX2DTM2 class always builds an ID index", 
   "hashtable by comparing the name of every attribute with \"id\". Now", 
   "we maintain a flag _hasIdCall in AbstractTranslet to indicate", 
   "whether the translet has id function calls. The value of this flag", 
   "is compiled into the translet from the Stylesheet class. The Stylesheet", 
   "class also has an _hasIdCall flag, which is set by the XPath parser.", 
   "When a SAXImpl object is created, the _hasIdCall flag is passed in from the", 
   "Translet. Now the id index table is only built when the stylesheet makes", 
   "use of the id function.", 
   "Also fix a bug in the NameBase class for using an incorrect class name", 
   "(org.apache.xml.dtm.ref.DTMAxisIterator should be org.apache.xml.dtm.DTMAxisIterator)."
  ], 
  "revision_id": "337305"
 }
]