[
 {
  "author": "zongaro", 
  "date": "2003-04-06T20:36:36.000000Z", 
  "msg": [
   "Patch from Christine Li (jycli@ca.ibm.com).  Reworked applet code so that the", 
   "init method creates a thread to which it delegates all the work of creating", 
   "Transformers and performing transformations.", 
   "Xalan needs all of its classes to be loaded with respect to the same class", 
   "loader.  The thread that's created will have the context class loader, if any,", 
   "that is in effect when the applet's init method is called, but calls to other", 
   "methods on the applet might not have the same context class loader.  Using a", 
   "thread avoids any problems that might arise from such a situation."
  ], 
  "revision_id": "337414"
 }, 
 {
  "author": "ilene", 
  "date": "2003-04-05T01:06:08.000000Z", 
  "msg": [
   "Instead of setting a default baseURI in newTemplates, append a dummy string", 
   "to the default used in the TreeWalker constructors.  This solves the problem", 
   "of violating the SourceLocator.getSystemId API which should return null", 
   "if if no systemId was set, while allowing relative URI's to be resolved when", 
   "the source is a DOM and no systemID has been set.  Relative URI's are already", 
   "resolved correctly for other source types."
  ], 
  "revision_id": "337413"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-04-04T19:29:04.000000Z", 
  "msg": [
   "According to spec http://www.w3.org/1999/11/REC-xslt-19991116-errata/#E27,", 
   "when element nodes are used in the instantiated content of attribute, comment", 
   "and processing instructions, we should ignore the elements together with", 
   "their content."
  ], 
  "revision_id": "337412"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-04-04T16:59:00.000000Z", 
  "msg": [
   "Replace Vector.add() by Vector.addElement() because the first method", 
   "is not in JDK 1.1.8."
  ], 
  "revision_id": "337411"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-04-03T20:23:50.000000Z", 
  "msg": [
   "Added a new \"fulldist\" target.  It builds a distribution that includes Xalan-J", 
   "components that depend upon non-standard components that aren't part of the", 
   "Xalan-J repository.  In particular, xsltcbrazil.jar is built under the", 
   "\"fulldist\" target, but not under the ordinary \"dist\" target."
  ], 
  "revision_id": "337410"
 }
]