[
 {
  "author": "mkwan", 
  "date": "2003-06-23T18:23:15.000000Z", 
  "msg": [
   "Performance improvement for XSLTC", 
   "New codegen solution for parameter passing in named templates,", 
   "which provides significant improvement for stylesheets that use", 
   "xsl:call-template and xsl:with-param heavily.", 
   "The old solution generates code to call Translet.addParameter(),", 
   "which seems to be too expensive. In the new solution, parameters", 
   "are passed to named templates via method arguments. The method", 
   "signature for a named template is not fixed. It depends on the number", 
   "of parameters declared in the template.", 
   "The caller (xsl:call-template) is responsible for generating the", 
   "correct parameter list and passes it to the called template. This is", 
   "done in the CallTemplate class, which finds out the corresponding", 
   "called template and processes its own xsl:with-param children together", 
   "with the xsl:params in the called template to generate an effective", 
   "parameter list. In the case where a xsl:param references another xsl:param,", 
   "local variables are generated to hold the temporary parameter value."
  ], 
  "revision_id": "337529"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-06-23T15:58:18.000000Z", 
  "msg": [
   "Performance improvement for XSLTC", 
   "Don't add a simple or adaptive RTF to the DTMManager if the nodeset", 
   "extension is not used. The DOMAdapters are also not created in", 
   "this case. This is a noticeable improvement for stylesheets that use", 
   "many small RTFs but do not use the nodeset extension."
  ], 
  "revision_id": "337528"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-06-23T15:23:41.000000Z", 
  "msg": [
   "Implement a \"DTM migration\" feature, which allows a DTM that is built with", 
   "an old DTMManager to be migrated to a new DTMManager. This is to support", 
   "DTM sharing between multiple transformations."
  ], 
  "revision_id": "337527"
 }, 
 {
  "author": "grchiu", 
  "date": "2003-06-23T14:26:57.000000Z", 
  "msg": [
   "Fixing a build issue for JDKs that include XSLTC (specifically, the", 
   "JavaCupRedirect class) but not java_cup.jar. Need to put java_cup.jar", 
   "and runtime.jar on the bootclasspath."
  ], 
  "revision_id": "337526"
 }, 
 {
  "author": "minchau", 
  "date": "2003-06-23T06:26:52.000000Z", 
  "msg": [
   "Moved a number of serializer instance variables into ElemContext,", 
   "which is a stack to push/pop such values in unison. This makes", 
   "the code clearer and less error prone and probably marginally", 
   "(0.001%) faster.", 
   "Submitted by:\tBrian Minchau"
  ], 
  "revision_id": "337525"
 }
]