[
 {
  "author": "minchau", 
  "date": "2003-10-23T15:59:01.000000Z", 
  "msg": [
   "bug 795 patched", 
   "(method=\"text\" emits message when output char does not fit", 
   "with the given output encoding)"
  ], 
  "revision_id": "337734"
 }, 
 {
  "author": "minchau", 
  "date": "2003-10-23T15:56:06.000000Z", 
  "msg": [
   "patch to emit emit error message for method=\"text\"", 
   "when output character not valid in the output encoding.", 
   "PR: bug 795", 
   "Submitted by:\tRichard Cao", 
   "Reviewed by:\tBrian Minchau"
  ], 
  "revision_id": "337733"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-10-22T23:25:07.000000Z", 
  "msg": [
   "Committing path for bugzilla 22438 from Bhakti Mehta (Bhakti.Mehta@sun.com). This patch fixes serialization problems of Templates objects in XSLTC. A user-defined URIResolver associated to a Templates object is also serialized whenever possible (i.e. if it is also serializable)."
  ], 
  "revision_id": "337732"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-10-22T20:45:14.000000Z", 
  "msg": [
   "Propagate the fixes for bug 23706 and 23896 from the head.", 
   "Fix a few problems for unsupported element and xsl:fallback."
  ], 
  "revision_id": "337731"
 }, 
 {
  "author": "mkwan", 
  "date": "2003-10-22T20:23:48.000000Z", 
  "msg": [
   "Apply Joanne Tong (joannet@ca.ibm.com) patch for bugzilla 23706,", 
   "with my own modifications. I also fixed bug 23896 in the same", 
   "patch.", 
   "This patch includes the fixes for the following:", 
   "1. an unsupported XSL element will trigger a syntax error in 1.0 mode.", 
   "2. In forward-compatibility mode, if an unsupported XSL element is in", 
   "a template, has no fallback, it will trigger a runtime error if it is", 
   "instantiated.", 
   "3. All fallback children are called in sequence. The old code only makes", 
   "use of the first fallback child.", 
   "4. Only direct fallback children are processed. The old code finds the fallback", 
   "from all descendants of an unsupported element, which is wrong behavior", 
   "according to the spec."
  ], 
  "revision_id": "337730"
 }
]