[
 {
  "author": "zongaro", 
  "date": "2003-12-04T16:45:02.000000Z", 
  "msg": [
   "Added comments to describe the situation in which this iterator is used."
  ], 
  "revision_id": "337779"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-04T16:45:00.000000Z", 
  "msg": [
   "Factored out part of ObjectFactory's createObject method into separately", 
   "callable lookUpFactoryClass and lookUpFactoryClassName methods.  This allows", 
   "the caller to cache the Class object that provides a service at an appropriate", 
   "level, and create new instances of that class at will, rather than going", 
   "through the expensive service provider look-up procedure for each and every", 
   "object created."
  ], 
  "revision_id": "337778"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-04T16:44:59.000000Z", 
  "msg": [
   "Changes to permit different DTM implementations to be supplied to XSLTC.", 
   "XSLTC will now use ObjectFactory to look up a new XSLTC DTM Manager service", 
   "provider (org.apache.xalan.xsltc.dom.XSLTCDTMManager).  The provider is looked", 
   "up once when a TransformerFactory is created, and used by any Transformer", 
   "objects created by that TransformerFactory.", 
   "Also, moved code for caching XMLReader objects from XSLTC's", 
   "TransformerFactoryImpl to a new org.apache.xml.utils.XMLReaderManager class.", 
   "It is now the responsibility of the DTMManagerDefault class to request one of", 
   "these cached XMLReader objects, so the benefit of reusing an XMLReader is now", 
   "conferred upon both XSLTC and Xalan-J Interpretive, as well as upon references", 
   "to the document() function."
  ], 
  "revision_id": "337777"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-04T16:44:53.000000Z", 
  "msg": [
   "Changes to permit different DTM implementations to be supplied to XSLTC.", 
   "Part of the change was to replace hard-coded references to SAXImpl with", 
   "references to a new interface - DOMEnhancedForDTM.  This part of the change was", 
   "supplied by Joseph Kesselman (keshlam@us.ibm.com).", 
   "The other part of the change was to use ObjectFactory to look up a new XSLTC", 
   "DTM Manager service provider (org.apache.xalan.xsltc.dom.XSLTCDTMManager).  The", 
   "provider is looked up once when a TransformerFactory is created, and used by", 
   "any Transformer objects created by that TransformerFactory."
  ], 
  "revision_id": "337776"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-04T16:44:50.000000Z", 
  "msg": [
   "Moved code for caching XMLReader objects from XSLTC's TransformerFactoryImpl to", 
   "a new org.apache.xml.utils.XMLReaderManager class.", 
   "It is now the responsibility of the DTMManagerDefault class to request one of", 
   "these cached XMLReader objects, so the benefit of reusing an XMLReader is now", 
   "conferred upon both XSLTC and Xalan-J Interpretive, as well as upon references", 
   "to the document() function."
  ], 
  "revision_id": "337775"
 }
]