[
 {
  "author": "zongaro", 
  "date": "2004-01-04T20:04:04.000000Z", 
  "msg": [
   "Made methods in this class public, as is the case in the XPathVisitor class that", 
   "it extends.  Having the class be public, but none of the methods public isn't", 
   "helpful.", 
   "Contributed by Warwick Burrows (wburrows at us.ibm.com)."
  ], 
  "revision_id": "337814"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-24T21:46:00.000000Z", 
  "msg": [
   "Fixed a bug I injected recently - missing slash between 'META-INF/services' and service name."
  ], 
  "revision_id": "337813"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-12-23T20:02:46.000000Z", 
  "msg": [
   "The parameter optimization implemented in 2.5.2 does not work in all cases. The problem (see Bugzilla 25449) is that a param's default value needs to be compiled multiples when there are mulitple calls the a template none of which has a correspoding with-param. However, ASTs store an internal state which is not restored after compilation; consequently, only the first compilation is guaranteed to succeed. Stated differently, the AST cannot be operated as a graph because sub-tree sharing causes problems.", 
   "The optimization has now been changed so that a param default value is compiled only once by the callee instead of multiple times by each caller. A caller will now pass 'null' when there is no with-param; a callee will only initialize a param if its value is 'null'. This ensures that default values are compiled exactly once while at the same time preserving the XSLT semantics."
  ], 
  "revision_id": "337812"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-12-23T15:34:51.000000Z", 
  "msg": [
   "Type conversions from internal to external Java types revisited: (1) Type.Int and Type.Real are now treated identically given that the former is an optimization for the latter (i.e. their use should be transparent to the user) (2) Better support Type.Reference, conversions to integral types are now supported. There are still some conversions that are supported by Xalan and not by XSLTC. We need to either revisit the conversion table for XSLTC or document the differences."
  ], 
  "revision_id": "337811"
 }, 
 {
  "author": "rameshm", 
  "date": "2003-12-22T19:09:42.000000Z", 
  "msg": [
   "Moving classes that are used between Xalan interpretive and XSLTC ( StylesheetPIHandler and StopParseException )  to xml/utils package . Making the required modifications to accomadate this change.", 
   "Thanks to Bhakti for the Patch", 
   "Submitted by:\tBhakti Mehta ( bhakti.mehta@sun.com )", 
   "Reviewed by: Ramesh Mandava"
  ], 
  "revision_id": "337810"
 }
]