[
 {
  "author": "santiagopg", 
  "date": "2003-12-19T17:37:55.000000Z", 
  "msg": [
   "Setting the maximum fraction digits on a DecimalFormat object to Integer.MAX_VALUE causes problems in some JDKs. Since only doubles need to be formatted, I've changed the code to set the maximum to 340. I've also optimized formatNumber(), the new version uses setters on the DecimalFormat object instead of calling toPattern()."
  ], 
  "revision_id": "337809"
 }, 
 {
  "author": "santiagopg", 
  "date": "2003-12-19T15:26:48.000000Z", 
  "msg": [
   "Patch for XSLTC's parameter optimization introduced in 2.5.2. The problem is that a param's default value can now be compiled multiple times, once for every call to the template for which that param is not specified. This essentially turns the AST into a graph, which requires the state of a param subtree to be reset after the each compilation. In particular, the variable Expression._startReset was not reset and this resulted in calls to setStartNode() to be generated only the first time the param's default value was compiled. After some analysis, I realized that _startReset was no longer necessary, so I removed it. I also renamed Expression.startResetIterator() to Expression.startIterator() since calls to reset() are no longer generated within this method."
  ], 
  "revision_id": "337808"
 }, 
 {
  "author": "igorh", 
  "date": "2003-12-15T21:52:08.000000Z", 
  "msg": [
   "A sample developed by Richard Cao"
  ], 
  "revision_id": "337807"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-12T04:25:29.000000Z", 
  "msg": [
   "Created a named constant for \"META-INF/services\" string."
  ], 
  "revision_id": "337806"
 }, 
 {
  "author": "zongaro", 
  "date": "2003-12-12T04:25:26.000000Z", 
  "msg": [
   "Added a finally block for SAXSource/StreamSource case in order to ensure that", 
   "any XMLReader is released to the XMLReader cache.", 
   "Thanks to Joanne Tong (joannet@ca.ibm.com) for catching this bug when she", 
   "reviewed my changes to where caching of XMLReaders was handled, and the DTM", 
   "plugability changes for XSLTC."
  ], 
  "revision_id": "337805"
 }
]