[
 {
  "author": "santiagopg", 
  "date": "2004-06-10T22:26:03.000000Z", 
  "msg": [
   "Patch for Bugzilla 29411. New algorithm shoudl optimize the way NS decls are reported for nested literal elements. Note that the algorithm will not work accross non-literal elements. E.g., if there is an xsl:element between two literal elements, the inner literal element may report unnecessary NS delcs. This is just a simple way to ensure that any NS decls defined by the xsl:element instruction are re-defined in the inner literal (see namespace39 in the conf tests)."
  ], 
  "revision_id": "337994"
 }, 
 {
  "author": "minchau", 
  "date": "2004-06-07T16:04:08.000000Z", 
  "msg": [
   "PR: bugzilla 29372", 
   "Submitted by:\tJ Desrochers (john@ASCnet.COM)", 
   "Reviewed by:\tBrian Minchau", 
   "A safe fix for chunking up an array for output. The length  was multiplied by the", 
   "chunk number (0,1,2... chunks) then divided by \"chunks\". John's fix uses a", 
   "\"long\" to do the arithemetic because multiplying by the chunk number first", 
   "could cause an overflow."
  ], 
  "revision_id": "337993"
 }, 
 {
  "author": "minchau", 
  "date": "2004-06-01T22:43:30.000000Z", 
  "msg": [
   "PR: bugzilla 29234", 
   "Submitted by:\tBrian Minchau", 
   "Reviewed by:\tMorris Kwan", 
   "This problem only showed up under XSLTC.  When setting the", 
   "encoding a related field was not set.  Fixed this by over-riding the", 
   "set method for the stream serializers."
  ], 
  "revision_id": "337992"
 }, 
 {
  "author": "jycli", 
  "date": "2004-05-26T21:33:08.000000Z", 
  "msg": [
   "If the local is set to Turkish, but the codepage is MS-DOS (US) 437. The BCEL", 
   "InstructionFinder.search(String) method can not find any instructions contain", 
   "letter I. In Turkish, there are 2 lower case i.  Since the search() method is case", 
   "insensitive, change the pattern string to use lower case."
  ], 
  "revision_id": "337991"
 }, 
 {
  "author": "santiagopg", 
  "date": "2004-05-25T18:41:38.000000Z", 
  "msg": [
   "Improved patch for Bugzilla 29120 based on Matthias' suggestion. A DOMImplementation is now cached for even better performance."
  ], 
  "revision_id": "337990"
 }
]