[
 {
  "author": "zongaro", 
  "date": "2004-04-10T19:00:44.000000Z", 
  "msg": [
   "Applying patch for bugs 27932 and 15333.", 
   "Code was incorrectly calculating the set of templates to which an", 
   "xsl:apply-imports instruction applies.  It should consider all templates that", 
   "the current template rule could override, which means that if the template", 
   "appeared in a stylesheet that was included in another stylesheet, any templates", 
   "imported into the including stylesheet have to be considered as well.  The", 
   "method Stylesheet.getMinimumDescendantPrecedence is responsible for this", 
   "calculation.", 
   "In addition, when code is generated for an xsl:apply-imports, if any template", 
   "has local parameters, an empty stack frame has to be pushed before attempting", 
   "to apply-imports.  Otherwise, parameters from the template that contains the", 
   "apply-imports instruction will be passed into the matching template.", 
   "Reviewed by Joanne Tong (joannet () ca ! ibm ! com)"
  ], 
  "revision_id": "337964"
 }, 
 {
  "author": "jycli", 
  "date": "2004-04-02T20:21:40.000000Z", 
  "msg": [
   "Due to license issue, remove the suggestion in FAQ of using -Xbootclasspath to replace xalan.jar in the jdk1.4 environment"
  ], 
  "revision_id": "337963"
 }, 
 {
  "author": "minchau", 
  "date": "2004-04-01T18:45:30.000000Z", 
  "msg": [
   "\"import\" clean up. Removed un-used imports,  some rearranging,", 
   "(a freebie from eclipse to sort them!).", 
   "Minor clean up as part of the preparation to make the serializer", 
   "stand-alone for use by Xalan and Xerces later on."
  ], 
  "revision_id": "337962"
 }, 
 {
  "author": "mkwan", 
  "date": "2004-03-24T15:41:12.000000Z", 
  "msg": [
   "Patch for bug 27417.", 
   "If an output stream is created by the XSLTC transformer, close", 
   "it after the transformation."
  ], 
  "revision_id": "337961"
 }, 
 {
  "author": "", 
  "date": "2004-03-23T23:04:41.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'Sun_24_03_04'."
  ], 
  "revision_id": "337960"
 }
]