[
 {
  "author": "santiagopg", 
  "date": "2004-12-06T16:12:50.000000Z", 
  "msg": [
   "Patch for Jira-2003. Problem was unrelated to recursion, but simply a bug in the basis library. Swapping operands requires swapping operators and the latter was not done. A workaround for this bug would be to swap the operands (and operator) in the stylesheet (as that would not cause any swapping in the basis library)."
  ], 
  "revision_id": "338074"
 }, 
 {
  "author": "mkwan", 
  "date": "2004-11-22T17:53:43.000000Z", 
  "msg": [
   "Fix a memory leak problem in DTMManager (JIRA bug 1999)."
  ], 
  "revision_id": "338073"
 }, 
 {
  "author": "zongaro", 
  "date": "2004-11-19T16:36:17.000000Z", 
  "msg": [
   "Patch for Jira bug 1368.", 
   "The method getKeyDeclaration was looping through all the xsl:key elements", 
   "defined, and returning the first with the required name.  However, more than", 
   "one xsl:key element can specify the same name, and should be treated", 
   "cumulatively.  Modified the method so that it returns all elements with the", 
   "required name, and the caller so that it tries to match against the patterns", 
   "associated with all such elements.", 
   "Reviewed by Joanne Tong (joannet () ca ! ibm ! com)."
  ], 
  "revision_id": "338072"
 }, 
 {
  "author": "zongaro", 
  "date": "2004-11-19T15:51:27.000000Z", 
  "msg": [
   "Patch for Jira bug 1955.  The equals(Object) method contains a list of", 
   "instanceof checks, and then casts the Object argument to the tested type in", 
   "order to dispatch to a more specific equals method.  In the case where the", 
   "Object argument was an XMLString, the code was actually casting \"this\" to", 
   "XMLString - thus testing this.equals(this), which will always be true.", 
   "Reviewd by Joanne Tong (joannet () ca ! ibm ! com)."
  ], 
  "revision_id": "338071"
 }, 
 {
  "author": "zongaro", 
  "date": "2004-11-16T19:57:17.000000Z", 
  "msg": [
   "Patch for bug report XALANJ-1994.", 
   "The CallTemplate.getCalleeTemplate() method was searching through a Vector of", 
   "all templates defined by the logical stylesheet, and picked out the first with", 
   "the same name referenced by the current xsl:call-template instruction.  However,", 
   "that failed to account for import precedence.  The SymbolTable.lookupTemplate", 
   "method takes into account import precedence, and should be used instead.", 
   "Patch was reviewed by Christine Li (jycli@ca.ibm.com)"
  ], 
  "revision_id": "338070"
 }
]