[
 {
  "author": "jycli", 
  "date": "2005-03-03T19:33:01.000000Z", 
  "msg": [
   "Added implementation for getAttribute, getAttributeNS and", 
   "getAttributes for LRE. A fix for bug report XALANJ-1526"
  ], 
  "revision_id": "338124"
 }, 
 {
  "author": "ytalwar", 
  "date": "2005-03-02T23:08:08.000000Z", 
  "msg": [
   "This patch fix XALANJ-2070.", 
   "This patch add XML 1.1 support in term of following:", 
   "- Output Document can be of Version XML 1.1", 
   "- Control Characters in Range C0 and C1 are output as NCR.", 
   "- Namespaces in XML 1.1 can be IRIs.", 
   "- NCNames and QNames can conform to XML 1.1 specifications.", 
   "- NEL and LSEP characters are treated as new end of line character as per XML 1.1 specifications.", 
   "Thanks to Brian Minchau for reviewing the patch.  Brian Minchau and Henry Zongaro has also helped how XML 1.1 support should be done."
  ], 
  "revision_id": "338123"
 }, 
 {
  "author": "ytalwar", 
  "date": "2005-02-22T21:35:41.000000Z", 
  "msg": [
   "The fix is for XALANJ-2059.", 
   "The problem is that when href attribute has aboslute uri with jar scheme and", 
   "base uri is not null, then base uri is pre-appended to uri specified in href attribute.", 
   "The newer patch is according to RFC 2396.", 
   "The newer patch ignores base uri and directly make use of uri specifed href attribute, provided following conditions are met.", 
   "a)If uri specified in href attribute starts with / after the scheme and :", 
   "For example, href=\"file:/myDIR/myXSLFile.xsl.", 
   "b)If scheme specified for uri href attribute is not same as scheme for base uri.", 
   "c)If base uri is not hierarchical", 
   "Henry Zongaro has helped creating this patch."
  ], 
  "revision_id": "338122"
 }, 
 {
  "author": "minchau", 
  "date": "2005-02-21T18:34:56.000000Z", 
  "msg": [
   "Fix for XALANJ-2033 and XALANJ-2051 so that the serializer will serialize DTD", 
   "tags if desired.  The patch was reviewed by Ilene Seeleman."
  ], 
  "revision_id": "338121"
 }, 
 {
  "author": "minchau", 
  "date": "2005-02-18T04:35:18.000000Z", 
  "msg": [
   "Committing serializer.patch5.txt  in JIRA issue XALANJ-1886,", 
   "that puts back an old attAttribute() method that takes 5 String arguments.", 
   "There is a new one that takes these", 
   "5 String arguments and a boolean to indicate if it is from an xsl:attribute", 
   "or not.  I'm just restoring the old method.", 
   "Patch reviewed by Henry Zongaro."
  ], 
  "revision_id": "338120"
 }
]