[
 {
  "author": "zongaro", 
  "date": "2005-06-15T18:31:17.000000Z", 
  "msg": [
   "Patch for bug XALANJ-2097 from Nick Van den Bleeken", 
   "(Nick.VandenBleeken () pandora ! be), reviewed by Henry Zongaro.", 
   "The code generated for a path expression of the form $var/self::node() was", 
   "incorrect.  It looked like the following, where \"i\" refers to the context node.", 
   "new StepIterator(dtmaxisiterator1.cloneIterator(), new SingletonIterator(i));", 
   "That's incorrect, because the SingletonIterator will only return the node used", 
   "upon its instantiation, rather than the node provided from the parent step", 
   "expression by the StepIterator.", 
   "The SingletonIterator should only be used if the self::node() is not a step", 
   "in a path expression.  In the case of a path expression, dom.getAxisIterator", 
   "should be used to create the axis iterator instead."
  ], 
  "revision_id": "338174"
 }, 
 {
  "author": "mkwan", 
  "date": "2005-06-15T15:16:15.000000Z", 
  "msg": [
   "Patch for XALANJ-2124", 
   "Update the online documentation to include descriptions on the new JAXP 1.3 features:", 
   "1. Add a new \"XPath API\" page to provide a complete guide on how to use the", 
   "XPath API in JAXP 1.3. Details on basic usage patterns, factory plugin mechanism,", 
   "how to use NamespaceContext, XPathVariableResolver and XPathFunctionResolver.", 
   "2. Document the secure processing feature in the features page", 
   "3. Describe three new XPath API related samples in the samples page."
  ], 
  "revision_id": "338173"
 }, 
 {
  "author": "mkwan", 
  "date": "2005-06-14T19:21:08.000000Z", 
  "msg": [
   "Update with the latest xml-apis.jar built from xml-commons."
  ], 
  "revision_id": "338172"
 }, 
 {
  "author": "mkwan", 
  "date": "2005-06-10T13:42:20.000000Z", 
  "msg": [
   "The new xercesImpl.jar supports the secure processing feature."
  ], 
  "revision_id": "338171"
 }, 
 {
  "author": "zongaro", 
  "date": "2005-06-08T17:59:49.000000Z", 
  "msg": [
   "Fix for XALANJ-1938.", 
   "A KeyIndex object contains a Hashtable mappings from key values to the", 
   "IntegerArray objects that contain the set of nodes selected by those key values.", 
   "For a reference to the key function, the lookupKey method finds the nodes", 
   "selected by a particular key value, and the merge method merges all the nodes", 
   "selected if more than one key value is specified for the one refernce to the key", 
   "function.", 
   "The problem was that the lookupKey and merge methods operated on the \"live\"", 
   "versions of the IntegerArrays stored in the mapping Hashtable, so that one", 
   "reference to the key function might affect the result of subsequent references", 
   "to the key function.  Changed those methods to make clones of the selected", 
   "IntegerArray objects, which can be safely modified without affecting the", 
   "original IntegerArrays.", 
   "This patch was reviewed by Joanne Tong (joannet () ca ! ibm ! com)."
  ], 
  "revision_id": "338170"
 }
]