[
 {
  "author": "zongaro", 
  "date": "2005-01-27T15:28:02.000000Z", 
  "msg": [
   "Two part fix for Jira bug report XALANJ-1888.", 
   "1) It is possible for the characters SAX event to specify a length of zero.", 
   "Text nodes should not be created in such situations.  Changed the", 
   "charactersFlush method to guard against this case.", 
   "2) Made a defensive change to references to m_dataOrQName.  If the value in", 
   "this vector is to be interpreted as an index into m_data, it is stored as a", 
   "negative value (via calls to addNode).  However, most references to elements of", 
   "m_dataOrQName were checking whether the value was non-positive, treating a", 
   "value of zero as an index into m_data as well.  The zeroth entry into m_data is", 
   "an invalid entry.", 
   "The fix to charactersFlush described above should ensure that zero is never", 
   "stored in m_dataOrQName, but I thought it was just as well to duplicate the", 
   "interpretation used in storing values in m_dataOrQName.", 
   "Reviewed by Morris Kwan (mkwan () ca ! ibm ! com)"
  ], 
  "revision_id": "338109"
 }, 
 {
  "author": "zongaro", 
  "date": "2005-01-27T15:17:41.000000Z", 
  "msg": [
   "Fix for Jira bug report XALANJ-1888.", 
   "It is possible for the characters SAX event to specify a length of zero.  Text", 
   "nodes should not be created in such situations.  Changed the charactersFlush", 
   "method to guard against this case.", 
   "Reviewed by Morris Kwan (mkwan () ca ! ibm ! com)"
  ], 
  "revision_id": "338108"
 }, 
 {
  "author": "zongaro", 
  "date": "2005-01-24T20:51:23.000000Z", 
  "msg": [
   "Fix for Jira bug report XALANJ-1811.", 
   "Updated Javadocs for constructors to make it clear that a single instance of", 
   "CachecXPathAPI must not be used by multiple threads without synchronization.", 
   "Reviewed by Christine Li (jycli () ca ! ibm ! com)"
  ], 
  "revision_id": "338107"
 }, 
 {
  "author": "mcnamara", 
  "date": "2005-01-24T04:04:40.000000Z", 
  "msg": [
   "Clean up javadoc to reduce warnings during doc builds.  See XALANJ-2048"
  ], 
  "revision_id": "338106"
 }, 
 {
  "author": "mcnamara", 
  "date": "2005-01-24T00:34:36.000000Z", 
  "msg": [
   "Clean up javadoc to reduce warnings during doc builds.  See XALANJ-2048"
  ], 
  "revision_id": "338105"
 }
]