[
 {
  "author": "ytalwar", 
  "date": "2005-04-01T19:28:07.000000Z", 
  "msg": [
   "This is a fix for XALANJ-2089.", 
   "Christine Li has created this patch.", 
   "Brian Minchau helped in creating this patch.", 
   "Brian Minchau also reviewed this patch.", 
   "org.apache.xalan.templates.ElemNumber.java has raised some performance issue as", 
   "a static array to hold resources was removed earlier.  However, the removal of static array is necessary", 
   "to fix a potential bug multithread environment, where a given thread can request different locale than another thread.", 
   "This patch resolves the performance glicth that was found in internal testing."
  ], 
  "revision_id": "338139"
 }, 
 {
  "author": "ytalwar", 
  "date": "2005-03-30T14:15:12.000000Z", 
  "msg": [
   "This resolves XALANJ-2085.", 
   "Sarah McNamara has reviewed this change."
  ], 
  "revision_id": "338138"
 }, 
 {
  "author": "ytalwar", 
  "date": "2005-03-23T17:54:05.000000Z", 
  "msg": [
   "This is resolve UTF-8 Charcater support and QName character support for XML 1.1 support in XALANJ-2070.", 
   "Henry Zongaro and Brian Minchau helped in fixing this part of the JIRA issue.", 
   "A new class org.apache.xml.utils.XML11Char has been included to support XML 1.1 characters.", 
   "Also a reference to org.apache.xml.utils.XMLChar has been replaced with a reference to", 
   "org.apache.xml.utils.XML11Char in almost all the places in Xalan.", 
   "org.apache.xml.serializer.WriterToUTF8Buffered has been update to support UTF-8 characters that can be represented in four bytes."
  ], 
  "revision_id": "338137"
 }, 
 {
  "author": "ytalwar", 
  "date": "2005-03-16T23:24:47.000000Z", 
  "msg": [
   "This is a fix for XALANJ-2081.", 
   "In class org.apache.xalan.xsltc.compiler.Text, a check was being done to find out if a given text string is all whitespaces.", 
   "In case, a given text string is all whitespace, a call to serializer is not made.", 
   "The code was using trim() method from java.lang.String.  trim() method trimmed characters as whitespaces", 
   "that are not considered as whitespace in XML.", 
   "The code logic is changed to check if a given string is all whitespace accoding to XML specifications.", 
   "I would like to thank Michael Glavassevich and Brian Minchau for their input to resolve this issue."
  ], 
  "revision_id": "338136"
 }, 
 {
  "author": "minchau", 
  "date": "2005-03-16T20:54:11.000000Z", 
  "msg": [
   "Minor changes to comments."
  ], 
  "revision_id": "338135"
 }
]