[
 {
  "author": "zongaro", 
  "date": "2005-07-11T13:18:28.000000Z", 
  "msg": [
   "Fix for bug report XALANJ-2140.", 
   "The AbstractTranslet._keyIndexes field is used to record the sets of keys", 
   "for a particular transformation by name.  This table was not cleared at the", 
   "end of a transformation, so the keys from one transformation persisted to", 
   "subsequent transformations.  Fixed this by adding a try-finally block in", 
   "the AbstractTranslet.transform method and setting _keyIndexes to null in the", 
   "finally block.", 
   "Reviewed by Brian Minchau (minchau () ca ! ibm ! com)."
  ], 
  "revision_id": "338194"
 }, 
 {
  "author": "jycli", 
  "date": "2005-07-08T21:45:12.000000Z", 
  "msg": [
   "Added missing apostrophe for error messages. Fixed bug report XALANJ-2167. Patch is reviewed by Sarah McNamara (mcnamara@ca.ibm.com)"
  ], 
  "revision_id": "338193"
 }, 
 {
  "author": "zongaro", 
  "date": "2005-07-05T17:55:44.000000Z", 
  "msg": [
   "Patch for Jira issue XALANJ-1978.  Reviewed by Christine Li", 
   "(jycli () ca ! ibm ! com).", 
   "Behaviour of StreamResult.getSystemId has changed if the Result object was", 
   "created using a File.  The URI returned begins with \"file:/\" where it used to", 
   "begin with \"file:///\".  TransformerIdentityImpl had a dependency on the old", 
   "behaviour."
  ], 
  "revision_id": "338192"
 }, 
 {
  "author": "zongaro", 
  "date": "2005-06-30T21:04:16.000000Z", 
  "msg": [
   "Patch for XALANJ-2146.  Reviewed by Christine Li (jycli () ca ! ibm ! com).", 
   "Section 4.3.4 of the JVM specification prohibits an uninitialized object from", 
   "appearing on the stack or in a local variable when a backwards branch is", 
   "executed.  We need to guard against that in the generated code in XSLTC by", 
   "storing arguments to constructors in temporary variables if there's any", 
   "possibility that the code used to calculate such arguments might contain a", 
   "backwards branch."
  ], 
  "revision_id": "338191"
 }, 
 {
  "author": "jycli", 
  "date": "2005-06-29T19:33:06.000000Z", 
  "msg": [
   "Cleanup resource files. Remove unused constants and commented out message keys. Fix for bug XALANJ-2161", 
   "Patch is reviewed by Sarah McNamara (mcnamara@ca.ibm.com)"
  ], 
  "revision_id": "338190"
 }
]