[
 {
  "author": "woolfel", 
  "date": "2005-11-17T15:14:59.279294Z", 
  "msg": [
   "updating the soap webservice sampler doc to explain how to use it with CSVDataSet", 
   "peter"
  ], 
  "revision_id": "345259"
 }, 
 {
  "author": "dims", 
  "date": "2005-11-17T15:11:25.408394Z", 
  "msg": [
   "code refactoring (reviewing javadocs)", 
   "- move XMLBeansSchemaUtility to org\\apache\\axis2\\databinding\\extensions", 
   "- move RelatesTo to org\\apache\\axis2\\addressing", 
   "- Get rid of unnecessary SOAPFaultException interface. Used ONLY in 1 place inside AxisEngine.", 
   "Please expect more changes and holler if i mess up :)"
  ], 
  "revision_id": "345258"
 }, 
 {
  "author": "evenisse", 
  "date": "2005-11-17T15:10:53.876713Z", 
  "msg": [
   "PR: MNG-1553 and MNG-1561", 
   "Submitted by: Dan Tran", 
   "o ability to retreive starteam username/password from settings.xml", 
   "o define goals to run on command line"
  ], 
  "revision_id": "345257"
 }, 
 {
  "author": "antoine", 
  "date": "2005-11-17T15:08:15.062452Z", 
  "msg": [
   "add a test case for bugrep 37348 in the xslt task, also remove", 
   "unneeded imports in FileUtils"
  ], 
  "revision_id": "345256"
 }, 
 {
  "author": "evenisse", 
  "date": "2005-11-17T14:58:21.917692Z", 
  "msg": [
   "PR: MNG-1556²", 
   "Submitted by: David Hawkins", 
   "Reviewed by : Emmanuel Venisse", 
   "This patch makes the maven-release-plugin no longer specify the tagBase by default. It will now play nicely with the changes made to the maven-scm-provider-svn in SCM-72.", 
   "The other significant change is that I made the version resolution a little smarter. I was tired of it not understanding my 3 digit versions (1.1.1). It now understands quite a few different ways of specifying the version and should be able to generate the next version as well as a snapshot version string. While it is quite robust, I wrote it with the thought that others could implement the interface if they wanted to use their own versioning scheme. I have the ProjectVersionResolver.getResolvedVersion explicitly instantiating the DefaultVersionInfo class because I am not sure what the best pattern is to have the container handle it. If someone wanted to insert their own class for the impl, how could they go about configuring it to do so? I also had the VersionInfo object implement comparable even though it isn't used right now. I can think of a couple places that might come in handy."
  ], 
  "revision_id": "345255"
 }
]