[
 {
  "author": "fuzzylogic", 
  "date": "2005-11-17T23:24:33.355661Z", 
  "msg": [
   "Make publishedapi and engine targets depend on initjars so that the changenumber", 
   "is properly set if the target is called independently of the 'javadoc' target."
  ], 
  "revision_id": "345359"
 }, 
 {
  "author": "sebb", 
  "date": "2005-11-17T23:17:00.451208Z", 
  "msg": [
   "Add missing report_bar_graph_url property"
  ], 
  "revision_id": "345358"
 }, 
 {
  "author": "radup", 
  "date": "2005-11-17T23:01:52.327798Z", 
  "msg": [
   "Changed the website to reflect the recent XmlBeans 2.1.0 release."
  ], 
  "revision_id": "345357"
 }, 
 {
  "author": "rich", 
  "date": "2005-11-17T23:01:29.416877Z", 
  "msg": [
   "Fixed a bunch of compiler tests I broke with my FormData-deprecation checkin the other day.  Also deleted an incorrect/redundant test (simpleActionReadOnlyUseFormBeanWarning).", 
   "tests: compiler.bvt in netui/test/ant (WinXP)", 
   "BB: same (linux)"
  ], 
  "revision_id": "345356"
 }, 
 {
  "author": "mikem", 
  "date": "2005-11-17T22:59:38.594534Z", 
  "msg": [
   "DERBY-239, committing next phase checkin on behalf of Suresh Thalamati.", 
   "This patch adds code to support real-time online backup with unlogged", 
   "operations. A consistent backup can not be made if there are pending", 
   "transactions with unlogged operations or if unlogged operations", 
   "occur when backup is in progress. Because container files can  be copied", 
   "to the backup before the transaction is committed and the data pages are", 
   "flushed as part of the commit. As there is no transaction log for unlogged", 
   "operations, while restoring from the backup database can not be restored to", 
   "a consistent state. To make a consistent online backup in this scenario, this patch:", 
   "1)  blocks  online backup until all the transactions with unlogged operation are", 
   "committed/aborted.", 
   "2)  implicitly converts all unlogged operations to logged mode for the duration", 
   "of the online backup, if they are started when backup is in progress.", 
   "This patch also adds a test to test the online backup in parallel with some DML,", 
   "> DDL and unlogged operations."
  ], 
  "revision_id": "345355"
 }
]