[
 {
  "author": "evenisse", 
  "date": "2005-11-21T15:59:12.177806Z", 
  "msg": [
   "PR: MNG-887", 
   "Submitted by: David Hawkins", 
   "The user is now prompted with a default release tag name. The default tag name is the artifactId-releaseVersion of the first project in reactor projects. The first project is assumed to be the single project being released or the parent project of a multi-module build.", 
   "The release plugin now checks for modified files _before_ prompting the user to enter a tag name for the release. I found it odd that the plugin would build the project, test it, prompt you for a release tag and then bomb because of local modifications. Now it will bomb due to modified files as soon as possible.", 
   "developerConnection is now an optional configuration parameter. If developerConnection is not specified in the Model, the project.scm.connection will be used. If that is also null, a MojoExecutionException is thrown. This allows a pom to specify a scm.connection and have the release plugin use that value if a developerConnection is not specified. This could be a topic of debate but my opinion is that it is probably a very common case where the scm.developerConnection and the scm.connection are the exact same value. Why force the user to specify both when we can default to scm.connection if there is no need to differentiate?", 
   "release:perform now passes along the -Dmaven.test.skip parameter to the child mvn process if specified. While its clearly not a recommended pattern to use, the people who need it, need it here as well."
  ], 
  "revision_id": "345919"
 }, 
 {
  "author": "evenisse", 
  "date": "2005-11-21T15:38:19.522424Z", 
  "msg": [
   "PR: MNG-887", 
   "Submitted by: David Hawkins", 
   "Added tag resolution methods that take String urls instead of a repository. Tag resolution now supports ViewCVS style urls with a \"?\" query string. Cleaned up comments."
  ], 
  "revision_id": "345918"
 }, 
 {
  "author": "aroush", 
  "date": "2005-11-21T15:29:16.919893Z", 
  "msg": [
   "Lucene.Net project.  Release 1.4.3"
  ], 
  "revision_id": "345917"
 }, 
 {
  "author": "aroush", 
  "date": "2005-11-21T15:20:18.084229Z", 
  "msg": [
   "Lucene.NET project."
  ], 
  "revision_id": "345916"
 }, 
 {
  "author": "hawkeye", 
  "date": "2005-11-21T15:10:10.020602Z", 
  "msg": [
   "Does not run with monitor on because it takes too long"
  ], 
  "revision_id": "345915"
 }
]