[
 {
  "author": "jeremias", 
  "date": "2005-12-13T19:50:59.365080Z", 
  "msg": [
   "Bugzilla #37880:", 
   "Bugfix for lost footnotes in centered text.", 
   "Skip elements with no Position in TextLayoutManager."
  ], 
  "revision_id": "356594"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-12-13T19:49:16.657063Z", 
  "msg": [
   "startVPArea() and endVPArea() made abstract in AbstractRenderer so implementors are forced to deal with the topic.", 
   "startVPArea() in Renderers now takes an additional parameter for an optional clipping rectangle. PDF, PS and Java2D renderers now perform proper clipping on viewports if requested.", 
   "Fixed various problems in the Java2D renderer and added border and background painting where still missing. Note that there are several code parts that could be easily shared with the AbstractPathOrientedRenderer."
  ], 
  "revision_id": "356593"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-12-13T19:48:04.326475Z", 
  "msg": [
   "New method: FONode.decorateWithContextInfo() adds context information to an error or log message by either providing the locator information or by gathering context information from the context FOs.", 
   "Improved log and error messages in a number of places by adding additional context information that should make it easier to find the location in the source files.", 
   "Added a check to detect inline overflows (LineLayoutManager).", 
   "Added a check to detect in-page overflows (PageBreakingAlgorithm)."
  ], 
  "revision_id": "356592"
 }, 
 {
  "author": "mrdon", 
  "date": "2005-12-13T19:45:48.172354Z", 
  "msg": [
   "Adding new interceptors to call reset() and validate() on the ActionForm, adding a new", 
   "StrutsFactory to provide conversion functions between Struts Action 1.x and Ti, added", 
   "class-level Javadocs, added rife as build dependency (temporary until XWork fixed)"
  ], 
  "revision_id": "356591"
 }, 
 {
  "author": "", 
  "date": "2005-12-13T19:41:57.892878Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "356590"
 }
]