[
 {
  "author": "mikem", 
  "date": "2005-12-14T21:40:44.774057Z", 
  "msg": [
   "Fix for DERBY-733.  Committed on behalf of Knut Anders Hatlen.", 
   "I have attached a patch which invokes ReentrantLock.lock() and", 
   "unlock() when reading in a page from disk. I did not build my own", 
   "ReentrantLock replacement, as I said I would. Instead, I have used", 
   "reflection to enable this feature if the JVM supports it. This seemed", 
   "like an easier approach, and I also discovered that the handling of", 
   "threads waiting for monitors had changed between 1.4 and 1.5 and that", 
   "this issue was not so serious on 1.4.", 
   "The maximum response time was drastically reduced in the disk-bound", 
   "case. Derbyall ran successfully on both Sun JVM 1.4.2 and 1.5.0. I", 
   "have also tested the performance, and I could not see any change in", 
   "throughput or CPU usage. (The performance test was run with a very", 
   "small page cache and with a database that was many times bigger than", 
   "the page cache, but smaller than the file system cache. This way,", 
   "Derby called readPage() very often, but it was CPU-bound since the", 
   "requested page always was in the file system cache.)"
  ], 
  "revision_id": "356884"
 }, 
 {
  "author": "crossley", 
  "date": "2005-12-14T21:37:12.340672Z", 
  "msg": [
   "The table is supposed to continue to point to the project's", 
   "incubation status file. Fix Geronimo."
  ], 
  "revision_id": "356883"
 }, 
 {
  "author": "ammulder", 
  "date": "2005-12-14T21:35:07.497341Z", 
  "msg": [
   "Fix missing deployer error message to use the right configId"
  ], 
  "revision_id": "356882"
 }, 
 {
  "author": "pkosiorowski", 
  "date": "2005-12-14T21:32:51.011315Z", 
  "msg": [
   "NUTCH-141: Invalid title tag in jsp page. Fix by Marko Bauhardt."
  ], 
  "revision_id": "356881"
 }, 
 {
  "author": "pkosiorowski", 
  "date": "2005-12-14T21:30:41.306580Z", 
  "msg": [
   "NUTCH-141: Invalid title tag in jsp page. Fix by Marko Bauhardt."
  ], 
  "revision_id": "356880"
 }
]