[
 {
  "author": "evenisse", 
  "date": "2005-12-16T14:46:56.853562Z", 
  "msg": [
   "Define default values of working directory and build output directory"
  ], 
  "revision_id": "357169"
 }, 
 {
  "author": "jorton", 
  "date": "2005-12-16T14:46:54.746730Z", 
  "msg": [
   "* acinclude.m4 (APACHE_ENABLE_MODULES): Support passing \"none\" to", 
   "--enable-modules to build an httpd with no optional modules enabled."
  ], 
  "revision_id": "357168"
 }, 
 {
  "author": "dims", 
  "date": "2005-12-16T14:42:17.402295Z", 
  "msg": [
   "- One more test with UTF-16 :)", 
   "- Fix build break (Thanks to Ruchith)"
  ], 
  "revision_id": "357167"
 }, 
 {
  "author": "jeremias", 
  "date": "2005-12-16T14:40:20.974609Z", 
  "msg": [
   "XMLHandler interface changed so it reports whether it supports a particular Renderer instead of reporting the MIME type. One MIME type could be implemented by multiple Renderer implementations so conflicts could occur. Almost all XMLHandler implementations will have a dependency on a particular Renderer implementation.", 
   "XMLHandlers are now configurable.", 
   "Standard XMLHandlers now get registered through service lookup.", 
   "Simplification: XMLHandlers don't need nested classes for the handling functionality anymore. If Batik, for example, is not in the classpath it will already be detected while registering the XMLHandlers.", 
   "The RendererContextConstants interface now standardizes some of the keys used in the RendererContext and helps with actually decoupling the XMLHandler implementations from the renderers. This is one step towards making Batik an optional dependency and making it possible to move the SVG functionality to a separate place later.", 
   "Extracted the SVG XMLHandler functionality from the sandbox SVGRenderer into a separate class following the example of the other renderers.", 
   "Bugfix in PSSVGHandler: Fixed a copy/paste error which could lead to wrong clipping of an SVG image for PostScript output."
  ], 
  "revision_id": "357166"
 }, 
 {
  "author": "bdudney", 
  "date": "2005-12-16T14:35:20.852041Z", 
  "msg": [
   "preparing for a branch to stay on AMQ 3.2.1"
  ], 
  "revision_id": "357165"
 }
]