[
 {
  "author": "billbarker", 
  "date": "2005-12-19T00:48:43.895037Z", 
  "msg": [
   "Restrict <jsp:getAttribute /> to only look in PAGE_SCOPE.", 
   "This is per the JSP spec section 5.3.  It would be nice to be able to do this at translation time (as recommended), but I don't see how to do this with my limited knowledge of Jasper :(.", 
   "Fix for Bug #37933"
  ], 
  "revision_id": "357589"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2005-12-19T00:46:24.372509Z", 
  "msg": [], 
  "revision_id": "357588"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2005-12-19T00:45:49.066368Z", 
  "msg": [
   "o everything is pretty much converted over to using the SOAP ruby interface instead of xmlrpc"
  ], 
  "revision_id": "357587"
 }, 
 {
  "author": "clr", 
  "date": "2005-12-19T00:43:16.439741Z", 
  "msg": [
   "updated project.xml to remove incubator logo and add jdo-commits email alias info"
  ], 
  "revision_id": "357586"
 }, 
 {
  "author": "archie", 
  "date": "2005-12-19T00:40:26.957547Z", 
  "msg": [
   "More simplification under the interpreter-only assumption, mainly of", 
   "code related to handling of the C and Java stacks:", 
   "- Separate C stack chunks from Java stack frames; keep them in separate", 
   "linked lists. Eliminate overly-complex stack walking code in favor of", 
   "a simple iteration over the Java stack frame linked list.", 
   "- It's no longer necessary to hold the VM mutex when walking the stack.", 
   "- Have C stack chunks include all C stack frames except for JNI frames and", 
   "other \"opaque\" (i.e., non-JCNI) native code. This means we unnecessarily", 
   "scan some parts of the C stack (e.g., _jc_interp() frames and signal frames)", 
   "but results in much simpler code. Create a new C stack chunk each time", 
   "we are invoked from native code.", 
   "- Only \"clip\" the C stack when necessary, i.e., when about to put a thread", 
   "to sleep; push down \"clip\" operations as low as possible and eliminate", 
   "all redundant \"clips\". Clarify the code and comments about \"clipping\".", 
   "- Remove env->jni_native field; instead, inspect the top Java stack frame.", 
   "- No longer assume JCNI native code synchronizes itself.", 
   "- Fix a bug in VMStackWalker.getClassContext()."
  ], 
  "revision_id": "357585"
 }
]