[
 {
  "author": "blumm", 
  "date": "2004-02-17T15:43:13.000000Z", 
  "msg": [
   "'jakarta-pluto/portal/src/java/org/apache/pluto/portalImpl/services/log/LogServiceCommonsLoggingImpl.java' is obsolete,", 
   "because of the implementation of the logging enhancements by David H.DeWolf."
  ], 
  "revision_id": "35889"
 }, 
 {
  "author": "blumm", 
  "date": "2004-02-17T15:38:13.000000Z", 
  "msg": [
   "'jakarta-pluto/container/src/java/org/apache/pluto/services/log/Log.java' is obsolete because", 
   "of the implementation of logging-enhancements by David H.DeWolf."
  ], 
  "revision_id": "35888"
 }, 
 {
  "author": "blumm", 
  "date": "2004-02-17T14:23:57.000000Z", 
  "msg": [
   "Submitted by:\tDavid H. DeWolf/david@daviddewolf.com", 
   "Container Changes:", 
   "------------------------------------", 
   "LogService interface has changed in the following ways in order for the LogService to act as a factory for logging implementations :", 
   "1) All isXXXEnabled() methods have been removed", 
   "2) All logging methods have been removed", 
   "3) getLogger(String) and getLogger(Class) have been added.", 
   "Logger interface has been added.  It includes:", 
   "1) All isXXXEnabled() methods", 
   "2) All logging methods removed from LogService", 
   "Finally, All pluto classes which log now lookup a Logger using the LogService implementation provided by the container's environment.  Because of this, the static Log class can and should be removed.", 
   "Portal Driver changes:", 
   "---------------------------------", 
   "The LogServiceImpl has been modified to implement the new version of pluto's LogService interface.   It returns Loggers of type LoggerImpl", 
   "LoggerImpl has been created.  It utilizes commons logging for all logging functions.", 
   "Where possible (and where it makes sense), all driver classes that utilize significant logging grab their own instance of Logger and use it for logging.  Each instance access the LogService directly from the driver's ServiceManager (instead of looking it up through the containers abstractions -- which would eventually bring it back to the ServiceManager anyways.", 
   "The driver's Log class has been modified so that all static invocations utilize a single Logger (org.apache.pluto.portalImpl) and it is not looked up each time.  Because of this, the 'aComponent' argument is no longer available to within static logging methods.", 
   "All classes have been modified to utilize the above portal changes."
  ], 
  "revision_id": "35887"
 }, 
 {
  "author": "blumm", 
  "date": "2004-02-13T10:31:35.000000Z", 
  "msg": [
   "PR: 26489", 
   "Submitted by:\tNick Lothian/nl@essential.com.au", 
   "Reviewed by:\tMichael Blum", 
   "'build.xml' is required by the nightly build process as defined by 'jakarta-gump'.", 
   "Look at '.../jakarta-gump/projects/jakarta-pluto.xml' for details."
  ], 
  "revision_id": "35886"
 }, 
 {
  "author": "blumm", 
  "date": "2004-02-13T10:02:15.000000Z", 
  "msg": [
   "PR: 26489", 
   "The build.xml will be needed for the nighly builds of Pluto's jar files.", 
   "'api/build.xml', 'container/build.xml', 'portal/build.xml' was generated by maven from project.xml version 1.0", 
   "on date February 12 2004, time 1040. Maven generated in some cases absolute pathes. I replaced those", 
   "pathes by relative ones to remove platform dependencies."
  ], 
  "revision_id": "35885"
 }
]