[
 {
  "author": "dolander", 
  "date": "2004-08-07T22:47:47.180824Z", 
  "msg": [
   "With this checkin I introduce the AbstractSimpleTag that supports SimpleTag allowing the", 
   "NetUI tags to be written as simple tags.  In addition, I converted the Error and Errors tag", 
   "to being simple tags as a proof of concept.", 
   "To do this, I moved all of the expression handling into a new ExpressionHandling class and off", 
   "the base tag.  In addition, I move expression handling to the dataSource tags directly.", 
   "Finally, there was a bit of work to make the base APIs switch from relying on Tag to JspTag."
  ], 
  "revision_id": "36074"
 }, 
 {
  "author": "ekoneil", 
  "date": "2004-08-07T19:41:18.583898Z", 
  "msg": [
   "JUnit DRT fixup related to Xalan 2.4.1.", 
   "This JAR was used by the NetUI DRT infrastructure when the XSLT classes moved from the JDK 1.4 package to the JDK 1.5 package.  Ant supports these in the ant-xalan1.jar file.  Thus, the extra <java> call in the junitReport.xml file is no longer needed.", 
   "The xalan-241.jar file has moved into netui/docs/external because the NetUI Javadoc / tag doc infrastructure needs it to process .xslt files.", 
   "This change also wires-up the \"ant docs\" target from the $BEEHIVE_HOME/netui/build.xml.  To generate Javadoc and tag doc for NetUI, run:", 
   "ant docs", 
   "in $BEEHIVE_HOME/netui.  The docs are produced in $BEEHIVE_HOME/netui/build/docs.", 
   "- move xalan-241.jar from netui/test/external to netui/docs/external", 
   "- remove unused targets from junit.xml", 
   "- re-wire the junitReport.xml file for the Xalan move.  This is just a partial fix -- the file can be collapsed into a single build file with changes to the test recordder.", 
   "- wire-up the \"docs\" target in netui/build.xml", 
   "- remove the xalan-241.jar property from netui/test/ant/test.properties", 
   "BB: self", 
   "DRT: NetUI pass", 
   "Controls pass"
  ], 
  "revision_id": "36073"
 }, 
 {
  "author": "niclas", 
  "date": "2004-08-07T19:09:08.330324Z", 
  "msg": [
   "Missed some commits."
  ], 
  "revision_id": "36072"
 }, 
 {
  "author": "dolander", 
  "date": "2004-08-07T18:46:06.879829Z", 
  "msg": [
   "This is a prep change in the process of creating solid support for JSP 2.0 SimpleTags.", 
   "The chang here is the rename AbstractBaseTag to AbstractClassicTag.  We will support", 
   "two base classes, AbtsractClassicTag and AbstractSimpleTag.  Portions of the tag", 
   "library may be migrated to simple tags."
  ], 
  "revision_id": "36071"
 }, 
 {
  "author": "ajack", 
  "date": "2004-08-07T18:35:53.589578Z", 
  "msg": [
   "(Still) attempting to fix the directories (After the re-org broke them)"
  ], 
  "revision_id": "36070"
 }
]