[
 {
  "author": "arminw", 
  "date": "2003-12-09T17:19:59.000000Z", 
  "msg": [
   "- fix bug in DescriptorRepository#discoverDescriptor method", 
   "Thanks Andy Malakov", 
   "- better toString output for Class/FieldDescriptor, PersistentField,", 
   "AttributeDescriptorBase classes", 
   "- introduce new interface JdbcType. This class was used to encapsulate jdbc type", 
   "information and does provide jdbc type specific \"object value extract\" methods for", 
   "Statement/ResultSet objects. Replaces methods provided by SqlTypesHelper.", 
   "Introduce new class JdbcTypesHelper as a replacement of SqlTypesHelper class (removed)", 
   "and as \"outer\" class for all inner JdbcType implementations.", 
   "Now each FieldDescriptor use a reference to its specific JdbcType implementation class,", 
   "e.g. FLD with PersistentField of type INTEGER now use a reference to", 
   "JdbcTypesHelper.T_Integer implementation of interface JdbcTypes", 
   "- (hope) fixed bug when using metadata profiles (by serialization) and anonymous fields.", 
   "When AnonymousPersistentField were serialized the map for anonymous key/values was not reinitialized", 
   "- Be more strict in handling of ResultSetAndStatement class instances. If unclosed instances", 
   "(not released resources) of this class will be finalized an error log is written and the resources", 
   "are closed", 
   "Till 1.0 version we may change this behaviour, but for QA it's ok", 
   "- split PB.delete(...) method in delete/doDelete methods and use intern only doDelete(...) method", 
   "calls. This allows to track all deleted objects of an object graph in a list and clear this list", 
   "before delete(...) was quitted", 
   "- change cache timout attribute from milliseconds to seconds", 
   "- fix javadoc comments"
  ], 
  "revision_id": "363124"
 }, 
 {
  "author": "arminw", 
  "date": "2003-12-09T13:55:35.000000Z", 
  "msg": [
   "add missing jdbc types", 
   "(should be possible to use most of these types in OJB)"
  ], 
  "revision_id": "363123"
 }, 
 {
  "author": "arminw", 
  "date": "2003-12-09T13:46:47.000000Z", 
  "msg": [
   "- split junit metadata file", 
   "- add new test cases (cache, collections)", 
   "- start adding a more complex data model for more complex PB tests", 
   "- fix collection test case to avoid fk-constraint violation"
  ], 
  "revision_id": "363122"
 }, 
 {
  "author": "brj", 
  "date": "2003-12-08T21:34:34.000000Z", 
  "msg": [
   "use RelationshipPrefetcherFactory (missed this one)"
  ], 
  "revision_id": "363121"
 }, 
 {
  "author": "brj", 
  "date": "2003-12-08T21:25:01.000000Z", 
  "msg": [
   "use RelationshipPrefetcherFactory"
  ], 
  "revision_id": "363120"
 }
]