[
 {
  "author": "rich", 
  "date": "2004-08-13T15:58:42.908757Z", 
  "msg": [
   "Preliminary integration of JSF with page flows.  To enable this, add the following entry in the <factory> section of your faces-config.xml:", 
   "<application-factory>org.apache.beehive.netui.pageflow.faces.PageFlowApplicationFactory</application-factory>", 
   "This enablees the following features:", 
   "- 'Backing class' management: each JSF-enabled JSP can have an implicitly associated class that serves as a home for command handlers, backing component objects, and other view-related state (as well as Java Controls in a subsequent checkin).  The class name is derived from the JSP's webapp-rooted URI: /foo/bar.jsp -> class foo.bar.  This class must have the @Jpf.FacesBacking annotation, and it can optionally have a \".jsfb\" extension and live alongside its JSP in the webapp.  The class is instantiated by the runtime before its JSP is rendered, and is removed/replaced only when a new JSP is rendered.", 
   "- Raising Page Flow actions from JSF pages: when there is a page flow for the current request, actions raised from JSF pages or backing classes are handled by the page flow.  Actions can be raised through the \"action\" attribute on h:command* tags, or through command handlers in backing classes.  Command handlers annotated with @Jpf.CommandHandler can also pass form beans to page flow actions (see example mentioned below).", 
   "- \"backing\" implicit bean: JSF pages can bind to properties in the backing class through expressions like \"#{backing.foo}\".", 
   "For an example, see netui/test/webapps/jsf/jsfWeb/jpfFaces/*.  To run this, you must first point the JSF_HOME environment variable to a JavaServer Faces 1.1 Reference Implementation distribution.", 
   "Note: The TestRecorder filter is currently incompatible with JSF.  This will be fixed elsewhere; for now, TR and the JSF-related DRTs are disabled.", 
   "Things left to do:", 
   "- Ability for backing classes to host Controls in the same way page flow classes host controls.", 
   "- Integration of JSF with @Jpf.Forward's navigateTo=Jpf.NavigateTo.currentPage/previousPage.", 
   "DRT: netui (WinXP)", 
   "buddy build: self"
  ], 
  "revision_id": "36354"
 }, 
 {
  "author": "ajack", 
  "date": "2004-08-13T15:28:54.656495Z", 
  "msg": [
   "1) Forget bin/update.py, let's have ./depot.py 'update' (etc.)", 
   "2) Adding a config tool (for viewing config)."
  ], 
  "revision_id": "36353"
 }, 
 {
  "author": "leif", 
  "date": "2004-08-13T15:18:17.381558Z", 
  "msg": [
   "More documentation work."
  ], 
  "revision_id": "36352"
 }, 
 {
  "author": "leif", 
  "date": "2004-08-13T14:39:37.538687Z", 
  "msg": [
   "Fix a typo which was leading to an array out of bounds exception if the base-time parameter were ommitted."
  ], 
  "revision_id": "36351"
 }, 
 {
  "author": "unico", 
  "date": "2004-08-13T13:51:54.916961Z", 
  "msg": [
   "port changes from 2.2: fix slide sample administration app"
  ], 
  "revision_id": "36350"
 }
]