[
 {
  "author": "olegnitz", 
  "date": "2004-04-12T16:32:42.000000Z", 
  "msg": [
   "OTM refactoring for better separation of user object from cache objects"
  ], 
  "revision_id": "363604"
 }, 
 {
  "author": "tomdz", 
  "date": "2004-04-09T13:22:30.000000Z", 
  "msg": [
   "Enhanced proxy handling:", 
   "* created new sub package org.apache.ojb.broker.core.proxy for all proxy stuff", 
   "* the indirection handler and the collection proxy types (list, set, collection) are now configurable in OJB properties and at runtime (ProxyFactory.set...)", 
   "* IndirectionHandler is now an interface, the previous class is renamed to IndirectionHandlerDefaultImpl", 
   "* made IndirectionHandlerDefaultImpl.materializeSubject() protected to allow overriding it in subclasses", 
   "* the existing collection proxy implementations are renamed to ...DefaultImpl", 
   "* added some checks that the classes used for the indirection handler/collection proxies are valid"
  ], 
  "revision_id": "363603"
 }, 
 {
  "author": "brianm", 
  "date": "2004-04-09T01:34:50.000000Z", 
  "msg": [
   "Fix error were clearing caches via evictAll through an NPE when outside transaction"
  ], 
  "revision_id": "363602"
 }, 
 {
  "author": "brianm", 
  "date": "2004-04-09T01:06:00.000000Z", 
  "msg": [
   "* Started to flesh out Query", 
   "* Continue to fill in methods on PersistenceManager", 
   "* Packaging client and spi code seperately (moved StateManagerImpl)", 
   "* JDO Transactions can be committed then began again", 
   "* Test assumptions about behavior around user errors"
  ], 
  "revision_id": "363601"
 }, 
 {
  "author": "arminw", 
  "date": "2004-04-07T23:58:00.000000Z", 
  "msg": [
   "Fix by Guillaume Nodet - declare hashCode and toString fields transient.", 
   "> The Identity class caches internally the hash code", 
   "> and the string representation in private attributes.", 
   "> These attributes are not declared transient, thus", 
   "> the computed hash code is serialized. The problem is", 
   "> that the Class.hashCode() method not overriden", 
   "> and so relies on the Object.hashCode() method which", 
   "> is not guaranteed to give the same values when", 
   "> serialized/deserialized."
  ], 
  "revision_id": "363600"
 }
]