[
 {
  "author": "", 
  "date": "2004-08-09T23:38:32.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'BEFORE_1_1'."
  ], 
  "revision_id": "364024"
 }, 
 {
  "author": "brianm", 
  "date": "2004-08-09T23:38:32.000000Z", 
  "msg": [
   "Take 2 on dirty state tracking for the PB.", 
   "This is definately an in-progress checkin -- parts of this code are criminally inefficient (the statement re-ordering, for instance).", 
   "Also added two libraries -- commons-grafolia which has the state management code written for OJB and is in db-commons-sandbox at the moment, and commons-graph which is in jakarta-commons-sandbox. Grafolia will remain a dependency, commons-graph may not as I don't know if it buys us enough to be worth including. It is only used in the statement reordering mudpie."
  ], 
  "revision_id": "364023"
 }, 
 {
  "author": "tomdz", 
  "date": "2004-08-09T16:24:40.000000Z", 
  "msg": [
   "Fixed missing #ifdef guarding the usage of java.lang.reflect on pre-1.3 jdk's"
  ], 
  "revision_id": "364022"
 }, 
 {
  "author": "arminw", 
  "date": "2004-08-09T07:51:26.000000Z", 
  "msg": [
   "merge with head"
  ], 
  "revision_id": "364021"
 }, 
 {
  "author": "arminw", 
  "date": "2004-08-09T07:45:41.000000Z", 
  "msg": [
   "clear used row Map for each object, default RowReader now only add fields", 
   "if they not already set in row map.", 
   "apply patch by Charles Anthony:", 
   "We've got a problem with the RowReaderDefaultImpl on some of our tables,", 
   "which arises when we use the Microsoft SqlServer Driver and the table", 
   "includes a LONGVARCHAR (or LONGVARBINARY).", 
   "The MS Driver doesn't like the columns resultset being read twice (or out of", 
   "sequence) when the data include an IMAGE or TEXT column.", 
   "The reason it throws this error is because the Default row reader first", 
   "reads the PK to check the cache, and then if nothing is found, reads the", 
   "entire row, thus leading to columns being read twice.", 
   "So, I'm writing a custom HPDRowReader that reads all the columns into the", 
   "map in one go - and that only adds something to row map if the column is't", 
   "already in the map."
  ], 
  "revision_id": "364020"
 }
]