[
 {
  "author": "unico", 
  "date": "2004-08-20T13:38:46.261754Z", 
  "msg": [
   "filter startDocument and endDocument events from included sources"
  ], 
  "revision_id": "36664"
 }, 
 {
  "author": "unico", 
  "date": "2004-08-20T13:38:37.300944Z", 
  "msg": [
   "filter startDocument and endDocument events from included sources"
  ], 
  "revision_id": "36663"
 }, 
 {
  "author": "kylem", 
  "date": "2004-08-20T13:32:54.340183Z", 
  "msg": [
   "First cut at generation of META-INF/MANIFEST.MF entries and customized java.beans.BeanInfo", 
   "classes for Control JavaBeans to support an enhanced packaging model.  JSR-175 attributes on the", 
   "control public or extension interface can be used to inject manifest entries for the bean class", 
   "or customized BeanInfo descriptor elements.  The JSR-175 annotation types for this can be found", 
   "in controls/src/api/packaging/*, and include:", 
   "ManifestAttribute - sets a META-INF/MANIFEST.MF name/value attribute for the bean class", 
   "ManifestAttributes - enables a collection of attributes to be set for a bean class", 
   "PropertyInfo - describes elements to be written to java.beans.PropertyDescriptor for the class.", 
   "This annotation can be used on control PropertySet element declarations", 
   "FeatureInfo - describes elements to be written to java.beans.FeatureDescriptor for the class", 
   "and/or properties of the class.  Currently supported on the interface (to modify the", 
   "BeanDescriptor) or property declarations (to modify the PropertyDescriptor).", 
   "FeatureAttribute - describes a name/value attribute for a FeatureDescriptor (an array of these", 
   "may be nested inside FeatureInfo annotations)", 
   "Still remaining to be done is the annotation model for control operations and events descriptor", 
   "elements, but it will follow the same basic pattern.  A mechanism for indirecting BeanInfo string", 
   "values through resource bundles (to enable localization) will also be supported later.", 
   "There is a DRT sample and a skeleton test case that use java.beans.Introspector to retrieve", 
   "the BeanInfo for the sample."
  ], 
  "revision_id": "36662"
 }, 
 {
  "author": "leif", 
  "date": "2004-08-20T10:41:36.322244Z", 
  "msg": [
   "Correct the project names after they were renamed."
  ], 
  "revision_id": "36661"
 }, 
 {
  "author": "antonio", 
  "date": "2004-08-20T09:51:34.582783Z", 
  "msg": [
   "Update asm to 1.4.3, asm-util to 1.4.3 and groovy to 1.0-beta6"
  ], 
  "revision_id": "36660"
 }
]