[
 {
  "author": "danielf", 
  "date": "2006-01-08T22:46:00.076253Z", 
  "msg": [
   "Made the BlockProcessor a Servlet and renamed it to SitemapServlet. Now the Processor and Environment handling is removed from the BlockManager. Next step will be to \"decomponentize\" it."
  ], 
  "revision_id": "367114"
 }, 
 {
  "author": "sebor", 
  "date": "2006-01-08T22:41:11.332676Z", 
  "msg": [
   "2006-01-08  Martin Sebor  <sebor@roguewave.com>", 
   "STDCXX-101", 
   "* Merged in a fix from trunk/ at rev 367109."
  ], 
  "revision_id": "367113"
 }, 
 {
  "author": "rahul", 
  "date": "2006-01-08T22:39:15.902525Z", 
  "msg": [
   "Added JEXL support for SCXML documents.", 
   "The SCXML specification allows implementations to support multiple expression languages so SCXML documents can be used in varying environments. Commons SCXML already supports the use of EL, using Commons EL. That is useful in servlet container environments and web frameworks, indeed the first use cases for Commons SCXML have been such that the JSP/EL APIs have come in via the \"provided\" maven scope. However since Commons EL 1.0 implements the EL portions of the JSP 2.0 specification, the inherent tie-in between the EL and JSP APIs leaves Commons EL an undesirable choice outside the realm of web applications. JEXL expressions provide an alternative for using Commons SCXML in desktop applications, some compound document formats and server managed code. The implementation consists of implementations of the Commons SCXML Context and Evaluator interfaces which serve as adapters to the JEXL APIs.", 
   "Some minor refactorings have been made to reuse any common code into utility classes and some classes not available in the public Commons SCXML API now have better names, IMO.", 
   "Adding Commons JEXL 1.0 to the dependency list in the project POM and updating the ant build file as well."
  ], 
  "revision_id": "367112"
 }, 
 {
  "author": "wsmoak", 
  "date": "2006-01-08T22:38:38.244941Z", 
  "msg": [
   "Added a class diagram to the package description.", 
   "Thanks to Andrea Aime for help with UMLGraph and Graphviz."
  ], 
  "revision_id": "367111"
 }, 
 {
  "author": "yonik", 
  "date": "2006-01-08T22:35:52.402211Z", 
  "msg": [
   "set default phraseSlop on MultiPhraseQuery in getFieldQuery: LUCENE-483"
  ], 
  "revision_id": "367110"
 }
]