[
 {
  "author": "crossley", 
  "date": "2004-08-23T00:51:06.819145Z", 
  "msg": [
   "Update \"avalon-framework\" references to use the new method which involves magic.", 
   "http://marc.theaimsgroup.com/?l=xml-cocoon-dev&m=109320288814185", 
   "Submitted by: Stephen McConnell"
  ], 
  "revision_id": "36714"
 }, 
 {
  "author": "ajack", 
  "date": "2004-08-22T23:58:29.486103Z", 
  "msg": [
   "Increase verbosity to debug absense."
  ], 
  "revision_id": "36713"
 }, 
 {
  "author": "mcconnell", 
  "date": "2004-08-22T23:40:27.179551Z", 
  "msg": [
   "bad idea - backing it out"
  ], 
  "revision_id": "36712"
 }, 
 {
  "author": "rich", 
  "date": "2004-08-22T23:39:26.444763Z", 
  "msg": [
   "- Enabled the @Jpf.ValidateCustom declarative validation rule.  This annotation causes a custom rule in a ValidatorPlugIn file to be applied on the associated property.  It accepts the name of the rule and an array of its variables/values (@Jpf.ValidateCustomVariable[]).", 
   "- Enabled the @Jpf.ValidateValidWhen declarative validation rule.  This annotation causes validation failure when the given expression evaluates to false at runtime.  This is hooked in to the new expression evaluation APIs, which is currently stubbed out.", 
   "- added a warning that occurs when a declarative validation rule annotation does not specify a custom message (i.e., uses the default), and it doesn't provide a first argument to the default message, and its parent @Jpf.ValidatableProperty annotation doesn't specify a display name... in which case a default display name will be used in the error message.", 
   "- Fixed generation of empty <arg0>, <arg1>, etc. elements in generated ValidatorPlugIn files when declarative validation annotations did not specify the message arguments.", 
   "- Fixed incorrect \"duplicate action\" errors that occured on Jpf.SimpleAction annotations when the validationErrorForward annotation member was set.", 
   "- Enabled the validatorMerge attribute on the @Jpf.Controller annotation.  The ValidatorPlugIn XML file referenced by this attribute is merged with the generated XML from declarative validation annotations in the page flow.  Elements/attributes in the referenced XML override those in the generated XML.", 
   "- Moved Simple Action expression evaluation (for evaluating conditions in @Jpf.ConditionalForward annotations within @Jpf.SimpleAction annotations) to the new (stubbed-out) expression evaluation APIs.", 
   "DRT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "36711"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-08-22T23:32:27.386078Z", 
  "msg": [
   "Commit changes ...", 
   "o correctly assemble tuple nodes in ReferralEncoder", 
   "o correctly assemble tuple nodes in LdapResultEncoder", 
   "o implemented BindResponseEncoder", 
   "o wrote test case using Snacc4J on BindResponseEncoder", 
   "Need to clean up test case and generalize for easy round trip PDU generation", 
   "and testing.  It might also be a good idea to start assembling the PDU", 
   "various comparison tests into a JUnit addon for reuse in testing.  This", 
   "I'll add to the JIRA."
  ], 
  "revision_id": "36710"
 }
]