[
 {
  "author": "cschoett", 
  "date": "2006-01-09T23:00:00.066716Z", 
  "msg": [
   "I've added new attribute to WebServiceControlGenerator task, 'copyWsdl' which accepts a boolean value. If set to true the WSDL file used to generate a web service control is copied into the same directory as the gen'd control.  The control's WSDL path annotation attribute value is set automatically to that location (same package as the gen'd control) unless the 'wsldRuntimePath' attribute has been set in which case it's value will be used.", 
   "I've also added a bunch of new JUnit tests for the WebServiceControlGenerator task.  The include tests for the 'copyWsdl', 'wsdlRuntimePath', 'serviceName', 'serviceNamespace' and 'servicePort' attributes."
  ], 
  "revision_id": "367424"
 }, 
 {
  "author": "hogstrom", 
  "date": "2006-01-09T22:51:13.493469Z", 
  "msg": [
   "Added code to warn users that JDKs other than 1.4 may not function correctly"
  ], 
  "revision_id": "367423"
 }, 
 {
  "author": "archie", 
  "date": "2006-01-09T22:41:11.330743Z", 
  "msg": [
   "Rename configure.in -> configure.ac, following the current standard."
  ], 
  "revision_id": "367422"
 }, 
 {
  "author": "archie", 
  "date": "2006-01-09T22:36:50.356781Z", 
  "msg": [
   "Generate jcjavah header files at build time instead of at distribution", 
   "creation time, and use the 'jcjavah' tool from the build tree instead of", 
   "the installed version. This has a few benefits:", 
   "- The generated headers correspond to the version of Classpath actually", 
   "installed instead of the version present when the distribution was made.", 
   "- It simplifies etc/makedist.sh and eliminates the need to run it as root.", 
   "- It makes the distribution tarball slightly smaller."
  ], 
  "revision_id": "367421"
 }, 
 {
  "author": "pherweg", 
  "date": "2006-01-09T22:35:33.514277Z", 
  "msg": [
   "fix error with lists: listIdGenerator must not be a local variable, in order to return different random numbers"
  ], 
  "revision_id": "367420"
 }
]