[
 {
  "author": "deweese", 
  "date": "2006-01-14T18:20:14.394352Z", 
  "msg": [
   "Added TextContent interface to flow text elements"
  ], 
  "revision_id": "369074"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-01-14T18:20:13.246815Z", 
  "msg": [
   "Remove some un-interesting comments.", 
   "BB: self", 
   "Test: NetUI BVT pass"
  ], 
  "revision_id": "369073"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-01-14T18:19:24.786708Z", 
  "msg": [
   "Fix for BEEHIVE-1042.  This change keeps URI parameters in FIFO order rather than in an order determined by the previous Map<String, List> data structure.  The java.net.URI class uses parameter order when running equals() on two URIs.  Since MutableURI is just an editable wrapper atop URI, it should implement the same ordering principles.", 
   "This change necessitated updating two JUnit tests that assumed parameters could be in any order.  They now expect parameters to be in a fixed order.", 
   "This implementation added a QueryParameters and Parameter private inner classes to the MutableURI that are used for managing the query string.  QueryParameters uses a simple LinkedList to hold query parameter name / value Strings in order.  Probably worth looking at using an optimized data structure for making List-by-param-name and Map lookups faster, but this implementation is now isolated in QueryParametrs and can easily change.", 
   "An additional fix was made to return unmodifiable lists from MutableURI's \"Map getParameters()\" call -- previously, modifiable List elements were stored as values in an unmodifiable Map.  Now, both the Map and contained List(s) are unmodifiable.  Seemed like it should work this way in the first place; if this assumption is incorrect, let me know.", 
   "BB: self", 
   "Test: NetUI BVT && distribution test pass"
  ], 
  "revision_id": "369072"
 }, 
 {
  "author": "deweese", 
  "date": "2006-01-14T18:17:48.430897Z", 
  "msg": [
   "Added TextContent interface to flow text elements"
  ], 
  "revision_id": "369071"
 }, 
 {
  "author": "scolebourne", 
  "date": "2006-01-14T18:15:16.877284Z", 
  "msg": [
   "New FileUtils method to copy a directory to within another directory", 
   "rfe 36315"
  ], 
  "revision_id": "369070"
 }
]