[
 {
  "author": "lofwyr", 
  "date": "2006-01-17T11:11:58.430412Z", 
  "msg": [
   "bugfix: inner class Row is now temporary for rendering, so it will not be seriealized (solves bug MYFACES-914)"
  ], 
  "revision_id": "369754"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-01-17T11:07:10.039534Z", 
  "msg": [
   "New feature: \"Intermediate format\" (IF). The IF is basically the XML dialect written by the area tree renderer (XMLRenderer). A new parser for this format allows reparsing a serialized and possibly modified area tree and rendering it to the final target format. More details on the Wiki at http://wiki.apache.org/xmlgraphics-fop/AreaTreeIntermediateXml. No advanced features have been implemented, yet, only the basic functionality. The whole change should be fully backwards-compatible WRT the outer FOP API except maybe for FOTreeBuilder.addElementMapping(), and the area tree XML which got small changes.", 
   "The area tree has been cleaned up. The serializability has been restored. The CachedRenderPagesModel works again and can, in certain situations, decrease the maximum amount of memory held at one point in time. Some adjustments were necessary in the area tree to help the work of the AreaTreeParser.", 
   "The AreaTreeParser is new and is responsible for parsing area tree XML files and adding pages to a RenderPagesModel instance. It is SAX-based and should be pretty efficient.", 
   "XMLUnit (http://xmlunit.sourceforge.net, BSD license) is a new dependency for the test code. It is used to verify the correctness of the intermediate format code. It doesn't have to be installed for the build to run through, though.", 
   "ElementMapping got a new method getDOMImplementation() which provides the DOMImplementation used to handle a subdocument of a particular namespace. For example, SVG uses Batik's SVG DOM. The AreaTreeParser needs that to properly recreate foreign objects because it can't use the mechanism of the FO tree. The default implementation returns null.", 
   "The ElementMapping instances are no longer maintained by the FOTreeBuilder, but by the newly created ElementMappingRegistry class. It is expected that the instance of this class is moved from the FOTreeBuilder and the AreaTreeParser's Handler class to the \"environment class\" once it is created to cut down on the startup time for each processed document.", 
   "The XMLRenderer has been slightly modified to improve the serialization/deserialization qualities of the area tree XML format.", 
   "The XMLRenderer can now mimic another renderer (see mimicRenderer(Renderer)) in order to use its font setup. That way it is made certain that the reparsed area tree will render to the final target format exactly as expected.", 
   "Fixed a bug in the XMLHandlerRegistry which did not always return the right XMLHandler for every situation.", 
   "Added a DefaultErrorListener to the util package. I've had problems with Xalan-J swallowing exceptions with its default ErrorListener, so I added a simple one for convenience and use in AreaTreeParser.", 
   "Example code for working with the AreaTreeParser can be found in examples/embedding. Documentation will follow."
  ], 
  "revision_id": "369753"
 }, 
 {
  "author": "vikas", 
  "date": "2006-01-17T11:02:30.989632Z", 
  "msg": [
   "cleaning up and updating to work with the new client."
  ], 
  "revision_id": "369752"
 }, 
 {
  "author": "vikas", 
  "date": "2006-01-17T11:01:35.760690Z", 
  "msg": [
   "Cleaning up, updating!"
  ], 
  "revision_id": "369751"
 }, 
 {
  "author": "damitha", 
  "date": "2006-01-17T10:55:38.650277Z", 
  "msg": [
   "Added a test for transport sender loading"
  ], 
  "revision_id": "369750"
 }
]