[
 {
  "author": "akarasulu", 
  "date": "2004-08-26T04:19:31.363289Z", 
  "msg": [
   "Commit changes ...", 
   "o Modified build to include all jars for both snickers and snacc4j runtimes", 
   "and providers for the time being so we can switch between the two using", 
   "the berlib.properties file.  This is temporary until we find and work out", 
   "kinks in the snickers runtime and the ldap provider while comparing PDU's", 
   "captured by ethereal.", 
   "o cleaned up file formatting", 
   "Results of Integration Tests:", 
   "It looks like the snickers provider is working and holding up well with a", 
   "simple bind, search, unbind sequence of operations from the initial tests", 
   "we have run.  But at this point we can continue with assurances that the", 
   "new snickers encoder redesign will work.  We will implement the rest of the", 
   "PDU's now and test them using this branch of the Eve server."
  ], 
  "revision_id": "37054"
 }, 
 {
  "author": "hammant", 
  "date": "2004-08-26T03:44:08.642926Z", 
  "msg": [
   "Jon Elson-Green's patch for far dates"
  ], 
  "revision_id": "37053"
 }, 
 {
  "author": "rich", 
  "date": "2004-08-26T00:56:11.099145Z", 
  "msg": [
   "Modification to my last checkin.  Make the generic test target in testRecorder.xml continue to call back to the \"start\" target on the caller.  Enable asserts in the \"start\" target in the drt app.", 
   "DRT/BVT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "37052"
 }, 
 {
  "author": "rich", 
  "date": "2004-08-26T00:41:49.589514Z", 
  "msg": [
   "Fixes for the following BVTs:", 
   "- AnyBean", 
   "- PfExceptions", 
   "- NonNormalizedPath", 
   "- PfErrors", 
   "- PfPageInput", 
   "Also, enabled assertions for running the DRTs.  With assertions off, PfExceptions will fail because it depends on production-mode being false, and the production-mode value is derived from the assertions setting.", 
   "DRT/BVT: netui (WinXP)", 
   "BB: self (linux)"
  ], 
  "revision_id": "37051"
 }, 
 {
  "author": "rich", 
  "date": "2004-08-26T00:24:10.808662Z", 
  "msg": [
   "Missed these files in revision 37049.  Ran patch, forgot to svn add.", 
   "BB: self (WinXP)"
  ], 
  "revision_id": "37050"
 }
]