[
 {
  "author": "tfischer", 
  "date": "2006-01-21T12:11:16.819264Z", 
  "msg": [
   "- merged lots of content from the maven-howto in the runtime to the index site. The maven-howto in the runtime will be removed.", 
   "- added the site skeleton navigation to the navigation", 
   "- updated some links", 
   "- added linkcheck excludes to svn.apache.org and .."
  ], 
  "revision_id": "371019"
 }, 
 {
  "author": "cheche", 
  "date": "2006-01-21T11:59:22.791132Z", 
  "msg": [
   "put install before upgrade, it makes more sense"
  ], 
  "revision_id": "371018"
 }, 
 {
  "author": "tfischer", 
  "date": "2006-01-21T11:59:16.354198Z", 
  "msg": [
   "- added the site skeleton navigation to the navigation", 
   "- updated some links", 
   "- added linkcheck excludes to svn.apache.org and .."
  ], 
  "revision_id": "371017"
 }, 
 {
  "author": "husted", 
  "date": "2006-01-21T11:57:42.538419Z", 
  "msg": [
   "CheckStyle pass", 
   "* Low-risk, mechanical changes only.", 
   "* Mostly Javadocs.", 
   "* Some IDE-assisted code changes, such as renaming final fields or removing unused private fields", 
   "NOTES", 
   "* ActionServlet - We are throwing from a Finally block", 
   "* RequestProcessor - We are syncronizing on a non-final field", 
   "STATUS", 
   "* We're down to 1882 errors in the Action subproject.", 
   "* I'm though the outer Action package, outer Chain, and Chain.Commands. Next would be Chain.Context.", 
   "* I'll be out most of the day, but I can work on this some more tonight."
  ], 
  "revision_id": "371016"
 }, 
 {
  "author": "tfischer", 
  "date": "2006-01-21T11:45:15.304666Z", 
  "msg": [
   "- added project info and project reporst sections (pointing to maven-generated reports)", 
   "- reorganized the navigation", 
   "- rewritten the texts on the Torque front page", 
   "- updated the links to the changelog on the status page", 
   "- added codestyle page pointing to Turbine codestyle (was voted on some time ago)", 
   "- added contributions page on how to submit contributions", 
   "- moved most svn stuff from the developers guide to the svn page", 
   "- removed the part about the runtime classes from the developer guide (will be added to runtime classes reference in runtime docs)"
  ], 
  "revision_id": "371015"
 }
]