[
 {
  "author": "jvanzyl", 
  "date": "2006-01-21T16:36:06.826593Z", 
  "msg": [
   "[MNG-1980] Removing the duplicate ID, the reactor will catch duplicate IDs in a single build so it doesn't not need", 
   "to be checked for in the project builder. I have removed the model caching for now while I'm refactoring", 
   "the project builder. The plan is to break the 1000+ lines down into its constituent components and use", 
   "a pipeline to build up the project."
  ], 
  "revision_id": "371079"
 }, 
 {
  "author": "snicoll", 
  "date": "2006-01-21T15:55:44.484262Z", 
  "msg": [
   "- Changed the package structure to org.apache.maven.plugin.source", 
   "- Added the source:download goal"
  ], 
  "revision_id": "371078"
 }, 
 {
  "author": "tfischer", 
  "date": "2006-01-21T15:46:38.471012Z", 
  "msg": [
   "- changed inclusion of project reports from automatic to manual", 
   "- corrected some urls", 
   "- rewritten runtime's index.html. Information about which database is supported was moved to an extra page in docs-all-components.", 
   "- removed the jar guide. It is not applicable any more as the generator was seperated from the runtime in torque 3.1", 
   "- the information in peers-howto was moved to several other documents in the reference (read-to-db, write-to-db, extend-classes)", 
   "- todo.xml was removed. Todo information is discussed in the wiki.", 
   "- users-guide was removed. It is not up-to-date anymore and mostly repeats information in the tutorial. The ant part will be rewritten and added to the generator reference.", 
   "- old logos (db-logo-blue.png, torque-logo-blue.png) are removed.", 
   "- the stuff in reference (which was scattered in the howtos before) was re-organized, checked to be up-to-date, rewritten in some parts and brought to a common format."
  ], 
  "revision_id": "371077"
 }, 
 {
  "author": "tfischer", 
  "date": "2006-01-21T15:26:12.807870Z", 
  "msg": [
   "moved managers-cache.xml to reference"
  ], 
  "revision_id": "371076"
 }, 
 {
  "author": "tfischer", 
  "date": "2006-01-21T15:15:17.820952Z", 
  "msg": [
   "- added project.properties and project.xml", 
   "- added navigation including site navigation skeleton", 
   "- added various index.xml files", 
   "- added supported-databases.xml (content taken from runtime's index.xml)", 
   "- small corrections in some of the howtos"
  ], 
  "revision_id": "371075"
 }
]