[
 {
  "author": "rahul", 
  "date": "2006-01-29T16:48:35.610153Z", 
  "msg": [
   "In a stateless model, the Context, Evaluator and NotificationRegistry have no role to play in SCXML IO. Update the Digester to match the changes made to the object model in r373323.", 
   "The imports for o.a.c.s.{Context,Evaluator,NotificationRegistry} are no longer needed, which is a fair indication that we have the desired separation of concerns.", 
   "Changes make BZ # 38275 ([scxml] More Explicit Instructions on core-digester.html) mostly obsolete."
  ], 
  "revision_id": "373325"
 }, 
 {
  "author": "thorsten", 
  "date": "2006-01-29T16:42:44.057416Z", 
  "msg": [
   "FOR-798 Removing the dispatcher specific linkmap implementation (partial fix FOR-738)"
  ], 
  "revision_id": "373324"
 }, 
 {
  "author": "rahul", 
  "date": "2006-01-29T16:35:02.944333Z", 
  "msg": [
   "Clean the Commons SCXML object model of any stateful properties.", 
   "* Remove last known configurations from History objects", 
   "* Remove NotificationRegistry and RootContext from SCXML objects", 
   "* Remove Context from State objects", 
   "* Remove NotificationRegistry from Transition objects", 
   "* Remove NotificationRegistry from TransitionTarget objects", 
   "Also remove the Observable interface. Implementing it ties the model elements to a particular NotificationRegistry."
  ], 
  "revision_id": "373323"
 }, 
 {
  "author": "hlship", 
  "date": "2006-01-29T16:06:35.918765Z", 
  "msg": [
   "Fix missing <description> element in RSS feed for product releases"
  ], 
  "revision_id": "373322"
 }, 
 {
  "author": "thorsten", 
  "date": "2006-01-29T15:57:43.384876Z", 
  "msg": [
   "FOR-801 - moving xsl from themes to the dispatcher. Since contracts are standalone the css is produced through its own forrest:view definition. Incooperates the work from kevin FOR-723. Further this commits activate and shows an example with the pelt.fv how to work with different output formats (resolving FOR-624). The branding-theme-profiler.ft moved to the css contracts and is obsolete (FOR-797)"
  ], 
  "revision_id": "373321"
 }
]