[
 {
  "author": "ltheussl", 
  "date": "2006-01-30T23:54:32.932144Z", 
  "msg": [
   "New maven.jdepend.dirs and maven.jdepend.components properties."
  ], 
  "revision_id": "373635"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-01-30T23:51:22.577361Z", 
  "msg": [
   "Modify to use the LoadBundle replacement for <f:loadBundle>.  Among other", 
   "things, this will make it straightforward to transliterate the MailReader", 
   "example for using Clay, where <f:loadBundle> has to be treated as a hack", 
   "since it is not actually a JSF component."
  ], 
  "revision_id": "373634"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-01-30T23:49:55.504775Z", 
  "msg": [
   "Improve usability of the LoadBundle and Messages helper classes, by explicitly", 
   "loading the default resource bundle if the requested one is not found.  This", 
   "needs to be reviewed to see if we should also do the \"strip suffixes\" trick", 
   "that ResourceBundle itself does (but only after explicitly finding a bundle", 
   "with the specified name, which is not particularly friendly).", 
   "Also, customize the Shale property resolver so that expressions like:", 
   "#{myLoadBundle['message.key']}", 
   "work instead of (actually, for backwards compatibility, in addition to):", 
   "#{myLoadBundle.map['message.key']}", 
   "In this way, you can directly substitute use of the LoadBundle helper class,", 
   "which makes the resources available to Java event handlers as well, by", 
   "simply removing all <f:loadBundle> tags from your JSP pages, and creating", 
   "a managed bean (typically in application scope) for the corresponding", 
   "\"var\" name."
  ], 
  "revision_id": "373633"
 }, 
 {
  "author": "akarasulu", 
  "date": "2006-01-30T23:46:31.440555Z", 
  "msg": [
   "make example exit when connection is lost"
  ], 
  "revision_id": "373632"
 }, 
 {
  "author": "sebor", 
  "date": "2006-01-30T23:30:07.838098Z", 
  "msg": [
   "2006-01-30  Martin Sebor  <sebor@roguewave.com>", 
   "STDCXX-34", 
   "* cstdint: Simplified.", 
   "* 8.cstdint.cpp: New test exercising tr.c99.cstdint."
  ], 
  "revision_id": "373631"
 }
]