[
 {
  "author": "pvillacorta", 
  "date": "2006-02-05T09:21:53.577036Z", 
  "msg": [
   "move setting \"maven.test.failure.ignore\" to test:test preGoal"
  ], 
  "revision_id": "374985"
 }, 
 {
  "author": "jm", 
  "date": "2006-02-05T08:55:56.954134Z", 
  "msg": [
   "promotions validated"
  ], 
  "revision_id": "374984"
 }, 
 {
  "author": "rahul", 
  "date": "2006-02-05T08:17:26.595639Z", 
  "msg": [
   "1) No longer using a flat document context.", 
   "2) Alphabetize imports in ActionsTest.", 
   "3) Rename ctx --> rootCtx as was more appropriate."
  ], 
  "revision_id": "374983"
 }, 
 {
  "author": "rahul", 
  "date": "2006-02-05T08:13:27.483680Z", 
  "msg": [
   "More helper methods for the utility class for the test cases."
  ], 
  "revision_id": "374982"
 }, 
 {
  "author": "rahul", 
  "date": "2006-02-05T08:07:00.779742Z", 
  "msg": [
   "Turn off a flat document variable context and turn on per state contexts as now required by the SCXML WD.", 
   "Some of the important side-effects brought around by this change are:", 
   "1) Variable resolution now bubbles up from local state up to document root.", 
   "2) For efficiency, contexts are created only on demand i.e. a state that has no variable declarations of its own does not need a context to store variables and one is not instantiated.", 
   "3) The two points above combine to give us an exception for (2) -- an ancestor state which doesn't have variable declarations but one or more of the states in its document subtree do, i.e. in this SCXML document (ASCII art warning)", 
   "root", 
   "/          \\", 
   "foo          bar", 
   "/       \\       /      \\", 
   "foo1     foo2     bar1*    bar2", 
   "if bar1 is the only state with variable declarations, bar and bar1 are guaranteed to have Contexts instantiated for them via the SCInstance (and the others are guaranteed to not have Contexts instantiated). bar1 since it needs a context for its variables, and a blank context in bar is essential for the recursion in variable resolution.", 
   "4) Going one step further, contexts are instantiated only if the owner state is visited in the course of the execution of the state machine. Thus, if the state bar1 above is never visited for a particular execution, then no contexts will be instantiated."
  ], 
  "revision_id": "374981"
 }
]