[
 {
  "author": "ekoneil", 
  "date": "2006-02-11T23:08:38.025990Z", 
  "msg": [
   "Add two Maven 2 artifacts to a sandbox/.", 
   "maven-apt-compiler: this is a Maven2 Compiler implementation that is derived from the Javac compiler.  Note, these files (AptCompiler and IsolatedClassLoader) preserve their MIT licenses and add an ASL 2.0 license.  They are from the Plexus infrastructure kept at codehaus.org.  I believe that they are acceptable to have committed to an ASF repo.  This module is documented in its README.txt file and can be built / installed locally in order to bulid Java source files with \"apt.exe\".", 
   "beehive-archetype-controls: this is a Maven2 archetype (project template) that includes a simple Control and a JUnit test.  Once built, it can be installed locally and used to create a new standalone Controls project.  This archetype depends on having built and installed the maven-apt-compiler as well.", 
   "Note, these do not include IDEA (or Eclipse) projects.  I expect that anyone interested in these will generate those locally.", 
   "BB: self", 
   "Test: none"
  ], 
  "revision_id": "377080"
 }, 
 {
  "author": "wrowe", 
  "date": "2006-02-11T23:08:31.986074Z", 
  "msg": [
   "Let's state some things more plainly, and provide some resources for users", 
   "to provide us unidiffs.  Failing that, make it clear that garbage just", 
   "isn't likely to be considered."
  ], 
  "revision_id": "377079"
 }, 
 {
  "author": "jkuhnert", 
  "date": "2006-02-11T22:57:45.806528Z", 
  "msg": [
   "Added a new property selection model class, more timetracker demo work"
  ], 
  "revision_id": "377078"
 }, 
 {
  "author": "davidw", 
  "date": "2006-02-11T22:53:05.529641Z", 
  "msg": [
   "Updated info, thanks to Jacopo Cappellato for the help."
  ], 
  "revision_id": "377077"
 }, 
 {
  "author": "davidw", 
  "date": "2006-02-11T22:52:09.638443Z", 
  "msg": [
   "Updated ofbiz status - thanks to Jacopo Cappellato for the help."
  ], 
  "revision_id": "377076"
 }
]