[
 {
  "author": "snoopdave", 
  "date": "2006-02-14T04:20:53.701556Z", 
  "msg": [
   "Fix for ROL-1026: problem with file-upload page on Mozilla"
  ], 
  "revision_id": "377610"
 }, 
 {
  "author": "djd", 
  "date": "2006-02-14T04:20:11.468033Z", 
  "msg": [
   "DERBY-176 DERBY-776 Add the initial utility code and split algorithm", 
   "to split a single generated method that execeeds the java virtual", 
   "machine limit of 65535 bytes of instructions. Allows the byte-code api", 
   "caller to generate code without worrying about exceeding the limit.", 
   "The initial split algorithm is the ability to split methods", 
   "that consist of multiple independent statements, seen by the stack", 
   "depth dropping to zero after a statement.", 
   "In the largeCodeGen test this change allowed the number of parameters", 
   "in the IN list query to increase from 3,400 to 97,000. The limit hit", 
   "at 98,000 was the number of constant pool entries."
  ], 
  "revision_id": "377609"
 }, 
 {
  "author": "damitha", 
  "date": "2006-02-14T04:14:01.272690Z", 
  "msg": [
   "On fixing Jira Axis2c-17"
  ], 
  "revision_id": "377608"
 }, 
 {
  "author": "cam", 
  "date": "2006-02-14T04:09:58.456695Z", 
  "msg": [
   "1. Fixed regression caused by last commit where scripts in a primary", 
   "document were not run.  The behaviour should now be as it should be:", 
   "primary documents and SVG 1.2 resource documents have their script run,", 
   "while SVG 1.1 resource documents do not."
  ], 
  "revision_id": "377607"
 }, 
 {
  "author": "rwatler", 
  "date": "2006-02-14T03:52:11.175782Z", 
  "msg": [
   "- fix DOS backslash path support in ant builds.", 
   "- remove explict local repository declarations for ant maven tasks: repository", 
   "settings seem to be inherited correctly from parent POM.", 
   "- set catalina 5.5 version in sample settings.xml.", 
   "- move JDBC system path dependencies to test profile to eliminate a system", 
   "path set via a property from the exported POMs that causes invalid POMs", 
   "upon being read from the repository."
  ], 
  "revision_id": "377606"
 }
]