[
 {
  "author": "zheng", 
  "date": "2006-02-17T11:19:09.814169Z", 
  "msg": [
   "Refactored portlet request/response impl."
  ], 
  "revision_id": "378485"
 }, 
 {
  "author": "rickhall", 
  "date": "2006-02-17T11:07:10.503399Z", 
  "msg": [
   "Modified Felix.setFrameworkStartLevel() to lock on the installed bundle", 
   "lock as well as lock the individual bundles before checking their start", 
   "level and determining whether to call startBundle()/stopBundle(). These", 
   "changes prevent bundles from being installed/uninstalled and individual", 
   "bundles' start level to be changed during a start level change operation.", 
   "Additionally, I added a separate lock for calculating bundle identifiers,", 
   "since this really doesn't need to share a lock with anyone else."
  ], 
  "revision_id": "378484"
 }, 
 {
  "author": "jlim", 
  "date": "2006-02-17T11:05:10.348589Z", 
  "msg": [
   "test case to check sending and receiving of messages inside a transaction (http://forums.activemq.org/posts/list/364.page)"
  ], 
  "revision_id": "378483"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-02-17T10:57:15.825004Z", 
  "msg": [
   "Initial support for XMP metadata (PDF 1.4) under fo:declarations. Both xmpmeta and RDF elements can be used as root elements for XMP metadata.", 
   "Extracted DOM2SAX functionality from XMLXMLHandler into utility class since it is now reused elsewhere.", 
   "New DOMBuilderContentHandlerFactory is used to create ContentHandlers that build generic DOMs.", 
   "New DelegatingContentHandler is a convenience base class modelled after XMLFilterImpl but as passive SAX receiver. It is used by DOMBuilderContentHandlerFactory.", 
   "Refactored FOTreeBuilder. FO tree building is now in a special ContentHandler which can be replaced temporarily when handling foreign XML like SVG or XMP. Extension Elements wanting the set their own ContentHandlers (instead of using the standard FO tree building mechanism) return a non-null value in getContentHandlerFactory(). The old mechanism is still supported (MathML, Plan and Barcode4J still use that). However, SVG support is changed to use a ContentHandlerFactory.", 
   "Extension elements for xmpmeta and RDF elements making use of the new DOM build-up using ContentHandlerFactory.", 
   "XMP metadata is passed to the renderer as ExtensionAttachment to the document. Only PDFRenderer uses the XMP extension attachment at this time.", 
   "The PDFRenderer automatically builds XMP metadata based on the basic metadata information in the PDFInfo object if no explicit XMP metadata has been added to the XSL-FO document.", 
   "XMP metadata merging is not implemented because this would involve a more sophisticated XMP infrastructure. That also means that XMP metadata is not validated. It's passed into the PDF as is.", 
   "The PDF library now provides the PDFMetadata class to embed XMP metadata in PDFs version >=1.4. stream contents use a special filter list which is initially empty, so non-PDF-aware XMP readers can extract (and optionally modify) the XMP metadata."
  ], 
  "revision_id": "378482"
 }, 
 {
  "author": "jstrachan", 
  "date": "2006-02-17T10:54:22.267892Z", 
  "msg": [
   "added base class for auto-generated test cases"
  ], 
  "revision_id": "378481"
 }
]