[
 {
  "author": "dandiep", 
  "date": "2006-02-24T17:38:19.135031Z", 
  "msg": [
   "[maven-release-plugin] prepare release XmlSchema-1.0"
  ], 
  "revision_id": "380725"
 }, 
 {
  "author": "stefan", 
  "date": "2006-02-24T17:37:20.253750Z", 
  "msg": [
   "fixing minor issues with recent changes in nodetype package (r377806)"
  ], 
  "revision_id": "380724"
 }, 
 {
  "author": "dreid", 
  "date": "2006-02-24T17:35:42.052397Z", 
  "msg": [
   "- add a feather icon to use for rss feeds. This was created by", 
   "Erik Abele (thanks!)", 
   "- add more data to rss feeds", 
   "- adjust where we get data from for rss feeds", 
   "- stop stripping so much data for release indexing as we don't need it", 
   "- add standards and maintainer info to the doap creation form", 
   "- add some faq items", 
   "- try and clarify how to use the doap form", 
   "- add links to the per project rss from their html pages. This was suggested by", 
   "Paul Querna.", 
   "This corrects the changes I made last night. Shouldn't try and make such changes", 
   "when I'm tired and in need of sleep!"
  ], 
  "revision_id": "380723"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-02-24T17:25:26.461509Z", 
  "msg": [
   "DERBY-515 Network Server should log server start and shutdown time to derby.log", 
   "Patch contributed by Deepa Remesh.", 
   "Summary of patch:", 
   "* Removes identical master files in DerbyNetClient and DerbyNet for", 
   "derbynet/NSinSameJVM.java and moves it the top master directory.", 
   "* Modified tools/release/build.xml to point to the new master file.", 
   "* Adds comments as to why CheapDateFormatter and GMT is used to format", 
   "timestamp. Moves formatting of timestamp to a method getFormattedTimestamp().", 
   "This will be helpful if timestamp is planned to be used for more messages", 
   "as Kathey indicated."
  ], 
  "revision_id": "380722"
 }, 
 {
  "author": "edwardsmj", 
  "date": "2006-02-24T17:20:50.565051Z", 
  "msg": [
   "Adding the new site layout, with src and target subtrees and POM and format compliant with Maven2"
  ], 
  "revision_id": "380721"
 }
]