[
 {
  "author": "hrabago", 
  "date": "2006-03-01T01:24:08.935901Z", 
  "msg": [
   "Add support for specifying validator parameters using nested s:validatorVar tags."
  ], 
  "revision_id": "381860"
 }, 
 {
  "author": "bandaram", 
  "date": "2006-03-01T01:23:44.959993Z", 
  "msg": [
   "DERBY-805: Apply Part I of the fix. Refer to JIRA for complete writeup", 
   "on all the phases. This Phase broadly addresses:", 
   "When remembering \"truly the best\" access path for an Optimizable, we have to", 
   "keep track of which OptimizerImpl the \"truly the best\" access is for.", 
   "In most queries there will only be one OptimizerImpl in question, but in", 
   "cases where there are nested subqueries, there will be one OptimizerImpl", 
   "for every level of nesting, and each OptimizerImpl might have its own", 
   "idea of what this Optimizable's \"truly the best path\" access path really is.", 
   "So whenever we save a \"truly the best\" path, we take note of which Optimizer", 
   "told us to do so.  Then as each level of subquery finishes optimization,", 
   "the corresponding OptimizerImpl can load its preferred access path into this", 
   "Optimizable's trulyTheBestAccessPath field and pass it up the tree, until", 
   "eventually the outer-most OptimizerImpl can choose to either use the best path", 
   "that it received from below (by calling \"rememberAsBest()\") or else use the", 
   "path that it found to be \"best\" for itself.", 
   "Submitted by Army Brown (qozinx@sbcglobal.net)"
  ], 
  "revision_id": "381859"
 }, 
 {
  "author": "felicity", 
  "date": "2006-03-01T01:19:09.653445Z", 
  "msg": [
   "put in my latest version of the scripts I use for nightly/weekly/devel runs"
  ], 
  "revision_id": "381858"
 }, 
 {
  "author": "brett", 
  "date": "2006-03-01T01:03:37.125715Z", 
  "msg": [
   "attach pom, don't deploy it separately"
  ], 
  "revision_id": "381857"
 }, 
 {
  "author": "clay", 
  "date": "2006-03-01T00:55:30.455343Z", 
  "msg": [
   "Switched forrestbot to transfer via svn instead of scp."
  ], 
  "revision_id": "381856"
 }
]