[
 {
  "author": "jsdelfino", 
  "date": "2006-03-01T07:51:22.767703Z", 
  "msg": [
   "show usage of WSDL2Java in the bigbank sample, the AccountService interfaces are now generated by WSDL2Java as part of the Maven build"
  ], 
  "revision_id": "381940"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2006-03-01T07:49:30.553415Z", 
  "msg": [
   "integrated SCA WSDL2Java tool with the Axis 2 WSDL2Java code generator - first stable version of the command line tool and Maven plugin"
  ], 
  "revision_id": "381939"
 }, 
 {
  "author": "jmarino", 
  "date": "2006-03-01T07:45:26.849945Z", 
  "msg": [
   "bug fix for down-scope references where target was being cached"
  ], 
  "revision_id": "381938"
 }, 
 {
  "author": "kmarsden", 
  "date": "2006-03-01T07:29:33.893872Z", 
  "msg": [
   "DERBY-1002 - Check that DRDAStatement and DRDAResultSet states are reset when they are re-used", 
   "Contributed by Deepa  Remesh", 
   "Please take a look at following two patches - patch 1 contains code changes and patch 2 contains tests. These have to be committed together.", 
   "------------------------------------------", 
   "1. derby1002-patch1-v1", 
   "------------------------------------------", 
   "* Adds reset() methods to DRDAStatement and DRDAResultSet objects. The purpose of reset method is to reset the states of all variables so that the objects can be re-used and will not have left-over states.", 
   "* In case of DRDAStatement, the following variables are not reset:", 
   "+ * 1. database - This variable gets initialized in the constructor and by", 
   "+ * call to setDatabase.", 
   "+ * 2. members which get initialized in setPkgnamcsn (pkgnamcsn, pkgcnstkn,", 
   "+ * pkgid, pkgsn, isolationLevel, cursorName). pkgnamcsn is the key used to", 
   "+ * find if the DRDAStatement can be re-used. Hence its value will not change", 
   "+ * when the object is re-used.", 
   "* close() methods are changed to only close and dereference objects.", 
   "* DRDAStatement.rsClose() method is not used in close() or reset(). This method has some checks which were causing the method to return without resetting currentDrdaRs. Now, close() calls currentDrdaRs.close() and reset() calls currentDrdaRs.reset().", 
   "* In Database.newDrdaStatement, close() method is called followed by reset() when the server finds the statement can be re-used.", 
   "------------------------------------------", 
   "2. derby1002-patch2-v2", 
   "------------------------------------------", 
   "Modifies test lang/procedure.java. Adds a method 'setupStatementReuse' which creates and uses statements in such a way as to provoke re-use of statements and result sets on network server. This method is called from tests for jira-491 and 'testImplicitClose'.", 
   "------------------------------------------------------------------------------------", 
   "Remaining TODOs for DERBY-1002", 
   "------------------------------------------------------------------------------------", 
   "* pkgcnstkn, pkgid, pkgsn variables can be removed from DRDAStatement since these are derived from pkgnamcsn object.", 
   "* Look into what is required by initialize() of default statement. Currently, initialize just calls setTypDefValues(). Once the purpose of this method is confirmed, we may need to modify the comments at places it is currently called."
  ], 
  "revision_id": "381937"
 }, 
 {
  "author": "wrowe", 
  "date": "2006-03-01T07:03:13.079662Z", 
  "msg": [
   "This patch needs additional pairs of eyeballs before considering", 
   "for backport.  We bucket the bytecount results from ReadFile and", 
   "GetOverlappedResult into a true DWORD buffer, and then pass that", 
   "value across to the apr_size_t *nbytes argument, which on Win64", 
   "is a quadword.  Please vote for correctness."
  ], 
  "revision_id": "381936"
 }
]