[
 {
  "author": "rajdavies", 
  "date": "2006-03-03T17:20:19.173141Z", 
  "msg": [
   "Added methods to create/destroy durable subscriber"
  ], 
  "revision_id": "382890"
 }, 
 {
  "author": "epunzalan", 
  "date": "2006-03-03T17:12:31.848048Z", 
  "msg": [
   "Brought back maven deps to 2.0.1 since the parent have depMngt set to 2.0.1... which allowed me to use a better method available in 2.0.1"
  ], 
  "revision_id": "382889"
 }, 
 {
  "author": "jstrachan", 
  "date": "2006-03-03T17:08:40.399435Z", 
  "msg": [
   "fixed NPE"
  ], 
  "revision_id": "382888"
 }, 
 {
  "author": "klute", 
  "date": "2006-03-03T16:57:55.963322Z", 
  "msg": [
   "* Writing support added to the SummaryInformation and DocumentSummaryInformation classes. These classes now have methods for setting and removing properties. Coherent extensions are:", 
   "** Documentation section about writing standard properties added to the HPSF HOW-TO.", 
   "** Example application added showing how to modify the document summary information.", 
   "** Testcases added for testing modifying summary information and document summary information.", 
   "** PropertySetFactory extended to create SummaryInformation and DocumentSummaryInformation instances.", 
   "* Added MutablePropertySet.write(DirectoryEntry, String) to ease writing a property set to a POI filesystem document.", 
   "* Improved codepage handling.", 
   "* Bug fixed: Integral values were read and written as unsigned instead of signed.", 
   "* Reworked the mapping between variant types and Java types: Variant.VT_I4 is mapped to Integer now and Variant.VT_I8 to Long. This might cause incompatibilities if you are doing low-level HPSF programming.", 
   "* Changed SectionIDMap.DOCUMENT_SUMMARY_INFORMATION_ID from a byte[] to a byte[][] in order to contain the format ID of the first and the second section. This is an incompatible change!", 
   "* Added PropertySet.getFirstSection(). This method is similar to getSingleSection() won't choke if the property set has more than one section.", 
   "* Support for low-level reading and writing of Variant.VT_I8 type properties added.", 
   "* Unnecessary casts removed.", 
   "* Poibrowser's display format changed slightly."
  ], 
  "revision_id": "382887"
 }, 
 {
  "author": "jstrachan", 
  "date": "2006-03-03T16:57:49.529486Z", 
  "msg": [
   "fixed bug if the connection factory already has a clientId configured"
  ], 
  "revision_id": "382886"
 }
]