[
 {
  "author": "sanka", 
  "date": "2006-03-05T04:44:27.647619Z", 
  "msg": [
   "Renaming doc to docs"
  ], 
  "revision_id": "383280"
 }, 
 {
  "author": "mc", 
  "date": "2006-03-05T04:40:18.624885Z", 
  "msg": [
   "The MapredLoadTest now has an extra step, to exercise", 
   "the case where we have multiple reduce tasks.", 
   "It used to have two stages: one job that created a huge", 
   "file of numbers in random order, followed by a job that", 
   "would read that file and count the numbers.  If the final", 
   "count was correct, the test passed.", 
   "Unfortunately, neither of these jobs had a reduce task", 
   "that was greater than 1.", 
   "So now we've got three stages.  The first stage is", 
   "unchanged.  The second stage reads the big file, then", 
   "emits the answer key split into 10 parts, one for each", 
   "reduce task.  then a third stage merges those parts into", 
   "a final number count.  As before, if that final count", 
   "is correct, all is well."
  ], 
  "revision_id": "383279"
 }, 
 {
  "author": "rooneg", 
  "date": "2006-03-05T04:33:44.483951Z", 
  "msg": [
   "Stop holding open connections to the backend fastcgi processes.  At", 
   "this point we lack a good way to manage them, and thus it's really", 
   "easy to end up with situations where you get weird timeouts because", 
   "other worker process are holding all the connections open.", 
   "This allows Rails applications to reliably work with mod_proxy_fcgi.", 
   "* modules/proxy/mod_proxy_fcgi.c", 
   "(dispatch): Add a timeout for our poll.  This should be controlled", 
   "by a config option of some sort, but for now just hardcode it.", 
   "(proxy_fcgi_handler): Set close_on_recycle to 1, so we don't hold", 
   "open connections to the fastcgi processes."
  ], 
  "revision_id": "383278"
 }, 
 {
  "author": "samisa", 
  "date": "2006-03-05T04:07:30.131085Z", 
  "msg": [
   "Fixed the LOG macros"
  ], 
  "revision_id": "383277"
 }, 
 {
  "author": "samisa", 
  "date": "2006-03-05T04:05:28.023218Z", 
  "msg": [
   "Fixed AXIS2C-89. There was a double free of om_builder"
  ], 
  "revision_id": "383276"
 }
]