[
 {
  "author": "olegk", 
  "date": "2006-03-14T19:25:26.121431Z", 
  "msg": [
   "More test coverage"
  ], 
  "revision_id": "385860"
 }, 
 {
  "author": "djd", 
  "date": "2006-03-14T19:18:37.716433Z", 
  "msg": [
   "DERBY-623 Change BaseMonitor to use privileged blocks for reading derby.debug.* system properties", 
   "and also removing the workaround permissions granted in 'derby_tests.policy'."
  ], 
  "revision_id": "385859"
 }, 
 {
  "author": "sboden", 
  "date": "2006-03-14T19:16:29.693787Z", 
  "msg": [
   "Fixup of insert example"
  ], 
  "revision_id": "385858"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-03-14T19:11:46.229622Z", 
  "msg": [
   "DERBY-1080: Connection reset when using security mechanism=EUSRIDPWD results in protocol error", 
   "Patch contributed by Sunitha Kambhampati", 
   "For eusridpwd case, the client sends the encrypted userid and password", 
   "sectkns as part of SECCHK. The protocol error was happening because we", 
   "only read the 2 sectkns if the database.decryptedUserId ,", 
   "database.decryptedPassword is null, otherwise we think we have already", 
   "read this. Thus on a connection reset,if the decryptedUserId and", 
   "decryptedPassword are not reset, server assumes we have seen more SECTKN's", 
   "and thus we throw error too many codepoints.", 
   "Patch adds", 
   "-- code to reset the security mechanism related variables on a connection re-use", 
   "-- regression test to testSecMec.java"
  ], 
  "revision_id": "385857"
 }, 
 {
  "author": "cutting", 
  "date": "2006-03-14T19:03:09.312524Z", 
  "msg": [
   "Fix tasktracker to exit when errors are encountered reading map output, in order to force re-execution of map tasks.  It's overkill, since it will re-compute all map output computed by that task tracker, not just that which could not be read, but this should be a rare situation.  If we start seeing it frequently, then we could optimize this by adding a way to tell the jobtracker that a particular previously completed map task now needs to be re-executed."
  ], 
  "revision_id": "385856"
 }
]