[
 {
  "author": "cschoett", 
  "date": "2006-03-14T17:28:37.059405Z", 
  "msg": [
   "Fix for BEEHIVE-1079, small tweak to the ControlBean.vm template, added unit tests."
  ], 
  "revision_id": "385840"
 }, 
 {
  "author": "fhanik", 
  "date": "2006-03-14T17:22:04.492152Z", 
  "msg": [
   "Implemented a blocking IO receiver, threaded"
  ], 
  "revision_id": "385839"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-03-14T17:17:31.617912Z", 
  "msg": [
   "Add both a command pattern and chain of responsibility pattern to NetUI.  These patterns define commands and chains of commands that can be executed at various extension points in the framework to support adding arbitrary user code / extensions.  The included source isn't used anywhere yet (that's coming), but it does include the ability to define a catalog of chains / commands inside of the beehive-netui-config.xml file.", 
   "This <catalog> element is parsed with the CatalogParser which is invoked from the NetUIConfigParser.  Once the <catalog> has been parsed, a CatalogConfig object is available from the NetUIConfig object and can be converted into a Catalog object using the CatalogFactory.  The CatalogFactory stores Catalogs of commands / chains as objects cached by the ClassLoader.", 
   "Arbitrary properties can be set on a Command by defining <custom-property> elements in the XML file; the framework uses commons-beanutils to map these property names onto JavaBean properties defined by the Command itself.", 
   "This change includes a set of JUnit tests for manually configuring commands / chains and for parsing them from an XML definition.", 
   "BB: self", 
   "Test: dist test pass"
  ], 
  "revision_id": "385838"
 }, 
 {
  "author": "", 
  "date": "2006-03-14T17:11:35.923883Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "385837"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-03-14T17:10:47.358837Z", 
  "msg": [
   "Fixup two build files to remove dependencies on some Maven2 files that have been deleted.", 
   "BB: self", 
   "Test: dist test pass"
  ], 
  "revision_id": "385836"
 }
]