[
 {
  "author": "stevel", 
  "date": "2006-03-16T14:00:00.498048Z", 
  "msg": [
   "No, it isnt the fact that I declare things through a property file either."
  ], 
  "revision_id": "386330"
 }, 
 {
  "author": "stevel", 
  "date": "2006-03-16T13:54:03.424219Z", 
  "msg": [
   "Matt's proof my bug doesnt exist, as a unit test. Given the bug doesnt exist, w.t.f. is wrong with my task?"
  ], 
  "revision_id": "386329"
 }, 
 {
  "author": "thorsten", 
  "date": "2006-03-16T13:51:56.584240Z", 
  "msg": [
   "Extending the put.java of the webdav usecase. You can now add any file via PUT. Still there is a problem how lenya stores the final file. It uses the xml extension for all files. I tried with PUT a png and in will be saved like {name}/index_{lang}.xml. I can open it with Gimp but Lenya will fail to open the document complaining about 'Invalid byte 1 of 1-byte UTF-8 sequence.'"
  ], 
  "revision_id": "386328"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-03-16T13:51:14.068091Z", 
  "msg": [
   "Added support for fixed-width spaces and kerning.", 
   "Note: letter-spacing is still implemented as before. Fixing this cannot be done without looking at space resolution as a whole on inline level.", 
   "The Character area tree object is now deprecated. Normal Text objects should be used to keep renderers simpler.", 
   "Introduced FontResolver interface to remove the dependency of FOUserAgent into the font package.", 
   "Added kerning information to the base14 fonts, Helvetica and Times. By default it is not used to keep the status-quo. Enable base14 kerning through the FOUserAgent (FopFactory after the API finalization).", 
   "Restored the production of EPS images in PDF output as PostScript XObjects.", 
   "Restored functionality for a more compact format for the area tree renderer to save space.", 
   "LayoutEngineTester slightly changed to allow for configuration values from the XML file. For now, only enabling base14 kerning is supported.", 
   "Removed duplicate offset variable in SpaceArea."
  ], 
  "revision_id": "386327"
 }, 
 {
  "author": "yoavs", 
  "date": "2006-03-16T13:50:50.851560Z", 
  "msg": [
   "Add note about native connector version in 5.5.16."
  ], 
  "revision_id": "386326"
 }
]