[
 {
  "author": "dinesh", 
  "date": "2006-03-19T18:43:41.670414Z", 
  "msg": [
   "added a method to get encoding method"
  ], 
  "revision_id": "387015"
 }, 
 {
  "author": "nick", 
  "date": "2006-03-19T18:43:40.180110Z", 
  "msg": [
   "Update docs with info on new code"
  ], 
  "revision_id": "387014"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-03-19T18:39:54.392957Z", 
  "msg": [
   "Test run that re-organizes the petstoreWeb to have the Page Flow source files live in the web/ directory rather than the src/ directory.  This fits more with the style of Eclipse's WTP project model and Maven's.", 
   "Feedback welcome...", 
   "BB: self", 
   "Test: distribution test pass"
  ], 
  "revision_id": "387013"
 }, 
 {
  "author": "wsmoak", 
  "date": "2006-03-19T18:30:17.780050Z", 
  "msg": [
   "Exclude the JSF RI and Creator 2 jars from the shale-dependencies distribution."
  ], 
  "revision_id": "387012"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-03-19T18:24:03.527431Z", 
  "msg": [
   "Change the NetUI coreWeb build so that it's incremental.  Note, tihs no longer uses the <build-controls> and <build-pageflows> macros and instead calls the <apt> macro directly.", 
   "The reason for this is that in order to process annotations and build the .java sources from web/ and src/ at once, both the controls and page flow annotation processors need to run at the same time.  Otherwise, the <build-controls> macro runs first, processing annotations and compiling.  Then, the <build-pageflows> macro runs and doesn't perform annotation processing for files that are already .class files.  The result was that only a subset of the struts-config-*.xml files were produced.", 
   "With this change, both annotation processors are in the \"build\" classpath and the webapp builds in one <apt> pass taking about 2 minutes on decent hardware.  Incremental build works as well.", 
   "BB: self", 
   "Test: NetUI tests pass, distribution tests pass"
  ], 
  "revision_id": "387011"
 }
]