[
 {
  "author": "thorsten", 
  "date": "2006-03-21T18:46:12.394770Z", 
  "msg": [
   "Using fallback:// to determine the menu location"
  ], 
  "revision_id": "387600"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-03-21T18:36:49.188917Z", 
  "msg": [
   "DERBY-668: SysInfo does not print the right info in class loader scenarios", 
   "This change modifies the sysinfo tool to print additional information about", 
   "the classes and jars that it examines. For each class that sysinfo examines,", 
   "it now calls getProtectionDomain().getCodeSource() to retrieve information", 
   "about the source of that file, which might be: an entry in the application", 
   "classpath, an entry in a class loader location list, a jar fetched due to", 
   "being listed in the manifest entry of another jar, a standard extension", 
   "in the JRE's extensions directory, a jar installed into the application", 
   "server, or any of various other possibilities.", 
   "The additional information about the class's origin is displayed in the", 
   "sysinfo output.", 
   "Note that when sysinfo runs under a Java security manager, it may need", 
   "special permissions to access this additional information, including the", 
   "permission to read the java.class.path property, and the permission to", 
   "call getProtectionDomain on a class. If sysinfo is not granted these", 
   "permissions, it will display an error message about the security problem", 
   "in place of displaying the class origin information."
  ], 
  "revision_id": "387599"
 }, 
 {
  "author": "gnodet", 
  "date": "2006-03-21T18:25:46.955052Z", 
  "msg": [
   "SM-358: NullPointerException in WSIFMarshaller.isSimpleType()", 
   "Patch provided by Ken Berthelot"
  ], 
  "revision_id": "387598"
 }, 
 {
  "author": "jim", 
  "date": "2006-03-21T18:21:28.117019Z", 
  "msg": [
   "Now that we are doing this in AprEndpoint, no need to", 
   "force it here."
  ], 
  "revision_id": "387597"
 }, 
 {
  "author": "fhanik", 
  "date": "2006-03-21T18:18:15.802110Z", 
  "msg": [
   "Fixed deadlock in the RPC channel, responses can not be sent with ACK, cause everyone ends up waiting for ACKs"
  ], 
  "revision_id": "387596"
 }
]