[
 {
  "author": "chinthaka", 
  "date": "2006-03-23T05:59:43.735999Z", 
  "msg": [
   "Adding build scripts for release"
  ], 
  "revision_id": "388055"
 }, 
 {
  "author": "sanka", 
  "date": "2006-03-23T05:56:46.894273Z", 
  "msg": [
   "adding download.xml"
  ], 
  "revision_id": "388054"
 }, 
 {
  "author": "dreid", 
  "date": "2006-03-23T05:47:00.677878Z", 
  "msg": [
   "- add server.cnf", 
   "- update links so they work correctly for navigation", 
   "- add more detail to cps document"
  ], 
  "revision_id": "388053"
 }, 
 {
  "author": "deepal", 
  "date": "2006-03-23T05:43:49.032617Z", 
  "msg": [
   "-small web app modification"
  ], 
  "revision_id": "388052"
 }, 
 {
  "author": "kmarsden", 
  "date": "2006-03-23T05:39:57.174839Z", 
  "msg": [
   "DERBY-1075 - Combine the script and the test available for upgrade testing into a java test", 
   "Intial checkin.  This is a work in progress.", 
   "Contributed by Deepa Remesh", 
   "Attaching a patch 'derby-1075-v1.diff'. This patch is based on the draft patch with some additional changes.", 
   "Summary of patch:", 
   "1. Creates a class UpgradeTester which does the following:", 
   "* Creates two class loaders using the jar locations provided for old and new release", 
   "* Switches between these two class loaders to run the different upgrade phases with old or new release.", 
   "* This class can be used to write tests for upgrades from different releases.", 
   "2. Adds a new test Upgrade_10_1_10_2 which uses UpgradeTester to test upgrade from 10.1 to 10.2. This test has not been added to any suite. Till the jars from previous release are available in svn, the test has to be run manually using the command:", 
   "java org.apache.derbyTesting.functionTests.tests.upgradeTests.Upgrade_10_1_10_2 <location of old jars> <location of new jars>", 
   "e.g, java org.apache.derbyTesting.functionTests.tests.upgradeTests.Upgrade_10_1_10_2 C:\\derby\\10.1\\lib C:\\derby\\trunk\\lib", 
   "Also, there are some issues in running the test using the harness because of use of security manager. These are mentioned in http://www.nabble.com/Upgrade-test-and-security-permissions-p3517019.html. Any suggestions to resolve these are welcome. I am planning to open separate sub-task for making this test run with a security manager.", 
   "3. Creates a new package upgradeTests under org.apache.derbyTesting.functionTests.tests. This package is for UpgradeTester class and the individual upgrade tests.", 
   "4. Adds a master 'Upgrade_10_1_10_2.out'. I have tried to reduce the diffs by doing version check in the code and removing reference to local machine paths. Still, there are few more diffs. I am planning to look at these once this patch is reviewed/committed."
  ], 
  "revision_id": "388051"
 }
]