[
 {
  "author": "rahul", 
  "date": "2006-03-25T00:01:58.079455Z", 
  "msg": [
   "* Correct behavior (short-circuit EventDispatcher, raise derived event) for the <send> element for special case when:", 
   "- targettype is \"scxml\"", 
   "- target is empty", 
   "Thanks to Shylaja Kokoori for pointing out the issue and Mike Sparr for his suggestions.", 
   "* Define a new event type for internally raised error events. State machines can watch for these events and display error recovery behaviors.", 
   "* Add a test case that demonstrates this <send> usage. The state machine in this test case effectively runs itself (without external events) since all events are internally raised via the <send> usage mentioned above.", 
   "* Also corrected typos in actions-test.xml"
  ], 
  "revision_id": "388680"
 }, 
 {
  "author": "remm", 
  "date": "2006-03-24T23:59:49.717823Z", 
  "msg": [
   "- Remove commented out code."
  ], 
  "revision_id": "388679"
 }, 
 {
  "author": "fhanik", 
  "date": "2006-03-24T23:54:45.666870Z", 
  "msg": [
   "Added to do items"
  ], 
  "revision_id": "388678"
 }, 
 {
  "author": "chirino", 
  "date": "2006-03-24T23:41:23.115060Z", 
  "msg": [
   "- Switched the m2 builds to use maven-one-plugin so that the activeio jars can be used in the maven 1 build activemq is using.", 
   "- the m2 build now uses the same groupId that our m1 activemq build is using.  I know it's not the m2 way to name groups, we I'm willing to live with this until we are out of the incubator and using m2 to do builds by default.", 
   "- Ported activemq to use activeio 3.0-SNAPSHOT from activeio 2.1, since the 3.x stuff is in a new package space, it should not conflict with previous version (for example the version used in Geronimo)."
  ], 
  "revision_id": "388677"
 }, 
 {
  "author": "shinsuke", 
  "date": "2006-03-24T23:38:22.722490Z", 
  "msg": [
   "Fixed a garbage character on ja and zh(from 387406). Fixed. For zh, if you find a garbage character, please let me know."
  ], 
  "revision_id": "388676"
 }
]