[
 {
  "author": "pkosiorowski", 
  "date": "2006-03-25T11:37:59.606188Z", 
  "msg": [
   "NUTCH-239 -  I changed httpclient to use javax.net.ssl instead of com.sun.net.ssl. (Jake Vanderdray)"
  ], 
  "revision_id": "388745"
 }, 
 {
  "author": "grahamd", 
  "date": "2006-03-25T11:24:10.998593Z", 
  "msg": [
   "The python_filter() function would only be called when Python*Filter is used", 
   "to register a filter and then Set*Filter or Add*Filter is used to trigger", 
   "the execution of that filter. Alternatively, it will be called when", 
   "req.register_*_filter() and req.add_*_filter() is used. In both cases", 
   "python_filter() should always be able to find a registered filter and if it", 
   "can't it is indicative of some sort of internal problem with Apache/mod_python.", 
   "This is the case with how ap_internal_fast_redirect() is used to implement", 
   "the DirectoryIndex directive with details of the handler for a mod_python", 
   "filter not being transfered from sub request to parent request. As such,", 
   "when a registered filter cannot be found it is really an error and so it", 
   "shouldn't be returning DECLINED but INTERNAL_SERVER_ERROR. Thus change code", 
   "to return an error and also log an explicit message indicating that a", 
   "registered filter couldn't be found. Note that even even if it were left to", 
   "return DECLINED in this case, Apache itself then in turn generates an", 
   "INTERNAL_SERVER_ERROR as no filter has properly executed, so the result is", 
   "no different, but having it return the error and log the message makes it", 
   "more explicit what is going on and the error log will indicate what the", 
   "problem is whereas Apache doesn't indicate what the problem is when it", 
   "generates the error making it hard for a user to work out what is going on."
  ], 
  "revision_id": "388744"
 }, 
 {
  "author": "dreid", 
  "date": "2006-03-25T11:20:23.522733Z", 
  "msg": [
   "- add a css file for the css docs"
  ], 
  "revision_id": "388743"
 }, 
 {
  "author": "pkosiorowski", 
  "date": "2006-03-25T11:19:31.888678Z", 
  "msg": [
   "Skipping post and nofollow outlinks"
  ], 
  "revision_id": "388742"
 }, 
 {
  "author": "reinhard", 
  "date": "2006-03-25T11:02:55.994330Z", 
  "msg": [
   "rename files as configuration files are not isolated in a monolthic Cocoon app"
  ], 
  "revision_id": "388741"
 }
]