[
 {
  "author": "rickhall", 
  "date": "2006-04-05T14:24:19.714674Z", 
  "msg": [
   "Added Shell GUI Plugin to the build process."
  ], 
  "revision_id": "391625"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-04-05T14:21:39.295074Z", 
  "msg": [
   "Improved JUnit report creation.", 
   "Added support for OutputIntent objects in PDF. When PDF/A-1b is activated OutputIntents are created and the sRGB color space is used by default (hardcoded for the moment for lack of better color infrastructure in FOP).", 
   "The sRGB color profile from HP (covering sRGB IEC61966-2.1) is now embedded in fop.jar as a resource so the PDF library can embed it. The sRGB profile from the Sun JRE is much bigger. That's why it's not used.", 
   "The Gladiator TrueType font (glb12.ttf) has been copied over from Batik and is used to verify PDF/A-1b's conformance checks.", 
   "CMYK JPEG image added to test resources so PDF/A-1b color space checks can be performed.", 
   "With the color space checks, support for PDF/A-1b is complete to the degree that FOP supports the creation of elements described in ISO 19005-1, except for the case where an embedded XMP packet is used in the fo:declarations element. In this case the metadata is not synchronized with the values in the Info PDF object which could lead to validation errors when checking for PDF/A-1b conformance."
  ], 
  "revision_id": "391624"
 }, 
 {
  "author": "rickhall", 
  "date": "2006-04-05T14:19:38.532897Z", 
  "msg": [
   "Added subproject for the Shell GUI Plugin, which contains some plugins for", 
   "the Shell GUI bundle for a simple GUI shell for Felix."
  ], 
  "revision_id": "391623"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-04-05T14:08:10.594729Z", 
  "msg": [
   "Reestablishing PDF 1.3 compatibility (\"Z\" is not available under JDK 1.3)."
  ], 
  "revision_id": "391622"
 }, 
 {
  "author": "husted", 
  "date": "2006-04-05T14:06:41.208659Z", 
  "msg": [
   "MailReader", 
   "* Change \"magic\" logon to text ExpiredPasswordException"
  ], 
  "revision_id": "391621"
 }
]