[
 {
  "author": "grahamd", 
  "date": "2006-04-09T09:21:17.681741Z", 
  "msg": [
   "A variable of type hl_entry was being used to copy pointer values of type", 
   "py_handler. Because of void* casting the code still worked fine, but the", 
   "mixing of pointer types could make someone looking at the code think", 
   "input/output filter lists held a data type different to what they actually", 
   "are."
  ], 
  "revision_id": "392695"
 }, 
 {
  "author": "rdonkin", 
  "date": "2006-04-09T09:10:09.914457Z", 
  "msg": [
   "Added back comment about other websphere versions that was removed by accident."
  ], 
  "revision_id": "392694"
 }, 
 {
  "author": "rdonkin", 
  "date": "2006-04-09T09:07:20.932070Z", 
  "msg": [
   "Fixed internal indexing. JRun ships JCL but may not use a custom implementation."
  ], 
  "revision_id": "392693"
 }, 
 {
  "author": "grahamd", 
  "date": "2006-04-09T08:58:35.921260Z", 
  "msg": [
   "The PythonImport directive makes use of the handler list data structure", 
   "even though it specifically is for a different purpose. The handler list", 
   "data structure needs to be changed a bit in order to support changes", 
   "required to address MODPYTHON-63 and MODPYTHON-126. These changes may", 
   "make it unusable in the way that the PythonImport directive was using it,", 
   "or at least it will not be a good match. The PythonImport directive has", 
   "therefore been modified to use a standard Apache table object thereby", 
   "allowing arbitrary changes to the handler list data structure to be made as", 
   "necessary.", 
   "Note that although the current Apache table implementation probably results", 
   "in module imports occuring in the order they appear in the Apache", 
   "configuration file, if how it is implemented is changed, this may no longer", 
   "be the case. This is not seen as an issue as the documentation for the", 
   "PythonImport directive does not give any guarantees about ordering of", 
   "imports within the context of a specific interpreter and it would be bad", 
   "practice for modules to rely on mod_python importing them in a specific", 
   "order. If there are ordering requirements, it should be dealt with internal", 
   "to the module being imported so that it is self contained."
  ], 
  "revision_id": "392692"
 }, 
 {
  "author": "gdamour", 
  "date": "2006-04-09T08:52:53.012497Z", 
  "msg": [
   "Test first that source needs to be copied to destination. Also fix another typo."
  ], 
  "revision_id": "392691"
 }
]