[
 {
  "author": "asmuts", 
  "date": "2006-04-10T15:48:21.889929Z", 
  "msg": [
   "I added the ability to not receive from the remote server.", 
   "You might want to do this for one primary reason.  If you", 
   "have an extremely high put low read region, then you don't want lots of chatter.", 
   "This new setting allows you to use the remote cache as an", 
   "easy remote store.  You can set you local memory size to 0 and then", 
   "use the remote cache backed by mysql as a remote store.  SInce you can cluster", 
   "the remote servers, you can have MYSQL replication using JCS. . . ."
  ], 
  "revision_id": "392975"
 }, 
 {
  "author": "rineholt", 
  "date": "2006-04-10T15:48:00.982119Z", 
  "msg": [
   "Adresses: http://issues.apache.org/jira/browse/TUSCANY-146", 
   "no sdo real type change to float"
  ], 
  "revision_id": "392974"
 }, 
 {
  "author": "reinhard", 
  "date": "2006-04-10T15:46:36.243208Z", 
  "msg": [
   "Only use BeanFactory instead of ConfigureableListeableBeanFactory which makes it much more complicated to write the SpringBridge because of the really fat interface; the only place that makes the ConfigureableListeableBeanFactory necessary, gets it by a cast to the BeanFactory --> the monoltitic app still works - within the Blocks-Fw this code should never be reached (DF/RP)"
  ], 
  "revision_id": "392973"
 }, 
 {
  "author": "mrglavas", 
  "date": "2006-04-10T15:44:08.184851Z", 
  "msg": [
   "Applying for fix for Bugzilla #37076 to tck-jaxp-1_2_0 branch:", 
   "http://issues.apache.org/bugzilla/show_bug.cgi?id=37076", 
   "Implementation-Vendor and Implementation-URL are supposed to specify which", 
   "organization maintains the implementation and where it can be downloaded, in", 
   "this case the ASF."
  ], 
  "revision_id": "392972"
 }, 
 {
  "author": "reinhard", 
  "date": "2006-04-10T15:42:03.445752Z", 
  "msg": [
   "add service declaration for SpringBridge (commented out as it is intested (DF/RP)"
  ], 
  "revision_id": "392971"
 }
]