[
 {
  "author": "jta", 
  "date": "2006-04-14T19:52:18.850312Z", 
  "msg": [
   "Catching two more files for the web site format change in revision 394177", 
   "that were generated to FORREST_HOME/main/site/releases."
  ], 
  "revision_id": "394180"
 }, 
 {
  "author": "aheritier", 
  "date": "2006-04-14T19:48:31.376115Z", 
  "msg": [
   "MAVEN-1753 : xerces (2.6.2) is back in the core"
  ], 
  "revision_id": "394179"
 }, 
 {
  "author": "ammulder", 
  "date": "2006-04-14T19:28:23.174275Z", 
  "msg": [
   "Editing keystores and Jetty HTTPS connectors based on keystores works"
  ], 
  "revision_id": "394178"
 }, 
 {
  "author": "jta", 
  "date": "2006-04-14T19:19:47.451925Z", 
  "msg": [
   "Addressing (partially) web site format issues raised by Dan Debrunner in [1]", 
   "and by Michelle Caisse in [2].", 
   "[1] http://mail-archives.apache.org/mod_mbox/db-derby-dev/200603.mbox/%3c442D6949.2070903@apache.org%3e", 
   "[2] http://mail-archives.apache.org/mod_mbox/db-derby-user/200604.mbox/%3c4431977A.9020406@sun.com%3e", 
   "The basic points:", 
   "(1) The \"Quick links\" subcategory on the home tab really should autoexpand", 
   "but can't because  http://issues.apache.org/jira/browse/FOR-339 feature", 
   "not implemented yet.", 
   "The resolution is to not have a Quick links subcategory on the home tab,", 
   "just a simple list.  But I'm leaving the subcategories in place on the", 
   "Resources tab because of the high number of items.", 
   "(2) A \"Quick Start\" entry on the home tab and its own tab is \"disconcerting\".", 
   "The resolution is to remove the link from the home tab -- it isn't needed", 
   "because the home page also links to it.", 
   "(3) Links on the home tab that are repeated on other tabs (for example, a", 
   "license link on the Download tab and an FAQs link on the Community tab)", 
   "cause a jump back to the home tab when the page is selected.", 
   "I agree this behavior is jarring, but don't see a way to avoid it. The", 
   "best near term solution is to not repeat links across tabs and to choose", 
   "carefully where those links should appear. I think \"license\" and \"FAQs\"", 
   "both need increased visibility, so left them on the home tab. I also left", 
   "\"Derby Wiki\" on the home tab because the Community tab has quite a few", 
   "items.", 
   "(4) Offsite links should open in a new window.", 
   "I haven't figured out a way to do that in the forrest menu; the forrest", 
   "class=\"fork\" style that works in the body of a page is accepted in the", 
   "site.xml but has no affect.", 
   "The best resolution for this for now is to remove those links, but for", 
   "another reason as well: keep the number of items on the home tab few", 
   "enough that people will notice what's there.", 
   "Not able to address yet:", 
   "On the download tab if you click on 10.1.2.1, the navbar collapses instead", 
   "of highlighting 10.1.2.1"
  ], 
  "revision_id": "394177"
 }, 
 {
  "author": "ate", 
  "date": "2006-04-14T19:08:00.414138Z", 
  "msg": [
   "Fixing JS2-511.", 
   "NPE's thrown from hashCode() methods as result of commons Digester trying to log (using .toString()) digested objects when logging level is set to DEBUG", 
   "See: http://issues.us.apache.org/jira/browse/JS2-511", 
   "Note: I saw a lot more \"interesting\" output in jetspeed.log with rootLogging level set to DEBUG ..."
  ], 
  "revision_id": "394176"
 }
]