[
 {
  "author": "bommel", 
  "date": "2006-04-22T10:17:13.360337Z", 
  "msg": [
   "added example for retrotranslater"
  ], 
  "revision_id": "396105"
 }, 
 {
  "author": "tcurdt", 
  "date": "2006-04-22T09:46:48.543158Z", 
  "msg": [
   "not needed"
  ], 
  "revision_id": "396104"
 }, 
 {
  "author": "olegk", 
  "date": "2006-04-22T09:37:46.818395Z", 
  "msg": [
   "Added a license link"
  ], 
  "revision_id": "396103"
 }, 
 {
  "author": "olegk", 
  "date": "2006-04-22T09:37:21.210464Z", 
  "msg": [
   "Added a license link"
  ], 
  "revision_id": "396102"
 }, 
 {
  "author": "erodriguez", 
  "date": "2006-04-22T09:00:03.221731Z", 
  "msg": [
   "Updated Apache Directory OSGi build to use Maven M2, latest MINA, latest Directory core and protocols, and Apache Felix:", 
   "o  Added Maven M2 POM's.  Removed all Maven 1 infrastructure.", 
   "o  Added a parent POM for building OSGi bundles.  This is *NOT* wired into the topmost Directory parent POM.", 
   "o  Updated to use latest MINA, refactored from ServiceRegistry to IoAcceptor.", 
   "o  Updated to use latest Directory, refactored to use recent package name changes.", 
   "o  Refactored to use Apache Felix Service Binder, refactored from org.ungoverned to org.apache.felix", 
   "o  Completed other refactoring from Oscar to Felix.", 
   "o  Added serialVersionUID's to satisfy compiler warnings.", 
   "o  Added log4j.properties to each bundle to make logging work.", 
   "TODO:", 
   "o  Test more and wire OSGi build parent POM into Directory parent POM.  Possibly merge directly into Directory artifacts.", 
   "o  Make logging its own library bundle and pull all logging dependencies out of individual bundles.", 
   "o  Update from Service Binder to OSGi R4 SCR now that Felix has a working SCR.", 
   "o  Migrate Config Admin service from Apache Directory to Apache Felix.  Directory bundles are CM-ready and will receive configuration from CM.  Dependency resolution is automatic with a Service Binder 0..n cardinality.", 
   "o  Figure out how to deploy Apache Felix \"strict modularity\" config.properties.  Felix system packages must include javax.naming, javax.naming.spi, javax.naming.directory, javax.naming.ldap, and javax.security.auth.kerberos."
  ], 
  "revision_id": "396101"
 }
]