[
 {
  "author": "dion", 
  "date": "2006-04-26T01:47:15.462221Z", 
  "msg": [
   "Checkstyle"
  ], 
  "revision_id": "397045"
 }, 
 {
  "author": "dion", 
  "date": "2006-04-26T01:25:57.237260Z", 
  "msg": [
   "Use StringBuffer rather than looping string concats"
  ], 
  "revision_id": "397044"
 }, 
 {
  "author": "bandaram", 
  "date": "2006-04-26T01:23:29.874259Z", 
  "msg": [
   "DERBY-805: Follow up patch to address remaining issues following Phase IV work.", 
   "1) Added logic to skip predicate pushdown when either of the predicate's column references does not point to a base table. This can happen if, for example, the column reference points to a literal or an aggregate expression. Further work is required for such situations in order to correctly \"remap\" the column reference to its source (or at least, to figure out what exactly it means to remap a ColumnReference that doesn't point to a base table, and then to implement the appropriate changes)--so in the meantime, I've just decided to skip pushing the predicate for now.", 
   "2) Added logic to correctly set the column number of a \"scoped\" reference based on whether or not the reference points to a base table. Existing comments in the relevant sections of code describe why we need to set the column numbers for references pointing to base tables, but the code itself didn't actually check for the base table condition--it set the column number for all scoped references, which wasn't always correct.", 
   "3) In cases where a ColumnReference's source ResultColumn's expression is not another ColumnReference, made it so that the scope operation will return a clone of ColumnReference (instead of the ColumnReference itself) since that ColumnReference will be pushed to two result sets.", 
   "4) Added corresponding test cases to the lang/predicatePushdown.sql test and updated the master file accordingly.", 
   "I ran derbyall on Red Hat Linux with ibm142 and saw no new failures.", 
   "Submitted by Army Brown."
  ], 
  "revision_id": "397043"
 }, 
 {
  "author": "dion", 
  "date": "2006-04-26T01:22:20.424901Z", 
  "msg": [
   "Add javadoc comment"
  ], 
  "revision_id": "397042"
 }, 
 {
  "author": "ekoneil", 
  "date": "2006-04-26T01:17:08.893042Z", 
  "msg": [
   "Code changes in core controls.  This moves the interceptor support methods off of ControlBeanContext and into their own InterceptorUtils class.  The old constant / static method will be deleted in a subsequent release.", 
   "BB: self", 
   "Test: Controls pass"
  ], 
  "revision_id": "397041"
 }
]