[
 {
  "author": "jmcconnell", 
  "date": "2006-05-04T17:01:09.084514Z", 
  "msg": [
   "merged -r397247:397248 and -r397244:397245 from trunk, the rename of the archetype and marchetype-10"
  ], 
  "revision_id": "399765"
 }, 
 {
  "author": "rahul", 
  "date": "2006-05-04T17:00:27.631924Z", 
  "msg": [
   "BZ 39450 [scxml] please add datamodel explanation and examples to user guide"
  ], 
  "revision_id": "399764"
 }, 
 {
  "author": "tmjee", 
  "date": "2006-05-04T17:00:09.941787Z", 
  "msg": [
   "changed nanocontainer-nanowar's version from 1.0 to 1.0-SNAPSHOT, cause", 
   "there's not yet a 1.0 release from CodeHaus, just pre 1.0, so that maven", 
   "will not complain when running some of its lifecycle."
  ], 
  "revision_id": "399763"
 }, 
 {
  "author": "jmitchell", 
  "date": "2006-05-04T16:57:46.413940Z", 
  "msg": [
   "Initial stab at TestGen4Web maven plugin.", 
   "I still need to provide detailed instructions (ya, it's on my todo list :) ), but basically, just do this:", 
   "- build and deploy the struts-blank.war sample app", 
   "- cd to this dir", 
   "- $mvn test", 
   "You'll see the dependencies downloaded and the test generated and run.  You'll also see the output as the test proceeds (assertions, etc), which is part of the underlying TestGen4Web sysouts.", 
   "If you feel really adventurous, install that ff plugin into your own ff and record your own steps and save it to src/main/scripts and run the test again.  Where I the most benefit with this new plugin is in doing 'smoke tests' of the same apps.  This can be an invaluable time saver during releases (assuming people go out and create a bunch of scripts agains the apps.", 
   "One more note, the actual plugin and pathes against the translator for TestGen4Web are not hosted here at Apache.  The plugin itself can be used against any url, web or local, and any language (Java/Servlet, Java/JSF, PHP, Perl, whatever).", 
   "Please give it a try.  Thanks."
  ], 
  "revision_id": "399762"
 }, 
 {
  "author": "jdcasey", 
  "date": "2006-05-04T16:57:20.083405Z", 
  "msg": [
   "Creating refactoring branch, to see if I can improve the design away from a couple of massive and virtually untestable abstract classes."
  ], 
  "revision_id": "399761"
 }
]