[
 {
  "author": "evenisse", 
  "date": "2006-05-18T15:49:18.661476Z", 
  "msg": [
   "Remove assert so it's more easy to test code coverage with clover"
  ], 
  "revision_id": "407575"
 }, 
 {
  "author": "evenisse", 
  "date": "2006-05-18T15:45:13.951579Z", 
  "msg": [], 
  "revision_id": "407574"
 }, 
 {
  "author": "cschoett", 
  "date": "2006-05-18T15:43:02.713071Z", 
  "msg": [
   "This commit fixes several issues with using the new ControlBeanContextSupport bean contexts.", 
   "The first issue is that when the WebContextFactoryProvider class is modified to use the o.a.b.c.r.webcontext bean context support", 
   "classes, only the top-level context (such as ServletBeanContext) actually uses these classes instead of the java.beans.beancontext", 
   "support classes.  This is because when a control bean is about to be added to a top-level context it first creates its control", 
   "bean context, however; since the top-level context does not have a parent, and can only invoke its getService() call for one of", 
   "its children (it doesn't have any at this point) so the cbc gets created with the default j.b.b support classes.  If that control", 
   "bean has nested controls within it, the nested control bean contexts are created with the proper o.a.b.c.r.webcontext support classes.", 
   "To fix this issue I have modified the ServletBeanContext class to override the ControlBeanContext.getService() method and to return", 
   "the proper factory type if the getService request cannot be handled by ControlBeanContext.getService().", 
   "Other issues:", 
   "-> I've also updated the ControlTestContainerContext to use the o.a.b.c.r.webcontext support classes, which involved pretty much", 
   "the same modification that was necessary for the ServletBeanContext.", 
   "-> There was another bug in ControlBeanContext where the serialization methods readObject() and writeObject() needed to be tweaked", 
   "to work correctly with the o.a.b.c.r.webcontext support classes.", 
   "-> Removed empty test from the SimpleSerializationTest."
  ], 
  "revision_id": "407573"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-05-18T15:42:39.683106Z", 
  "msg": [
   "Forgot to upload the new PCLElementMapping. Used so the PCL extension attributes are working."
  ], 
  "revision_id": "407572"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-05-18T15:41:22.463682Z", 
  "msg": [
   "Fix for TUSCANY-391", 
   "Patch applied"
  ], 
  "revision_id": "407571"
 }
]