[
 {
  "author": "ate", 
  "date": "2006-05-21T22:46:45.784293Z", 
  "msg": [
   "Adjusting portal junit tests for the PortletWindowAccessorImpl which now requires a reference to the PortletFactory as well as validates", 
   "PortletWindow and their PortletEntity against it."
  ], 
  "revision_id": "408515"
 }, 
 {
  "author": "ate", 
  "date": "2006-05-21T22:42:54.855709Z", 
  "msg": [
   "Automatically clear cached but no longer valid PortletWindow/PortletEntity instances.", 
   "A PortletEntity normally holds a reference to a PortletDefinition and its PortletApplication.", 
   "When a Portlet Application is restarted/redeployed with changes in its portlet.xml, the registry for it is updated.", 
   "Then, cached PortletWindow/PortletEntity instances still holding out-of-sync references to the \"old\" registry instances", 
   "may cause  rendering problems which can only be solved by restarting the portal!", 
   "Now, each PortletWindow and its PortletEntity instance will first be checked when retrieved from the cache and removed from it when out-of-sync.", 
   "Note: this is a light-weight validation checking if the referenced PortletApplication is registered in the PortletFactory (meaning its active/available).", 
   "These checks will have no real performance penalty for \"valid\" PortletWindows, only for \"offline\" Portlet Applications they will (need to) be recreated each and every time.", 
   "Warning: this change requires a mandatory change to the Spring assembly definition for the PortletWindowAccessorImpl (in jetspeed-spring.xml)."
  ], 
  "revision_id": "408514"
 }, 
 {
  "author": "sebb", 
  "date": "2006-05-21T22:38:19.450380Z", 
  "msg": [
   "No need for array to be public", 
   "[Findbugs]"
  ], 
  "revision_id": "408513"
 }, 
 {
  "author": "sebb", 
  "date": "2006-05-21T22:35:11.346529Z", 
  "msg": [
   "Remove useless log of array.toString()", 
   "[Findbugs]"
  ], 
  "revision_id": "408512"
 }, 
 {
  "author": "sebb", 
  "date": "2006-05-21T22:31:45.468956Z", 
  "msg": [
   "Calculation needs dbl variable", 
   "[Findbugs]"
  ], 
  "revision_id": "408511"
 }
]