[
 {
  "author": "kmarsden", 
  "date": "2006-05-25T21:15:22.208861Z", 
  "msg": [
   "DERBY-1148 Client XA getTransactionIsolation() does not return the correct isolation level when rejoining a global transaction", 
   "Contributed by Deepa Remesh", 
   "Summary of patch:", 
   "* Changes getTransactionIsolation method in org.apache.derby.client.am.Connection class to get the isolation level from server. The built-in function \"CURRENT ISOLATION\" is used for this. It throws SQLException in case of failures. At the start of the method, the current auto-commit value is stored in a variable. When executing the function, auto-commit is set to false. At the end of the method, auto-commit value is restored. As it is the client which drives the auto-commit, this strategy of locally changing the auto-commit works.", 
   "* Removes the excludes for DERBY-1148 and DERBY-1035 from checkDataSource test. Adds a test for transaction suspend/resume in checkDataSource test. Updates master files", 
   "With this patch, I have run derbynetclientmats with Sun jdk 1.4.2 on Windows XP. I also ran checkDataSource.java and checkDataSource30.java with embedded and client framework. No failures"
  ], 
  "revision_id": "409470"
 }, 
 {
  "author": "cschoett", 
  "date": "2006-05-25T21:12:50.817273Z", 
  "msg": [
   "Updated to check at runtime if Xmlbeans is available before adding xmlbean lookup."
  ], 
  "revision_id": "409469"
 }, 
 {
  "author": "elecharny", 
  "date": "2006-05-25T21:01:09.342547Z", 
  "msg": [
   "merging ldif modification into 1.0-trunks"
  ], 
  "revision_id": "409468"
 }, 
 {
  "author": "elecharny", 
  "date": "2006-05-25T21:00:43.480522Z", 
  "msg": [
   "merging ldif modification into 1.0-trunks"
  ], 
  "revision_id": "409467"
 }, 
 {
  "author": "kmarsden", 
  "date": "2006-05-25T20:59:02.081559Z", 
  "msg": [
   "DDERBY-1298 Tracing client data source gives NPE if all data source properties are not set", 
   "Contributed by Deepa Remesh"
  ], 
  "revision_id": "409466"
 }
]