[
 {
  "author": "rhillegas", 
  "date": "2006-06-06T21:42:45.340949Z", 
  "msg": [
   "DERBY-1253: Make UnsupportedVetter test smart enough to handle methods which change shape."
  ], 
  "revision_id": "412220"
 }, 
 {
  "author": "cutting", 
  "date": "2006-06-06T21:41:34.001494Z", 
  "msg": [
   "HADOOP-280.  Fix a typo in AllTestDriver."
  ], 
  "revision_id": "412219"
 }, 
 {
  "author": "bandaram", 
  "date": "2006-06-06T21:37:34.887369Z", 
  "msg": [
   "DERBY-1365: Fixes two minor problems with logic in Optimizer. Here is the note from contributor:", 
   "In addition to fixing the two issues described, the patch also resolves another potential problem: there are several places in OptimizerImpl.getNextPermutation() where calls to rewindJoinOrder() are made. These calls typically indicate that the optimizer has decided to abandon or \"short circuit\" a join order before calculating the full cost. For some of these calls--esp. the ones that can occur in the middle of the join order (as opposed to those which will only occur on a complete join order)--the \"rewind\" operation needs to make sure to reload the best plans for the optimizables that are pulled as part of the \"rewind\" process. Otherwise Derby could end up generating a plan for an optimizable even though that plan was part of a join order that was \"abandoned\" (i.e. rewound in the middle), which is logically incorrect and could lead to sub-optimal performance. I've included changes for this issue as part of d1365_v1.patch.", 
   "I ran derbyall on Red Hat Linux with d1365_v1.patch applied and saw no new failures. I would appreciate reviews/comments/commit if anyone has the time...", 
   "Submitted by Army Brown (qozinx@gmail.com)"
  ], 
  "revision_id": "412218"
 }, 
 {
  "author": "cutting", 
  "date": "2006-06-06T21:27:50.529858Z", 
  "msg": [
   "HADOOP-279.  Provide defaults for system properties used in log4j configuration.  Contributed by Owen."
  ], 
  "revision_id": "412217"
 }, 
 {
  "author": "jgbutler", 
  "date": "2006-06-06T21:15:28.912071Z", 
  "msg": [
   "Change for IBATIS-128.  No need to recurse through the super classes because addMethods() method already pulls in all methods from the superclasses."
  ], 
  "revision_id": "412216"
 }
]