[
 {
  "author": "ndbeyer", 
  "date": "2006-06-10T19:26:11.297091Z", 
  "msg": [
   "Apply patch for HARMONY-105."
  ], 
  "revision_id": "413355"
 }, 
 {
  "author": "kmarsden", 
  "date": "2006-06-10T19:10:35.075204Z", 
  "msg": [
   "DERBY-1327 Identity column can be created with wrong and very large start with value with \"J2RE 1.5.0 IBM Windows 32 build pwi32dev-20060412 (SR2)\" with JIT on", 
   "Contributed by Mamta Satoor", 
   "Attaching the patch for 10.1 codeline after doing a merge from main and hand fixing some of the conflicts. (The derbyall test suite ran fine with jdk13)", 
   "svn merge -r 413128:413129 https://svn.apache.org/repos/asf/db/derby/code/trunk/", 
   "One thing to note though is that in 10.1 codeline, the number of parameters to ColumnDescriptor constructors are 10 and not >10. So, from the bug diagnosis as mentioned in this JIRA entry, the bug should not have manifested in 10.1 codeline (the main codeline does have ColumnDscriptor constructor with >10 parameters).", 
   "Kathey verified that the issue reproduced without the patch and did not reprodcue after the patch BUT this issue should be left unresolved until we get clarification on the conditions where the JIT bug is triggered and know that this is a reliable workaround for the problem.", 
   "Kathey also manually merged the test which did not seem to merge properly with the patch."
  ], 
  "revision_id": "413354"
 }, 
 {
  "author": "baranda", 
  "date": "2006-06-10T19:01:24.877266Z", 
  "msg": [
   "Using the profile \"jsfri\" now it is possible to build the examples using the RI. Based on the pom.xml file from the shale project. Thanks! ;)"
  ], 
  "revision_id": "413353"
 }, 
 {
  "author": "ndbeyer", 
  "date": "2006-06-10T18:50:18.377505Z", 
  "msg": [
   "Apply patch for HARMONY-557."
  ], 
  "revision_id": "413352"
 }, 
 {
  "author": "tmjee", 
  "date": "2006-06-10T18:50:10.227090Z", 
  "msg": [
   "WW-1338", 
   "- <saf:div ..> tag should be able to not auto start and depend", 
   "make remote connection only when a topic of interest is received"
  ], 
  "revision_id": "413351"
 }
]