[
 {
  "author": "ruchithf", 
  "date": "2006-06-14T14:39:41.503319Z", 
  "msg": [
   "Build the rahas.mar when the maven module is built"
  ], 
  "revision_id": "414275"
 }, 
 {
  "author": "jorton", 
  "date": "2006-06-14T14:39:11.332904Z", 
  "msg": [
   "Update."
  ], 
  "revision_id": "414274"
 }, 
 {
  "author": "akarasulu", 
  "date": "2006-06-14T14:37:59.897626Z", 
  "msg": [
   "bypassing calls to backend in search and bind for noback-experiment"
  ], 
  "revision_id": "414273"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-06-14T14:34:29.477953Z", 
  "msg": [
   "Added initial support for PDF/X-3:2003 (ISO 15930-6:2003(E)).", 
   "Fixed bugs in PDF/A support: Transparency is now switched off and the CIDSet object is generated for CID fonts.", 
   "PDF/A and PDF/X are now \"profiles\" (see PDFProfile) which are used to control the allowed, required and forbidden features in PDF. PDF/A-1b and PDF/X-3:2003 can both be activated simultaneously as they are compatible.", 
   "For PDF/X, color handling has been improved a little (PDFColorSpace is now an interface, the old PDFColorSpace is now PDFDeviceColorSpace) and most importantly, the \"DefaultRGB\" color space is now mapped to the sRGB color space (for all colors in DeviceRGB) which ensures that all sRGB colors from XSL-FO are also sRGB colors in PDF which wasn't necessarily the case before.", 
   "For PDF/X, added support for a custom, non-sRGB output profile because PDF/X requires a \"Output Device Profile\" (which sRGB is not).", 
   "ICC profiles are now shared/cached among images.", 
   "Added support for fox:conversion-mode=\"bitmap\" in the PDFRenderer to handle SVGs with transparency when transparency is forbidden (PDF/X and PDF/A). Only drawback: the image is not combined with the background. An opaque bitmap with a white background is generated."
  ], 
  "revision_id": "414272"
 }, 
 {
  "author": "akarasulu", 
  "date": "2006-06-14T14:32:59.163296Z", 
  "msg": [
   "These are experimental branches where we removed the backend processing code", 
   "and are only returning the same canned responses to bind and search requests.", 
   "Here's the breakdown of each branch which will all be discarded:", 
   "noback: search and bind operations returned canned responses back to the client", 
   "so there is no backend access even though the backend code is still there", 
   "nocodec: just like noback but we omit the asn1 codec layer to send canned", 
   "responses that we've captured via ethereal."
  ], 
  "revision_id": "414271"
 }
]