[
 {
  "author": "foconer", 
  "date": "2006-06-20T06:22:35.931133Z", 
  "msg": [
   "changed http to https in scm connection."
  ], 
  "revision_id": "415515"
 }, 
 {
  "author": "wsmoak", 
  "date": "2006-06-20T06:18:00.734090Z", 
  "msg": [
   "New temporary location for the website, while we work out the remaining issues."
  ], 
  "revision_id": "415514"
 }, 
 {
  "author": "hindessm", 
  "date": "2006-06-20T06:15:32.884159Z", 
  "msg": [
   "Make use of properties (junit.jar) explicit."
  ], 
  "revision_id": "415513"
 }, 
 {
  "author": "rahul", 
  "date": "2006-06-20T06:06:49.913799Z", 
  "msg": [
   "Implemented <invoke> (Section 4.4) and its children <param> (Section 4.5) and <finalize> (Section 4.6) -- all sections from the January 06 W3C WD [ http://www.w3.org/TR/scxml/ ]. With this addition, Commons SCXML aligns with the Jan '06 WD.", 
   "The primary addition is the Invoker interface, which is used to define the possible interactions between the parent state machine (executor) and the types of invocable activities. Invocable activities must first register an Invoker implementation class for the appropriate \"targettype\" (attribute of <invoke>) with the parent SCXMLExecutor.", 
   "The communication link between the parent state machine executor and the invoked activity is a bi-directional events pipe. All events triggered on the parent state machine get forwarded to the invoked activity. The processing semantics for these events depend upon the \"targettype\", and thereby vary per concrete implementation of the Invoker interface.", 
   "The Invoker \"lifecycle\" is outlined below:", 
   "* Instantiation via Class.newInstance() (Invoker implementation requires accessible constructor).", 
   "* Configuration (setters for parent state ID and SCInstance).", 
   "* Initiation of invoked activity via invoke() method, passing the source URI and the map of params.", 
   "* Zero or more bi-directional event triggers.", 
   "* Either completion or cancellation.", 
   "These additions introduce backwards incompatible changes to the SCXMLSemantics interface (two new methods).", 
   "I will bring up the couple of open issues (such as event names TBD in WD and handling invocation failure) at the related W3C face to face meeting later this week."
  ], 
  "revision_id": "415512"
 }, 
 {
  "author": "trustin", 
  "date": "2006-06-20T06:02:18.006570Z", 
  "msg": [
   "Fixed issue: DIRMINA-222 (DatagramAcceptor doesn't configure a user-defined FilterChain configuration on bind.)", 
   "* Added buildFilterChain to DatagramAcceptor and DatagramConnector to reduce code duplication which caused this issue.", 
   "* Eventually, we need to refactor the NIO transport implementation."
  ], 
  "revision_id": "415511"
 }
]