[
 {
  "author": "brett", 
  "date": "2006-07-03T04:29:17.115919Z", 
  "msg": [
   "setup codehaus sync"
  ], 
  "revision_id": "418675"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-07-03T04:10:48.061762Z", 
  "msg": [
   "Re-wrote the create/update/deletePartyRelationship services to get around CLA issue with Christopher Worley; also cleaned up some of the PartyRelationship UI which had some bad labels and no way to not specify a security permission in the drop-down (I don't like the feature in the first place, let alone it being mandatory in the UI)"
  ], 
  "revision_id": "418674"
 }, 
 {
  "author": "smishura", 
  "date": "2006-07-03T02:59:36.544462Z", 
  "msg": [
   "Adjusting to conventions serialization tests for java.security package:", 
   "1) moving from api-injected to api tests", 
   "2) package: java.security.serialization -> o.a.h.security.tests.java.security.serialization", 
   "3) resource files: .dat -> .ser", 
   "Note: Not all tests were moved - some tests needs re-creation of golden data"
  ], 
  "revision_id": "418673"
 }, 
 {
  "author": "kmarsden", 
  "date": "2006-07-03T02:37:42.940313Z", 
  "msg": [
   "DERBY-578 - Grouped select from temporary table raises null pointer exception in byte code generator", 
   "DERBY-1464 - runtimestatistics can show that an index is being used even when it isn't", 
   "Contributed by Manish Khettry", 
   "The problem is simple enough-- we didn't have a conglomerate name for temporary tables. I fixed the code to behave more like what fillInScanArgs does.", 
   "Earlier, we would set the indexName field in DistinctScanResult to the conglomerate name (cd.getName()) used to scan the table. If the conglomerate was the base table itself then this was just plain wrong. The change, for this patch, passes null if no index is being used."
  ], 
  "revision_id": "418672"
 }, 
 {
  "author": "wsmoak", 
  "date": "2006-07-03T02:22:45.531852Z", 
  "msg": [
   "Reorganize the struts-build module and remove unused files.", 
   "SITE-7"
  ], 
  "revision_id": "418671"
 }
]