[
 {
  "author": "norman", 
  "date": "2006-07-03T06:42:27.645689Z", 
  "msg": [
   "Get sure the defualt handlers (minimum needed) get loaded.", 
   "Correct the hardcoded SMTPHandlerChain", 
   "Remove unneeded config stuff"
  ], 
  "revision_id": "418695"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-07-03T06:28:07.150309Z", 
  "msg": [
   "Updated a few files to clean URLs and such for the ofbiz incubator site; also now point to bigfiles.ofbiz.org for the big video files and such"
  ], 
  "revision_id": "418694"
 }, 
 {
  "author": "reinhard", 
  "date": "2006-07-03T06:19:09.295955Z", 
  "msg": [
   "add JUnit as test dependency"
  ], 
  "revision_id": "418693"
 }, 
 {
  "author": "kahatlen", 
  "date": "2006-07-03T06:14:07.703497Z", 
  "msg": [
   "DERBY-1364: Client driver does not roll back the effects of a stored", 
   "procedure when incorrectly invoked by executeQuery()/executeUpdate()", 
   "Description of the patch:", 
   "1. Checking of the number of result sets returned was moved from", 
   "executeUpdate/executeQuery to a point in flowExecute where the", 
   "transaction has not been auto-committed (otherwise, the transaction", 
   "would already be committed when the exception was raised).", 
   "2. If the number of result sets does not match the execute type and", 
   "auto-commit is enabled, the transaction is rolled back (otherwise,", 
   "the transaction would be committed when the Statement was closed or", 
   "re-executed).", 
   "3. All execute* methods in CallableStatement were removed since they", 
   "have become identical to the methods in PreparedStatement. (Or", 
   "almost identical. The methods in CallableStatement did not call", 
   "checkStatementValidity() on errors, but that's probably a bug.)", 
   "4. SQL state for error message in executeQuery() was changed to match", 
   "embedded (XJ201/XJ205 -> X0Y78). Updated English and Portuguese", 
   "messages to use the new SQL state (no other translations existed", 
   "for XJ201 and XJ205).", 
   "5. Added more rollback tests to jdbcapi/ProcedureTest.junit and", 
   "enabled all test cases for DerbyNetClient."
  ], 
  "revision_id": "418692"
 }, 
 {
  "author": "kahatlen", 
  "date": "2006-07-03T05:57:33.126038Z", 
  "msg": [
   "DERBY-1468: Server returns data when it receives a QRYROWSET value of", 
   "zero on an OPNQRY, which doesn't follow DRDA protocol.", 
   "The patch disables pre-fetching for LMTBLKPRC when QRYROWSET=0 and", 
   "adds a test case to the protocol test which sends an OPNQRY for a", 
   "scrollable cursor with QRYROWSET=0."
  ], 
  "revision_id": "418691"
 }
]