[
 {
  "author": "hindessm", 
  "date": "2006-07-07T14:14:54.094422Z", 
  "msg": [
   "Applied patch from \"[#HARMONY-789] logging.properties is missing in VM build\"."
  ], 
  "revision_id": "419895"
 }, 
 {
  "author": "jboynes", 
  "date": "2006-07-07T14:04:16.896621Z", 
  "msg": [
   "simplify classpath creation by using listFiles"
  ], 
  "revision_id": "419894"
 }, 
 {
  "author": "hughesj", 
  "date": "2006-07-07T14:02:13.695618Z", 
  "msg": [
   "Code to speed up the W3CFileRepository tests. If you have CVS extracted the W3C test schemas to the downloads/w3c-cache directory then those will be used instead of downloading each file from W3C every time you run the tests. Note: this is not an XML catalog, just a quick hack to speed the tests up a bit. The network is still used for files not retrieved from W3C CVS and also for any files imported by the W3C tests with an absolute URL (if any of those imports actually exist!).", 
   "NOTE: the W3C public CVS tree is available under the W3C software license. Please see here for a link to the license: http://dev.w3.org/cvsweb/", 
   "To create a local cache of the W3C files do this:", 
   "cd <woden root dir>/downloads", 
   "mkdir w3c-cache", 
   "cd w3c-cache", 
   "cvs -d:pserver:anonymous@dev.w3.org:/sources/public login", 
   "cvs -d:pserver:anonymous@dev.w3.org:/sources/public checkout 2002/ws/desc/test-suite/documents", 
   "run the Woden W3CTestSuiteTest as usual. I did a quick one-off comparison today and this improved the time to run the test from 38secs to 27secs. This will vary greatly depending on your network connection.", 
   "Note: if you run the tests and you haven't got a local cache, the tests will run as before direct from the cvsweb links."
  ], 
  "revision_id": "419893"
 }, 
 {
  "author": "jstrachan", 
  "date": "2006-07-07T14:00:46.562411Z", 
  "msg": [
   "allow subscriptions to catch all messages on all endpoints if no service/interface is specified. For background see: http://www.nabble.com/Capture-any-message-off-the-NMR--tf1902644.html#a5217738"
  ], 
  "revision_id": "419892"
 }, 
 {
  "author": "jboynes", 
  "date": "2006-07-07T13:53:13.281501Z", 
  "msg": [
   "do not cache the classloader as this should only be called once"
  ], 
  "revision_id": "419891"
 }
]