[
 {
  "author": "akarasulu", 
  "date": "2006-07-12T05:03:52.884955Z", 
  "msg": [
   "changes ....", 
   "o added additional configuration settings to control the server but soon I", 
   "realized that these settings belong in the ServerStartupConfiguration and", 
   "not the core StartupConfiguration", 
   "o added maxThreads, maxTimeLimit, and maxSizeLimit", 
   "o only maxThreads is implemented correctly and should work", 
   "o the others require some refactoring", 
   "o preparing to move configuration files to a new maven module or two", 
   "NOTE: core configuration and server configuration modules will be created to", 
   "centralize these beans and prevent a dependency nightmare"
  ], 
  "revision_id": "421120"
 }, 
 {
  "author": "wsmoak", 
  "date": "2006-07-12T04:49:11.641977Z", 
  "msg": [
   "Correct svn properties: keywords and eol-style.  No other changes."
  ], 
  "revision_id": "421119"
 }, 
 {
  "author": "djd", 
  "date": "2006-07-12T04:48:05.451956Z", 
  "msg": [
   "DERBY-1330 (partial) The patch gets rid of requirement of permission type along with the uuid to find a unique row.", 
   "Fixing this has in fact cleaned up the supporting code quite a bit. For instance, there is no need for special", 
   "class DDColumnPermissionDependableFinder or no need for a constructor in ColPermsDescriptor which takes permission", 
   "types in the form of an int. DDdependableFinder is much cleaner too with this patch. In addition, I have also created", 
   "a unique index on the uuid for these 3 system tables in order to quickly locate a row in those system tables.", 
   "Patch contributed by Mamta Satoor"
  ], 
  "revision_id": "421118"
 }, 
 {
  "author": "wsmoak", 
  "date": "2006-07-12T04:35:47.022622Z", 
  "msg": [
   "STR-2900 Fix Checkstyle errors in struts-core.", 
   "Submitted by: Frank Zammetti"
  ], 
  "revision_id": "421117"
 }, 
 {
  "author": "pgollucci", 
  "date": "2006-07-12T04:35:39.959008Z", 
  "msg": [
   "still need to look up the debugger name in the", 
   "hash, so we can still reuse similiar code for debuggers", 
   "with similiar syntax."
  ], 
  "revision_id": "421116"
 }
]