[
 {
  "author": "robbinspg", 
  "date": "2006-07-12T15:06:25.973252Z", 
  "msg": [
   "TUSCANY-534 Windows release build doc"
  ], 
  "revision_id": "421285"
 }, 
 {
  "author": "chirino", 
  "date": "2006-07-12T15:01:44.267212Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQ-773"
  ], 
  "revision_id": "421284"
 }, 
 {
  "author": "jim", 
  "date": "2006-07-12T15:01:15.263843Z", 
  "msg": [
   "It never fails. I sit on a patch for awhile and", 
   "it's not until almost right after I commit it that", 
   "I think \"hey, there's a better way to do that.\"", 
   "Anyway, I was never happy about the code", 
   "duplication of the primary/standby checks...", 
   "This fixes that."
  ], 
  "revision_id": "421283"
 }, 
 {
  "author": "chirino", 
  "date": "2006-07-12T14:58:33.230570Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQ-773"
  ], 
  "revision_id": "421282"
 }, 
 {
  "author": "djd", 
  "date": "2006-07-12T14:57:29.677797Z", 
  "msg": [
   "DERBY-551 (partial) This patch allows invoking procedures in triggered sql statement.", 
   "* Modifies the parser to allow call statement in the trigger action.", 
   "* Changes the validateStatement in InternalTriggerExecutionContext to catch following statements not allowed in triggers:", 
   "- DDL statements are not allowed in triggers. This was caught as an assert failure as this would be caught at compile time in case of direct use of DDL statements. Since use of DDL statement inside a procedure will not be caught at compile time, patch changes the assert to a SQLException.", 
   "- Insert, update, delete statements are not allowed in a before trigger. On the same lines, a procedure that modifies sql data should not be allowed in a before trigger. This is also caught at runtime. This uses the existing check in InternalTriggerExecutionContext.validateStatement. However, the existing check was limited to the trigger table. This check was modified to check for use of insert,update,delete statements on any table.", 
   "* Adds a new test lang/procedureInTrigger.sql to derbylang suite. The test is based on the scenarios in ' ProcedureInTrigger_Tests_v1.html'. Only one case (calling procedures that modify SQL data in before triggers) is handled differently by this patch. Trigger creation will pass but firing will fail. This behaviour will change once we move this check to compile time. So I have not modified the test case document. Also, I have not added the test cases for recursive triggers as I am not sure about the expected behaviour. This is being discussed as part of DERBY-1261 on derby-dev.", 
   "* Modifies tests and master files which used to check that call statement cannot be part of trigger action.", 
   "Patch contributed by Deepa Remesh - dremesh@gmail.com"
  ], 
  "revision_id": "421281"
 }
]