[
 {
  "author": "jkuhnert", 
  "date": "2006-07-15T18:19:11.500673Z", 
  "msg": [
   "Converted unit tests to new base tests/ testng"
  ], 
  "revision_id": "422275"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-07-15T18:03:47.815451Z", 
  "msg": [
   "just reviewing servlet code and doing a little bit of tidy up."
  ], 
  "revision_id": "422274"
 }, 
 {
  "author": "mturyn", 
  "date": "2006-07-15T17:22:41.070817Z", 
  "msg": [
   "All objects except the extensions/revisions of Zimbra classes* should", 
   "now be properly scoped within the scheme we've devised, with a", 
   "toplevel object \"xap\" and otherwise following the directory structure.", 
   "A lone exception is the Xap object itself, which is confusing given", 
   "that there's a \"xap\" object as well, so maybe we'll end up identifying", 
   "the two.", 
   "To this end, all files (except Zimbroid ones) are now loaded using", 
   "dojo.require(), as wrapped within Xap.require() so that we can", 
   "potentially do things like turning on Dojo's debugging switches, which", 
   "last will take more work.  Files must now also use dojo.provide() (via", 
   "Xap.provide()) let the Dojo loader know what's being loaded, which in", 
   "turn creates the objects scoping our classes, e.g. \"xap.xml.dom\".", 
   "HOW-TO:", 
   "All this was done with extensive use of regular expressions, first to", 
   "assemble a list of files that contained unscoped constructor", 
   "definitions (\"^[A-Z].*= *function.*=\"), using that to construct a", 
   "mapping /x/y/z/Foo.js-->(Foo, x.y.z.Foo) and then going through all", 
   "the files (using *ix shells' \"find\" or Windows' \"for /r in (*.js) do", 
   "\") and implementing all those mappings using \"sed\".", 
   "A lot of work is required afterward, but this creates a first draft", 
   "with a lower error-rate than (my) doing it by hand, and has the", 
   "advantage of being re-runnable if there's a foul-up later.", 
   "*Anything starting with \"Ajx\", or with \"Dwt\" and doesn't end with \"Bridge\"."
  ], 
  "revision_id": "422273"
 }, 
 {
  "author": "dennisl", 
  "date": "2006-07-15T17:21:00.504442Z", 
  "msg": [
   "Use a live JIRA report instead of the sample report"
  ], 
  "revision_id": "422272"
 }, 
 {
  "author": "dennisl", 
  "date": "2006-07-15T17:20:13.853034Z", 
  "msg": [
   "[MCHANGES-40] Documentation of changes plugin should be improved", 
   "Replace the sample-changes-report with a freshly generated one"
  ], 
  "revision_id": "422271"
 }
]