[
 {
  "author": "danj", 
  "date": "2006-07-17T03:28:44.058168Z", 
  "msg": [
   "The original OASIS WSDM 1.1 MUWS Part 2 WSDL does not include a portType for relationships resources. I have added a", 
   "barebones one whose WSRP doc is the RelationshipType (three properties) and which has the WSRP \"Get\" operations. This", 
   "can be used by users who want to expose the Relationships capability and need to have relationship ws-resource to", 
   "manipulate."
  ], 
  "revision_id": "422610"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-07-17T03:17:18.697298Z", 
  "msg": [
   "[SHALE-220] Resolve problems with the init() and destroy() methods being", 
   "called twice on a ViewController.", 
   "There were actually two related problems:", 
   "* The init() and destroy() methods were indeed being called twice.", 
   "This was due to a change in the implemented support for these calls", 
   "(the logic was migrated from ViewViewHandler to LifecycleListener),", 
   "without accounting for the fact that the view controller instance was", 
   "also being added as a reqeust scope attribute under the VIEW_RENDERED", 
   "constant as well (which triggered the init/destroy behavior again).", 
   "Fixed by storing the name of the corresponding managed bean, rather", 
   "than the managed bean itself.", 
   "* The postBack property was not correctly initialized before the", 
   "init() method was called, although it was set correctly before", 
   "the preprocess() method was called (if it was, indeed, a post back).", 
   "Fixed by initializing the postBack property in the constructor of", 
   "AbstractViewController, and ensuring that the relevant request scope", 
   "attribute was initialized before the managed bean was created.", 
   "While messing around with this functionality, I also took the", 
   "opportunity to isolate manifest constants that are internal to the", 
   "implementation out of org.apache.shale.view.Constants and into a private", 
   "package, so as to not confuse developers about what an application can", 
   "rely on.", 
   "Also, added a system integration test to the Use Cases example", 
   "application, to ensure the proper calling sequence of view controller", 
   "lifecycle events."
  ], 
  "revision_id": "422609"
 }, 
 {
  "author": "husted", 
  "date": "2006-07-17T03:16:26.036386Z", 
  "msg": [
   "Tagged Struts 1.3.5 at revision 422607"
  ], 
  "revision_id": "422608"
 }, 
 {
  "author": "husted", 
  "date": "2006-07-17T03:15:06.927563Z", 
  "msg": [
   "STR-2910 Remove snapshot qualifier in preparation for 1.3.5 distribution"
  ], 
  "revision_id": "422607"
 }, 
 {
  "author": "hansbak", 
  "date": "2006-07-17T02:47:21.333002Z", 
  "msg": [
   "license change inserted double first record <?xml: corrected"
  ], 
  "revision_id": "422606"
 }
]