[
 {
  "author": "mrdon", 
  "date": "2006-07-18T22:24:26.960161Z", 
  "msg": [
   "Making the form method \"POST\" by default", 
   "WW-1309 WW-1343"
  ], 
  "revision_id": "423270"
 }, 
 {
  "author": "jm", 
  "date": "2006-07-18T22:23:25.425335Z", 
  "msg": [
   "add plugin API, allowing plugins to append log data to the spamd 'result' syslog output"
  ], 
  "revision_id": "423269"
 }, 
 {
  "author": "kwilliams", 
  "date": "2006-07-18T22:17:12.751316Z", 
  "msg": [
   "Darius' patch for TUSCANY-433.  Thanks Darius!"
  ], 
  "revision_id": "423268"
 }, 
 {
  "author": "jukka", 
  "date": "2006-07-18T22:15:39.560129Z", 
  "msg": [
   "JCR-442: Split ConfigurationParser in two to enable external subclassing. Contributed by Nicolas Toper."
  ], 
  "revision_id": "423267"
 }, 
 {
  "author": "djd", 
  "date": "2006-07-18T22:11:50.333328Z", 
  "msg": [
   "DERBY-551  Adds a new reliability bit mask(MODIFIES_SQL_DATA_PROCEDURE_ILLEGAL) to CompilerContext.", 
   "Sets the above reliability for before triggers before binding the actionNode in CreateTriggerNode.", 
   "Checks the above reliability in CallStatementNode. After the called procedure is resolved, the sql allowed", 
   "by the procedure is checked and if it is \"modifies sql data\" and if we have set the reliability to", 
   "MODIFIES_SQL_DATA_PROCEDURE_ILLEGAL, it means we are calling a procedure that modifies sql data in the", 
   "action statement of a before trigger. In this case, an exception is thrown and trigger creation fails.", 
   "Removes the check in InternalTriggerExecutionContext.validateStatement which was used to catch the use of DML", 
   "in before triggers. This is a redundant check as use of DML in before triggers is now caught at compile time.", 
   "Added a comment to indicate this.", 
   "Adds a new message to indicate procedures that modify sql data are not allowed in before triggers.", 
   "Reuses the same SQLState as for invalid statement in triggers.", 
   "Patch submitted by Deepa Remesh"
  ], 
  "revision_id": "423266"
 }
]