[
 {
  "author": "ruchithf", 
  "date": "2006-07-19T10:41:15.139228Z", 
  "msg": [
   "updating the security sample's README.txt to refer to the SNAPSHOT versions of the mars and jars"
  ], 
  "revision_id": "423430"
 }, 
 {
  "author": "pgollucci", 
  "date": "2006-07-19T10:40:15.544393Z", 
  "msg": [
   "bsdtar (default on FreeBSD) is nolonger with the Fedora Core series FC5 and higher.", 
   "Fortunately, FreeBSD has gtar available as a port (/usr/local/archivers/gtar)", 
   "which will be used by default now on this platform via some Makefile.am/acinclude.m4 foo.", 
   "This change should only affect release managers and make the resulting tarballs", 
   "usable by all.", 
   "Reported by: Bojan Smojver <bojan@rexursive.com>", 
   "Message ID : <1152563966.499.14.camel@coyote.rexursive.com> (start of thread)", 
   "Redhat Bug : https://bugzilla.redhat.com/bugzilla/show_bug.cgi?id=198305"
  ], 
  "revision_id": "423429"
 }, 
 {
  "author": "rickhall", 
  "date": "2006-07-19T10:35:04.483910Z", 
  "msg": [
   "The old packages from uninstalled and updated bundles remain available", 
   "until refreshPackages() is called per the spec; however, the spec also", 
   "states that new bundles should not be wired to these old packages. Felix'", 
   "resolving was wiring to the old packages. Related to this, Felix previously", 
   "associated \"isRemovalPending()\" with a bundle as a whole, but to fix the", 
   "resolver to wire only to new packages the \"isRemovalPending()\" must be", 
   "associated with the modules underlying bundles.", 
   "Thus, for example, if a bundle is updated, the module associated with the", 
   "old version is marked for removal (and thus its exported packages are", 
   "marked for removal), but the module associated with its new version is", 
   "not marked for removal. As a result, the resolver is able to correctly", 
   "avoid wiring new bundles to old packages."
  ], 
  "revision_id": "423428"
 }, 
 {
  "author": "kahatlen", 
  "date": "2006-07-19T10:34:00.213082Z", 
  "msg": [
   "DERBY-1534: Add BaseJDBCTestCase.assertSQLState() overload with no", 
   "message parameter"
  ], 
  "revision_id": "423427"
 }, 
 {
  "author": "hansbak", 
  "date": "2006-07-19T10:32:53.607787Z", 
  "msg": [
   "make Uom mandatory on subscription resource because also required in processExtendSubscription service. Removed null pointer possibility on empty field useTime"
  ], 
  "revision_id": "423426"
 }
]