[
 {
  "author": "wrowe", 
  "date": "2006-07-23T03:49:07.740734Z", 
  "msg": [
   "Not big on 2.0 fixes now, but this one has a clean patch and a long", 
   "track record - and is widely deployed in 2.2 now."
  ], 
  "revision_id": "424670"
 }, 
 {
  "author": "bayard", 
  "date": "2006-07-23T03:25:32.441796Z", 
  "msg": [
   "Apache-SSL, mod_ssl and PHP are removed from the LHS menu of Sister Projects.", 
   "All three relate to the Web Server project and have been removed from their", 
   "site.", 
   "The Sister Projects label has been renamed to Related Sites (copying php.net's", 
   "term). While it held for the ones removed, it doesn't make much sense for", 
   "the three that remain. I think this is the best renaming in that External +", 
   "Links are both far too bland as terms and Projects is a bad term to use as", 
   "these sites aren't projects by our way of thinking.", 
   "On the RHS, the News menu has gone. The News link is folded into the", 
   "Foundation menu and the Conferences and Other Events pages are gone.", 
   "Conferences is already listed under Apache-wide (which we're working on", 
   "an improved label for so it can move up to the RHS and be more", 
   "prominent) and Other Events will soon be replaced by a Press/PRC section", 
   "under the same Apache-wide menu.", 
   "Please yell at me/join in on site-dev@ etc :)"
  ], 
  "revision_id": "424669"
 }, 
 {
  "author": "jdillon", 
  "date": "2006-07-23T03:02:05.845047Z", 
  "msg": [
   "Skeletal experiment to implement a Geronimo repository w/JDBM", 
   "Also provides a common m2 structure for a subsystem and its extensions"
  ], 
  "revision_id": "424668"
 }, 
 {
  "author": "jkuhnert", 
  "date": "2006-07-23T02:42:48.196092Z", 
  "msg": [
   "Fixes for \"blocking\" incompatibly licensed navigator code."
  ], 
  "revision_id": "424667"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-07-23T02:35:27.152697Z", 
  "msg": [
   "make request mapping configurable via config file."
  ], 
  "revision_id": "424666"
 }
]