[
 {
  "author": "danj", 
  "date": "2006-07-23T20:36:49.090797Z", 
  "msg": [
   "Added an extra check to setEndpointReference() so that we could still (re-)set the EPR of a resource as long as it", 
   "happened before initialize() was called. This is needed by the persistence layer when it is creating resources and", 
   "then assigning them EPRs that were found in the persistence location (from the last time it booted)."
  ], 
  "revision_id": "424810"
 }, 
 {
  "author": "danj", 
  "date": "2006-07-23T20:35:47.180090Z", 
  "msg": [
   "Added InitParam interface to these core components in effort to reduce duplicate code."
  ], 
  "revision_id": "424809"
 }, 
 {
  "author": "ngn", 
  "date": "2006-07-23T20:35:36.371676Z", 
  "msg": [
   "Renaming test classes since Maven will try to run them and fail"
  ], 
  "revision_id": "424808"
 }, 
 {
  "author": "danj", 
  "date": "2006-07-23T20:35:12.164358Z", 
  "msg": [
   "ResourceManager is no longer responsbile for creating resources at startup - the RouterPersistence layer handles this."
  ], 
  "revision_id": "424807"
 }, 
 {
  "author": "danj", 
  "date": "2006-07-23T20:33:43.819759Z", 
  "msg": [
   "Modified router component to rely on RouterPersistence interface for saving and re-loading of router table entries during", 
   "initialization. This allows clients to talk to resource instances even after a reboot of the appserver/container. There", 
   "is an interface whose implementation class can be specified in the deployment descriptor under /router/persistence/java-persistence-class,", 
   "and there is a default implementation, FilePersistence. The default impl writes all EPRs in the routing table to a", 
   "directory, with EPRs sorted by resource type.", 
   "The persistence layer also takes over the role of the 'instances-at-startup' feature, allowing users to auto-create", 
   "instances by having pre-existing EPR entries in a data store rather than having Muse create them on its own. Users of", 
   "File Persistence can simply put EPR files on disk (in the directory they name in the descriptor) and Muse will load", 
   "them into the router table and create resource instances for them."
  ], 
  "revision_id": "424806"
 }
]