[
 {
  "author": "danj", 
  "date": "2006-07-23T20:24:55.172127Z", 
  "msg": [
   "1. Changed context-path from xsd:anyURI to xsd:NCName so we could avoid slash prefixes at design time using schema", 
   "validation tools in Eclipse, etc. This allows us to assume the descriptor has a simple name in context-path, and that", 
   "we can use that simple name as a directory name when persisting a resource type'e EPRs to disk.", 
   "2. Removed the instances-at-startup attribute, because I could not come to a resolution that allowed this feature and", 
   "the persistence of resource instances (save and re-load) to co-exist. Allowing the auto-creation of N instances at startup", 
   "creates an ambiguity when combined with the re-loading of previous resource instances of the same type - does the user", 
   "want both created, or to fall back on the previous one, or to discard the previous one? The answer here is to allow for", 
   "auto-create by putting EPR XML files in the persistence directory and allowing Muse to load them on startup."
  ], 
  "revision_id": "424800"
 }, 
 {
  "author": "siren", 
  "date": "2006-07-23T20:24:02.157811Z", 
  "msg": [
   "set agent name for test because it is no longer set by default"
  ], 
  "revision_id": "424799"
 }, 
 {
  "author": "niq", 
  "date": "2006-07-23T20:22:57.012276Z", 
  "msg": [
   "Remove dependence on server config from ap_dbd_prepare, as that may", 
   "be called in per-directory config functions where there is no", 
   "server context causing segfault.", 
   "Discussion at", 
   "http://mail-archives.apache.org/mod_mbox/httpd-dev/200607.mbox/<831327593.20060720023332%40engec.ru>", 
   "and subsequent thread."
  ], 
  "revision_id": "424798"
 }, 
 {
  "author": "niallp", 
  "date": "2006-07-23T20:22:24.743444Z", 
  "msg": [
   "Update VFS build/site:", 
   "- remove dependency on commons build", 
   "- correct mail-archive links", 
   "- add custom \"Source Repository\" page", 
   "- add custom \"Issue Tracking\" page", 
   "- improve site navigation", 
   "- add md5 checksums"
  ], 
  "revision_id": "424797"
 }, 
 {
  "author": "dennisl", 
  "date": "2006-07-23T20:16:48.787796Z", 
  "msg": [
   "Promote docck plugin out of the sandbox."
  ], 
  "revision_id": "424796"
 }
]