[
 {
  "author": "mturyn", 
  "date": "2006-07-24T20:40:47.348930Z", 
  "msg": [
   "Added extra \"debug loading\" option to require() to handle a common case (we're not debug-loading all files).", 
   "Added loader for new HttpUtils class."
  ], 
  "revision_id": "425180"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-07-24T20:40:19.790621Z", 
  "msg": [
   "Fix for eclipse .classpath generation", 
   "* Add a -Peclipse profile that changes the \".\" resource dir to src/main/resources to prevent having nested source directories in the eclipse projects"
  ], 
  "revision_id": "425179"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-07-24T20:40:02.873700Z", 
  "msg": [
   "Activating ImageIOImage for reading PNG images in the ImageFactory made some test cases fail. The reason is that the PNGReader cannot extract the image resolution and leaves the default of 72dpi.", 
   "Added code to inspect the image metadata for resolution info.", 
   "I added the same hack as is already used in PNGImage to force loading the whole image when the image dimensions are requested, i.e. getting the right image size is more important than efficient memory use for now.", 
   "The image package needs that redesign sooner or later...."
  ], 
  "revision_id": "425178"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-07-24T20:29:52.447648Z", 
  "msg": [
   "[SHALE-225] Initial version of an example using JPA entity classes", 
   "This example application is functionally equivalent to the original", 
   "Struts 1.x \"mail reader\" example, but uses a relational database to", 
   "store the persistent data (rather than an XML file), and uses entity", 
   "classes configured for the Java Persistence Architecture (JPA) to", 
   "provide the database interaction.  The application features the", 
   "ViewController APIs in Shale, as well as the ability to have detached", 
   "JPA entities that are later re-merged into the persistence architecture.", 
   "TODO:  cosmetic cleanups, unit tests, and a basic website.", 
   "NOTE:  this application is *not* yet included in the \"shale-apps\"", 
   "builds, because it requires some manual setup of your Maven2 repository.", 
   "See the README.txt file in the top level directory for more information."
  ], 
  "revision_id": "425177"
 }, 
 {
  "author": "cziegeler", 
  "date": "2006-07-24T20:24:45.149363Z", 
  "msg": [
   "Keep session after logout"
  ], 
  "revision_id": "425176"
 }
]