[
 {
  "author": "danj", 
  "date": "2006-07-28T15:28:03.046925Z", 
  "msg": [
   "Reverting to the original implementation of WS-RMD exposure, via WS-MEx - creating metadata resource types", 
   "in a descriptor and providing the RMD WSDL was a pain but could probably be hidden with tooling. The persistence", 
   "of RMD metadata resources, though, would require another component that could reset all of the resource-to-metadata-resource", 
   "mappings after both had be reloaded at initialzation. That means that users wishing to expose metadata resoruces", 
   "would have to add THREE extra items - the ResourceMetadata capability, the metadata resource type, and this", 
   "third controller/factory resource type. This is just too much. We can return the same descriptor via WS-MEx,", 
   "and the client API will remain the same."
  ], 
  "revision_id": "426565"
 }, 
 {
  "author": "danj", 
  "date": "2006-07-28T15:25:01.332468Z", 
  "msg": [
   "Added an init param for <resource-type> that are WSRF WsResources - name is 'validate-wsrp-schema' and it", 
   "allows users to shut off WSRP schema validation. Default value is 'true'."
  ], 
  "revision_id": "426564"
 }, 
 {
  "author": "dennisl", 
  "date": "2006-07-28T15:24:07.262239Z", 
  "msg": [
   "o Initialize plexus component in the correct way."
  ], 
  "revision_id": "426563"
 }, 
 {
  "author": "danj", 
  "date": "2006-07-28T15:23:49.719469Z", 
  "msg": [
   "Added WS-SG persistence layer based on the generic persistence framework in muse-core. This sytem relies", 
   "on the fact that SG entries are reloaded before SG resources, and then the reloading of the SG entry table", 
   "is done by finding the reloaded entries by EPR and filling in the rest of the properties (member EPR, SG EPR,", 
   "etc.) using data saved to a file. The ServiceGroupPersistence interface extends Persistence to make sure that", 
   "the layer can respond to events that are inherent to SG implementation (creation/destruction of resources)."
  ], 
  "revision_id": "426562"
 }, 
 {
  "author": "danj", 
  "date": "2006-07-28T15:21:21.809246Z", 
  "msg": [
   "Changed names of WSRF ext faults to be inline with other WSRF fault names."
  ], 
  "revision_id": "426561"
 }
]