[
 {
  "author": "hlship", 
  "date": "2006-07-29T23:28:41.429400Z", 
  "msg": [
   "Finish up the ChainBuilder service and tests.", 
   "Add some documentation about chain of command and ChainBuilder.", 
   "Replace the HiveMind configuration files with Tapestry IoC module classes."
  ], 
  "revision_id": "426850"
 }, 
 {
  "author": "djd", 
  "date": "2006-07-29T23:20:40.873750Z", 
  "msg": [
   "DERBY-1609 (partial) Add a runScript method to ij. Initial version runs a script", 
   "successfully using the passed in connection. More work is needed to avoid the", 
   "standard ij startup which opens connections and to return the number of errors."
  ], 
  "revision_id": "426849"
 }, 
 {
  "author": "dennisl", 
  "date": "2006-07-29T23:13:30.919013Z", 
  "msg": [
   "o Generate xdoc for verifications.mdo and add it to the site.", 
   "o Expand some of the texts.", 
   "o Fix titles and headings.", 
   "o Add banners and project name to site.xml.", 
   "o Rename example file.", 
   "o Fix typos and broken links."
  ], 
  "revision_id": "426848"
 }, 
 {
  "author": "bandaram", 
  "date": "2006-07-29T23:12:58.911728Z", 
  "msg": [
   "DERBY-1543:This patch should address these two left over items in GRANT/REVOKE implementation. Some implementation notes:", 
   "1) Now Derby raises an SQLWarning when SQL authorization is ON without authentication at connect time. This is done by checking if AuthenticationService being used is an instance of NoneAuthenticationServiceImpl. Since this is the default authentication service with Derby, it should always be present.", 
   "2) Added code to drop permission descriptors from SYSTABLEPERMS, SYSCOLPERMS and SYSROUTINEPERMS when the object they provide permission for is dropped. This includes tables, views and routines and these descriptors needs to be removed from permissionCache as well.", 
   "I have tested the cases when PermissionsDescriptors are in cache also.", 
   "Submitted by Satheesh Bandaram (bandaram@gmail.com)"
  ], 
  "revision_id": "426847"
 }, 
 {
  "author": "mbo", 
  "date": "2006-07-29T22:41:25.638265Z", 
  "msg": [
   "JDO-380: Missing pm.close() in GetPersistenceManagerFactory"
  ], 
  "revision_id": "426846"
 }
]