[
 {
  "author": "cam", 
  "date": "2006-07-30T12:36:04.424851Z", 
  "msg": [
   "1.  Fixed regression with DOM updates to rect elements' rx and ry attributes.", 
   "2.  The xlink:href attribute of image elements is animatable.", 
   "3.  Fixed error in the SVGTransform.setSkew[XY] implementations.", 
   "4.  Fixed problem with animating preserveAspectRatios attributes.", 
   "5.  Extension elements now do not need to provide override style declarations.", 
   "6.  Fixed problem with animatable attributes on use elements.", 
   "7.  SVG 1.2 multiImage element uses unanimated attribute values properly", 
   "(before it was throwing exceptions).", 
   "8.  Various Errors thrown are now IllegalArgumentExceptions.", 
   "9.  Fixed regression with 'a' elements that are children of text elements.", 
   "10. Avoided warnings about varargs methods in the Rhino debugger code in", 
   "JSVGViewerFrame.", 
   "11. Changed the SVGConverter.ERROR_UNABLE_TO_CREATE_OUTPUT_DIR test so that", 
   "it also fails to create the directory under Unix.", 
   "12. Introduced org.apache.batik.extension.GraphicsExtensionElement that provides", 
   "support for SVG interfaces common to graphics elements (SVGTransformable,", 
   "SVGLocatable, etc.)."
  ], 
  "revision_id": "426885"
 }, 
 {
  "author": "dims", 
  "date": "2006-07-30T12:21:59.628269Z", 
  "msg": [
   "Missed a couple of constants from last round of cleanup. deprecated the ones on Constants.java"
  ], 
  "revision_id": "426884"
 }, 
 {
  "author": "dnaber", 
  "date": "2006-07-30T11:56:57.898251Z", 
  "msg": [
   "LUCENE-641: fix off-by-one bug for maximum field length"
  ], 
  "revision_id": "426883"
 }, 
 {
  "author": "grahamd", 
  "date": "2006-07-30T10:27:00.579682Z", 
  "msg": [
   "(MODPYTHON-155) Modifications to handler and filter lists so that", 
   "references can be maintained back to parent handler of a handler/filter", 
   "which was registered dynamically. This is necessary within the scheme of", 
   "how the new module importer works. Specifically, where a directory isn't", 
   "specified when adding a handler or registering a filter, the directory", 
   "associated with the parent up the chain has to be used instead. In the old", 
   "importer it was relying on fact that directory of parent had already been", 
   "added to the Python sys.path, although this didn't actually work reliably.", 
   "The new module importer doesn't add directories to sys.path and so the need", 
   "to properly work out directory associated with a parent so that it can be", 
   "used when required."
  ], 
  "revision_id": "426882"
 }, 
 {
  "author": "cziegeler", 
  "date": "2006-07-30T09:34:07.550366Z", 
  "msg": [
   "Remove now obsolete block"
  ], 
  "revision_id": "426881"
 }
]