[
 {
  "author": "jsdelfino", 
  "date": "2006-08-04T17:43:43.905788Z", 
  "msg": [
   "Set svn:ignore properties to ignore files generated by the build"
  ], 
  "revision_id": "428795"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2006-08-04T17:42:29.252257Z", 
  "msg": [
   "Set svn:ignore properties to ignore files generated by the build"
  ], 
  "revision_id": "428794"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-08-04T17:36:34.387077Z", 
  "msg": [
   "This still needs LOTS of work to complete.  The client itself is rather straightforward and complete, conditional gets,", 
   "cache-control, gzip/compress/zip compression is supported and enabled by default, extension HTTP methods (e.g. COPY)", 
   "can be used with nominal effort..", 
   "The part that really needs the most work is the client side HTTP cache.  It's generally functional but still needs lots of", 
   "refinements, testing, tweaking... and a generally-better-all-the-way-around implementation.  The goal is to provide a functionally", 
   "complete client-side private cache that supports most of the nuances of HTTP caching (e.g. Vary headers, max-stale, min-fresh,", 
   "no-cache and private headers, and so on).  Use of the cache can be controlled via the RequestOptions interface", 
   "(e.g. options.setNoCache(true) to disable the use of the cache via the Cache-Control header).", 
   "I had imagined ultimately shipping three cache implementations with this.  An in-memory LRU cache, A write-to-disk cache, and a", 
   "JCS-backed cache implementation.  Other impls are possible (e.g. derby-based, etc).", 
   "The client code currently depends 100% on the Apache Commons HTTP Client. Changing the http stack would require fairly significant", 
   "changes to this code."
  ], 
  "revision_id": "428793"
 }, 
 {
  "author": "chamikara", 
  "date": "2006-08-04T17:35:36.429244Z", 
  "msg": [
   "Corrected the client code to terminate property."
  ], 
  "revision_id": "428792"
 }, 
 {
  "author": "matzew", 
  "date": "2006-08-04T17:34:22.816588Z", 
  "msg": [
   "made a copy"
  ], 
  "revision_id": "428791"
 }
]