[
 {
  "author": "hlship", 
  "date": "2006-08-07T10:37:27.059797Z", 
  "msg": [
   "Add support for @Inject annotation and the ObjectProviders interface.", 
   "Create the tapestry.Infrastructure service, which provides the infrastructure: provider prefix (for use with @Inject).", 
   "Create a base TapestryModule that imports all other Tapestry sub-modules (both public and internal).", 
   "Document a few places where @Concurrent.Write and a race condition can result in duplicated (but harmless) work."
  ], 
  "revision_id": "429295"
 }, 
 {
  "author": "dreid", 
  "date": "2006-08-07T10:34:45.116179Z", 
  "msg": [
   "Start adding form to create the module rdf file"
  ], 
  "revision_id": "429294"
 }, 
 {
  "author": "stefan", 
  "date": "2006-08-07T10:34:13.768204Z", 
  "msg": [
   "JCR-468: the code in ItemImpl.isSame() only compares the item id, but not the source workspace."
  ], 
  "revision_id": "429293"
 }, 
 {
  "author": "jacopoc", 
  "date": "2006-08-07T10:28:51.282659Z", 
  "msg": [
   "New price list feature that can be used to set up price lists for specific customers. It is based on the Agreement data model.", 
   "There are only two relevant changes in this commit:", 
   "a) added a new price field to the AgreementProductAppl entity", 
   "b) added a new optional input parameter, \"agreementId\", to the calculateProductPrice service; if the agreementId is passed, and if a valid price for the product is found in the AgreementProductAppl entity, this price overrides the default price in the ProductPrice entity.", 
   "Here are the steps needed to test this stuff:", 
   "* create an agreement (of type sales) from the customer to the Company", 
   "* create an agreement item of type price list for a given currency", 
   "* associate products to the price list (agreement item) and set the price there (this is a new field AgreementProductAppl.price)", 
   "* when you start a sales order, select the agreement from the drop down list"
  ], 
  "revision_id": "429292"
 }, 
 {
  "author": "samisa", 
  "date": "2006-08-07T10:18:15.858539Z", 
  "msg": [
   "More style changes"
  ], 
  "revision_id": "429291"
 }
]