[
 {
  "author": "gnodet", 
  "date": "2006-08-08T15:56:20.862176Z", 
  "msg": [
   "SM-519: Update LICENSE and NOTICE files for servicemix-shared"
  ], 
  "revision_id": "429700"
 }, 
 {
  "author": "samisa", 
  "date": "2006-08-08T15:54:38.468845Z", 
  "msg": [
   "Fixed build breaks caused due to updates to conf API"
  ], 
  "revision_id": "429699"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-08-08T15:53:29.521387Z", 
  "msg": [
   "DERBY-688: Enhancements to XML functionality toward XPath/XQuery support", 
   "This revision contains d688_phase1_v3.patch.", 
   "This patch was contributed by Army Brown (qozinx@gmail.com).", 
   "Attaching a \"phase 1\" patch, d688_phase1_v1.patch, for this issue that does the following:", 
   "1. Reorganizes XML-specific code as follows:", 
   "- Moves all code that relies on JAXP and Xalan classes", 
   "out of XML.java and into a new class, SqlXmlUtil.java.", 
   "See comments at the beginning of SqlXmlUtil for an", 
   "explanation of why this was done.", 
   "- Creates a new class, SqlXmlExecutor, in the impl.sql.execute", 
   "package that serves as the class on which all XML operator", 
   "calls are generated. Ex. for XMLEXISTS, instead of", 
   "generating:", 
   "<xmlOperand>.XMLExists(<query-expr>, xmlOperand)", 
   "we now generate:", 
   "<SqlXmlExecutor>.XMLSerialize(<query-expr>, xmlOperand)", 
   "Along with making the code cleaner by allowing all", 
   "XML operator calls to be defined in the same class,", 
   "this new class has other benefits, as well--see", 
   "comments at the beginning of SqlXmlExecutor for", 
   "more of an explanation.", 
   "2. Changes implementation of XPath from XSLT processing to", 
   "the low-level Xalan API, which is faster, more flexible,", 
   "and better for implementation of the XMLQUERY operator", 
   "(the XMLQUERY operator will be coming in subsequent", 
   "phases). Note that as part of this change I've removed", 
   "the dependency on an explicit declaration of Xerces", 
   "as the parser; Derby will now pick up the parser from", 
   "the JVM (i.e. this patch resolves DERBY-567).", 
   "3. Makes a small change to the XMLEXISTS operator to bring", 
   "it more in line with SQL/XML spec. More specifically,", 
   "the query expression that is specified must now be a string", 
   "literal; parameters and other expressions are not allowed.", 
   "4. Updates the XML test and master files (lang/xml_general.sql", 
   "and lang/xmlBinding.java) to bring them in sync with the latest", 
   "Derby codeline. Since the XML tests are not (yet) run", 
   "as part of derbyall, the master files need to be updated", 
   "to reflect some client/server changes that have gone into", 
   "the codeline for 10.2 (for example, server pre-fetching", 
   "behavior)."
  ], 
  "revision_id": "429698"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-08-08T15:49:13.867440Z", 
  "msg": [
   "Added countyGeoId to PostalAddress, and changed the TaxAuthority rate calc code to use it if populated to support county level taxes; note that this commit does not include UI or background service to populate the countyGeoId"
  ], 
  "revision_id": "429697"
 }, 
 {
  "author": "chirino", 
  "date": "2006-08-08T15:48:09.887041Z", 
  "msg": [
   "Reverted the 429364 commit.  it was a borked automated commit"
  ], 
  "revision_id": "429696"
 }
]