[
 {
  "author": "rooneg", 
  "date": "2006-08-08T22:09:45.700749Z", 
  "msg": [
   "Tweak the behavior of get/set DefaultParserOptions for sanity and thread", 
   "safety.", 
   "* parser/src/main/java/org/apache/abdera/parser/stax/FOMParser.java", 
   "(getDefaultParserOptions): Note why we're cloning the options, and", 
   "if we get a CloneNotSupportedException just throw a RuntimeException,", 
   "since that's really a bogus ParserOptions impl, and we shouldn't let", 
   "it silently continue to suck.", 
   "(setDefaultParserOptions): Make a defensive copy of the options, so", 
   "that we remain thread safe even if the calling thread later messes", 
   "with it.  Comment about why, and add the same exception handling we", 
   "use in the previous method for the same reasons."
  ], 
  "revision_id": "429850"
 }, 
 {
  "author": "olegk", 
  "date": "2006-08-08T22:06:09.394680Z", 
  "msg": [
   "Fix for [HTTPCLIENT-594]: HttpMethodBase#aborted variable mistakenly declared transient instead of volatile", 
   "Contributed by Oleg Kalnichevski", 
   "Reviewed by Ortwin Glück and Roland Weber"
  ], 
  "revision_id": "429849"
 }, 
 {
  "author": "tellison", 
  "date": "2006-08-08T22:06:02.490044Z", 
  "msg": [
   "Code tidy-up and fix minor compiler warnings."
  ], 
  "revision_id": "429848"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-08-08T22:06:01.037521Z", 
  "msg": [
   "DERBY-688: Enhancements to XML functionality toward XPath/XQuery support", 
   "This revision contains d688_phase3_v1_code.patch and d688_phase3_v1_tests.patch", 
   "This patch was contributed by Army Brown (qozinx@gmail.com).", 
   "Attaching a \"phase 3\" patch that implements the XMLQUERY operator. The patch is in two parts:", 
   "- d688_phase3_v1_code.patch", 
   "- d688_phase3_v1_tests.patch", 
   "When committed, though, *both* patches should be committed together in", 
   "order to avoid test diffs.", 
   "The SQL parsing/compile time logic was added as part of the phase 2 patch;", 
   "this patch handles the execution-time logic by making the necessary Xalan", 
   "calls to evaluate an expression and to retrieve the results.", 
   "The phase 3 patch also adds logic to distinguish between two \"types\" of XML:", 
   "XML(DOCUMENT(ANY)) and XML(SEQUENCE), as defined in the SQL/XML[2006]", 
   "specification. The reason we need to distinguish between the two is that", 
   "the result of evaluating an XML query expression against an XML document", 
   "can be an arbitrary list of items including atomic values, attributes,", 
   "etc.--i.e. a sequence of items that is *not* required to form a valid", 
   "DOCUMENT node. For now, though, we only allow valid DOCUMENTs to be", 
   "inserted into XML columns, so we have to be able to look at the results", 
   "of the XMLQUERY operator to determine whether or not it's a valid DOCUMENT,", 
   "and if not we disallow insertion of that result into an XML column.", 
   "We can, however, keep the result transiently and pass it into other", 
   "operations that accept an XML value (namely, XMLSERIALIZE, which a user", 
   "can then use to retrieve the results in serialized form)."
  ], 
  "revision_id": "429847"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2006-08-08T22:04:05.790179Z", 
  "msg": [
   "Refactoring SCA C++ runtime to use the composite assembly model. More file renames"
  ], 
  "revision_id": "429846"
 }
]