[
 {
  "author": "norman", 
  "date": "2006-08-09T05:32:43.176442Z", 
  "msg": [
   "Fix javamail version"
  ], 
  "revision_id": "429970"
 }, 
 {
  "author": "norman", 
  "date": "2006-08-09T05:31:06.549045Z", 
  "msg": [
   "Commit javamail and activation jars to allow review"
  ], 
  "revision_id": "429969"
 }, 
 {
  "author": "imario", 
  "date": "2006-08-09T05:20:42.172572Z", 
  "msg": [
   "add object class name to error message"
  ], 
  "revision_id": "429968"
 }, 
 {
  "author": "crossley", 
  "date": "2006-08-09T05:18:21.427761Z", 
  "msg": [
   "Link to SVG Serializer docs."
  ], 
  "revision_id": "429967"
 }, 
 {
  "author": "jacopoc", 
  "date": "2006-08-09T05:09:45.367848Z", 
  "msg": [
   "First version of the class to render fo templates out of form widgets:", 
   "* a new FoFormRenderer class that implements the FormStringRenderer interface in order to provide a fo representation of a form widget definition.", 
   "* small change to ModelForm class (new getter method) needed because I have to read the form's list", 
   "* moved the initialization of the \"formStringRenderer\" object, from the ScreenRenderer class to the ScreenFopPdfViewHandler and ScreenWidgetViewHandler classes (so that the former can instantiate the new FoFormRenderer class and the latter the HtmlFormRenderer)", 
   "The FoFormRenderer class is far from complete:", 
   "* in single forms, the position attribute is ignored (nulti columns single forms are not still supported)", 
   "* all the style attributes from the form definitions are ignored", 
   "* in list forms, all the columns are rendered with the same size", 
   "* left/center/right alignment of cells' content is not supported", 
   "* field groups are not supported", 
   "* banner and image fields are not supported", 
   "* in general see the TODO comments near the methods that should be implemented", 
   "However we can now render both list and single forms in a nice PDF format without errors."
  ], 
  "revision_id": "429966"
 }
]