[
 {
  "author": "bpendleton", 
  "date": "2006-08-11T05:06:29.198138Z", 
  "msg": [
   "DERBY-688: Enhancements to XML functionality toward XPath and XQuery support", 
   "This revision contains d688_phase5_v1.patch.", 
   "This patch was contributed by Army Brown (qozinx@gmail.com).", 
   "The phase 5 patch, d688_phase5_v1.patch, adds code to determine whether or", 
   "not the user's classpath has the required XML classes and, if not, to throw", 
   "a user-friendly(-ier) error message whenver the user attempts to use any of", 
   "the XML operators.", 
   "I inquired as to the best way to do this in the following thread:", 
   "http://thread.gmane.org/gmane.comp.apache.db.derby.devel/25307/focus=25315", 
   "Dan suggested a) looking at the Derby code that loads modules, and", 
   "b) adding a new utility method to the ClassInspector class.", 
   "I looked at the module-loading code and it ultimately just makes a call to", 
   "Class.forName() and ignores a module if that call throws a LinkageError or", 
   "a ClassNotFoundException; see the getImplementations() method in", 
   "BaseMonitor.java. So based on that I added a utility method to ClassInspector", 
   "that does the same thing, except that it just returns \"true\" if the call", 
   "to Class.forName() succeeds and \"false\" otherwise. I made the new method", 
   "static because it doesn't rely on any state specific to ClassInspector and", 
   "because it would have taken a good deal of searching for me to figure out", 
   "how to instantiate an instance of ClassInspector correctly from within", 
   "the XML datatype class."
  ], 
  "revision_id": "430670"
 }, 
 {
  "author": "antonio", 
  "date": "2006-08-11T05:03:32.649729Z", 
  "msg": [
   "Apply first patch \"submit on change is not setted on the widget\" from COCOON-1858: [PATCH]on-value-change does not work on suggestion list. Thanks to vincent Demay (vincent.demay@anyware-tech.com)"
  ], 
  "revision_id": "430669"
 }, 
 {
  "author": "fuzzylogic", 
  "date": "2006-08-11T05:03:07.811937Z", 
  "msg": [
   "DERBY-1032 (partial): Add Unix scripts to bin directory"
  ], 
  "revision_id": "430668"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-08-11T04:59:47.583350Z", 
  "msg": [
   "Update Spring Framework dependencies from 1.2.5 to 1.2.8 (the current", 
   "production release).", 
   "SHALE-242"
  ], 
  "revision_id": "430667"
 }, 
 {
  "author": "andyhot", 
  "date": "2006-08-11T04:40:41.404245Z", 
  "msg": [
   "added myself ;)"
  ], 
  "revision_id": "430666"
 }
]