[
 {
  "author": "jonesde", 
  "date": "2006-08-12T10:44:52.436473Z", 
  "msg": [
   "Small error message improvement when related entity is not found"
  ], 
  "revision_id": "431010"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-08-12T10:36:00.695846Z", 
  "msg": [
   "Implemented extend-entity for entity definitions to support adding field, relation and index elements to an entity; this is now also used to support further separation of the framework from the applications"
  ], 
  "revision_id": "431009"
 }, 
 {
  "author": "jdillon", 
  "date": "2006-08-12T10:22:18.757993Z", 
  "msg": [
   "The car package builder no longer makes car files directly, but instead lets maven handle that", 
   "Updated pom's to use the maven archiver to specify extra manifest bits", 
   "Updated car package mojo to take a list of artifacts (classpathElements) which will be used to make the Class-Path manifest entry, this was needed to allow a subset of artifacts to use a custom prefix (for the lib/endorsed bits)", 
   "Finally we are including geronimo-plugin.xml again", 
   "Removed uneeded config fields/setters for manifest related bits in package builder now that it is handled externally via maven", 
   "Changed all ${pom.currentVersion} to ${pom.version} in plan.xml files", 
   "Car files now all have LICENSE.txt and NOTICE.txt included", 
   "Added startup-jar w/comments in that file for what its purpose is, so that the bootstrap can root itself now"
  ], 
  "revision_id": "431008"
 }, 
 {
  "author": "pauls", 
  "date": "2006-08-12T10:14:13.485880Z", 
  "msg": [
   "Until now, SecureAction was synchronizing the framework for certain operations in order to reduce", 
   "the amount of objects it created. Furthermore, the synchronization was carried out whether security", 
   "was enabled or not.", 
   "We now use a threadlocal to avoid synchronization all together at the expense of only a few more", 
   "objects."
  ], 
  "revision_id": "431007"
 }, 
 {
  "author": "jdillon", 
  "date": "2006-08-12T10:10:32.803688Z", 
  "msg": [
   "Added flag to allow bootstrapping into a directory... expanded, so that maven can make the jar from that"
  ], 
  "revision_id": "431006"
 }
]