[
 {
  "author": "husted", 
  "date": "2006-08-13T15:19:02.649859Z", 
  "msg": [
   "Update \"localiize\" lab for Struts 2."
  ], 
  "revision_id": "431185"
 }, 
 {
  "author": "jm", 
  "date": "2006-08-13T15:16:43.095061Z", 
  "msg": [
   "extend re2xs to store the original regexps, too, so that callers can see exactly what REs are c-ified through introspection of a HAS_RULES hash. read the module name from the input file. make writing of re.in optional in plugin, driven by ENV-variable back channel. modify re2xs to automatically rm the output module tree if --force is used.  extend 'start_rules' plugin API to pass the priority, which was an omission.  support use of re2c module in scan.  add a quick driver script which builds the ruleset (for me anyway)"
  ], 
  "revision_id": "431184"
 }, 
 {
  "author": "thorsten", 
  "date": "2006-08-13T15:09:51.915802Z", 
  "msg": [
   "Automatic publish from forrestbot"
  ], 
  "revision_id": "431183"
 }, 
 {
  "author": "olegk", 
  "date": "2006-08-13T14:59:09.541375Z", 
  "msg": [
   "Some minor fixes"
  ], 
  "revision_id": "431182"
 }, 
 {
  "author": "thorsten", 
  "date": "2006-08-13T14:38:08.895540Z", 
  "msg": [
   "This commit uses a generator of a forrest plugin. See", 
   "http://svn.apache.org/viewvc?view=rev&revision=429872 for more information.", 
   "Produces properties from an input-module. This is been managed by the", 
   "heart of the forrest plugin the ModuleGenerator. The generator is contacting", 
   "the input module and gets an iterator of all attributes names. This", 
   "iterator will be then used to receive the values of the key. Till now", 
   "we only use a Object to String cast but an input module does not have", 
   "to return a simple String but can return any object. This may cause", 
   "ClassCastExceptions for the values.", 
   "Further some attributes need to be received with additional parameter", 
   "(like the page-envelope). The genarator returns then Null.", 
   "See", 
   "http://localhost:8888/modules/properties/input-module.properties.properties.xml", 
   "http://localhost:8888/modules/properties/input-module.page-envelope.properties.xml", 
   "The match is", 
   "<map:match pattern=\"input-module.*.properties.xml\">"
  ], 
  "revision_id": "431181"
 }
]