[
 {
  "author": "jta", 
  "date": "2006-08-15T20:58:22.958950Z", 
  "msg": [
   "DERBY-1057 (partial): Update the Reference Guide with info about Grant and", 
   "Revoke.", 
   "Patch (derby1057_ref4.diff) by Laura Stewart <scotsmatrix@gmail.com>."
  ], 
  "revision_id": "431700"
 }, 
 {
  "author": "davidillsley", 
  "date": "2006-08-15T20:55:49.868256Z", 
  "msg": [
   "Fixing NPE in fix for AXIS2-967 is OperationContext is somehow null."
  ], 
  "revision_id": "431699"
 }, 
 {
  "author": "mikem", 
  "date": "2006-08-15T20:55:21.842867Z", 
  "msg": [
   "DERBY-1652, submitted by Yip Ng", 
   "The cause of the problem is that the trigger descriptor is created after the stored prepared statement(SPS) has been compiled, so the compiled form of the SPS is not aware of that its trigger action can fire on the trigger table itself. Hence, the constant action was not generated correctly.", 
   "During upgrade, the SPSs are invalidated at database boot time. The SPS will be recompile when it is being invoked and the recompilation at this point will of course detect the relevent trigger and generate the correct constant action for the SPS and produce the expected behavior when the SPS is executed - throwing an error when it exceeds the trigger's maximum depth in the above case.", 
   "The simplest solution without introducing another revalidation of the SPS is to create the trigger descriptor first before compiling the SPS. I ran derbyall and had to go over the testcases which have the wrong master outputs and I have corrected them on this patch."
  ], 
  "revision_id": "431698"
 }, 
 {
  "author": "djd", 
  "date": "2006-08-15T20:38:48.446888Z", 
  "msg": [
   "DERBY-1694 Cleanup derbynet/testProperties so that it always handles the output from the processes it forks.", 
   "Not handling the output can lead to hangs according to the javadoc for java.lang.Process."
  ], 
  "revision_id": "431697"
 }, 
 {
  "author": "djd", 
  "date": "2006-08-15T20:37:07.251699Z", 
  "msg": [
   "Fix testSecMec so that if the server fails to start (checked by pinging it) the test prints a fail message", 
   "and completes, rather than just calling System.exit()."
  ], 
  "revision_id": "431696"
 }
]