[
 {
  "author": "jukka", 
  "date": "2006-08-16T17:48:26.551313Z", 
  "msg": [
   "Upgrading all project versions to 1.1-SNAPSHOT"
  ], 
  "revision_id": "431965"
 }, 
 {
  "author": "rdonkin", 
  "date": "2006-08-16T17:47:29.735700Z", 
  "msg": [
   "Added links and examples."
  ], 
  "revision_id": "431964"
 }, 
 {
  "author": "", 
  "date": "2006-08-16T17:44:54.470438Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "431963"
 }, 
 {
  "author": "jta", 
  "date": "2006-08-16T17:44:23.822191Z", 
  "msg": [
   "Web site DITA instructions:", 
   "- Explained how to 'svn del' a file.", 
   "- Added instructions for committers on how to commit patches.", 
   "- Removed old Enigmail tip because we request uploading patches to Jira."
  ], 
  "revision_id": "431962"
 }, 
 {
  "author": "asmuts", 
  "date": "2006-08-16T17:40:26.849702Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/JCS-2", 
   "I'm adding a configuration option to the CompositeCacheAttributes.  It's called DiskUsagePattern.  There are two patterns: update and swap.  The changes are isolated to the CompositeCache class and they are very easy to unit test.", 
   "SWAP is the default.  Under the swap pattern, data is only put to disk when the max memory size is reached.  Since items puled from disk are put into memory, if the memory cache is full and you get an item off disk, the lest recently used item will be spooled to disk.  If you have a low memory hit ration, you end up thrashing.", 
   "The UPDATE usage pattern allows items to go to disk on an update.  It disables the swap.  This allows you to persist all items to disk.  If you are using the JDBC disk cache for instance, you can get all item on disk use the memory cache for performance, and not worry aobut lossing data on a system crash or improper shutdown.  Also, since all items are on disk, there is no need to swap to disk.  This prevents the possibility of threashing.", 
   "The configuration is done at the region level.   The attrribute is called DiskUsagePatternName and takes two values: SWAP and UPDATE.", 
   "For example, below there is a region defined called \"Swap\" that uses the SWAP disk usage pattern and another called \"Update\" that uses the UPDATE usage pattern.", 
   "##### CACHE REGIONS FOR TEST", 
   "jcs.region.Swap=indexedDiskCache", 
   "jcs.region.Swap.cacheattributes=org.apache.jcs.engine.CompositeCacheAttributes", 
   "jcs.region.Swap.cacheattributes.MaxObjects=100", 
   "jcs.region.Swap.cacheattributes.MemoryCacheName=org.apache.jcs.engine.memory.lru.LRUMemoryCache", 
   "jcs.region.Swap.cacheattributes.DiskUsagePatternName=SWAP", 
   "jcs.region.Update=indexedDiskCache", 
   "jcs.region.Update.cacheattributes=org.apache.jcs.engine.CompositeCacheAttributes", 
   "jcs.region.Update.cacheattributes.MaxObjects=100", 
   "jcs.region.Update.cacheattributes.MemoryCacheName=org.apache.jcs.engine.memory.lru.LRUMemoryCache", 
   "jcs.region.Update.cacheattributes.DiskUsagePatternName=UPDATE"
  ], 
  "revision_id": "431961"
 }
]