[
 {
  "author": "bodewig", 
  "date": "2006-08-19T18:56:24.851446Z", 
  "msg": [
   "make report file name prettier"
  ], 
  "revision_id": "432860"
 }, 
 {
  "author": "fuzzylogic", 
  "date": "2006-08-19T18:54:29.556155Z", 
  "msg": [
   "DERBY-1730: Fix generation of OSGi attributes in derby.jar manifest"
  ], 
  "revision_id": "432859"
 }, 
 {
  "author": "chinthaka", 
  "date": "2006-08-19T18:51:31.061590Z", 
  "msg": [
   "Fix for Axis2-1023 (Yet to be fully tested)", 
   "- Now there are three switches for the user", 
   "enableRESTInAxis2MainServlet - this will decide whether main servlet serves for REST requests as well. The side advantage here is that one can have the same endpoint for both REST and SOAP requests", 
   "disableREST - once set to true, this will completely disable REST in both the servlets", 
   "disableSeparateEndpointForREST - as you might already know, we have a separate servlet to handle REST requests (AxisRESTServlet). If this flag is set, that servlet will be disabled.", 
   "Using the above flags user can get different combinations to fit his requirement. By default all the above params are set to false.", 
   "- AxisSOAPServlet was not used anywhere. Removing that."
  ], 
  "revision_id": "432858"
 }, 
 {
  "author": "gnodet", 
  "date": "2006-08-19T18:49:24.422755Z", 
  "msg": [
   "Do not use woodstox stax reader on dom, but use our own implementation to avoid a NPE (the location is used by jaxb2).", 
   "Use the SU classloader when processing an exchange so that the JAXB2 context can find the needed classes."
  ], 
  "revision_id": "432857"
 }, 
 {
  "author": "djd", 
  "date": "2006-08-19T18:40:47.658269Z", 
  "msg": [
   "DERBY-766 DERBY-1714 Working method in CodeChunk that splits expressions out of generated methods that are too large.", 
   "Bumps the number of unions supported in largeCodeGen to over 6,000 from around 800. Also increases the", 
   "number of rows supported in a VALUES clause. A large number of UNION clauses still requires a large amount of", 
   "memory for optimization (see DERBY-1315). A large number of rows in a VALUES clause fails at some point due to", 
   "a StackOverflow. Subsequent commit will modify largeCodeGen to be a JUnit test and adapt to these changes", 
   "but running into issues finding a useful workign limits that can produce repeatable results without", 
   "hitting memory issues."
  ], 
  "revision_id": "432856"
 }
]