[
 {
  "author": "rickmcguire", 
  "date": "2006-08-23T18:32:20.941218Z", 
  "msg": [
   "YOKO-152 Yoko core server is no longer Java 1.4 compatible."
  ], 
  "revision_id": "434120"
 }, 
 {
  "author": "rjung", 
  "date": "2006-08-23T18:26:56.383049Z", 
  "msg": [
   "Change note names and symbols to make them more consistent.", 
   "Add a note with the worker type. More notes are to come.", 
   "Documentation of the notes is still missing but important."
  ], 
  "revision_id": "434119"
 }, 
 {
  "author": "dmiddlem", 
  "date": "2006-08-23T18:25:31.293924Z", 
  "msg": [
   "Bug fix to solve problems with DynAny Type test (YOKO-153)"
  ], 
  "revision_id": "434118"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-08-23T18:24:11.789886Z", 
  "msg": [
   "Fix the client test suite.", 
   "there were several issues here.", 
   "* Change all of the requests so that keep-alive connections are not used.  The jetty", 
   "server hangs on shutdown until all open connections timeout, using Connection: close", 
   "resolves the problem.", 
   "* It appears that in some cases, Jetty will actually use the same writer / outputstream", 
   "for different requests, causing the output from the previous request to be sent to", 
   "subsequent requests!!  This looks like a bug, but we're able to work around it by", 
   "explicitly closing the writer in the servlet after we write to it.", 
   "* The way I was starting and stopping the server was just wrong.  I change it, but this", 
   "change currently means that the only reliable way to run the client tests is via the", 
   "TestSuite class.  That should be ok for now, but we'll want to revisit to see if we", 
   "can make this better.", 
   "* Commented out the Auth Cache test.  It's testing incorrect behavior.  I need to fix", 
   "up the cache code so that authenticated requests are properly handled.  Specifically,", 
   "authenticated requests must only be cached if the response is explicitly marked as", 
   "being cacheable (e.g. using Cache-Control: public)"
  ], 
  "revision_id": "434117"
 }, 
 {
  "author": "mprudhom", 
  "date": "2006-08-23T18:23:19.635995Z", 
  "msg": [
   "Changed packaging to \"pom\", since we aren't building a jar for this module."
  ], 
  "revision_id": "434116"
 }
]