[
 {
  "author": "mturyn", 
  "date": "2006-08-23T23:03:03.684107Z", 
  "msg": [
   "Removed separate dojo.js load, as that functionality's now handled in xapcore.js."
  ], 
  "revision_id": "434235"
 }, 
 {
  "author": "mturyn", 
  "date": "2006-08-23T23:00:17.177353Z", 
  "msg": [
   "Fixed a bug that can hit when setting attributes early---eventTriggers object doesn't seem to have been built.  Should investigate later:  error was only showing up for http://localhost:8080/xap/examples/htmlEmbedding/Example_3_specialAttributes_controlledComponentLevelDisplay.html, none of the other, very similar, examples in that same directory."
  ], 
  "revision_id": "434234"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-08-23T22:55:34.699791Z", 
  "msg": [
   "Current StAX cursor model implementations inconsistently handle DTDs.", 
   "Woodstox, for instance, does not provide a means of getting to the complete", 
   "doctype declaration (which is actually valid according to the spec, which", 
   "is broken).  The StAX reference impl returns the complete doctype declaration", 
   "despite the fact that doing so is apparently against the spec.  We can get", 
   "to the complete declaration in Woodstox if we want to use their proprietary", 
   "extension APIs.  It's unclear how other Stax impls handle this. So.. for now,", 
   "we're just going to ignore the DTD.  The DTD will still be processed as far", 
   "as entities are concerned, but we will not be able to reserialize the parsed", 
   "document with the DTD.  Since very few folks actually use DTD's in feeds", 
   "right now (and we should likely be encouraging folks not to do so), this", 
   "shouldn't be that big of a problem"
  ], 
  "revision_id": "434233"
 }, 
 {
  "author": "mturyn", 
  "date": "2006-08-23T22:47:38.385414Z", 
  "msg": [
   "Removed residual zimbra, dojo load (since that's now handled in xapcore.js)."
  ], 
  "revision_id": "434232"
 }, 
 {
  "author": "sichen", 
  "date": "2006-08-23T22:41:22.599926Z", 
  "msg": [
   "OFBIZ-155: Refactored processRefundReturn to handle any combination of payment methods, especially billing accounts (EXT_BILLACT).  Thanks to Chris Liberty."
  ], 
  "revision_id": "434231"
 }
]