[
 {
  "author": "ajaypaibir", 
  "date": "2005-11-17T18:37:27.663906Z", 
  "msg": [
   "Support for soap:header parts when mapped as a return to a SEI method.", 
   "Fixed a bug around return handling in the non-header case.", 
   "Added unit/system tests for soap:header parts mapped as return."
  ], 
  "revision_id": "434910"
 }, 
 {
  "author": "andreasmyth", 
  "date": "2005-11-17T17:45:00.137548Z", 
  "msg": [
   "Allow global element definition and type definition (for configuration metadata) to reside in different schema files.", 
   "Removed aliases for xml schema standard types and use the latter instead in standard configuration types schema (std-types.xsd).", 
   "Added support for types integer, short and float.", 
   "Code-generate beans for all configurable components (so far this was done only for test components).", 
   "Added component configuration for Service, Port, Endpoint, HTTP Client Transport and HTTP Server Transport.", 
   "For the latter, the configuration metadata is obtained by transforming http-conf-types.xsd(slightly modified to replace anonymous types by global types definitions).", 
   "Added a sample configuration file for the handler demo - this is not used yet but gives an idea of what configuration xml files should look like.", 
   "Mocked up most of the stuff needed in the HTTPTransport test.", 
   "Ship the schema  files in schema (wsdl,xsd, http-conf.xsd) etc.", 
   "Tried to make system servers to use the logging configuration files in build/test-classes/system but this causes the tests to hang - commented change."
  ], 
  "revision_id": "434909"
 }, 
 {
  "author": "ajaypaibir", 
  "date": "2005-11-17T14:22:35.759410Z", 
  "msg": [
   "Adding System Test for soap:header mapped to SEI method parameters. Tests such headers as in, inout and out mode."
  ], 
  "revision_id": "434908"
 }, 
 {
  "author": "cjodea", 
  "date": "2005-11-17T09:05:55.767578Z", 
  "msg": [
   "remove eclispe warnings from demos", 
   "apply pmd to demo sources during release build"
  ], 
  "revision_id": "434907"
 }, 
 {
  "author": "cjodea", 
  "date": "2005-11-17T08:44:50.043665Z", 
  "msg": [
   "fix eclipse unused variable warning"
  ], 
  "revision_id": "434906"
 }
]