[
 {
  "author": "seanoc", 
  "date": "2006-05-16T16:03:41.444132Z", 
  "msg": [
   "Fix for #305194", 
   "Samples don't exit immediately if an exception is thrown"
  ], 
  "revision_id": "435935"
 }, 
 {
  "author": "eglynn", 
  "date": "2006-05-16T12:43:10.914682Z", 
  "msg": [
   "Replaced fragile timing logic in HTTPTransportTest with condition variable"
  ], 
  "revision_id": "435934"
 }, 
 {
  "author": "cjodea", 
  "date": "2006-05-16T08:51:26.776865Z", 
  "msg": [
   "Allow resource handlers to initialised via @Resource injection", 
   "The JAXWS spec is not clear about handler initialisation.   The init method is not in the Handler interface anymore (was in previous revision) and there is a fuddled mention of injection.  This support is therefore disabled by default for User defined handlers.", 
   "This is the behaviour when enabled.", 
   "If there is an init method, it will be invoked.  If there is no init method, the init-param values specified in the handler-config will be injected into appropriately annotated members of the handler class.  When all values have been injected, any methods decorated with @PostConstruct will be called.", 
   "- turned off handler initialisation by injection or init method by default.  Can be enabled in config.", 
   "- add InitParamResourceResolver for resolving init params from handler config", 
   "- add init of handlers using @resource injection.  Will happen if enabled in config and no init method is present on handler.", 
   "- alllow ResourceManager to resolve resource from specified list of resolvers.", 
   "- trim handler class name and init params to remove extra white space"
  ], 
  "revision_id": "435933"
 }, 
 {
  "author": "peterjones", 
  "date": "2006-05-15T20:20:38.374830Z", 
  "msg": [
   "Fix to use ${path.separator} instead of ':'."
  ], 
  "revision_id": "435932"
 }, 
 {
  "author": "peterjones", 
  "date": "2006-05-15T18:05:17.379588Z", 
  "msg": [
   "Fix for bug 304894.", 
   "Update to maven-javadoc-plugin version 2.0 so we can filter packages.", 
   "Fixed a few javadoc warnings - the maven plugin lists the number of errors,", 
   "but eats the warning messages.", 
   "Removed two spurious test System.out.printlns.", 
   "Commented out a couple of version properties that were defined more than once", 
   "in trunk pom.xml."
  ], 
  "revision_id": "435931"
 }
]