[
 {
  "author": "dkulp", 
  "date": "2006-08-01T19:26:11.354690Z", 
  "msg": [
   "Fix setting the formatter settings for eclipse 3.2", 
   "* Change the way the formatter name is set for eclipse workspace to match what is needed for 3.2.   Probably won't work with 3.1 anymore. Upgrade.   :-)"
  ], 
  "revision_id": "436335"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-08-01T18:51:23.249619Z", 
  "msg": [
   "Add support for recording potential unwrapped things in service model", 
   "* Added flag to operation to determine if it could support being unwrapped", 
   "* Added internal \"MessageInfo\" to MessageInfo to record \"pseudo message\" for the unwrapped case", 
   "* Update WSDLServiceBuilder to detect potential wrapped operations and record that"
  ], 
  "revision_id": "436334"
 }, 
 {
  "author": "andreasmyth", 
  "date": "2006-08-01T15:33:30.358527Z", 
  "msg": [
   "APIs for management event handling in common.", 
   "Implementation of instrumentation manager and event processor in new project cxf-rt2-management.", 
   "Using a QName instead of a String as eventID should obsolete the need for subclassing the Event class and subsequent casts in event handling code."
  ], 
  "revision_id": "436333"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-08-01T15:12:41.415854Z", 
  "msg": [
   "Dependency updates, minor client api change, saaj jar removal", 
   "* Remove the SAAJ stuff from the maven_repo dir as they are now available on java.net.  Update groupid to reflect what Sun uploaded them to java.net.  (Only dependencies left in maven_repo are JSR250 and JSR181 jars)", 
   "* Create dependencyManagement section in the top level pom.  Updated all the poms for the \"new\" stuff (api2, rt2) and tools/common to just grab versions configured that way.  (You WILL need to do a \"mvn install\" top level for builds to work)", 
   "* Update Client \"invoke\" method to return Object[] instead o Object to reflect what will be in the response message.", 
   "* Downgrade (for now) the stax-api version and woodstox version to versions that have pom.xml files so maven will stop trying to download them."
  ], 
  "revision_id": "436332"
 }, 
 {
  "author": "eglynn", 
  "date": "2006-08-01T11:18:25.039127Z", 
  "msg": [
   "unified message abstractions", 
   "replaced Message.{get|set}|(Result|Source} with single {get|set}Content", 
   "fixed up inappropriate setResult/setSource usage"
  ], 
  "revision_id": "436331"
 }
]