[
 {
  "author": "dandiep", 
  "date": "2006-08-16T17:46:30.837540Z", 
  "msg": [
   "Add missing files... I really need to stop forgetting these."
  ], 
  "revision_id": "436440"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-16T17:41:20.772616Z", 
  "msg": [
   "o Get Wrapped interceptors working with other interceptors. This involved", 
   "mostly having them use Exchange properties instead of Message properties", 
   "and throwing Faults corectly. Also, I created a flag on operations which", 
   "signals that it can be unwrapped into separate parts. If it can, it does", 
   "so using WrapperHelper. WrapperHelper still needs to figure out the", 
   "class involved, so it can do its Boolean magic, but wanted to keep", 
   "moving towards helloworld...", 
   "o More flagrant ugly use of ExchangeConstants for now as many constants", 
   "on Message were Exchange constants.", 
   "o Used message.getContent(Object.class) instead of the invocation objects", 
   "property and the properties on ServiceInvokerInterceptor.", 
   "o Commented out RPC interceptors for now as it will take a bit more work to get", 
   "them and their tests up to speed with the Wrapped/Bare stuff. I am trying to", 
   "focus on the HelloWorld stuff instead. If someone thinks I should revisit", 
   "this immediately let me know (or someone else could too). I think they could", 
   "relatively easily extend the WrappedInterceptors which should make those", 
   "classes very simple. The only thing that should need to change between them", 
   "is the outgoing namespace on the RPCOutInterceptor."
  ], 
  "revision_id": "436439"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-08-16T16:49:59.629891Z", 
  "msg": [
   "Add junit dependency to more poms"
  ], 
  "revision_id": "436438"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-08-16T16:44:57.261591Z", 
  "msg": [
   "Add junit as test dependency"
  ], 
  "revision_id": "436437"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-08-16T16:27:59.111604Z", 
  "msg": [
   "Remove build warnings", 
   "* Remove warning of junit using local scope test instead of compile", 
   "* Fix unchecked warning in JAXWS"
  ], 
  "revision_id": "436436"
 }
]