[
 {
  "author": "andreasmyth", 
  "date": "2006-08-14T14:55:08.205334Z", 
  "msg": [
   "Fixed class names in some extensions fragments.", 
   "Moved GreeterTest from rt2-frontend-jaxws into systests2 - in order to find all extensions on which there is no explicit dependency in rt2-frontend-jaxws.", 
   "The test still fails with a ClassCastException but the bus is initialises and the soap binding factory activated via ns through the extension manager."
  ], 
  "revision_id": "436415"
 }, 
 {
  "author": "andreasmyth", 
  "date": "2006-08-14T13:35:37.371753Z", 
  "msg": [
   "Removed hierarchical structure of Configuration objects - ConfigurationBuilder to manage a flat map of Configuration objects keyed by CompoundName instead (both api/rt and api2/rt2).", 
   "Added config metadata mapping info for bus and instrumentation manager configuration.", 
   "Removed createProviderConfiguration/createConsumerConfiguration in jbi service unit implementation - not necessary as configuration builder is not static any more.", 
   "Added getId() to bus API so that retrieval of bus id does not require access to bus configuration (api2/rt2 only)."
  ], 
  "revision_id": "436414"
 }, 
 {
  "author": "mmao", 
  "date": "2006-08-14T09:11:36.019328Z", 
  "msg": [
   "* Removed the useless classes.", 
   "* The RPC interceptor unit tests should check if the process has any exceptions."
  ], 
  "revision_id": "436413"
 }, 
 {
  "author": "ffang", 
  "date": "2006-08-14T06:26:14.970488Z", 
  "msg": [
   "using static way to access static field"
  ], 
  "revision_id": "436412"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-11T14:53:40.373540Z", 
  "msg": [
   "o Add ChainInitiationObserver which starts a message flow when a Destination receives a message.o Create a ServerImpl", 
   "o Add commented out lines for Configuration building to CeltixBus which breaks CeltixBusTest", 
   "o Add commented out unit tests GreeterTest and EndpointImplTest which fail because the bus configuration  won't load.\""
  ], 
  "revision_id": "436411"
 }
]