[
 {
  "author": "dandiep", 
  "date": "2006-08-17T22:35:44.846818Z", 
  "msg": [
   "Make JUnit an optional dependency. It is now needed for the test package."
  ], 
  "revision_id": "436455"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-17T22:15:07.281640Z", 
  "msg": [
   "o Add response capability to the LocalTransport", 
   "o Add AbstractCXFTest for CXF developers and users to play messages against", 
   "a service. GreeterTest now uses it and properly fails.", 
   "o Add an XPathAssert utils class for AbstractCXFTest", 
   "o Add DOMUtils for XPath Assertions"
  ], 
  "revision_id": "436454"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-08-17T20:18:12.180408Z", 
  "msg": [
   "Call output chain", 
   "* Add Bus to exchange so it can be looked up later", 
   "* Move POST_INVOKE to \"in\" chain so cleanup can be done even if no output"
  ], 
  "revision_id": "436453"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-17T19:02:57.248417Z", 
  "msg": [
   "Add missing file."
  ], 
  "revision_id": "436452"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-17T18:49:19.696392Z", 
  "msg": [
   "o Add ClassLoaderUtils which loads classes from the correct classloaders.", 
   "If you need to do classloading, please use this as it handles the various", 
   "appservers correctly.", 
   "o Improve Service construction - put a Method in the OperationInfo for doing", 
   "invocations.", 
   "o Add SimpleMethodInvoker which invokes the service. This will definitely be", 
   "replace later by something which supports different scopes/factorys.", 
   "o Add a URIResolver to correct resolve URIs off the filesystem, classpath,", 
   "or from a remote location.", 
   "o Fix a minor bug in WSDLServiceBuilder where an operation wasn't be", 
   "recognized as wrapped if it didn't have any message parts.", 
   "o Fix WrappedInInterceptor to work with messages that don't have any message", 
   "parts.", 
   "o Move GreeterImpl to testutils as both the JAX-WS and Systests module use", 
   "it.", 
   "o Add an invocation count to GreeterImpl. We are actually invoking the", 
   "service now so assertEquals(1, greeter.getInvocationCount()) passes! :-)"
  ], 
  "revision_id": "436451"
 }
]