[
 {
  "author": "dandiep", 
  "date": "2006-08-15T02:14:56.480986Z", 
  "msg": [
   "Add ruleset."
  ], 
  "revision_id": "436420"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-15T01:59:42.215164Z", 
  "msg": [
   "o Start of invocation processing on the server side. We get through the", 
   "ReadHeadersInterceptor now.", 
   "o Added StaxInInterceptor to convert InputStream to XMLStreamReader", 
   "o Added Fault/SoapFault classes. Interceptors should use these classes to", 
   "signal that a Fault has occurred. And if its a Soap interceptor, it should", 
   "set the appropriate fault code.", 
   "o Added LocalTransportFactory for testing as I still didn't get HTTP working.", 
   "o Clean up soap module a bit.", 
   "o Cleaned up SoapOutInterceptor - attachment processing should not be", 
   "happening here. Also, writing the end of the envelope should be delayed too.", 
   "Will write more about this later when I have more time tomorrow.", 
   "o Removed catch()'s from soap unit tests as it is impossible to tell what", 
   "exception occurs if they're swallowed.", 
   "o I had to disable a checkstyle setting because it wouldn't allow me to", 
   "declare private static finals before my public static finals. But my", 
   "public ones depend on my private ones, so thats not exactly possible.", 
   "Any suggestions are welcome."
  ], 
  "revision_id": "436419"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-14T19:17:42.004419Z", 
  "msg": [
   "Comment out systest2 pom.xml as none of the systests really pass."
  ], 
  "revision_id": "436418"
 }, 
 {
  "author": "dandiep", 
  "date": "2006-08-14T18:43:40.716305Z", 
  "msg": [
   "o Add get/setter for @Resource in HttpTransportFactory (Can we do this by default? It is good for testing.)o Fix AbstractPropertiesHolder so multiple extensors worko Improve Greeter test, activateEndpoints still doesn't work due to HTTP issues."
  ], 
  "revision_id": "436417"
 }, 
 {
  "author": "andreasmyth", 
  "date": "2006-08-14T17:18:33.939954Z", 
  "msg": [
   "Tests for plain JAX-WS  client and server endpoint creation (client fails with same ClassCastException as GreeterTest).", 
   "Set javax.xml.ws.spi.Provider system property to new ProviderImpl in rt2-frontend-jaxws."
  ], 
  "revision_id": "436416"
 }
]