[
 {
  "author": "", 
  "date": "2004-09-10T23:31:21.121915Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "43694"
 }, 
 {
  "author": "jta", 
  "date": "2004-09-10T22:47:50.372612Z", 
  "msg": [
   "Initialized Papers tab"
  ], 
  "revision_id": "43693"
 }, 
 {
  "author": "mmerz", 
  "date": "2004-09-10T22:26:36.449413Z", 
  "msg": [
   "Added method and parameter level unit tests, modified the model classes to implement the correct defaults.", 
   "The model classes now have:", 
   "** empty constructor  -- primarily for the case of building model from WSDL -- this still needs some work", 
   "** constructor with (RequiredAnnotation,  required defaults, List<Annotations> optional annotations, more arguments).  The first argument is the required annotation for the model object (e.g. @webmethod for method, but for case of WebParam, it may NOT be null), followed by other required arguments for the class, followed the list of optional annotations,", 
   "**  InitFromAnnotation(annotation) for all anotations that the model expects, it should enforce the JSR 181 defaults for a given anotation.", 
   "Here is how the new model classes work:", 
   "a)       Model attributes are not initialized by default.  – this would make sure the  constructors are initializing the class properly.", 
   "b)       the model class attributes are initialized in the empty constructor as required in the WSDL case", 
   "c)       In the constructor with the (required annotation, other required defaults. List<Annotoation>.) we do the following:", 
   "1:        first check to make sure the required annotation are not null,", 
   "2:      initialize the model attributes based on the required annotations as if  there are no optional annotations", 
   "3:       For each annotation in the list of optional annotation call initFromAnnotation", 
   "4:       The container model class (e.g. Method for Parameters, or Type for Method and Parameters) are responsible for setting the missing defaults that could not have been set when the model class was created.", 
   "Contributor:  Daryoush Mehrtash"
  ], 
  "revision_id": "43692"
 }, 
 {
  "author": "", 
  "date": "2004-09-10T22:20:07.242350Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "43691"
 }, 
 {
  "author": "ekoneil", 
  "date": "2004-09-10T21:26:16.150229Z", 
  "msg": [
   "Fixup the parenting requirements specified in the TLDX for the data grid tags.", 
   "Remove references in the config tags handler to the old netui-datagrid tag library.", 
   "CR: Daryl", 
   "BB: self", 
   "BVT: NetUI pass"
  ], 
  "revision_id": "43690"
 }
]