[
 {
  "author": "gregw", 
  "date": "2003-08-14T07:14:34.000000Z", 
  "msg": [
   "This commit is an attempt to continue moving gently towards the JSR77 state mechanism", 
   "without committing to any MBean backbone choise etc.", 
   "This commit has some of the ideas from the patch submitted by gianny_damour@hotmail.com", 
   "Specifically the addition of the JSR77 state change notifications to the State class.", 
   "However I have left his full notification mechanism out for now, as I am unclear", 
   "if this is the way we are going.  I have put and abstract notification method", 
   "onto AbstractComponent, so it will be simple to add the real notification mechanism when", 
   "we know what that is.", 
   "The rest of the commit is more in the same theme. Gently moving towards JSR77.", 
   "I have extracted the state stuff from Component into a StateManageable interface", 
   "and an AbstractStateManageable.", 
   "Unfortunately JSR77 wants it's state as an int, so getState now returns", 
   "an int.  But getStateInstance is there to get the object itself.  I have", 
   "put a bit more toInt an fromInt support into the State class.", 
   "For symmetry I created the AbstractContainer class, but it does nothing", 
   "at this stage.  It needs the startRecursive handling moved to it once", 
   "we have a real Container interface (one which you can iterate over", 
   "the Components would be good).", 
   "Submitted by: Greg Wilkins", 
   "Reviewed by: Nameless the cat"
  ], 
  "revision_id": "43779"
 }, 
 {
  "author": "dain", 
  "date": "2003-08-14T00:02:43.000000Z", 
  "msg": [
   "Deployment system now will wait for relationship type to be registered and for related MBeans to be created before attempting to enroll a MBean in a relationship.  This also delays the create callback until all related MBeans have been registered with the MBeanServer and have been enrolled in the relationship."
  ], 
  "revision_id": "43778"
 }, 
 {
  "author": "dain", 
  "date": "2003-08-13T21:21:02.000000Z", 
  "msg": [
   "RelationshipMBeanProxyFactory creates a proxies to an mbean based solely on a relationship id and a target role.  The relationship is not resolved until runtime, so the proxy remains valid as the relationship changes over time."
  ], 
  "revision_id": "43777"
 }, 
 {
  "author": "dain", 
  "date": "2003-08-13T21:18:47.000000Z", 
  "msg": [
   "Moved invocation handler to a top level class, so it can be easily reused by other MBeanProxyFactories."
  ], 
  "revision_id": "43776"
 }, 
 {
  "author": "dain", 
  "date": "2003-08-13T21:17:32.000000Z", 
  "msg": [
   "Fixed MBean relationship creation.  I was assuming that a relationship could only have two roles, but a relationship can have zero or more roles."
  ], 
  "revision_id": "43775"
 }
]