[
 {
  "author": "craigmcc", 
  "date": "2006-08-28T23:51:07.053666Z", 
  "msg": [
   "State machine implementation for shale-dialog2 that refactors the", 
   "existing machinery to use the new APIs.  The new implementation has not", 
   "been tested yet.", 
   "This implementation was partly done as a proof that the abstracted API", 
   "in shale-dialog2 is actually sufficient to implement a version of the", 
   "existing functionality, but also might be useful if we decide to stick", 
   "with some variant of the existing state machine approach.", 
   "SHALE-10 SHALE-48 SHALE-61"
  ], 
  "revision_id": "437880"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-08-28T23:48:48.327033Z", 
  "msg": [
   "Beginnings of experiments on improving the Dialog functionality in", 
   "Shale.", 
   "Abstract out the basic interfaces required to operate in a dialog", 
   "environment from the implementation of the state machine.  The primary", 
   "interface is o.a.s.dialog2.Context, which is instantiated (in request", 
   "scope) once per active dialog for a user.  It plays a similar role to", 
   "what Status does in the current implementation (but does not suffer from", 
   "\"one active dialog per user\" problems).  In addition, there is a", 
   "simplified Dialog2NavigationHandler that utilizes the new approach to", 
   "start up a Context based on a logical outcome with a matching prefix,", 
   "but it will also be possible to start a dialog instance", 
   "programmatically, by interacting with a o.a.s.dialog2.Contexts (note the", 
   "trailing \"s\") instance provided by a state machine implementation.", 
   "This API is packaged in a separate package (org.apache.shale.dialog2),", 
   "and uses unique attribute keys for everything, so that it should not", 
   "interfere with the existing functionality while we are experimenting.", 
   "In fact, as you can see from the POM, it has no direct dependency on the", 
   "rest of Shale at the moment either.  All you'd need to add is this JAR,", 
   "plus the state machine implementation for your favorite version (see", 
   "upcoming submits).", 
   "WARNING:  This code has been desk checked, and compiles clean, but has", 
   "not been tested for real yet.  I'm committing now for feedback on the", 
   "design approach, and so we can all experiment.", 
   "SHALE-10 SHALE-48 SHALE-61"
  ], 
  "revision_id": "437879"
 }, 
 {
  "author": "carlos", 
  "date": "2006-08-28T23:44:10.162432Z", 
  "msg": [
   "Make the redirect relative"
  ], 
  "revision_id": "437878"
 }, 
 {
  "author": "carlos", 
  "date": "2006-08-28T23:44:08.653862Z", 
  "msg": [
   "Make the redirect relative"
  ], 
  "revision_id": "437877"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-08-28T23:35:04.334804Z", 
  "msg": [
   "* Add the ability to lookup NamedWriter instances by the media type of the output", 
   "format they support (e.g., WriterFactory.getWriterByMediaType(\"application/json\"); )", 
   "* Create an abstract base impl for NamedWriters", 
   "* Modify the JSON and PrettyXML writers to use the abstract base impl"
  ], 
  "revision_id": "437876"
 }
]