[
 {
  "author": "rfeng", 
  "date": "2006-08-29T17:35:28.452375Z", 
  "msg": [
   "Fix checkstyle warning"
  ], 
  "revision_id": "438125"
 }, 
 {
  "author": "cschoett", 
  "date": "2006-08-29T17:29:48.604140Z", 
  "msg": [
   "Fix for BEEHIVE-1140, updated the o.a.b.c.s.e.i.EJBJarDescriptorHandler to correctly process ejb-jar files which include entity beans for which an EJBControl has been created.", 
   "Also added new assembly junit tests for the entity bean case."
  ], 
  "revision_id": "438124"
 }, 
 {
  "author": "jm", 
  "date": "2006-08-29T17:28:08.285485Z", 
  "msg": [
   "top-level MANIFEST updates to include new apache2 module code"
  ], 
  "revision_id": "438123"
 }, 
 {
  "author": "mikem", 
  "date": "2006-08-29T17:25:23.203746Z", 
  "msg": [
   "DERBY-1130", 
   "contributed by Deepa Remesh", 
   "Committing patch 'd1130-v2.diff' which ensures that database name set using setConnectionAttributes does not get used by client data sources. Changes are:", 
   "1) Appends the attributes in setConnectionAttributes method to database name only if database name has been already set on the data source. This will handle both these cases successfully:", 
   "a) When database name is not set as a DataSource property - In this case, if we pass in database name as a connection attribute, it will not get used. databaseName is a required Derby DataSource property. If it is not set, we cannot get a connection using the DataSource. It will fail with the following exception:", 
   "08001 - Required Derby DataSource property databaseName not set.", 
   "So, there is no need to append the connectionAttributes to the database name variable if databaseName DataSource property is not set. This way, we can avoid using database name in case it is passed in as a connection attribute.", 
   "Without the patch, if database name was not set, the code was using \"null\" as database name and creating a database named null if \"create=true\" is specified or throwing an exception that it cannot connect to database named null.", 
   "b) When database name is set as a DataSource property - In this case, if we pass in database name as a connection attribute, it will not be used. This is because database name set as DataSource property will over-ride it. This case is correctly handled (even without the patch).", 
   "2) The exception message is changed to indicate we are referring to \"Derby DataSource\" property:", 
   "08001 - Required Derby DataSource property databaseName not set.", 
   "3) Adds test to jdbcapi/checkDataSource.java. Adds a new method \"testClientDSConnectionAttributes\" which is run only in client framework. Modifies master files."
  ], 
  "revision_id": "438122"
 }, 
 {
  "author": "ruchithf", 
  "date": "2006-08-29T17:23:34.780680Z", 
  "msg": [
   "1.) Fixed the key derivation to use two label values properly", 
   "2.) Updated the saml namespace"
  ], 
  "revision_id": "438121"
 }
]