[
 {
  "author": "mszefler", 
  "date": "2006-08-30T16:29:24.985826Z", 
  "msg": [
   "Removed old deployment descriptor", 
   "Use QNames in deploy descriptor for process properties"
  ], 
  "revision_id": "438535"
 }, 
 {
  "author": "", 
  "date": "2006-08-30T16:27:58.689269Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "438534"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-08-30T16:26:59.692300Z", 
  "msg": [
   "Continued work on the server implementation.", 
   "* Refactor the new Target to be a bit more flexible.  TargetResolver and Target", 
   "are now interfaces in the org.apache.abdera.server.target package.  Specific", 
   "deployments of the AbderaServlet can specify a TargetResolver implementation.", 
   "* RegexTargetResolver and RegexTarget implementation for specifying targets", 
   "based on regular expression matching", 
   "* RequestHandlerFactory ... pass in AbderaServer when creating a RequestHandler", 
   "* RequestContext ... Method to get the resolved Target for this request", 
   "* AbderaServerException ... Constructors and methods for setting the content of", 
   "the error response from a string, URL or other DataSource", 
   "* Rename the old BaseRequestHandler and BaseResponseContext to", 
   "AbstractRequestHandler and AbstractResponseContext", 
   "* Create a new BaseResponseContext that extends AbstractResponseContext and", 
   "handles the details of returning Feed Object Model objects (e.g. entry, feed,", 
   "and service documents)", 
   "* Create a new EmptyResponseContext for returning empty responses", 
   "* Abdera Servlet... resolve the TargetResolver from the Servlet init params", 
   "or abderaconfiguration... pull the RequestHandlerFactory from the init", 
   "params or abderaconfiguration.  Store both the TargetResolver and", 
   "RequestHandlerFactory in the servlet context once resolved. Don't return", 
   "a customized status text message (for now).", 
   "* ResourceType... rename \"INTROSPECTION\" to \"SERVICE\" per a change in the", 
   "APP spec.  \"Introspection docs\" are now referred to as \"Service docs\"", 
   "More to come"
  ], 
  "revision_id": "438533"
 }, 
 {
  "author": "husted", 
  "date": "2006-08-30T16:13:17.224364Z", 
  "msg": [
   "WW-1349 Update and Add READMEs for applications."
  ], 
  "revision_id": "438532"
 }, 
 {
  "author": "mszefler", 
  "date": "2006-08-30T16:11:05.335634Z", 
  "msg": [
   "Removed straggler."
  ], 
  "revision_id": "438531"
 }
]