[
 {
  "author": "trustin", 
  "date": "2006-09-08T03:38:20.695787Z", 
  "msg": [
   "Resolved issue: DIRMINA-245 (MINA does not fire read events)", 
   "Resolved issue: DIRMINA-260 (Utilize backport-util-concurrent Executor)", 
   "* Renamed:", 
   "** ThreadPoolFilter -> ExecutorFilter", 
   "** PooledThreadModel -> ExecutorThreadModel", 
   "** org.apache.mina.filter.thread -> org.apache.mina.filter.executor"
  ], 
  "revision_id": "441365"
 }, 
 {
  "author": "chestnut", 
  "date": "2006-09-08T03:28:55.651076Z", 
  "msg": [
   "add single resource Doc and not all docs in area to the ArrayList for each resource"
  ], 
  "revision_id": "441364"
 }, 
 {
  "author": "danj", 
  "date": "2006-09-08T03:26:41.568198Z", 
  "msg": [
   "Two fixes:", 
   "1. Modified documentation link so that it goes to the current release's documentation section.", 
   "2. Removed the JavaScript highlight box thing from selected menu items and replaced it with a simple bold-ing of the", 
   "selected item. This not only prevents the slight shifting of the words but also an IE-only bug in the display. We", 
   "still have highlighting, but it's not as loud and doesn't require javascript/css."
  ], 
  "revision_id": "441363"
 }, 
 {
  "author": "ningjiang", 
  "date": "2006-09-08T03:25:54.858753Z", 
  "msg": [
   "[CXF-39] Implement Destination & Conduit API for JMS transport"
  ], 
  "revision_id": "441362"
 }, 
 {
  "author": "danj", 
  "date": "2006-09-08T03:23:16.107305Z", 
  "msg": [
   "Last refactoring of /docs, I swear. I realized that my plan for supporting multiple version of the documentation (for past", 
   "releases and the current release) was flawed and modified the directory structure so that we can do this properly. The", 
   "docs/index.html file now forwards to the latest version (docs/x.y.z/index.html), and each release can contain only the", 
   "directory that contains their version of the docs. I may change docs/index.html to have a list of the previous versions.", 
   "Also, I filled in 2/3 of the content for step 5 of the tutorial. step 2 is a little more accurate as well."
  ], 
  "revision_id": "441361"
 }
]