[
 {
  "author": "bpendleton", 
  "date": "2006-09-09T04:40:56.195451Z", 
  "msg": [
   "DERBY-1759: XMLSERIALIZE doesn't follow spec when serializing sequence", 
   "This patch was contributed by Army Brown (qozinx@gmail.com)", 
   "The patch does the following:", 
   "1. Adds logic to SqlXmlUtil.serializeToString() to perform the", 
   "steps of \"sequence normalization\" as required by XML serialization", 
   "rules. This includes throwing an error if the user attempts to", 
   "explicitly serialize a sequence that contains one or more top-level", 
   "attribute nodes.", 
   "2. In order to ensure that the serialization error is only thrown", 
   "when the user performs an explicit XMLSERIALIZE, I added a", 
   "new field, \"containsTopLevelAttr\", to the XML class. This field", 
   "indicates whether or not the XML value corresponds to a sequence", 
   "with a top-level attribute node. If the user calls XMLSERIALIZE", 
   "on an XMLDataValue for which containsTopLevelAttr is true,", 
   "then we'll throw the serialization error 2200W as dictated by", 
   "SQL/XML.", 
   "3. Adds appropriate test cases to lang/xml_general.sql to verify", 
   "the fix.", 
   "4. Since Xalan doesn't provide a built-in way to retrieve a sequence", 
   "of attribue values (as opposed to attribute nodes), I also included", 
   "in lang/xml_general.sql a (rather ugly) way to accomplish that", 
   "task within the serialization restrictions of SQL/XML."
  ], 
  "revision_id": "441740"
 }, 
 {
  "author": "geirm", 
  "date": "2006-09-09T04:40:40.806220Z", 
  "msg": [
   "more tweaks - Remove the java version from what the launcher", 
   "ever prints as it doesn't know, and  also let -showversion", 
   "go through to VM as that is The Way Sun Does It! (amen)"
  ], 
  "revision_id": "441739"
 }, 
 {
  "author": "damitha", 
  "date": "2006-09-09T04:40:23.539128Z", 
  "msg": [
   "rm_ping is now working"
  ], 
  "revision_id": "441738"
 }, 
 {
  "author": "geirm", 
  "date": "2006-09-09T04:24:59.190085Z", 
  "msg": [
   "tweaks - make it so that on", 
   "java -version", 
   "the version is printed after the exec() so we don't get double", 
   "print  and also let it continue so we get launcher version *and* VM version, if VM", 
   "supports such foolishness"
  ], 
  "revision_id": "441737"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-09-09T04:15:54.292647Z", 
  "msg": [
   "Added functionality for picking out and retrying CC auths for NSF failures, meant for auto-orders to get better chance of successful charge for subscriptions and such; tries once a week for the number of times specified on the ProductStore"
  ], 
  "revision_id": "441736"
 }
]