[
 {
  "author": "elecharny", 
  "date": "2006-09-09T02:18:14.677291Z", 
  "msg": [
   "Reformated somme comments.", 
   "Removed the serialUID"
  ], 
  "revision_id": "441725"
 }, 
 {
  "author": "husted", 
  "date": "2006-09-09T02:00:09.185175Z", 
  "msg": [
   "WW-1349 Update site menu to omit reference to obsolete TLD docs. Update some remaining WW references."
  ], 
  "revision_id": "441724"
 }, 
 {
  "author": "crossley", 
  "date": "2006-09-09T01:40:03.025899Z", 
  "msg": [
   "Explain the \"checksums\" feature of Cocoon CLI and its use with forrestbot."
  ], 
  "revision_id": "441723"
 }, 
 {
  "author": "mikem", 
  "date": "2006-09-09T01:29:42.814789Z", 
  "msg": [
   "DERBY-1675", 
   "contributed by Sunitha Kambhampati", 
   "USRIDPWD support depends on the JCE available in the classpath of the server", 
   "This patch(derby1675.diff.txt) does the following", 
   "1. Add code to check if server jvm can support EUSRIDPWD.", 
   "2. Throw an error if the derby.drda.securityMechanism is set to ENCRYPTED_USER_AND_PASSWORD_SECURITY", 
   "and if the server jvm cannot support EUSRIDPWD.", 
   "3. Server sends the client the list of supported security mechanisms as part of ACCSECRD. Now, the server will correctly only send EUSRIDPWD as an option if the running server can support this security mechanism.", 
   "Test related changes:", 
   "Changes were made to testProtocol.java and a new method readSecMecAndSECCHKCD is added to TestProto to read the SECMEC and SECCHKCD values. Note, that with ibm142 and ibm15 jvms that support eusridpwd, the SECMEC value 9 (eusridpwd) will be sent as part of the ACCSECRD response. But for the jvms that dont support the eusridpwd, the SECMEC value of 9 wont be sent. The new method readSecMecAndSECCHKCD takes", 
   "care of printing out the SECMEC values that are sent by the server - this results in the need for a new master file for the jvm that support eusridpwd and the jvm that cannot support it. A new master file has been added for ibm14.", 
   "Tests for codepath that covers #2 is already present in testSecMec.java. This results in themaster updates for the jvms that do not support eusridpwd for the case where server is started with", 
   "derby..drda.securityMechanism=ENCRYPTED_USER_AND_PASSWORD_SECURITY."
  ], 
  "revision_id": "441722"
 }, 
 {
  "author": "rfeng", 
  "date": "2006-09-09T01:14:59.808826Z", 
  "msg": [
   "Re-activate interface.wsdl support"
  ], 
  "revision_id": "441721"
 }
]