[
 {
  "author": "bago", 
  "date": "2006-09-09T12:23:02.465859Z", 
  "msg": [
   "First pass for JAMES-611:", 
   "Removed finalizers from MimeMessageCopyOnWriteProxy and MimeMessageInputStreamSource: the finalizers were simple calls to dispose(), nothing more.", 
   "Fixed one MailImpl constructor to handle exceptions during the construction and related resource disposal: we should review every other constructor (this one was leaking on MessageSizeException).", 
   "Added a check in MimeMessageInputStreamSource to remove the just created file if the input stream throw an IOError (was leaking on MessageSizeException)", 
   "Added a check in DeleCmdHandler to make sure we dispose the loaded mail when replacing it with the DELETED object (must be reviewed: maybe it would be better to dispose it when we close the connection and delete the messages from the repository).", 
   "POP3Handler: added a loop over backupUserMailbox when resetting the handler to make sure objects are disposed (not sure this is the right thing to do)", 
   "Updated a lot of tests to make sure they dispose messages/mails they create."
  ], 
  "revision_id": "441785"
 }, 
 {
  "author": "idus", 
  "date": "2006-09-09T12:16:51.705475Z", 
  "msg": [
   "cosmetics"
  ], 
  "revision_id": "441784"
 }, 
 {
  "author": "damitha", 
  "date": "2006-09-09T11:58:35.366777Z", 
  "msg": [
   "Now RM is working in following schenarios", 
   "rm_ping", 
   "rm_echo dual client non blocking", 
   "rm_echo dual client blocing"
  ], 
  "revision_id": "441783"
 }, 
 {
  "author": "norman", 
  "date": "2006-09-09T11:55:32.804996Z", 
  "msg": [
   "Better log string"
  ], 
  "revision_id": "441782"
 }, 
 {
  "author": "ruchithf", 
  "date": "2006-09-09T11:31:42.955883Z", 
  "msg": [
   "Updated MessageBuilder", 
   "- to get processed policy from the config context if available", 
   "- to move general token acquisition code into methods within MessageBuilder", 
   "Fixed SimpleTokenStoreTest"
  ], 
  "revision_id": "441781"
 }
]