[
 {
  "author": "carlos", 
  "date": "2006-09-12T17:33:47.761512Z", 
  "msg": [
   "Config file had changed name"
  ], 
  "revision_id": "442650"
 }, 
 {
  "author": "snoopdave", 
  "date": "2006-09-12T17:33:18.588749Z", 
  "msg": [
   "Final changes before RC1"
  ], 
  "revision_id": "442649"
 }, 
 {
  "author": "jboynes", 
  "date": "2006-09-12T17:25:53.964399Z", 
  "msg": [
   "commit patch from Venkat for TUSCANY-715"
  ], 
  "revision_id": "442648"
 }, 
 {
  "author": "suresht", 
  "date": "2006-09-12T17:25:10.249447Z", 
  "msg": [
   "DERBY-1786 (a crash during re-encryption may cause an unrecoverable db)", 
   "The problem was when transaction log spans more than one log file during (re)", 
   "encryption of the database and if there is a crash just before switching the", 
   "database to use the new encryption properties; On recovery checkpoint in the", 
   "first log file is used as reference and the next log file is assumed to have", 
   "the commit log record for (re) encryption and deleted incorrectly to force the", 
   "roll-back , which lead to the incomplete rollback of re-encryption. And that", 
   "caused recovery failures on next (re) encryption crashed.", 
   "This patch fixes the problem by ensuring there a checkpoint record in the", 
   "last log file before creating a new log file with new encryption properties", 
   "and writing the commit log record. Log is also flushed before making the", 
   "transaction log use the new encryption key to avoid any part of old log", 
   "records in the buffers getting encrypted with the new encryption key.", 
   "While working on this problem , I noticed error message thrown incase of", 
   "re-encryption failures are confusing, added a new error message to indicate", 
   "failures specific to (re) encryption."
  ], 
  "revision_id": "442647"
 }, 
 {
  "author": "fuzzylogic", 
  "date": "2006-09-12T17:03:01.275086Z", 
  "msg": [
   "DERBY-1843: Pass arguments to derby_common.bat for processing."
  ], 
  "revision_id": "442646"
 }
]