[
 {
  "author": "kevan", 
  "date": "2006-09-13T02:04:35.051189Z", 
  "msg": [
   "GERONIMO-2313 Merge security fixes onto trunk. Insure that the Context contains the appropriate caller."
  ], 
  "revision_id": "442795"
 }, 
 {
  "author": "antoine", 
  "date": "2006-09-13T02:03:07.239283Z", 
  "msg": [
   "fix javadoc parameter"
  ], 
  "revision_id": "442794"
 }, 
 {
  "author": "sichen", 
  "date": "2006-09-13T02:02:09.230043Z", 
  "msg": [
   "After the order is packed, the list of available invoices will be shown on the packing screen, so that the invoices can be printed right there, instead of going back to the order again"
  ], 
  "revision_id": "442793"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-09-13T02:00:35.208154Z", 
  "msg": [
   "Ok, so the server code was coming along but it was getting rather difficult to manage", 
   "and was quickly becoming complicated and way too overabstracted.  So, I decided to", 
   "simplify things a bit.  This is a big update that greatly improves the overall design", 
   "of the server code.", 
   "RequestHandlers have been refactored to depend directly on the servlet api and a", 
   "default implementation provided.  End developers should only have to worry about", 
   "implementing a RequestHandler if they are extending the core APP methods (e.g. if", 
   "someone wants to support COPY, etc).  RequestHandler's are pooled by default.", 
   "Provider has been fleshed out more and is the primary interface for interacting with", 
   "a backend Atom Store.", 
   "AbderaServer has been replaced by a much more improved ServiceContext element that is", 
   "accessed from a Singleton ServiceManager.", 
   "TargetResolver is still there are pretty much does the same thing it did before except", 
   "with a relatively minor API change.", 
   "SubjectResolver is still there and I have successfully tested it with third party auth", 
   "tools like Acegi.", 
   "A new EntityTag class is provided that implements strong and weak entity tags, checking", 
   "for matches between entity tags, etc.  The client and server code has been modified to", 
   "use this new class.", 
   "The example APP server has been updated to demonstrate the new design.", 
   "A test suite for the server component has been started, but has not yet been plugged into", 
   "the build."
  ], 
  "revision_id": "442792"
 }, 
 {
  "author": "tli", 
  "date": "2006-09-13T01:59:10.573315Z", 
  "msg": [
   "fix xml wrap test"
  ], 
  "revision_id": "442791"
 }
]