[
 {
  "author": "", 
  "date": "2006-09-14T06:22:30.280716Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "443260"
 }, 
 {
  "author": "samisa", 
  "date": "2006-09-14T06:21:48.128639Z", 
  "msg": [
   "Fixed seg fault when no comments in axis2.xml"
  ], 
  "revision_id": "443259"
 }, 
 {
  "author": "carnold", 
  "date": "2006-09-14T06:21:30.768172Z", 
  "msg": [
   "Bug 40172: Make log4j 1.2 and 1.3 documentation consistent"
  ], 
  "revision_id": "443258"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-09-14T06:17:34.122750Z", 
  "msg": [
   "Make changes needed due to the refactoring of Maven dependencies in the", 
   "Shale Framework POMs."
  ], 
  "revision_id": "443257"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-09-14T06:16:55.865645Z", 
  "msg": [
   "Implement a fairly massive refactoring of our Maven2 build dependencies,", 
   "and (along the way) address the issues raised by SHALE-258 (although", 
   "they are probably not completely covered yet).  Highlights of the", 
   "changes:", 
   "* Dependencies to compile the Shale Framework libraries have been", 
   "adjusted to always use the MyFaces API jar (it should not matter", 
   "which implementation is used to compile against, because the signature", 
   "tests in the TCK will ensure method signature compatibility).", 
   "* Migrate as many dependency version numbers as possible into the", 
   "<dependencyManagement> section of the shale-parent POM, along with", 
   "exclusions that avoid adding optional dependencies to the classpath.", 
   "* Move the profile stuff about choosing MyFaces or the JSF RI into the", 
   "shale-apps-parent POM, instead of shale-parent, since this now only", 
   "affects webapps.", 
   "* There is a wierd test failure on the shale-clay unit tests that I", 
   "could not figure out, so I commented out those test cases for now.", 
   "Gary, could you take a look at CommentTestCase?", 
   "* There is some really wierd Maven2 behavior related to exclusions", 
   "in the dependency management section of shale-parent that I don't", 
   "understand yet ... Maven mavens please review1!  For example, I", 
   "would like to exclude commons-digester from the myfaces:myfaces-api", 
   "dependency, so that a framework library that happens to need", 
   "the JSF APIs won't also be able to use Digester APIs without", 
   "explicitly declaring a dependency on commons-digester.  For some", 
   "reason, doing this prevents the explicit dependency from being", 
   "recognized.  Strange ...", 
   "* At this point, all the unit and system integration tests run", 
   "(and they will in the sandbox once I do a parallel commit there", 
   "to account for the changes), but I haven't done any thorough", 
   "testing to gauge impacts of these changes.  But, the advertised", 
   "dependencies seem to be much closer to the minimal required set."
  ], 
  "revision_id": "443256"
 }
]