[
 {
  "author": "ammulder", 
  "date": "2003-10-07T17:16:37.000000Z", 
  "msg": [
   "Continue work on web app support for JSR-88 client", 
   "- move more module-specific code into module dirs", 
   "- move more module-independent code into j2ee dir", 
   "- enhance JNDI ref interfaces", 
   "- move common ref loading/storing into j2ee dir", 
   "- update manifest with proper JavaBean packages", 
   "- initial web app DConfigBeans, DeploymentConfiguration, DeployableObject", 
   "- update command-line deployer to offer the same feature for WARs as for", 
   "EJB JARs", 
   "Not done yet:", 
   "- still need to implement DD writing for geronimo-web.xml", 
   "- only JNDI refs are available in geronimo-web.xml XSD, POJOs, DCBs", 
   "- still need to replace current (Sun) geronimo-web.xml", 
   "- still need web app POJO test cases"
  ], 
  "revision_id": "44354"
 }, 
 {
  "author": "ammulder", 
  "date": "2003-10-06T14:35:34.000000Z", 
  "msg": [
   "Repackage the JSR-88 server implementation", 
   "- now uses .server instead of .provider", 
   "- now uses .ejb instead of .jar", 
   "- the DConfigBeans related to \"j2ee\" elements are in a .j2ee package", 
   "- the common stuff is no longer in .ejb", 
   "Hook up the DConfigBeans to the server", 
   "- the DConfigBeans all have access to the server connection so they can", 
   "look up values for \"drop-down lists\", etc."
  ], 
  "revision_id": "44353"
 }, 
 {
  "author": "janb", 
  "date": "2003-10-05T01:39:48.000000Z", 
  "msg": [
   "Task to handle removal of a webapp from it's containment hierarchy as part of undeploy"
  ], 
  "revision_id": "44352"
 }, 
 {
  "author": "janb", 
  "date": "2003-10-05T01:38:21.000000Z", 
  "msg": [
   "Added a few comments here and there.", 
   "Most importantly, implemented undeploy, so webapps can be hot deployed and", 
   "now hot-undeployed.", 
   "Redeploy is a lot harder and needs some mods to the scanner service."
  ], 
  "revision_id": "44351"
 }, 
 {
  "author": "janb", 
  "date": "2003-10-05T01:37:00.000000Z", 
  "msg": [
   "The Service deployer current will undeploy absolutely everything because it", 
   "does not check to see if it is a suitable thing for it to undeploy. This is", 
   "stopping the undeployment of web apps, so I've put in a temporary patch which", 
   "at least checks if the url being deployed is a service xml descriptor. Note", 
   "that this won't work for unpacked service directories, but that is a much harder", 
   "problem to solve and requires more co-operation from the scanner, so I'm leaving", 
   "that as an exercise for the reader to solve :-)"
  ], 
  "revision_id": "44350"
 }
]