[
 {
  "author": "dblevins", 
  "date": "2002-07-18T03:36:58.000000Z", 
  "msg": [
   "He he"
  ], 
  "revision_id": "443855"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-07-18T02:59:27.000000Z", 
  "msg": [
   "Excplicitly closing the connection with clients not allowed to administer", 
   "the server."
  ], 
  "revision_id": "443854"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-07-18T01:25:37.000000Z", 
  "msg": [
   "Task [ 581804 ] Add a Stop class that can be called from", 
   "Documented the stop command in the bin/commands.txt"
  ], 
  "revision_id": "443853"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-07-18T01:16:28.000000Z", 
  "msg": [
   "Feature request [ 575560 ] Jane! Stop this crazy thing!", 
   "Task [ 581804 ] Add a Stop class that can be called from", 
   "-- Added a Stop class that can be called from the scripts.", 
   "The stop class opens a socket connection to the server and sends the STOP_REQUEST. The IP and port are configurable, just as with the start command.", 
   "The start command now contains an --admin-ip option which allows you to specify exactly who can a send stop requests.  Stop requests from IPs not in the admin list will be ignored.", 
   "-- Added a stop command to the openejb.sh and openejb.bat scripts", 
   "-- Added help for the stop command."
  ], 
  "revision_id": "443852"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-07-17T05:15:19.000000Z", 
  "msg": [
   "[ 582624 ] Admin Console: Basic Telnet impl", 
   "Implemented the ability to accept option negotiations, send replies to option", 
   "requests, and request options.", 
   "The TelnetInputStream wraps another imput stream and simply intercepts the", 
   "telnet Interpret As Command byte (255) and passes control off to the TelnetConsole", 
   "that created it.", 
   "The TelnetConsole carries out the option negotiation and sends a reply back", 
   "to the client if required.  If the command is not an option negotiation, the", 
   "command is ignored.", 
   "Support for other basic telnet commands still needs to be added, but at least", 
   "now there is support for negotiation of options.", 
   "At the moment the TelnetConsole starts up and immediately requests that many", 
   "of the common options be disabled.  This should result in a client that echos", 
   "characters to the client automatically and has behavior like a basic NVT (Network", 
   "Virtual Terminal)"
  ], 
  "revision_id": "443851"
 }
]