[
 {
  "author": "dblevins", 
  "date": "2002-08-20T02:34:45.000000Z", 
  "msg": [
   "Added HomeHandle support back into the interface."
  ], 
  "revision_id": "443905"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-08-20T02:31:10.000000Z", 
  "msg": [
   "[Fix #15][transaction]", 
   "TransactionPolicy.  Heavy amounts of logging added.  These logging", 
   "statements use to org.openejb.util.Loggers, one for the OpenEJB category", 
   "and one for a new Transaction category."
  ], 
  "revision_id": "443904"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-08-20T01:33:14.000000Z", 
  "msg": [
   "[Fix #12][entity]", 
   "EntityContainer.  Several fixes to the use of pooling, this also fixes the", 
   "load/store problems.", 
   "[Fix #14][entity]", 
   "EntityInstanceManager.  Performance fixes. Instead of keeping pools of", 
   "simple objects, we discard the objects and create them again.  JDK 1.3 and", 
   "higher are better at reusing instances."
  ], 
  "revision_id": "443903"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-08-19T22:33:27.000000Z", 
  "msg": [
   "[Fix #07][intravm]", 
   "BaseEjbProxyHandler.  IntraVm copy flag can now be switched on and off on a", 
   "per handle basis.  The equals, hashCode, and toString methods have been", 
   "implemented.  [Task] The logging statement uses log4j directly, it should", 
   "be updated to use the logging interface instead.", 
   "[Fix #08][intravm]", 
   "EjbObjectProxyHandler.  Added optimization for checking which method to", 
   "invoke.  I was calling equals on strings before, but now keeps a hasmap of", 
   "the methods, each using an integer constant for the equals instead of a", 
   "string. Lots of logging was also added.  [Task] The logging statement uses", 
   "log4j directly, it should be updated to use the logging interface instead.", 
   "[Fix #09][intravm]", 
   "EjbHomeProxyHandler.  Added same optimizations for checking which method", 
   "to invoke.", 
   "[Fix #10][intravm]", 
   "IntraVmArtifact.  Replaced the previous caching hashmap with an array list.", 
   "This clears up the need to use strings as ids and fixes a bug where the", 
   "same item apprears in the list more than once.  Very clever fix.", 
   "[Fix #11][intravm]", 
   "IntraVmHandle.  Added back in the home handle support.", 
   "[Fix #12][intravm]", 
   "IntraVmServer.  Added back in the home handle support."
  ], 
  "revision_id": "443902"
 }, 
 {
  "author": "dblevins", 
  "date": "2002-08-19T19:21:58.000000Z", 
  "msg": [
   "[Fix #06][transaction]", 
   "CoreUserTransaction.  Logs of great logging statements were added.", 
   "[Task] The logging statement uses log4j directly, it should be updated to", 
   "use the logging interface instead."
  ], 
  "revision_id": "443901"
 }
]