[
 {
  "author": "ammulder", 
  "date": "2004-12-06T06:32:33.000000Z", 
  "msg": [
   "Changes to OpenEJB module builder to be compatible with latest Geronimo"
  ], 
  "revision_id": "445075"
 }, 
 {
  "author": "dain", 
  "date": "2004-12-04T05:14:07.000000Z", 
  "msg": [
   "Configuration objects no longer use GBeamMBeans", 
   "Added more memory to the itest vm"
  ], 
  "revision_id": "445074"
 }, 
 {
  "author": "ammulder", 
  "date": "2004-12-02T23:49:35.000000Z", 
  "msg": [
   "Use the new Geronimo deployment modules"
  ], 
  "revision_id": "445073"
 }, 
 {
  "author": "gdamour", 
  "date": "2004-12-02T23:14:00.000000Z", 
  "msg": [
   "GERONIMO-506: CMP - Dependent Value Classes are not supported", 
   "GERONIMO-195: BLOB support for CMP entity bean", 
   "Dependent Value Classes, and more generally any classes, can now be stored", 
   "by CMP entity beans.", 
   "It is even possible to define explicitely the SQL type of the column in which", 
   "a CMP field is to be stored and how to store it.", 
   "This is achieved via two new optional sub-elements of cmp-field-mapping:", 
   "o sql-type: this is an SQL type identifier. It must be a field name of the", 
   "java.sql.Types class; and", 
   "o type-converter: this is the full class name of a TypeConverter. A", 
   "TypeConverter is used to perform Java to SQL types conversions and", 
   "SQL to Java types conversions.", 
   "Combined together, these features give the flexibility to control explicitely", 
   "the storage of CMP fields.", 
   "For instance, it is possible to store a byte[] directly into a BLOB by", 
   "implementing the adequate TypeConverter.", 
   "By default, in other words where none of the above elements are specified,", 
   "CMP fields, whose types are not explicitely defined by TranQL, are serialized", 
   "and stored in a BLOB."
  ], 
  "revision_id": "445072"
 }, 
 {
  "author": "dain", 
  "date": "2004-12-01T06:59:11.000000Z", 
  "msg": [
   "Converted to use GBeanData instead of GBeanMBean"
  ], 
  "revision_id": "445071"
 }
]