[
 {
  "author": "dblevins", 
  "date": "2005-08-23T04:12:53.000000Z", 
  "msg": [
   "Rewrote the ManagedConnectionFactory.  Allowed the BasicManagedConnectionFactory", 
   "to be optionally wrapped to include a very nasty hack for dealing with embedded", 
   "databases that use the system properties for resolving their configuration.", 
   "This becomes really hard if you expect to have more than one instance of the", 
   "embedded database."
  ], 
  "revision_id": "445640"
 }, 
 {
  "author": "djencks", 
  "date": "2005-08-21T07:36:31.000000Z", 
  "msg": [
   "GERONIMO-666.  Enable virtual host[] support for ejb web services"
  ], 
  "revision_id": "445639"
 }, 
 {
  "author": "djencks", 
  "date": "2005-08-20T22:50:49.000000Z", 
  "msg": [
   "GERONIMO-676.  Provide default for WS security realm name since it appears to be generally meaningless"
  ], 
  "revision_id": "445638"
 }, 
 {
  "author": "gdamour", 
  "date": "2005-08-20T07:53:02.000000Z", 
  "msg": [
   "We need to use the column name, i.e. physical name of the SQLSchema, to", 
   "detect that a primary key column is also a foreign key column."
  ], 
  "revision_id": "445637"
 }, 
 {
  "author": "gdamour", 
  "date": "2005-08-20T03:49:08.000000Z", 
  "msg": [
   "o GERONIMO-675 CMR / CMP Fields should not be read-only", 
   "Some additional enhancement to support the scenario where a primary key column", 
   "is also a foreign key column.", 
   "This basically implements the rules that Jeremy was recommending to apply", 
   "in such a case:", 
   "when the primary key is set in the ejbCreate<Method> the associated CMR field,", 
   "i.e. the CMR mapped to the foreign key column, is marked as under construction.", 
   "From this point, the CMR must be set before the commit of the current", 
   "transaction. If not set, then the transaction is marked as rolled back.", 
   "Also, if an attempt is made to reset the pk field by relating the entity to", 
   "the wrong entity, an IllegalStateException is thrown.", 
   "o Also sync the code with the refactoring of the Association and AssociationEnd", 
   "classes: the Association.isOneToOne, isOneToMany, isManyToOne and", 
   "isManyToMany methods have been moved to AssociationEnd."
  ], 
  "revision_id": "445636"
 }
]