[
 {
  "author": "zongaro", 
  "date": "2006-09-15T02:35:25.006229Z", 
  "msg": [
   "Part of patch for XALANJ-1774", 
   "Defined constants that contain names of static translet fields used to record", 
   "information about stylesheet namespaces declarations and their signatures, and", 
   "the name and signature of a new BasisLibrary method to look up that namespace", 
   "information at transformation time.", 
   "Reviewed by Christine Li (jycli () ca ! ibm ! com)"
  ], 
  "revision_id": "446475"
 }, 
 {
  "author": "zongaro", 
  "date": "2006-09-15T02:35:18.607688Z", 
  "msg": [
   "Part of patch for XALANJ-1774", 
   "Added getNodeIDForStylesheetNSLookup method which is used to get the unique", 
   "stylesheet node ID for this node or the nearest enclosing element node in the", 
   "syntax tree that has namespace declarations.  If there is no such node, the", 
   "value -1 is returned.", 
   "Reviewed by Christine Li (jycli () ca ! ibm ! com)"
  ], 
  "revision_id": "446474"
 }, 
 {
  "author": "zongaro", 
  "date": "2006-09-15T02:35:11.962417Z", 
  "msg": [
   "Part of patch for XALANJ-1774", 
   "Added new lookupStylesheetQNameNamespace and expandStylesheetQNameRef methods", 
   "that determine the namespace in which a QName is defined using information", 
   "about the stylesheet's namespace declarations.  The first method returns a", 
   "namespace URI or a zero-length string if none was found, and the second returns", 
   "an expanded QName of the form <uri>:<local-name> or just <local-name> if no", 
   "namespace was found.", 
   "Reviewed by Christine Li (jycli () ca ! ibm ! com)"
  ], 
  "revision_id": "446473"
 }, 
 {
  "author": "zongaro", 
  "date": "2006-09-15T02:35:05.299569Z", 
  "msg": [
   "Part of patch for XALANJ-2318.", 
   "Check whether the method that is being outlined is either <clinit> (the static", 
   "class initializer) or <init> (a constructor function).  Only those methods are", 
   "permitted to have less than and greater than characters, so any outlined", 
   "method based on them has to avoid using those characters.", 
   "Also, fixed a bug in MethodGenerator.mergeAdjacentChunks where it was not", 
   "correctly handling the end case where the last N chunks are all adjacent.", 
   "Reviewed by Christine Li (jycli () ca ! ibm () com)"
  ], 
  "revision_id": "446472"
 }, 
 {
  "author": "zongaro", 
  "date": "2006-09-15T02:34:58.752364Z", 
  "msg": [
   "1) Part of patch for XALANJ-2318", 
   "Added OutlineableChunkStart and OutlineableChunkEnd instructions through the", 
   "static class initializer and constructor generation to allow the code to be", 
   "outlined.  Replaced DUP instructions that duplicated array references to", 
   "explicitly reload the array reference to allow the code to marked outlineable.", 
   "2) Part of patch for XALANJ-1774", 
   "Added code to static initializer to record information about the namespace", 
   "definitions in scope at different points in the stylesheet.", 
   "Reviewed by Christine Li (jycli () ca ! ibm () com)"
  ], 
  "revision_id": "446471"
 }
]