[
 {
  "author": "geirm", 
  "date": "2006-09-16T01:04:50.130691Z", 
  "msg": [
   "HARMONY-1430", 
   "The bug in optimizing simple arithmetic instruction consist of two parts:", 
   "- copy/paste caused bug in simplifier::simplifyAnd(xxx)", 
   "- erroneuos conversion elimination in abcd", 
   "The first is fixed in the code.", 
   "The second is fixed by turning off conversion elimination in abcd.", 
   "(It should be rewritten completely later)", 
   "The second bug: Jitrino does not throw a LinkingException when ldc tries to load", 
   "incorrect class literal.", 
   "As 1.5 support is available 'ldc' can loads class literals.", 
   "These classes may be incorrect (not resolved successfully).", 
   "It actually does not distrub ldc activity but according to specification", 
   "LinkingException must be thrown.", 
   "Bugfix:ThrowLinkingException helper call is generated at the place of ldc in managed", 
   "code if literal type can not be resolved."
  ], 
  "revision_id": "446800"
 }, 
 {
  "author": "mprudhom", 
  "date": "2006-09-16T00:44:55.162311Z", 
  "msg": [
   "Non-optimistic transactions will no longer perform a version check when committing dirty objects, unless the NonOptimisticVersionCheck compatibility property is set to true. This allows dirty instances enlisted in a non-optimistic transaction to be allowed to overwrite conflicting versions in the database."
  ], 
  "revision_id": "446799"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-09-16T00:35:48.629372Z", 
  "msg": [
   "Replaced all old references to [Copyright * The Open For Business Project] which should take care of all of the legal loose ends"
  ], 
  "revision_id": "446798"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2006-09-16T00:32:00.094216Z", 
  "msg": [
   "Changed 'require libtuscany_sca_ruby' to require 'tuscany_sca_ruby'. Ruby scripts are now portable between Windows and Linux."
  ], 
  "revision_id": "446797"
 }, 
 {
  "author": "geirm", 
  "date": "2006-09-16T00:31:54.750948Z", 
  "msg": [
   "HARMONY-1427", 
   "Looks like the mode in which exn_print_stack_trace works has changed. It is now suspend_enabled, and inside of this", 
   "function there is an assertion that suspend is enabled. But the change was not applied to JNI ExceptionDescribe", 
   "function. It still disables suspend when calling exn_print_stack_trace.", 
   "tested on ubuntu 6, smoke and c-unit ok,"
  ], 
  "revision_id": "446796"
 }
]