[
 {
  "author": "sichen", 
  "date": "2006-09-21T01:28:10.304574Z", 
  "msg": [
   "New InventoryWorker class to figure out quantity of product on outstanding POs.  Re-factored product inventory page in catalog manager to use it. Added column to show quantity on order for facility inventory"
  ], 
  "revision_id": "448425"
 }, 
 {
  "author": "mikem", 
  "date": "2006-09-21T01:24:25.310304Z", 
  "msg": [
   "DERBY-1787", 
   "contributed by Mamta Satoor", 
   "patch: DERBY1787_UseCorrectTerminologyV1diff.txt", 
   "Grant revoke functionality was added in Derby 10.2 The comments that went into the grant revoke code, in some places refer to database owner as \"dba\". They are not the same thing. In the grant revoke world, dba is a role. We haven't added roles into Derby yet but current use of dba in comments might make it confusing when we do start working on roles including dba."
  ], 
  "revision_id": "448424"
 }, 
 {
  "author": "antoine", 
  "date": "2006-09-21T01:21:23.537395Z", 
  "msg": [
   "change the manual-beta to be the tag ANT_170_B2"
  ], 
  "revision_id": "448423"
 }, 
 {
  "author": "sebor", 
  "date": "2006-09-21T01:20:32.791802Z", 
  "msg": [
   "2006-09-20  Martin Sebor  <sebor@roguewave.com>", 
   "* run_locale_utils.sh (output, debug_output): New functions to handle", 
   "script output.", 
   "(check_locale_help, check_locale_all, check_locale_m, check_locale_k,", 
   "check_localedef_help, generate_locale, dump_locale, test_locale,", 
   "signal_cleanup, main body of script): Used output, debug_output.", 
   "(dump_locale): Set the LC_ALL environment variable for the invoked", 
   "process only (instead of the entire script). Incremented the number", 
   "of assertions. On error exited script with the same non-zero exit", 
   "status as the locale utility.", 
   "(dump_charmap): New function to dump the charmap of a locale.", 
   "(test_locale): Called dump_charmap to produce the charmap source", 
   "from the locale database at each of the three stages. Used this", 
   "charmap source to create a locale in each subsequent stage. Placed", 
   "the files created at each stage in separate directories named stage.1", 
   "through stage.3. Avoided setting the LANG and LC_ALL environment", 
   "variables for the whole script to prevent their values from screwing", 
   "up the output of system utilities that don't understand them. Avoided", 
   "deleting stage directories when the -n option is set."
  ], 
  "revision_id": "448422"
 }, 
 {
  "author": "jrduncans", 
  "date": "2006-09-21T01:15:11.828316Z", 
  "msg": [
   "Added generated files and folders to svn:ignore property."
  ], 
  "revision_id": "448421"
 }
]