[
 {
  "author": "", 
  "date": "2006-09-22T01:21:40.389023Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "448760"
 }, 
 {
  "author": "geirm", 
  "date": "2006-09-22T01:09:38.752500Z", 
  "msg": [
   "add two new pages for getting started, for users", 
   "and contributors.  It's a first step.", 
   "Also, modify the rendering template to use relative path for site.css", 
   "so that it looks the same locally as it does online", 
   "Finally, change build.xml to push site.css everywhere."
  ], 
  "revision_id": "448759"
 }, 
 {
  "author": "suresht", 
  "date": "2006-09-22T00:59:49.121648Z", 
  "msg": [
   "DERBY-1854 (SYSCS_COMPRESS_TABLE corrupts table with a single column which is both a primary key and a foreign key)", 
   "Problem was all the conglomerate descriptor entries in sys.sysconglomerates", 
   "were not getting updated with new conglomerate number generated for an index", 
   "during compress/bulk-insert, when an index is shared. Update code was assuming", 
   "conglomerate id is common when an index is shared, but that is not correct.", 
   "ConglomerateID's in sys.sysconglomerates are unique.", 
   "This patch modifies the update conglomerate descriptor code to update each", 
   "conglomerate descriptor separately using conglomerateID as the key, when", 
   "there are more than one conglomerate descriptor referring to the same", 
   "conglomerate(conglomerate number).", 
   "This patch also adds a test-case to test import into a table that has the same column as a primary key and foreign key,  import was also causing corruption because of the same problem.  See DERBY-1641 , for details."
  ], 
  "revision_id": "448758"
 }, 
 {
  "author": "awhite", 
  "date": "2006-09-22T00:52:08.088467Z", 
  "msg": [
   "fix JDBC Abs query function's return type."
  ], 
  "revision_id": "448757"
 }, 
 {
  "author": "dain", 
  "date": "2006-09-22T00:48:30.759909Z", 
  "msg": [
   "Merge of session api is not necessary... if someone wants it they can resurrect it"
  ], 
  "revision_id": "448756"
 }
]