[
 {
  "author": "rfeng", 
  "date": "2006-09-22T05:46:15.239308Z", 
  "msg": [
   "Remove the empty class"
  ], 
  "revision_id": "448820"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2006-09-22T05:40:38.542910Z", 
  "msg": [
   "Improvements to the Ruby BigBank sample. Integrated StockQuote Web service and simplified generation of AccountReport document"
  ], 
  "revision_id": "448819"
 }, 
 {
  "author": "jmsnell", 
  "date": "2006-09-22T05:40:01.131593Z", 
  "msg": [
   "Initial check in of the IRI/IDN support.  I had originally thought this would land in the parser project,", 
   "but then I remembered that we'll likely need to surface the IRI and Lang objects provided by this package", 
   "in the core model api... at least at some point.  Not sure how we should ultimately package this, but", 
   "we can work on those details later.", 
   "* Unicode 3.2.0 Normalization implementation.  We likely need to update to Unicode 4.0,or at least check", 
   "to make sure this code will work with either", 
   "* Punycode/Nameprep/IDNA implementation.  This is fundamental to IRI support and the most significant", 
   "hole in the java.net.* stuff.  This code implements support for both the ToASCII and ToUnicode algorithms", 
   "* IRI implementation. API is similar to java.net.URI, provides conversion to and from URI/URL, provides", 
   "custom scheme support, scheme specific equivalence checking, bunch of other stuff.", 
   "* Language tag implementation, e.g. parsing and validating the syntax of things like en-US", 
   "* Bunch of IO utility classes including a CodepointIterator that converts surrogate chars into", 
   "supplementary codepoints from byte arrays, char arrays, charsequences, charbuffers, etc. Also", 
   "some InputStream implementations that extend things like PushbackInputStream with dynamic buffer", 
   "management,etc. Some of these currently exist in the parser module, but it made sense to move", 
   "them around and keep them with the other new io stuff.", 
   "Test cases are included.", 
   "The org.apache.abdera.util.unicode.data package contains the gzip compressed binary representation of the", 
   "Unicode Character Database (version 3.2.0).  The Unicode license forbids us from storing the source", 
   "text files but we can store a binary represenation used to enable our impl.  I'll be working a process", 
   "into the build that will download the source files and generate the ucd.res file during the build process.", 
   "None of the Abdera code has been modified to use these new classes yet"
  ], 
  "revision_id": "448818"
 }, 
 {
  "author": "recordond", 
  "date": "2006-09-22T05:34:31.052151Z", 
  "msg": [
   "Check in the Yadis testing tool currently hosted at http://yadis.org/conformance/", 
   "Still needs all the correct licensing stuff applied to it"
  ], 
  "revision_id": "448817"
 }, 
 {
  "author": "smishura", 
  "date": "2006-09-22T05:13:07.452063Z", 
  "msg": [
   "Apply patch for HARMONY-1502 ([classlib][security] Support more Certificate/CRL extensions by X.509 framework.)"
  ], 
  "revision_id": "448816"
 }
]