[
 {
  "author": "mbenson", 
  "date": "2006-09-22T22:31:55.917094Z", 
  "msg": [
   "switch when attribute of size fileselector to use Comparison type.", 
   "Also took out a bunch of spurious parentheses and moved the public statics to the top."
  ], 
  "revision_id": "449115"
 }, 
 {
  "author": "mikem", 
  "date": "2006-09-22T22:29:28.403698Z", 
  "msg": [
   "DERBY-1830", 
   "contributed by Sunitha Kambhampati", 
   "The testcase added for derby-1660 in optimizerOverrides.sql uses jdbc:default:connection and does not work with wctme5.7 foundation causing the diff mentioned in this jira. This testcase needs to be excluded and should run only in environments that have support for DriverManager.", 
   "This patch (derby1830.diff.txt) converts this particular testcase into a junit test.", 
   "1. Add a new Junit test in lang suite - VTITest.java", 
   "2. Conditionally add the test fixture bulkInsertVtiTest if JDBC.vmSupportsJDBC2() is true.", 
   "3. Since the problematic testcase is converted to junit test, remove this test from optimizerOverrides.sql and update the master files for embedded and server frameworks."
  ], 
  "revision_id": "449114"
 }, 
 {
  "author": "crogers", 
  "date": "2006-09-22T22:21:03.950540Z", 
  "msg": [
   "Another change for BEEHIVE-1135 to handle another case where we don't want to commit any session-scoped changes during the PageFlowPageFilter processing of a request for a JSP... where the JSP does not have an associated page flow (such as a JSP included as a common header or footer to a page).", 
   "Tests: NetUI BVT (WinXP pass)"
  ], 
  "revision_id": "449113"
 }, 
 {
  "author": "awiner", 
  "date": "2006-09-22T22:18:32.292285Z", 
  "msg": [
   "First big step towards public rendering APIs.  Created pure abstract base classes for Skin, FormData, PartialPageContext, and LocaleContext, some with significantly reduced APIs, and generally made these APIs and RenderingContext and Icon free from other dependencies.  Next step is moving all of these out of trinidadinternal and into trinidad, which I think requires a bit of discussion"
  ], 
  "revision_id": "449112"
 }, 
 {
  "author": "mbenson", 
  "date": "2006-09-22T22:17:41.564248Z", 
  "msg": [
   "Fix incorrectly documented default value for size selector's when attribute."
  ], 
  "revision_id": "449111"
 }
]