[
 {
  "author": "norman", 
  "date": "2006-09-23T13:31:04.250286Z", 
  "msg": [
   "Fix/Add javadocs. See JAMES-628", 
   "Remove some unused imports and code"
  ], 
  "revision_id": "449235"
 }, 
 {
  "author": "pradine", 
  "date": "2006-09-23T13:28:57.236929Z", 
  "msg": [
   "Ensure that the correct WS-Addressing namespace is used when when fault response messages are generated."
  ], 
  "revision_id": "449234"
 }, 
 {
  "author": "pradine", 
  "date": "2006-09-23T13:28:43.294327Z", 
  "msg": [
   "Ensure that the correct WS-Addressing namespace is used when when fault response messages are generated."
  ], 
  "revision_id": "449233"
 }, 
 {
  "author": "geirm", 
  "date": "2006-09-23T13:28:16.466351Z", 
  "msg": [
   "HARMONY-1545", 
   "I've reworked the implementation of JVMTI breakpoints and single step. The code which sends breakpoint and single", 
   "step events currently is ugly and uses unobvious logic. In the new implementation the infrastructure is much more", 
   "clean and clear :)", 
   "Main class is VMBreakPoints. It is the container for all breakpoint instrumentation and handler for all breakpoint", 
   "events. A VMBreakInterface is a class for breakpoints references container. It can be used for any purpose, be it", 
   "SingleStep or user breakpoints container. In VMBreakInterface breakpoints instrumentations are referenced by", 
   "VMBreakPointRef.", 
   "VMBreakPoints has handlers for native (JIT mode) and interpreter mode breakpoints. When such handler is called, the", 
   "processing goes through all registered VMBreakInterface instances according to their priorities (currently two", 
   "priorities are supported - SingleStep is first according to JVMTI spec about colocated events) and calls", 
   "VMBreakInterface handling callback which can send an event of type which this interface supports.", 
   "Ubuntu 6 - smoke, c-unit"
  ], 
  "revision_id": "449232"
 }, 
 {
  "author": "bago", 
  "date": "2006-09-23T13:20:27.555347Z", 
  "msg": [
   "Another attempt fixing inter-projects urls (JAMES-618 / JAMES-634)"
  ], 
  "revision_id": "449231"
 }
]