[
 {
  "author": "dandiep", 
  "date": "2006-09-24T20:55:22.987308Z", 
  "msg": [
   "o Centralize BindingOp/Operation/Method association logic into a MethodDispatcher.", 
   "Whenever we need to find the method for an operation or vis a versa, we can", 
   "look it up from the MethodDispatcher now. I'd like to extend this into a more", 
   "general dispatching system like Spring web services has, but small steps...", 
   "o Work on getting the code first approach working. Started by constructing a simple", 
   "service with the ReflectionServiceFactoryBean. It still needs to set up the message", 
   "parts and bindings.", 
   "o Add a ProviderServiceFactoryBean to create a Provider from a class. Still needs", 
   "SOAP binding support.", 
   "o Attempted to unify the JaxWsServiceFactoryBean and the JaxWsImplementorInfo better", 
   "o Fix the namespace of the XML binding to use apache.org instead of celtix.org", 
   "o Add failing HolderTest which demonstrates thate Holders with byte[] arrays don't", 
   "seem to work.", 
   "o Add a HeaderTest to JAX-WS as it was impossible to track down a server side", 
   "header bug with the multithreaded systests.", 
   "o Have URIResolver take an optional calling class argument so it can work its", 
   "classloader magic."
  ], 
  "revision_id": "449480"
 }, 
 {
  "author": "dims", 
  "date": "2006-09-24T20:54:44.809948Z", 
  "msg": [
   "Fix for AXIS2-1211 - Mapping a value of type xs:dateTime to null"
  ], 
  "revision_id": "449479"
 }, 
 {
  "author": "rdonkin", 
  "date": "2006-09-24T20:53:48.492307Z", 
  "msg": [
   "New page on user ssh access using putty on windows. JIRA INFRA-959. Contitrbued by Gavin McDonald."
  ], 
  "revision_id": "449478"
 }, 
 {
  "author": "jboynes", 
  "date": "2006-09-24T20:46:56.082070Z", 
  "msg": [
   "go back to a SNAPSHOT of XmlSchema to avoid conflict with stax 1.0 and 1.0.1 dependencies"
  ], 
  "revision_id": "449477"
 }, 
 {
  "author": "dims", 
  "date": "2006-09-24T20:46:26.157155Z", 
  "msg": [
   "Fix for AXIS2-1208 - DB databinding - org.apache.axis2.databinding.utils.ConverterUtil$ObjectConversionException: java.lang.ArrayStoreException exception throw when convert the string representation of calender object to java.util.Calender object ."
  ], 
  "revision_id": "449476"
 }
]