[
 {
  "author": "mikem", 
  "date": "2006-09-26T19:19:40.290537Z", 
  "msg": [
   "DERBY-1866", 
   "contributed by Army Brown", 
   "patch: d1866_v1.patch", 
   "Attaching a first patch for this issue, d1866_v1.patch. In short, the problem was that, when pushing predicates to subqueries beneath UNIONs, the predicates were always being pushed to the *first* table in the subquery's FROM list, regardless of whether or not that was actually the correct table. Thus it was possible to push a predicate down to a base table to which it didn't apply, thereby leading to an assertion failure in sane mode and an index out of bounds exception in insane mode.", 
   "For details on how this occurred and what the fix is, please refer to the code comments in the patch. The d1866_v1 patch does the following:", 
   "1. Adds logic to ensure scoped predicates are only pushed", 
   "to the appropriate base tables.", 
   "2. Adds one line to OptimizerImpl to solve the hang that", 
   "was occuring for the second query shown in repro.sql.", 
   "The problem there was just that one variable was not", 
   "being properly reset when beginning a new round of", 
   "optimization.", 
   "3. Adds some test cases to verify the changes for #1 and", 
   "#2.", 
   "Note that the patch is mostly just explanatory comments for existing and new logic, plus the test cases."
  ], 
  "revision_id": "450155"
 }, 
 {
  "author": "rhillegas", 
  "date": "2006-09-26T19:16:42.995484Z", 
  "msg": [
   "Adding myself to the list of PMC members visible on the whoweare page."
  ], 
  "revision_id": "450154"
 }, 
 {
  "author": "chirino", 
  "date": "2006-09-26T19:14:23.663864Z", 
  "msg": [
   "Latest export from confluence"
  ], 
  "revision_id": "450153"
 }, 
 {
  "author": "chirino", 
  "date": "2006-09-26T19:14:15.114159Z", 
  "msg": [
   "Latest export from confluence"
  ], 
  "revision_id": "450152"
 }, 
 {
  "author": "mriou", 
  "date": "2006-09-26T19:11:19.074234Z", 
  "msg": [
   "Support for external working directory. Ode can use any directory (instead of the ones directly included in the WAR file) for the deployed processes and the database (when the embedded one is used). Just set the ode-axis2.working.dir property in ode-axis2.properties. The embedded database must be copied to this directory before starting if it's used."
  ], 
  "revision_id": "450151"
 }
]