[
 {
  "author": "bayard", 
  "date": "2006-09-27T17:16:01.727442Z", 
  "msg": [
   "Preparing rc3"
  ], 
  "revision_id": "450510"
 }, 
 {
  "author": "chirino", 
  "date": "2006-09-27T17:15:23.970557Z", 
  "msg": [
   "Latest export from confluence"
  ], 
  "revision_id": "450509"
 }, 
 {
  "author": "mikem", 
  "date": "2006-09-27T17:10:56.835018Z", 
  "msg": [
   "DERBY-1878", 
   "contributed by Sunitha Kambhampati", 
   "patch: derby1878.diff.txt", 
   "I am attaching the patch (derby1878.diff.txt) to improve some error handling in some of the network server tests.", 
   "1.The execCmdDumpResults used by the five tests timeslice.java,maxthreads.java,testij.java,runtimeinfo.java,sysinfo.java suffer from the same problems that was fixed for testProperties.java namely", 
   "-- the outputstream for the sub process's is not flushed out", 
   "-- there is no timeout handling for the ProcessStreamResult", 
   "2.Eliminate duplication of code in these 5 tests for execCmdDumpResults(String[] args) method. The execCmdDumpResults method basically exec's a new process and then waits for the process to dump the results. A new utility class - ExecProcUtil is added with execCmdDumpResults that is generalized to take the necessary input from the tests as well as fixes the issues mentioned in #1. The OutputStream is flushed out by calling bos.flush and System.out.flush and the timeout is added for ProcessStreamResult.", 
   "3.Make use of the TimedProcess to kill process if process does not exit within the timeout period.", 
   "4.TestConnection.java test has some variation of the execCmdDumpResults and it also adds some testcases into this method. Hence this method in this test is left as is and timeout handling is added.", 
   "5.testij.out has been updated. The previous master file was eating away the last line that was written to System.out, but now that the process's streams are flushed properly, the last line in testij.out test which prints out 'End test'", 
   "is also seen in the output file.", 
   "Also noticed that these tests - like timeslice.java, maxthreads.java all seem to set the properties for the server and then check if the property is set. The functionality of the server when these properties is set is not being tested. It will be good to add tests that test that the functionality itself is working as expected or not. Please note, recently connecting to server with timeslice options discovered some issues with server (see DERBY-1856)."
  ], 
  "revision_id": "450508"
 }, 
 {
  "author": "mriou", 
  "date": "2006-09-27T17:10:29.282336Z", 
  "msg": [
   "Fixed one more bug in deployment. The ode-deployed.dat now contains relative paths to the deployed units."
  ], 
  "revision_id": "450507"
 }, 
 {
  "author": "robbinspg", 
  "date": "2006-09-27T16:47:21.309701Z", 
  "msg": [
   "Add sdo_axiom test to make check"
  ], 
  "revision_id": "450506"
 }
]