[
 {
  "author": "dims", 
  "date": "2006-09-28T18:14:10.530843Z", 
  "msg": [
   "Working on fix for AXIS2-969, The problem is that xmlbeans expects the current TCCL to be able to load the xsb files. So we have to set the TCCL to that of the axis service class loader. There is a flakiness even now that i am investigating, namely the service returns a response w/o the xsi:type for the first request ONLY. Responses to subsequent requests are ok. Still looking.", 
   "There are now 3 modes for the TCCL when a service method is invoked.", 
   "Option #1: default - we don't set the TCCL (AXis2 1.0 behavior)", 
   "Option #2: composite - we set a multi class loader as the TCCL with the web app class loader and the axis service class loader.", 
   "Option #3: service - we set the TCCL to the axis service classloader.", 
   "Notes:", 
   "- default is fine for normal use (remember the ejb and jndi lookup problems, this is the default setting for getting them to work)", 
   "- composite is for spring folks. there was a forceTCCL i introduced a couple of weeks ago, this is the new way of doing that.", 
   "- service is for xmlbeans primarily right now as mentioned before."
  ], 
  "revision_id": "450955"
 }, 
 {
  "author": "chirino", 
  "date": "2006-09-28T18:13:38.149365Z", 
  "msg": [
   "Latest export from confluence"
  ], 
  "revision_id": "450954"
 }, 
 {
  "author": "rfeng", 
  "date": "2006-09-28T18:12:31.564492Z", 
  "msg": [
   "Improve exception handling for the following two cases:", 
   "1) locateService(name): name is not found in children of a composite", 
   "2) reference name (for exmaple \"ref\") in component is not found in the component type (for example, using a wrong setter such as setRef1 with @Reference)"
  ], 
  "revision_id": "450953"
 }, 
 {
  "author": "awiner", 
  "date": "2006-09-28T18:07:57.263919Z", 
  "msg": [
   "Commiting ADFFACES-182: chart component from Venkata Guddanti"
  ], 
  "revision_id": "450952"
 }, 
 {
  "author": "mriou", 
  "date": "2006-09-28T18:07:54.158496Z", 
  "msg": [
   "Forcing compilation when the deployment unit is created (redeployment)."
  ], 
  "revision_id": "450951"
 }
]