[
 {
  "author": "rfeng", 
  "date": "2006-09-29T00:44:45.119949Z", 
  "msg": [
   "Fix the missing xmlns for the value of xsi:type"
  ], 
  "revision_id": "451075"
 }, 
 {
  "author": "rfeng", 
  "date": "2006-09-29T00:43:02.329119Z", 
  "msg": [
   "Add svn.ignore"
  ], 
  "revision_id": "451074"
 }, 
 {
  "author": "bsnyder", 
  "date": "2006-09-29T00:39:05.968866Z", 
  "msg": [
   "Fixing SM-608."
  ], 
  "revision_id": "451073"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-09-29T00:33:21.191816Z", 
  "msg": [
   "A couple tweaks for DebugFilter.", 
   "- added in a bit more debugging.", 
   "- added DebugFilter to filter-mappings and have it commented out by default."
  ], 
  "revision_id": "451072"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-09-29T00:31:37.603155Z", 
  "msg": [
   "First commit for Roller 3.1 Theme Encapsulation work ...", 
   "http://rollerweblogger.org/wiki/Wiki.jsp?page=Proposal_ThemeEncapsulation", 
   "1. Reworking of FileManager implementation to support storing files in a hierarchy using subdirectories.", 
   "* Cleaned up FileManager interface and added new createDirectory() method.", 
   "* Added new getFile() method which provides access to a specific file.", 
   "* Removed methods which exposed the uploads dir and uploads path.", 
   "* Removed canSave() method because it was redundant and should be implied by the call to saveFile().", 
   "* Added better exception handling and comments.", 
   "2. Updated themes code to support the handling of theme resource files.", 
   "* Added code for resource handling in Theme class.", 
   "* Added code in ThemeManagerImpl for reading in Theme resources and properly setting them.", 
   "* Cleaned up unnecessary methods from ThemeManager interface.", 
   "3. Updated ResourceServlet to be capable of serving up theme resources.", 
   "* Added WeblogResourceRequest object.", 
   "* ResourceServlet now checks if weblog is using a theme and if so checks if the requested resource comes from the theme.", 
   "NOTE: this work only partially implements the overall functionality of the proposal.  there will be further commits to complete the work."
  ], 
  "revision_id": "451071"
 }
]