[
 {
  "author": "jmarino", 
  "date": "2006-10-04T08:38:22.062136Z", 
  "msg": [
   "[PATCH] from Ignacio for Tuscany-767"
  ], 
  "revision_id": "452795"
 }, 
 {
  "author": "faridz", 
  "date": "2006-10-04T08:37:31.597317Z", 
  "msg": [
   "2006-10-04 Farid Zaripov <faridz@kyiv.vdiweb.com>", 
   "* THREAD_SAFE_EXCEPTIONS.cpp [_WIN32]: disable displaying", 
   "general protection fault message box"
  ], 
  "revision_id": "452794"
 }, 
 {
  "author": "aco", 
  "date": "2006-10-04T08:29:38.821906Z", 
  "msg": [
   "Fix for: https://issues.apache.org/activemq/browse/AMQ-942", 
   "- Added support for large string in ActiveMQStreamMessage.", 
   "- Change the marshalling method of ActiveMQStreamMessage to also use the MarshallingSupport utility. This allows a central utility to handle object marshalling. Unmarshalling was still left to ActiveMQStreamMessage as it performs type conversions.", 
   "- NOTE: The constants use to determine the data type was also change to refer to the constants in MarshallingSupport. This makes this version's wireformat incompatible with previous versions."
  ], 
  "revision_id": "452793"
 }, 
 {
  "author": "jacopoc", 
  "date": "2006-10-04T08:29:02.554316Z", 
  "msg": [
   "In the attached patch there is a very simple way to fix the old and", 
   "known bug that makes impossible to display the English labels when OFBiz", 
   "is run in an operating system with a system language (different from", 
   "English) that is available in the OFBiz ui lables property files.", 
   "The bug is caused by the way the Java localization routines search for", 
   "localized files and by the fact that in OFBiz we don't maintain the en_EN", 
   "files, because the labels are in the default properties files (without", 
   "locale extension).", 
   "The proposed solution (as also suggested by Jacques LeRoux) is to use the -Duser.language=en parameter when invoking the", 
   "java command (in the OFBiz startup files): in this way the default system locale will be the English one, and everything will work as expected."
  ], 
  "revision_id": "452792"
 }, 
 {
  "author": "weber", 
  "date": "2006-10-04T08:22:00.481924Z", 
  "msg": [
   "TOBAGO-142 (tree should use jsf valueBinding mechanismn to lookup reference values)"
  ], 
  "revision_id": "452791"
 }
]