[
 {
  "author": "robbinspg", 
  "date": "2006-10-05T16:12:17.606843Z", 
  "msg": [
   "TUSCANY-798 remove unnecessary parameter from ComponentType constructor"
  ], 
  "revision_id": "453280"
 }, 
 {
  "author": "ahuegen", 
  "date": "2006-10-05T16:09:44.559566Z", 
  "msg": [
   "support for contributions"
  ], 
  "revision_id": "453279"
 }, 
 {
  "author": "evenisse", 
  "date": "2006-10-05T16:08:57.287068Z", 
  "msg": [
   "[CONTINUUM-953] Allow to download some type of file"
  ], 
  "revision_id": "453278"
 }, 
 {
  "author": "kenney", 
  "date": "2006-10-05T16:07:28.769299Z", 
  "msg": [
   "PR: SCM-239", 
   "Support Subversion 1.4 working copies.", 
   "Approach: instead of hacking another parser for some internal", 
   "format I'm using 'svn info' which also provides the URL in a more", 
   "implementation-independent way.", 
   "Changes: (mentioned verbosely here since there are some api additions,", 
   "but everything is backwards compatible)", 
   "* Added support for 'svn info', only at the SVN level.", 
   "* Removed old and unused Entry/EntriesReader", 
   "* Added a protected 'getRepositoryURL' to AbstractSvnScmProvider.", 
   "Different implementations may use different methods to return", 
   "that URL.", 
   "* Removed testcase for constructing a provider for the TestSvnScmProvider:", 
   "Now the code to actually get the repo url is not in the abstract base class,", 
   "I didn't see the need to implement a method in TestSvnScmProvider just so", 
   "we can test it; all other methods there return null anyway.", 
   "* Implemented the getRepositoryURL in SvnExeScmProvider using the output", 
   "from SvnInfoScmCommand. This method _CAN_ throw an ScmException, since it's", 
   "performing an SCM action.", 
   "* Modified ScmRepositoryException to extend ScmException (not strictly needed but seems", 
   "logical to me), and added a new constructor with a Throwable cause parameter."
  ], 
  "revision_id": "453277"
 }, 
 {
  "author": "bago", 
  "date": "2006-10-05T15:53:51.842811Z", 
  "msg": [
   "Removed SPFInternalResult (we don't use it anymore)", 
   "Moved DefaultExplanationPolicy to policies.local", 
   "Introduced a common abstract SPFResultException to be used as the root of our exceptions: the concrete implementations provide also the string representation of the result to use."
  ], 
  "revision_id": "453276"
 }
]