[
 {
  "author": "dandiep", 
  "date": "2006-10-05T20:19:52.903824Z", 
  "msg": [
   "svn-commit.tmp"
  ], 
  "revision_id": "453355"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-10-05T20:19:28.890284Z", 
  "msg": [
   "Thirs commit for Roller 3.1 Theme Encapsulation work ...", 
   "http://rollerweblogger.org/wiki/Wiki.jsp?page=Proposal_ThemeEncapsulation", 
   "1. Added new WeblogResource interface to represent uploaded weblog resources.", 
   "2. More modifications to FileManager.", 
   "* FileManager now takes a true WebsiteData object as a parameter to its methods rather than just a weblog handle.", 
   "* FileManager now returns a WeblogResource for calls to getFile() and getFiles().", 
   "* Updated FileManager unit tests to match.", 
   "* Modified all callers of FileManager methods with new method signatures.", 
   "3. Updated file uploads form to handle subdirectories.", 
   "* Updated UploadFile.jsp to display both files and directories in the listing as well as to pass around a \"path\" parameter in the form fields.", 
   "* Updated UploadFileFormAction and its PageModel to account for changes needed to handle subdirectories.", 
   "NOTE: at this point this work mostly implements the functionality of the proposal, however there are some additional items to complete before being totally finished.  Primarily, this commit breaks part of the theme preview functionality."
  ], 
  "revision_id": "453354"
 }, 
 {
  "author": "arminw", 
  "date": "2006-10-05T20:19:11.662318Z", 
  "msg": [
   "fix javadoc"
  ], 
  "revision_id": "453353"
 }, 
 {
  "author": "mikem", 
  "date": "2006-10-05T20:15:41.460167Z", 
  "msg": [
   "DERBY-1847", 
   "contributed by Mamta Satoor", 
   "patch: DERBY1846_V1_diff_AddColumnAndGrantRevoke.txt", 
   "To recap the problem, in SQL Authorization mode, when a new column is added to a table, the rows in SYSCOLPERMS for the table in question were not getting updated to incorporate the new column. This caused ASSERT failure when a non-table owner attempted to select the new column.", 
   "Some background information on system table involved: SYSCOLPERMS keeps track of column level privileges on a given table. One of the columns in SYSCOLPERMS is \"COLUMNS\" and it has a bit map to show which columns have the given permission granted on them. When a new column is added to the user table, the \"COLUMNS\" need to be expanded by one bit and that bit should be initialized to zero since no privileges have been granted on that column at the ALTER TABLE...ADD COLUMN time.", 
   "I have fixed this problem by having AlterTableConstantAction.addNewColumnToTable call the new method in DataDictionary called updateSYSCOLPERMSforAddColumnToUserTable. At this point, we know of only the TableDescriptor's uuid which can help us determine all the rows in SYSCOLPERMS for that given table uuid. I get ColPermsDescriptor for each one of those rows and then use the ColPermsDescriptor's uuid to update the \"COLUMNS\" column so SYSCOLPERMS is aware of the newly added column in user table. This fixes the problem because at the time of SELECT, when we do privilege lookup in SYSCOLPERMS, we have info on the newly added column."
  ], 
  "revision_id": "453352"
 }, 
 {
  "author": "rdonkin", 
  "date": "2006-10-05T20:14:53.516781Z", 
  "msg": [
   "Corrected malinks. Thanks to Niall Pemberton."
  ], 
  "revision_id": "453351"
 }
]