[
 {
  "author": "bpendleton", 
  "date": "2006-10-05T23:11:32.844515Z", 
  "msg": [
   "DERBY-1489: Provide ALTER TABLE DROP COLUMN functionality", 
   "This patch provides support for ALTER TABLE t DROP COLUMN c.", 
   "The patch modifies the SQL parser so that it supports statements of the form:", 
   "ALTER TABLE t DROP [COLUMN] c [CASCADE|RESTRICT]", 
   "If you don't specify CASCADE or RESTRICT, the default is CASCADE.", 
   "If you specify RESTRICT, then the column drop will be rejected if it would", 
   "cause a dependent view, trigger, check constraint, unique constraint,", 
   "foreign key constraint, or primary key constraint to become invalid.", 
   "Currently, column privileges are not properly adjusted when dropping a", 
   "column. This is bug DERBY-1909, and for now we simply reject DROP COLUMN", 
   "if it is specified when sqlAuthorization is true. When DERBY-1909 is fixed,", 
   "the tests in altertableDropColumn.sql should be merged into altertable.sql,", 
   "and altertableDropColumn.sql (and .out) should be removed.", 
   "This new feature is currently undocumented. DERBY-1926 tracks the documentation", 
   "changes necessary to document this feature.", 
   "The execution logic for ALTER TABLE DROP COLUMN is in AlterTableConstantAction,", 
   "and was not substantially modified by this change. The primary changes to", 
   "that existing code were:", 
   "-  to hook RESTRICT processing up to the dependency manager so that", 
   "dependent view processing was sensitive to whether the user", 
   "had specified CASCADE or RESTRICT", 
   "-  to reread the table descriptor from the catalogs after dropping all the", 
   "dependent schema objects and before compressing the table, so that the", 
   "proper scheman information was used during the compress."
  ], 
  "revision_id": "453420"
 }, 
 {
  "author": "geirm", 
  "date": "2006-10-05T23:05:15.436959Z", 
  "msg": [
   "HARMONY-1417", 
   "Fixed bugs in lazy exception optimization pass.", 
   "Replaced lazyexc optpass after inline optpass in server and server_static emconf files.", 
   "Fixed bugs in lazy exception optimization pass:", 
   "1. Permitted to have more then one chknull instructions for exception initializer argument.", 
   "2. Added check that call exception initializer instruction is present in the code.", 
   "3. Changed side effect indication for stvar instruction from true to false.", 
   "Ubuntu.  Smoke, c-unit, ~kernel", 
   "Tested also as suggested in JIRA, and that test passed."
  ], 
  "revision_id": "453419"
 }, 
 {
  "author": "assaf", 
  "date": "2006-10-05T23:00:51.605208Z", 
  "msg": [
   "Added logging messages and fixed indentation"
  ], 
  "revision_id": "453418"
 }, 
 {
  "author": "assaf", 
  "date": "2006-10-05T23:00:28.299531Z", 
  "msg": [
   "Added logging messages and fixed indentation"
  ], 
  "revision_id": "453417"
 }, 
 {
  "author": "sebor", 
  "date": "2006-10-05T22:51:39.400346Z", 
  "msg": [
   "2006-10-05  Martin Sebor  <sebor@roguewave.com>", 
   "* _config.h: Updated license."
  ], 
  "revision_id": "453416"
 }
]