[
 {
  "author": "snoopdave", 
  "date": "2006-10-06T20:21:32.777757Z", 
  "msg": [
   "JSP I18N fixes from Jian Liu and some comment changes"
  ], 
  "revision_id": "453750"
 }, 
 {
  "author": "jbq", 
  "date": "2006-10-06T20:20:27.339346Z", 
  "msg": [
   "<action dev=\"JBQ\" type=\"update\" fixes-bug=\"COCOON-1706\" due-to=\"Philippe Gassmann\" due-to-email=\"philippe.gassmann@anyware-tech.com\">", 
   "Allow TeeTransformer to run a system command for debugging purposes", 
   "</action>"
  ], 
  "revision_id": "453749"
 }, 
 {
  "author": "jochen", 
  "date": "2006-10-06T19:57:44.763534Z", 
  "msg": [
   "Atomic properties of XmlRpcServer are now configurable as init parameters", 
   "in the XmlRpcServlet.", 
   "PR: XMLRPC-116", 
   "Submitted-by: Jimisola Laursen, lists@jimisola.com"
  ], 
  "revision_id": "453748"
 }, 
 {
  "author": "mikem", 
  "date": "2006-10-06T19:54:23.703883Z", 
  "msg": [
   "DERBY-1847", 
   "contributed by Mamta Satoor", 
   "backporting via merge change 453352 from trunk to 10.2 branch.", 
   "To recap the problem, in SQL Authorization mode, when a new column is added to", 
   "a table, the rows in SYSCOLPERMS for the table in question were not getting", 
   "updated to incorporate the new column. This caused ASSERT failure when a", 
   "non-table owner attempted to select the new column.", 
   "Some background information on system table involved: SYSCOLPERMS keeps track", 
   "of column level privileges on a given table. One of the columns in SYSCOLPERMS", 
   "is \"COLUMNS\" and it has a bit map to show which columns have the given", 
   "permission granted on them. When a new column is added to the user table,", 
   "the \"COLUMNS\" need to be expanded by one bit and that bit should be initialized", 
   "to zero since no privileges have been granted on that column at the ALTER", 
   "TABLE...ADD COLUMN time.", 
   "I have fixed this problem by having", 
   "AlterTableConstantAction.addNewColumnToTable call the new method in", 
   "DataDictionary called updateSYSCOLPERMSforAddColumnToUserTable. At this point,", 
   "we know of only the TableDescriptor's uuid which can help us determine all the", 
   "rows in SYSCOLPERMS for that given table uuid. I get ColPermsDescriptor for", 
   "each one of those rows and then use the ColPermsDescriptor's uuid to update", 
   "the \"COLUMNS\" column so SYSCOLPERMS is aware of the newly added column in user", 
   "table. This fixes the problem because at the time of SELECT, when we do", 
   "privilege lookup in SYSCOLPERMS, we have info on the newly added column."
  ], 
  "revision_id": "453747"
 }, 
 {
  "author": "chirino", 
  "date": "2006-10-06T19:53:54.505521Z", 
  "msg": [
   "Latest export from confluence"
  ], 
  "revision_id": "453746"
 }
]