[
 {
  "author": "djencks", 
  "date": "2004-06-11T19:22:05.000000Z", 
  "msg": [
   "Supply the means for the ManagedConnectionFactory to participate in recovery. Modify the JDBCLog to recover names and branch Xids."
  ], 
  "revision_id": "45529"
 }, 
 {
  "author": "djencks", 
  "date": "2004-06-11T19:20:55.000000Z", 
  "msg": [
   "Modify the recovery scheme to require the log to save names of XAResources and allow it to save xid branch qualifiers"
  ], 
  "revision_id": "45528"
 }, 
 {
  "author": "djencks", 
  "date": "2004-06-11T19:18:21.000000Z", 
  "msg": [
   "Replace hardcoded name reference patterns with configurable names from the EarDeployer"
  ], 
  "revision_id": "45527"
 }, 
 {
  "author": "jdillon", 
  "date": "2004-06-10T23:31:22.000000Z", 
  "msg": [
   "o fixed path to servlet module", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "45526"
 }, 
 {
  "author": "gdamour", 
  "date": "2004-06-10T23:12:25.000000Z", 
  "msg": [
   "o Gets rid of the weight-based NodeTopology;", 
   "o Replaces it with a simple interface, NodeTopology, defining the basic contracts of a node topology;", 
   "o Introduces the Cluster notion: a Cluster seats on top of a cluster of nodes. The topology of these", 
   "latter is managed automatically by Cluster. More acccurately, Cluster delegates to TopologyManager", 
   "the computing of the new topology when a Node joins or leaves it;", 
   "o Introduces the notion of TopologyManager: it allows to implement various Node topologies (e.g. ring,", 
   "mesh,hypercube);", 
   "o Implements a simple ring topology;", 
   "o Node does not offer anymore the ability to join or leave a remote Node. Instead, when its topology", 
   "is set, it leaves and/or joins remote nodes based on the neighbours defined by NodeTopology and the", 
   "currently connected neighbours; It then cascades the new topology to all of its neighbours.", 
   "o EndPoints are no more required to be GBeans. StreamManager, EndPointProxyFactory and", 
   "ReferenceableManager are now basic EndPoints (no more GBeans). Their implementations can be replaced", 
   "via standard inheritence of NodeImpl; and", 
   "o Renames GBean to GBeanLifecycle."
  ], 
  "revision_id": "45525"
 }
]