[
 {
  "author": "jonl", 
  "date": "2005-02-24T03:44:32.000000Z", 
  "msg": [
   "Added automatic image buttons (as demonstrated in FormInput example now)", 
   "as well as automatic images.  Each can generate an image using an image", 
   "factory based on the value of the component's tag's value attribute.", 
   "If the value is set to [factoryName].label, the given label will be drawn", 
   "with the given ImageResourceFactory.  The LocalizedImageResource class", 
   "handles all this as well as localization issues with images attached to", 
   "components.  By default, only DefaultButtonImageFactory() is registered", 
   "via LocalizedImageResource.add(ImageResourceFactory).  The default button", 
   "image factory has the name 'button', which means that any image or image", 
   "button component that specifies a value of \"button.[label]\" will result in", 
   "a DefaultButtonImage with the given label drawn on it.  In addition to these", 
   "improvements, the ImageResourceFactory base class adds automatic caching", 
   "of images it creates via a WeakHashMap."
  ], 
  "revision_id": "456005"
 }, 
 {
  "author": "jonl", 
  "date": "2005-02-24T01:54:23.000000Z", 
  "msg": [
   "Restructured form validation so that feedback is updated for the whole form", 
   "on success or failure.  Fixed additional bug where the form itself was not", 
   "being considered by the feedback messages model as a place that might be the", 
   "source of messages.  These two changes together fix the bug."
  ], 
  "revision_id": "456004"
 }, 
 {
  "author": "jonl", 
  "date": "2005-02-23T21:26:05.000000Z", 
  "msg": [
   "Fixed changes.xml bug and added to faq as per #1149939 -  doc bug - hiding some markup"
  ], 
  "revision_id": "456003"
 }, 
 {
  "author": "jonl", 
  "date": "2005-02-23T20:53:21.000000Z", 
  "msg": [
   "Made RequiredValidator constructor private so that getInstance() must be used.  In the long term, this will result in more efficient Wicket apps."
  ], 
  "revision_id": "456002"
 }, 
 {
  "author": "jonl", 
  "date": "2005-02-23T19:15:01.000000Z", 
  "msg": [
   "Moved getRequestX() down into FormComponent and renamed to getInput() and inputAsX().  Then made all these methods protected so only FormComponent subclasses can access them.  This should reduce confusion about validation considerably."
  ], 
  "revision_id": "456001"
 }
]