[
 {
  "author": "jonl", 
  "date": "2005-03-10T00:34:51.000000Z", 
  "msg": [
   "Fleshed out more of sketch of UndoPageVersionManager and put that in a new package, wicket.version.undo.  Made minor changes to Component and Page to support those changes.  Could it be this simple?  Probably not!"
  ], 
  "revision_id": "456185"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-09T23:43:46.000000Z", 
  "msg": [
   "JavaDoc"
  ], 
  "revision_id": "456184"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-09T23:11:39.000000Z", 
  "msg": [
   "Added the first portion of our framework for doing page versioning, including the IPageVersionManager interface and calls into that from MarkupContainer, Component and elsewhere.  Removed all render count functionality and reworked the code to check component renderings as a debug-only Set in Page.  Also made more structural changes to onX() handlers so that all internal handlers are onInternalX() now, meaning that user code does not have to call super.onX() ever to have the core functionality work.  There are now user methods for each lifecycle event that the user might care about.  These are called in the following order: Page.onBeginRequest(), Component.onBeginRender(), Component.onRender(), Component.onEndRender(), Page.onEndRequest().  Component.onModelChanged() is called when a component's model is changed.  This is detected when Component.setModel() or Component.setModelObject() are called.  If a Component's model is changed by the programmer and they wish to let the framework know that a model change happened, they can call Component.modelChanged() directly."
  ], 
  "revision_id": "456183"
 }, 
 {
  "author": "jdonnerstag", 
  "date": "2005-03-09T14:32:51.000000Z", 
  "msg": [
   "moved Spring utility classes and character encoding classes from examples into contrib"
  ], 
  "revision_id": "456182"
 }, 
 {
  "author": "cvs2svn", 
  "date": "2005-03-08T21:26:44.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'BEFORE_INITIAL_VERSIONING_REFACTOR'."
  ], 
  "revision_id": "456181"
 }
]