[
 {
  "author": "jonl", 
  "date": "2005-03-15T15:06:28.000000Z", 
  "msg": [
   "Fix for 1.4 JDK and before."
  ], 
  "revision_id": "456215"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-15T13:51:18.000000Z", 
  "msg": [
   "Changed model cloning so that models which are identical to their parent Page/Form do not get cloned.  Instead a null reference is saved in ModelChange as the value to install on undo (originalModel).  This should work find because the next time the model is retrieved with getModel(), initModel() will be called and that will install the model again from the parent Page/Form."
  ], 
  "revision_id": "456214"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-15T13:11:03.000000Z", 
  "msg": [
   "Added IStringResource, which extends IResource to add a Charset property and a method asString() for any object that implements the interface.  AbstractResource implements this interface now.  Changed VelocityPanel to use an IStringResource instead of a hardwired String.  This will allow velocity users to load templates from anywhere."
  ], 
  "revision_id": "456213"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-15T13:08:58.000000Z", 
  "msg": [
   "Changes for Maurice's bug where changing the component hierarchy in onSubmit() can cause the form to become detached from its Page parent.  In this case, we check for a null Page parent and avoid attempting to update feedback."
  ], 
  "revision_id": "456212"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-15T11:09:10.000000Z", 
  "msg": [
   "Now WebApplication reads the servlet init parameter \"configuration\". If the parameter has the value \"development\", settings appropriate for development are set. If it's \"deployment\", deployment settings are used. If development, configuration is specified and a \"sourceFolder\" init parameter is also set, then resources in that folder will be polled for changes.  Since this all occurs on initialization, the user can still override settings in the usual place."
  ], 
  "revision_id": "456211"
 }
]