[
 {
  "author": "ehillenius", 
  "date": "2005-03-18T13:20:04.000000Z", 
  "msg": [
   "tree uses classes now instead of id's"
  ], 
  "revision_id": "456245"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-18T13:19:20.000000Z", 
  "msg": [
   "Simplified a few calls that no longer need to call getRequestCycle() explicitly."
  ], 
  "revision_id": "456244"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-18T13:11:32.000000Z", 
  "msg": [
   "Only call onBegin/onEndRender notifications when a component is actually visible because invisible components are not really rendered."
  ], 
  "revision_id": "456243"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-18T12:48:22.000000Z", 
  "msg": [
   "Added setRedirect()."
  ], 
  "revision_id": "456242"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-18T11:55:39.000000Z", 
  "msg": [
   "Major changes!  Added PageMap abstraction to Session to make it possible for multiple browser windows,", 
   "popups and frames to have their own page maps, avoiding the problem of pages going stale in one window", 
   "when the other window is used.  In the future, this will also allow us to implement a page stack for the", 
   "page map and using this a back() navigation method that always knows what the previous page was.", 
   "Adding PageMap required a whole set of changes to the framework.", 
   "The various urlFor overloads moved from RequestCycle to Page (and they are implemented in WebPage).", 
   "The reason for this is that each Page belongs to a specific PageMap now and it will render differently", 
   "in that the url returned by urlFor will have the PageMap encoded in it (if it is not in the default", 
   "page map).  A variety of other changes were necessary to support this abstraction, including changes to", 
   "state management and clustering code.  In addition, this checkin contains a very early implementation of", 
   "a concept I'm calling \"PageSets\".  The code will eventually apply to security, presentation and navigation,", 
   "but don't worry about all this just yet.  Also created newPage() methods in Component that make it easy", 
   "to create new pages using the Page's PageFactory."
  ], 
  "revision_id": "456241"
 }
]