[
 {
  "author": "jonl", 
  "date": "2005-03-22T11:16:15.000000Z", 
  "msg": [
   "Changed the render cycle to make it better defined.  You can no longer change the component", 
   "hierarchy during rendering.  If you attempt to do so, an exception will be thrown.  To allow", 
   "for modification of the component hierarchy prior to rendering, there is a new onBeginRequest", 
   "and onEndRequest pair, which wholly replaces onBeginRender / onEndRender.  There should be no", 
   "need to do anything just before something renders now because the whole component tree is", 
   "expected to be immutable throughout the rendering process.  I updated the Link, ListView and", 
   "Loop components so that they use internalOnBeginRequest() to add their children.  But we have", 
   "an ongoing problem with auto-links and auto-components, which now must be added during", 
   "internalOnBeginRequest(), requiring changes to the markup parser as well (which should probably", 
   "just make notes about what components if any need to be added in internalOnBeginRequest()).", 
   "Also, fixed a major stupid bug in Component where i had implemented space efficient booleans", 
   "nicely, but failed to initialize them."
  ], 
  "revision_id": "456280"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-22T08:48:01.000000Z", 
  "msg": [
   "Minor changes and formatting in list package, space optimizations for clustering in component and page."
  ], 
  "revision_id": "456279"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-21T16:39:18.000000Z", 
  "msg": [
   "Removed State and refactored clustering."
  ], 
  "revision_id": "456278"
 }, 
 {
  "author": "jonl", 
  "date": "2005-03-21T15:09:24.000000Z", 
  "msg": [
   "Minor changes, formatting and sorting of members."
  ], 
  "revision_id": "456277"
 }, 
 {
  "author": "dashorst", 
  "date": "2005-03-21T15:02:19.000000Z", 
  "msg": [
   "Fixed the discription on the website for the user manual, and point users to various documentation places."
  ], 
  "revision_id": "456276"
 }
]