[
 {
  "author": "jonl", 
  "date": "2005-04-08T05:23:47.000000Z", 
  "msg": [
   "Fixed a bunch of unreported problems with image resources.  The new method", 
   "Application.localizedPath(name, locale, style) constructs more reasonable paths", 
   "for images by inserting the locale just before the extension (instead of after", 
   "it, which looks wrong and confusing).  This method will omit the locale if it", 
   "is equal to Locale.getDefault(), which means foo_en_US.gif and foo.gif are the", 
   "same resource in the US.  Updated Application.getResource() methods to use", 
   "this method when searching for a resource in the shared resource cache.", 
   "The new getResource() method will actually fail if it cannot find a resource", 
   "that matches the locale (as opposed to defaulting to the default locale).  This", 
   "will help keep localization problems to a minimum and also ensures that lazy", 
   "initialization will work (which it did not, before).  Undid a change that Johan", 
   "made to InputForm since we do not search for anything other than Locale.toString(),", 
   "meaning nl and nl_nl are not equal in Wicket at this time (which is really a bug", 
   "if anyone wants to report it).  Finally, made changes to the static image resolution", 
   "code so that it automatically creates shared resources! This means that the code", 
   "for the Pub example did not have to change in order to be efficient /and/ localized."
  ], 
  "revision_id": "456445"
 }, 
 {
  "author": "jonl", 
  "date": "2005-04-08T00:36:12.000000Z", 
  "msg": [
   "Removed unused import.  Fixed build errors in sandbox code."
  ], 
  "revision_id": "456444"
 }, 
 {
  "author": "jcompagner", 
  "date": "2005-04-07T23:07:05.000000Z", 
  "msg": [
   "expire date header fix"
  ], 
  "revision_id": "456443"
 }, 
 {
  "author": "jcompagner", 
  "date": "2005-04-07T22:30:41.000000Z", 
  "msg": [
   "cacheable boolen added", 
   "some members/methods visibility changed (private->protected, protected->public)"
  ], 
  "revision_id": "456442"
 }, 
 {
  "author": "jcompagner", 
  "date": "2005-04-07T22:29:15.000000Z", 
  "msg": [
   "set the cache boolean to true for shared resources"
  ], 
  "revision_id": "456441"
 }
]