[
 {
  "author": "jdonnerstag", 
  "date": "2005-12-11T22:54:04.000000Z", 
  "msg": [
   "Some refactoring of markup resource loading. Introduced MarkupResourceStream which implements IResourceStream and which knows about the container (ContainerInfo: class, locale, style) requesting the markup. IMO it the (internal) APIs are much better now."
  ], 
  "revision_id": "458290"
 }, 
 {
  "author": "jdonnerstag", 
  "date": "2005-12-11T19:49:12.000000Z", 
  "msg": [
   "I tried to remove the dependency on Container for reasons described by", 
   "Johan. The changes are as follows:", 
   "- Created a new class ContainerInfo which contains the container", 
   "class, the locale, the style and the markupType (file extension). It", 
   "is used instead of MarkupContainer whereever possible", 
   "- xxxStringResourceLoaders no longer takes a Container parameter. They", 
   "use container.getClass instead. This change required to move some", 
   "\"common\" code from AbstractStringResourceLoader into Localizer.", 
   "- Localizers API is extended. It provides one additional method which", 
   "does NOT take a component, but a component class instead. This method", 
   "is currently only used by WicketMessageHandler", 
   "- MarkupParser and WicketMessageHandler changed to take ContainerInfo", 
   "instead of MarkupContainer", 
   "- MarkupCache to use ContainerInfo instead of Container, thus solving", 
   "the loadMarkupAndWatchForChange issue described by Johan", 
   "Created a cvs tag prior to committing the changes, so it should be easy to revert back if necessary"
  ], 
  "revision_id": "458289"
 }, 
 {
  "author": "cvs2svn", 
  "date": "2005-12-11T18:19:03.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'PRE_CONTAINERINFO_CHANGE'."
  ], 
  "revision_id": "458288"
 }, 
 {
  "author": "ivaynberg", 
  "date": "2005-12-11T18:19:03.000000Z", 
  "msg": [
   "mounting path/package checks"
  ], 
  "revision_id": "458287"
 }, 
 {
  "author": "ivaynberg", 
  "date": "2005-12-11T09:26:25.000000Z", 
  "msg": [
   "added todo"
  ], 
  "revision_id": "458286"
 }
]