[
 {
  "author": "jdonnerstag", 
  "date": "2005-12-27T10:38:52.000000Z", 
  "msg": [
   "Based on the idea and code provided by Christian Essl. A component resolver (ScopedComponentResolver) which walks up the component tree until a Page or Panel and tries to find a component with a matching wicket id, effectivly providing something like scoping for wicket id resolution.", 
   "Note: this resolver is NOT activated by default. See the javadoc for more details"
  ], 
  "revision_id": "458375"
 }, 
 {
  "author": "jdonnerstag", 
  "date": "2005-12-27T10:29:53.000000Z", 
  "msg": [
   "- some javadoc", 
   "- tagged the cvs version prior to committing this change", 
   "- Refactored how containers implement transparent component resolution. A feature used mainly be \"internal\" components like Autolink, HeaderContainers, BodyOnLoadContainer etc.. Components which gets autoAdded and which must be invisble (in terms of component tree and component resolution) to the user. The resolver implementation has been extracted into a IComponentResolver (ParentResolver) which has been added to the existing list of resolver registered by Application. To implement a transparent container it is now sufficient to ovveride MarkupContainer.isTransparent() which by default return false.", 
   "This change does not change the API. All junit tests are unmodified and pass successfully and I (manually) tested wicket-example. It should not break anyones application."
  ], 
  "revision_id": "458374"
 }, 
 {
  "author": "cvs2svn", 
  "date": "2005-12-26T11:15:32.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag", 
   "'V_1_2_PRE_TRANSPARENT_CONTAINERS'."
  ], 
  "revision_id": "458373"
 }, 
 {
  "author": "jdonnerstag", 
  "date": "2005-12-26T11:15:32.000000Z", 
  "msg": [
   "renamed private inner class"
  ], 
  "revision_id": "458372"
 }, 
 {
  "author": "jdonnerstag", 
  "date": "2005-12-26T10:11:58.000000Z", 
  "msg": [
   "tiny refinements for re-render and additional javadoc"
  ], 
  "revision_id": "458371"
 }
]