[
 {
  "author": "jonl", 
  "date": "2006-01-17T07:34:26.000000Z", 
  "msg": [
   "Better explanation of limitations of access stack in the presence of stateless pages accessed with the back button."
  ], 
  "revision_id": "458710"
 }, 
 {
  "author": "jonl", 
  "date": "2006-01-17T07:19:43.000000Z", 
  "msg": [
   "Made changes to PageMap to support an access stack.  The order of access to page versions is tracked on this stack and the stack may be used in eviction strategies like LeastRecentlyAccessedEvictionStrategy.  When the back button is used on stateful pages, unreachable version information and page entries are automatically removed from the session.  The PageMap.back() method gives access to the most recently accessed page.  The access stack mechanism does not work perfectly when the user uses the back button to access stateless pages to move forward again.  However, the failure to remove state information on inaccessible pages is no worse than the framework was before.  A few other minor changes like getSize() -> getSizeInBytes() and changes to the inspector which now shows the page access order, including the order that versions of pages were accessed.  When the back button is used, you can see versions and entries disappearing (except for the odd problem with stateless pages where the browser stack cannot be kept in sync with the access stack)."
  ], 
  "revision_id": "458709"
 }, 
 {
  "author": "jcompagner", 
  "date": "2006-01-16T23:58:29.000000Z", 
  "msg": [
   "fixe the versions a page can have"
  ], 
  "revision_id": "458708"
 }, 
 {
  "author": "jonl", 
  "date": "2006-01-16T23:43:50.000000Z", 
  "msg": [
   "Added getVersions() method to PageMap and expireOldestVersion to Page and IPageVersionManager.  Updated eviction strategy and then tested using an update to PageMapView which shows how many versions a page has as well as the current version.  After 15 refreshes of the column sorting example, the eviction strategy starts to remove old versions."
  ], 
  "revision_id": "458707"
 }, 
 {
  "author": "jonl", 
  "date": "2006-01-16T23:04:52.000000Z", 
  "msg": [
   "Removed setter causing warning."
  ], 
  "revision_id": "458706"
 }
]