[
 {
  "author": "jcompagner", 
  "date": "2006-05-19T17:58:23.287141Z", 
  "msg": [
   "rename from ISupplyConverter to ICoverterLocator"
  ], 
  "revision_id": "460645"
 }, 
 {
  "author": "jcompagner", 
  "date": "2006-05-19T12:13:36.887696Z", 
  "msg": [
   "converter and depricated changes"
  ], 
  "revision_id": "460644"
 }, 
 {
  "author": "jcompagner", 
  "date": "2006-05-19T12:12:53.408228Z", 
  "msg": [
   "fixes for the 2.0"
  ], 
  "revision_id": "460643"
 }, 
 {
  "author": "jcompagner", 
  "date": "2006-05-19T12:04:06.069656Z", 
  "msg": [
   "PageMap refactor. The default base pagemap doesn't do much anymore", 
   "What was our previoud pagemap is now called AccessStackPageMap", 
   "this was needed for:", 
   "ClientPageSavingSessionStore A tryout of clientside page state saving. It works currently only for forms. Links are not rewritten yet to use a form submit.", 
   "SecondLevelCacheSessionStore This is for now the default one. This only holds one page (the last/current one) for one pagemap and the rest is first cached", 
   "in a soft cache store. And written to the work dir on the HD.", 
   "IConverter/ITypConverter changes.", 
   "Now we only have one IConverter with 2 methods: convertToObject/convertToString.", 
   "And a converter for a specific type can be get in the new refactored method getConverted(Class) on component or session.", 
   "This method comes from the ISupplyConverter interface which has a default ConverterSupplier class", 
   "where the sessions gets its type converters from. But you can make youre own.", 
   "It is now much easier to create converters for a component..", 
   "added Form.setBookmarkableHint(boolean), If this is set and the Page is stateless and the Page has a default or pageparams constructor", 
   "the form will generate a bookmarkable url to itself.  So the page is still stateless..", 
   "This will result ofcourse in lost page state. Because when such an url is hit. The page will first be created. then the form onFormSubmit() will be called.", 
   "So the form will always be in the constructed state. The nice thing is. That everythign just works. required chec, Type conversion and Validation.", 
   "And if you only care about the input in the onsubmit you won't notice any difference.", 
   "Large parts are java5 generified  now. This is by far done. But i got as much as i came alonge when walking through the code.", 
   "removed wicket.concurrent package now. Because you really should use java5 for that."
  ], 
  "revision_id": "460642"
 }, 
 {
  "author": "dashorst", 
  "date": "2006-05-19T11:08:38.597143Z", 
  "msg": [
   "clean up"
  ], 
  "revision_id": "460641"
 }
]