[
 {
  "author": "kylem", 
  "date": "2004-09-17T19:58:20.625250Z", 
  "msg": [
   "- Added additional constraint to semantic validation of primitive-valued properties in Control", 
   "PropertySets.  PRIMITIVE PROPERTIES MUST SPECIFY A DEFAULT VALUE AS PART OF THE ANNOTATION TYPE", 
   "MEMBER DECLARATION.  The ensures consistent behavior for property accessor methods (they will", 
   "return the default value).   Object-valued properties do not have this constraint;  they will", 
   "return 'null' if the property has not been set by annotation, client, or external config.", 
   "- Added ControlBeanContext.getClassLoader() API, to enable a control implementation to do", 
   "resource loading using the same class loader as control type bound to the implementation.", 
   "- Removed a synchronization bottleneck in ControlContainerContext.begin/endContext methods.", 
   "Since these methods only access thread-local-storage, there is no value (and a high cost) to", 
   "doing global synchronization.", 
   "- Minor cleanup to codegen to leverage JDK 1.5 autoboxing, on the assumption that it should", 
   "be more efficient (or at least equivalent to) explicit casting.", 
   "- Tweaked test webapp build target to support composite control scenarios (by setting the", 
   "compileByExtension flag on <apt> invocation)."
  ], 
  "revision_id": "46269"
 }, 
 {
  "author": "mmerz", 
  "date": "2004-09-17T18:39:51.987807Z", 
  "msg": [
   "Added Linux sctipts for Axis' wsdd deployment model.", 
   "Contributor: Wolfgang (wolfgang127us@yahoo.co.jp)"
  ], 
  "revision_id": "46268"
 }, 
 {
  "author": "ekoneil", 
  "date": "2004-09-17T18:11:21.654577Z", 
  "msg": [
   "Fixup for the FormatTags test.", 
   "This has been a while in coming.  <g>", 
   "More on this in a bit into the dev list; this change just specifies a pattern on a couple of formatDate tags that were picking up the default pattern for the locale even though they had specifically specified EN and GB / US for the locales.", 
   "Also add a target to the DRT build file that will run the NetUI tests in an i18n'ed / l10n'ed locale by forcing the VM into:", 
   "-Duser.language=NL -Duser.country=BE", 
   "This could also be externally configurable but serves the purpose for now.", 
   "BB: self", 
   "DRT: NetUI pass"
  ], 
  "revision_id": "46267"
 }, 
 {
  "author": "mmerz", 
  "date": "2004-09-17T17:37:33.069117Z", 
  "msg": [
   "Added support for HandlerChain Annotations and made the AXIS WSM components", 
   "backward compatible with the original non-annotated .jws files so both types can", 
   "be placed in the context root.", 
   "Contributor: Jonathan Colwell"
  ], 
  "revision_id": "46266"
 }, 
 {
  "author": "andreas", 
  "date": "2004-09-17T17:12:05.208313Z", 
  "msg": [
   "created publication.util package"
  ], 
  "revision_id": "46265"
 }
]