[
 {
  "author": "kelvingoodson", 
  "date": "2006-10-16T16:38:05.451957Z", 
  "msg": [
   "tagging sdo-java-M2 branch for M2 delivery"
  ], 
  "revision_id": "464555"
 }, 
 {
  "author": "remm", 
  "date": "2006-10-16T16:37:32.880393Z", 
  "msg": [
   "- Thanks for adding in the other important features to the list.", 
   "- Do we remove the 5.5 changelog or not ?"
  ], 
  "revision_id": "464554"
 }, 
 {
  "author": "kelvingoodson", 
  "date": "2006-10-16T16:37:00.456815Z", 
  "msg": [
   "prep for sdo tagging"
  ], 
  "revision_id": "464553"
 }, 
 {
  "author": "minchau", 
  "date": "2006-10-16T16:34:43.835147Z", 
  "msg": [
   "Applying Dave Brosius patch from xalanj-2221 which", 
   "changes a loop over i that copies values from one", 
   "array to another to a System.arraycopy() that should", 
   "run faster."
  ], 
  "revision_id": "464552"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-10-16T16:32:50.531101Z", 
  "msg": [
   "DERBY-737: SYSCS_UTIL.SYSCS_COMPRESS_TABLE should create statistics", 
   "This patch was contributed by Mamta A. Satoor (msatoor@gmail.com)", 
   "The changes have been very localized in", 
   "AlterTableConstantAction.java!updateIndex(). Currently, this method checks", 
   "if statistics already exist for an index. If yes, then it sets a flag", 
   "updateStatistics to true. Later, the code checks for this flag and drops", 
   "the existing statistics and creates new statistics for that index provided", 
   "the user table at this point is not empty. So, as we can see, if there is", 
   "an index with no preexisting statistics, the flag updateStatistics will be", 
   "set to false and hence no statistics related code is executed and hence", 
   "even though the user table is not empty at the time of compress, no", 
   "statistics get generated for such an index.", 
   "I am proposing to fix the problem by still using the flag to see if", 
   "an index has pre-existing statistics. If yes, then we should drop", 
   "those statistics. Next, whether the index has pre-existing statistics or", 
   "not, go ahead and create new statistics for the index provided the", 
   "user table is not currently empty."
  ], 
  "revision_id": "464551"
 }
]