[
 {
  "author": "dandiep", 
  "date": "2006-10-18T05:14:04.593971Z", 
  "msg": [
   "o Client side fault support. This mostly involved writing the ClientFaultConverter", 
   "interceptor which takes a Detail and turns it into an exception. ServiceFactories", 
   "also had to be improved a bit.", 
   "o As part of the ClientImpl changes needed for fault support, I needed to straigten", 
   "out correlation a bit. It is now the transport's responsibility to set the exchange", 
   "on the message and the message on the exchange (unless the transport is completely", 
   "async). This can be done by simply calling exchange.setInMessage(msg).", 
   "o IMPORTANT: this seems to somehow break WS-Addressing systests. I've commented them", 
   "out, but I would appreciate some help figuring out whats going on as I can't figure", 
   "it out for the life of me! This may be related to the partial response logic I", 
   "removed, but I tried reenabling it to no avail.", 
   "o I removed the partial response logic as it didn't seem to be doing much (see above", 
   "- correct me if I'm completely wrong). I don't think the ClientImpl is the right", 
   "place to put the logic. To me it would seem much more appropriate for the ws-rm", 
   "implementation to register its own MessageObserver. I will bring this up on the", 
   "list though.", 
   "o The JAXBEncoderDecoder wasn't always returning the inner value of the JAXBElement", 
   "and so it was returning a JAXBElement for faults instead of the fault bean. I don't", 
   "see any reason to return a JAXBElement and it doesn't seem to break anything, so", 
   "I changed it. Please correct me if I'm wrong.", 
   "o Remove ServiceManager as its not needed."
  ], 
  "revision_id": "465145"
 }, 
 {
  "author": "mturyn", 
  "date": "2006-10-18T05:09:02.852660Z", 
  "msg": [
   "Firefox's parser objected to a margin statement's not using px units."
  ], 
  "revision_id": "465144"
 }, 
 {
  "author": "wjwashburn", 
  "date": "2006-10-18T05:05:44.868857Z", 
  "msg": [
   "HARMONY-1806, Jitrino.JET write barrier support for gc written in java (mmtk)", 
   "This patch builds and runs successfully on windowsxp as well as redhat w/ gcc 2.3.5"
  ], 
  "revision_id": "465143"
 }, 
 {
  "author": "jdillon", 
  "date": "2006-10-18T04:43:12.100395Z", 
  "msg": [
   "Need 1.5 to build due to gshell usage"
  ], 
  "revision_id": "465142"
 }, 
 {
  "author": "mloenko", 
  "date": "2006-10-18T04:42:13.057919Z", 
  "msg": [
   "fixed BigDecimal serialization, applied patch from HARMONY-1896", 
   "[classlib][math] Serialization of BigDecimal works incorrtly"
  ], 
  "revision_id": "465141"
 }
]