[
 {
  "author": "jliu", 
  "date": "2006-10-23T13:17:46.708966Z", 
  "msg": [
   "* A simple sub chain support: Sub chain can be used when the invocation of a set of interceptors needs to be wrapped in another interceptor, so that the interceptor that initiates sub chain can do some work when sub chain invocation returns, for example, stax can take this opportunity to write the end element.", 
   "The interceptor that wants to initiate a sub chain invocation needs to call PhaseInterceptorChain.doInterceptInSubChain(). The last interceptor in the sub chain needs to call PhaseInterceptorChain.finishSubChain() to indicate that the sub chain invocation has finished, the control will be returned to the interceptor that initiates the sub chain.", 
   "We may want to review this simple sub chain support later on, for example, we may want to configure interceptor chain and sub chain through configuration, if we are convinced that a sub chain interceptor is the best way to solve stax related problems. For the time being, we just use this simple sub chain to get the job done.", 
   "* Make SOAPHandlerInterceptor located after SoapOutInterceptor in the chain in order to access SOAPMessage."
  ], 
  "revision_id": "466980"
 }, 
 {
  "author": "kpvdr", 
  "date": "2006-10-23T13:01:03.496326Z", 
  "msg": [
   "Tidy-up of generated code"
  ], 
  "revision_id": "466979"
 }, 
 {
  "author": "jmcconnell", 
  "date": "2006-10-23T12:51:31.596087Z", 
  "msg": [
   "continuum-966, a couple of added jsp's and some tweaking of the added group notifiers action, thanks rahul"
  ], 
  "revision_id": "466978"
 }, 
 {
  "author": "ddewolf", 
  "date": "2006-10-23T12:51:21.452800Z", 
  "msg": [
   "SB-44, Making the TilesContextFactory a normal class. Seperating the TilesContext into a TilesApplicationContext (for app scoped methods) and a TilesRequestContext (for request scoped features);  Configuratino of the Factory remains for a different issue/commit"
  ], 
  "revision_id": "466977"
 }, 
 {
  "author": "deepal", 
  "date": "2006-10-23T12:32:15.855049Z", 
  "msg": [
   "fixing code generation problem for SOAP 12"
  ], 
  "revision_id": "466976"
 }
]