[
 {
  "author": "jm", 
  "date": "2006-10-27T19:19:28.137011Z", 
  "msg": [
   "moving this set of rules to a sandbox for zmi -- even if he doesn't have the commit bit, it's still a more sensible place"
  ], 
  "revision_id": "468505"
 }, 
 {
  "author": "awhite", 
  "date": "2006-10-27T19:17:32.694236Z", 
  "msg": [
   "Move build logic for adding an interface to WASManagedRuntime's inner class to", 
   "WASManagedRuntime itself.  Move caching in WASManagedRuntime to", 
   "endConfiguration() callback to avoid threading issues."
  ], 
  "revision_id": "468504"
 }, 
 {
  "author": "bpendleton", 
  "date": "2006-10-27T19:17:28.936421Z", 
  "msg": [
   "DERBY-1758: Enable xmlSuite to run as part of derbyall for qualified JVMs", 
   "This patch was contributed by A B (qozinx@gmail.com)", 
   "This patch adds two JUnit tests to lang/_Suite.java. The first test,", 
   "XMLTypeAndOpsTest.java, is meant to be a JUnit equivalent to the current", 
   "lang/xml_general.sql test. The second test, XMLMissingClassesTest,", 
   "tests the behavior of the SQL/XML operators when the required JAXP", 
   "or Xalan classes are not in the classpath.", 
   "The XML classes can be provided in any of a number of ways:", 
   "1) bundled into the JVM", 
   "2) installed as endorsed libraries", 
   "3) specified in the classpath", 
   "Hand-testing was performed to ensure that the new JUnit tests perform", 
   "correctly in these various configurations.", 
   "If the tests are run in an environment which does not support the XML", 
   "features, the tests quietly do nothing.", 
   "The patch, d1758_newJUnitTests_v2.patch, also adds a new utility method", 
   "and some associated state to JDBC.java for checking two things:", 
   "1) that the classpath has JAXP and Xalan classes, and", 
   "2) if the classpath has Xalan, check that the version of Xalan meets", 
   "the minimum requirement for use of Derby SQL/XML operators.", 
   "These methods/flags are then used to determine when to run the new", 
   "XML JUnit tests.", 
   "NOTE: After this patch has been reviewed/updated and finally committed", 
   "I will post a separate patch to remove the old lang/xml_general.sql test", 
   "and the corresponding master files. I will then continue addressing the", 
   "rest of the tasks for this issue (esp. xmlBinding.java) in incremental fashion."
  ], 
  "revision_id": "468503"
 }, 
 {
  "author": "djd", 
  "date": "2006-10-27T19:06:19.822130Z", 
  "msg": [
   "DERBY-2007 (partial) Improve CleanDatabaseTestSetup to handle tables in a dependency loop due", 
   "to foreign key constraints and simple cases for objects that are dependent across schemas."
  ], 
  "revision_id": "468502"
 }, 
 {
  "author": "cziegeler", 
  "date": "2006-10-27T19:05:18.264213Z", 
  "msg": [
   "Fix compilation of jcr test cases"
  ], 
  "revision_id": "468501"
 }
]