[
 {
  "author": "gnodet", 
  "date": "2006-10-30T21:55:30.407717Z", 
  "msg": [
   "Fix infinite loop problem on ftp servers reporting \".\" and \"..\" dirs.", 
   "Thanks to Allan Brighton."
  ], 
  "revision_id": "469285"
 }, 
 {
  "author": "djencks", 
  "date": "2006-10-30T21:52:55.495940Z", 
  "msg": [
   "DAYTRADER-16 add JPA mode.  Don't know if direct and ejb mode still work.  Requires fix for OPENEJB-300 to fully work"
  ], 
  "revision_id": "469284"
 }, 
 {
  "author": "sichen", 
  "date": "2006-10-30T21:47:28.375728Z", 
  "msg": [
   "Fix bug in sequence value utility where it is actually using Integer instead of Long, so very large sequence values cannot be generated"
  ], 
  "revision_id": "469283"
 }, 
 {
  "author": "cschoett", 
  "date": "2006-10-30T21:46:49.194197Z", 
  "msg": [
   "Fix for BEEHIVE-919.  This exception was being caused because the Adult control was attempting to add a child control which was already present with the same control ID.  This was occuring for children of the 'Dean' control bean, which do NOT have bean definitions in the application-context file.", 
   "All other beans do have entries in the application-context and their control ID's are injected via constructor at creation time.  The children of 'Dean' don't get a control ID set at construction time so when the control bean is added to the control context, an ID is autogenerated by the context for them.  This ID is not the same as the names in Dean's child list, hence the error.", 
   "There were a couple of options on how to fix this bug:", 
   "1) Add a bean descriptor to the application-context file for each of Dean's children.", 
   "2) Modify the Adult control to map child names -> control ids.", 
   "I chose option 2 as it seems to best fit with the original intent of the spring integration sample."
  ], 
  "revision_id": "469282"
 }, 
 {
  "author": "rdonkin", 
  "date": "2006-10-30T21:27:42.832262Z", 
  "msg": [
   "Added generated version."
  ], 
  "revision_id": "469281"
 }
]