[
 {
  "author": "gnodet", 
  "date": "2006-10-30T22:43:29.599923Z", 
  "msg": [
   "SM-726: Upgrade to backport-util-concurrent 2.2"
  ], 
  "revision_id": "469310"
 }, 
 {
  "author": "gnodet", 
  "date": "2006-10-30T22:38:26.614174Z", 
  "msg": [
   "Include missing modules in build.", 
   "Add components to distribution."
  ], 
  "revision_id": "469309"
 }, 
 {
  "author": "jta", 
  "date": "2006-10-30T22:38:21.819073Z", 
  "msg": [
   "Web site cleanup:", 
   "Associate the \"Product Writeups\" on integrate/index.html with the Resources", 
   "tab so that the left-hand navigation for those pages lists just the contents", 
   "of the Resources tab instead of the entire Derby site.", 
   "Gory explanation:", 
   "On http://db.apache.org/derby/integrate/index.html the \"Product Writeups\"", 
   "section links to some papers that don't appear on the navigation menu to keep", 
   "it decluttered. If a page doesn't appear in the site.xml, then forrest builds", 
   "a menu for that page that consists of the entire site.  That's clunky but", 
   "harmless. What causes greater confusion is a change made to an unrelated tab", 
   "also modifies these pages.", 
   "For example, Laura Stewart added a new manuals/guidelines.html page under", 
   "the Documentation tab, which was committed with revision 469254. The change", 
   "to the Documentation tab also changed the \"Product Writeups\" pages because", 
   "they weren't associated with any tab. (I reverted the changes to the product", 
   "writeup pages before committing them.)", 
   "The fix is to add the pages to the site.xml without any label, which is", 
   "partially shown below:", 
   "<integrate label=\"Other Products\" href=\"integrate/\" tab=\"resources\">", 
   "<index    label=\"Overview\" href=\"index.html\"/>", 
   "...", 
   "<ddlutils                  href=\"db_ddlutils.html\"/>", 
   "<jpox                      href=\"JPOX_Derby.html\"/>", 
   "....", 
   "</integrate>", 
   "So, this associates the pages with a specific tab, but doesn't output any label."
  ], 
  "revision_id": "469308"
 }, 
 {
  "author": "smilek", 
  "date": "2006-10-30T22:35:55.859957Z", 
  "msg": [
   "Improved management of html <head> content via HeaderResource and HeaderAggregatorImpl.", 
   "Recently added doHeader phase has facilitated a close examination of remaining header generation problems. This check-in is about addressing the following deficiencies:", 
   "1) Detection of the addition of duplicate header content is too coarse-grained. For example, entire script blocks are compared with each other as each is added. Exacerbating this problem is that each block is the complete definition for an html element to be added to the <head> (e.g. <script>, <link>, <style>).", 
   "2) In order to load a toolkit like dojo, each portlet which requires dojo needs to specify all header content needed to load the basic dojo in addition to any portlet specific header requirements. Making matters worse, this portlet must deal with the differences in dojo loading between /portal and /desktop. To date this problem has been mitigated by moving the common load code to a base class such as AbstractDojoVelocityPortlet.", 
   "3) Header content must be specified in java code and/or templates (e.g. velocity, jsp). The template solution further encumbers the effort to detect duplicate header content.", 
   "4) The ordering of header content is determined by whatever order the portlets get rendered.", 
   "We're writing an entry on this topic to add to the Documentation Guides.", 
   "Steve Milek"
  ], 
  "revision_id": "469307"
 }, 
 {
  "author": "dkulp", 
  "date": "2006-10-30T22:33:32.104864Z", 
  "msg": [
   "More cr/lf eol fixes"
  ], 
  "revision_id": "469306"
 }
]