[
 {
  "author": "peterjones", 
  "date": "2006-11-07T17:56:05.078650Z", 
  "msg": [
   "Fixed some windows linefeeds in this file."
  ], 
  "revision_id": "472180"
 }, 
 {
  "author": "joachim", 
  "date": "2006-11-07T17:51:49.471271Z", 
  "msg": [
   "merged changes from trunk (especially needed mailboxmanager refactoring)"
  ], 
  "revision_id": "472179"
 }, 
 {
  "author": "mturyn", 
  "date": "2006-11-07T17:50:11.552434Z", 
  "msg": [
   "Added handling for a \"path\" attribute for MCO's---if the mco \"src\" doesn't resolve", 
   "to a valid constructor, we look for a \"path\" attribute for the MCO, and if found, load", 
   "from the URI indicated there (usual restrictions on XmlHttpRequests in mozilla apply).", 
   "If there's no path, or if the source obtained still hasn't provided a constructor,", 
   "we attempt a Xap.require(<src>); there seems to be some problem with resolving the path", 
   "here, so this is more of a placeholder than anything else.", 
   "Xap has been altered to return a boolean depending on the success or failure in", 
   "its 'require()' call; this is necessary for the nascent behaviour above, but is a good", 
   "idea anyway---we should know when our loads work.", 
   "The combobox example has been altered to test these changes:  the <script/> tag loading", 
   "AttributeTester has been removed from the html file, and a path to Attribute.js supplied", 
   "to the mco declaration in the xal file.  AttributeTester.js has been altered in a minor way", 
   "--the xal file's source is AttributeTesterAlias instead of AttributeTester---in order to", 
   "test that we don't have any accidental file resolution going on anywhere."
  ], 
  "revision_id": "472178"
 }, 
 {
  "author": "tellison", 
  "date": "2006-11-07T17:38:52.319434Z", 
  "msg": [
   "Apply patch HARMONY-2079 ([classlib] Incorrect field declarations)"
  ], 
  "revision_id": "472177"
 }, 
 {
  "author": "mriou", 
  "date": "2006-11-07T17:32:51.506321Z", 
  "msg": [
   "Re-introducing events filtering."
  ], 
  "revision_id": "472176"
 }
]