[
 {
  "author": "tellison", 
  "date": "2006-11-07T15:10:29.595171Z", 
  "msg": [
   "Apply patch HARMONY-2076 ([classlib][luni]a bug of j.u.Scanner)"
  ], 
  "revision_id": "472130"
 }, 
 {
  "author": "jm", 
  "date": "2006-11-07T15:01:49.880586Z", 
  "msg": [
   "add comment speculating about T_RCVD_IN_XBL"
  ], 
  "revision_id": "472129"
 }, 
 {
  "author": "epunzalan", 
  "date": "2006-11-07T14:54:05.816704Z", 
  "msg": [
   "removed sysout method"
  ], 
  "revision_id": "472128"
 }, 
 {
  "author": "jacopoc", 
  "date": "2006-11-07T14:51:10.629540Z", 
  "msg": [
   "Removed other duplicated stuff... this component is a total mess."
  ], 
  "revision_id": "472127"
 }, 
 {
  "author": "kenney", 
  "date": "2006-11-07T14:34:59.779904Z", 
  "msg": [
   "Fix nested output folder problem by creating an external ant builder", 
   "to copy resources. This also makes it possible to copy resources with filtering.", 
   "o Added BuildCommand.java to specify the buildCommands; this is not yet a Mojo parameter,", 
   "but should be, since buildCommands are not simple strings but can have arguments", 
   "and triggers (although triggers seem to be ignored, and taken from the launch file).", 
   "This class also can write it's contents as XML to a writer.", 
   "o The buildCommands lists are updated to use the BuildCommand class instead of String.", 
   "o Updated all .project files to drop the empty <arguments/> tag due to the changed", 
   "nature of the BuildCommand writing.", 
   "o Added EclipseLaunchConfigurationWriter that abstracts writing eclipse .launch files.", 
   "o Added EclipseAntExternalLaunchConfigurationWriter that adds ant specific settings", 
   "to the above. The default is to NOT run in the background since you cannot fork", 
   "multiple ant builds on the same file at the same time.", 
   "Further, officially you cannot set the triggers 'auto' and 'clean' in the gui,", 
   "but they work perfectly when specified in the launch file.", 
   "o Add MonitoredResource to specify the resources that can trigger the build. Each", 
   "external build command can be triggered on resource changes. Right now it", 
   "defaults to the project itself. TODO: add the resource paths the trigger is for.", 
   "o Added filtering flag to EclipseSourceDir.", 
   "o Added eclipseProjectName property to EclipseWriterConfig. I don't want each", 
   "writer to figure out that it needs to call config.getProject().getArtifact() to", 
   "construct the project name. Also it's nice to have when we allow -version to", 
   "be appended to the project name.", 
   "o EclipsePlugin: moved the EclipseProjectWriter call after the EclipseClasspathWriter,", 
   "since that one modifies the config.buildCommands. This is not ideal; preferrably", 
   "this is all calculated in the plugin itself, and writers should not update the configuration", 
   "(unless we rename writer to processor or something ;))", 
   "o Added warnings if dupe source/resource directories are not added to the list to aid", 
   "in debugging missing source dirs.", 
   "o fixed typo in project-25/pom.xml: removed leading / from /src/main/java (was this", 
   "indeed an error?)"
  ], 
  "revision_id": "472126"
 }
]