[
 {
  "author": "trustin", 
  "date": "2006-11-11T04:40:53.483848Z", 
  "msg": [
   "Starting to implement a test case for ReplicationService"
  ], 
  "revision_id": "473640"
 }, 
 {
  "author": "gvanmatre", 
  "date": "2006-11-11T04:37:07.066366Z", 
  "msg": [
   "Allow setting the view root's properties within a Clay template (SHALE-331)."
  ], 
  "revision_id": "473639"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-11-11T04:16:19.232153Z", 
  "msg": [
   "Partial fix for cleaning up static resources at application shutdown", 
   "(SHALE-274) for the basic implementation.  This took several changes:", 
   "* We needed a servlet context listener that can call", 
   "PropertyUtils.clearDescriptors() and LogFactory.release().", 
   "* In order to get this without requiring the user to configure a listener", 
   "manually in web.xml, create a dummy \"tag library\" inside the JAR", 
   "(META-INF/taglib.tld) that serves to declare the listener.", 
   "* Since we now have an application startup/shutdown instance, migrate", 
   "the dialog configuration parsing from \"first use\" in BasicDialogManager", 
   "to \"application startup time\" as well.", 
   "With these changes, we have successfully cleaned up issues that caused", 
   "the Commons BeanUtils and Commons Logging jars to remain locked after", 
   "undeployment on a Windows platform.  However, there is still something", 
   "that prevents shale-dialog-basic-xxx.jar itself from being deleted -- and", 
   "this means there will be a memory leak over multiple application deploys", 
   "and undeploys.  This needs to be investigated and fixed before this issue", 
   "can be considered as \"dealt with\" for the basic implementation.", 
   "The Commons SCXML implementation is going to need the same sort of changes", 
   "(can be tagged against SHALE-274 as well), but it's likely to have its own", 
   "set of different issues about leaving the shale-dialog-scxml-xxx.jar file", 
   "locked."
  ], 
  "revision_id": "473638"
 }, 
 {
  "author": "jkuhnert", 
  "date": "2006-11-11T04:02:08.976755Z", 
  "msg": [
   "Fixes TAPESTRY-1147. Weird, I have eclipse setup for jre \"5\" compliance, not sure why it didn't catch this."
  ], 
  "revision_id": "473637"
 }, 
 {
  "author": "joehni", 
  "date": "2006-11-11T03:06:48.107967Z", 
  "msg": [
   "Fix XStream"
  ], 
  "revision_id": "473636"
 }
]