[
 {
  "author": "akarasulu", 
  "date": "2004-09-29T07:09:56.036678Z", 
  "msg": [
   "Commit changes ...", 
   "During the process of copying over the Backend interface we did a few things:", 
   "o renamed Backend to BackingStore; we did this because really this interface", 
   "is for managing storage operations on JNDI Attributes (entries) within", 
   "namespaces", 
   "o modified interface methods to be less LDAP specific; we would like to", 
   "minimize the LDAP specificity so this apparatus can be used for any", 
   "directory namespace not just the LDAP namespace; to acheive that we did", 
   "the following:", 
   "o removed references to LDAP specific JNDI objects like Controls from", 
   "the javax.naming.directory.ldap package; these objects will be kept", 
   "within the env used for the call", 
   "o altered the use of identifiers in javadocs and parameters; we now refer", 
   "to absolute or distinguished names as 'names' instead of an LDAP", 
   "specific identifier like 'dn'; we also refer to a relative name (rn/RN)", 
   "rather than the LDAP specific identifier 'rdn'.", 
   "o altered method names to reflect more general hierarchical namespace", 
   "operations rather than LDAP specific operations", 
   "Notes ...", 
   "o some operations like modifyRn have an LDAP centric parameter to delete", 
   "attributes associated with RN on a name change; although other namespaces", 
   "can do this as well it still stinks of LDAP; we have two options for", 
   "managing this:", 
   "o use a special property in the environment for this deleteRn parameter", 
   "o keep it in the method signature as a first class parameter", 
   "o these changes need not be considered right away; it might create too much", 
   "to deal with while pulling the code in from the sand box - this can be done", 
   "incrementally"
  ], 
  "revision_id": "47469"
 }, 
 {
  "author": "crossley", 
  "date": "2004-09-29T06:57:13.277185Z", 
  "msg": [
   "Woops, last commit was from the wrong working copy.", 
   "Add new section to describe \"Voting procedure\".", 
   "Extend time period if quorum not reached, then fail.", 
   "Describe the situation for changing these bylaws.", 
   "Add option to abstain.", 
   "Add links to select ASF documentation."
  ], 
  "revision_id": "47468"
 }, 
 {
  "author": "crossley", 
  "date": "2004-09-29T06:46:32.954726Z", 
  "msg": [
   "Add new section to describe \"Voting procedure\".", 
   "Extend time period if quorum not reached, then fail.", 
   "Describe the situation for changing these bylaws.", 
   "Add option to abstain.", 
   "Add links to select ASF documentation."
  ], 
  "revision_id": "47467"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-09-29T05:53:25.966746Z", 
  "msg": [
   "updates to state of moves"
  ], 
  "revision_id": "47466"
 }, 
 {
  "author": "hammett", 
  "date": "2004-09-29T05:47:05.432880Z", 
  "msg": [
   "Small but important correction."
  ], 
  "revision_id": "47465"
 }
]