[
 {
  "author": "kahatlen", 
  "date": "2006-11-15T19:17:53.424970Z", 
  "msg": [
   "DERBY-2089: jdbc4/VerifySignatures.junit is failing", 
   "Adding \"create=true\" so that the test database is created."
  ], 
  "revision_id": "475370"
 }, 
 {
  "author": "ablack", 
  "date": "2006-11-15T19:15:57.808752Z", 
  "msg": [
   "2006-11-15  Andrew Black  <ablack@roguewave.com>", 
   "* GNUmakefile.bin (exec): Fix typo introduced in http://svn.apache.org/viewvc?view=rev&rev=475095"
  ], 
  "revision_id": "475369"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-11-15T19:14:24.314200Z", 
  "msg": [
   "Reworking the hierarchical objects persistence model and enabling lazy fetching for all single and collection-valued associations in Hibernate.", 
   "I. Remodeled weblog category data model to remove use of HierarchicalPersistenObject and Assoc classes.", 
   "* Each category now points to its parent and children through the parentid column of the weblogcategory table.", 
   "* Did a little cleanup on unit tests to reflect this change.", 
   "* Removed all code which dealt with WeblogCategoryAssoc objects.", 
   "II. Remodeled folder/bookmarks data model to remove use of HierarchicalPersistentObject and Assoc classes.", 
   "* Same as weblog categories, uses a parentid column to reference parent and child relationships.", 
   "* Did some cleanup on unit tests.", 
   "* Removed all code which dealt with FolderAssoc objects.", 
   "III. Removed HierarchicalPersistentObject and Assoc classes since they were no longer needed.", 
   "* Removed all code which used these objects and delete the classes.", 
   "IV. Enabled Hibernate lazy fetching for all pojos so that associations can be fetched in a lazy manner.", 
   "* All this really required was changing the xdoclet marked in a variety of the pojo classes.", 
   "V. Modified RollerSession to only reference a user id string, not the UserData object itself.", 
   "* This is required to prevent lazy initialization exceptions from Hibernate because the stored UserData object is a detached object and thus referencing its Roles or Permissions associations later in the session causes problems.  The fix was simply to store the id and to load the actual UserData object using the id when it is needed."
  ], 
  "revision_id": "475368"
 }, 
 {
  "author": "chirino", 
  "date": "2006-11-15T19:14:13.204660Z", 
  "msg": [
   "Latest export from confluence"
  ], 
  "revision_id": "475367"
 }, 
 {
  "author": "andyhot", 
  "date": "2006-11-15T19:13:35.947308Z", 
  "msg": [
   "Interface and implementations for factories of FormSupport instances"
  ], 
  "revision_id": "475366"
 }
]