[
 {
  "author": "taylor", 
  "date": "2006-11-15T22:13:03.015260Z", 
  "msg": [
   "meant for this constraint to be on roles, not users"
  ], 
  "revision_id": "475460"
 }, 
 {
  "author": "tfischer", 
  "date": "2006-11-15T22:12:16.314915Z", 
  "msg": [
   "- Removed catching of exceptions in setUp() and tearDown() to ease diagnostics if an exception is thrown in these methods", 
   "- removed unnecessary setUp()-Method which only call super.setUp()", 
   "- skipped a test with self-joins for direbird and interbase (self-joins are buggy there)"
  ], 
  "revision_id": "475459"
 }, 
 {
  "author": "tellison", 
  "date": "2006-11-15T22:11:04.451679Z", 
  "msg": [
   "Add readme with explanation of bis export file."
  ], 
  "revision_id": "475458"
 }, 
 {
  "author": "jmcconnell", 
  "date": "2006-11-15T22:08:22.429012Z", 
  "msg": [
   "working through a new strategy of loading up projects that require authentication, since the CreateProjectsFromMetadata class is where we deal with authentication and the mungedUrl https format I figured this is also the place to pull information from the settings.xml file should it exist and attempt to use that as well.  This moves around something that I patched in last week from john didion that didn't sit well with me after looking at it a day or two, so I removed that and have it worked out this way now.  I also added in the MavenTwoContinuumProjectBuilder that if we get a scm username/password from the calling code (create action here) then we will persist that into the database for each project.  I'll add that to the MavenOne builder once I have all this sorted out, but I think the builders and executors could stand a bit of flow refactoring, but there is a jira ticket for that, to move them together under the same package space."
  ], 
  "revision_id": "475457"
 }, 
 {
  "author": "minchau", 
  "date": "2006-11-15T22:07:08.313019Z", 
  "msg": [
   "I have reviewed Michael G.'s patch in XALANJ-2323 and I approve it.", 
   "This fixes some DOM Level 3 serialization bugs."
  ], 
  "revision_id": "475456"
 }
]