[
 {
  "author": "craigmcc", 
  "date": "2000-06-14T19:28:57.000000Z", 
  "msg": [
   "Make BeanUtils.populate() work correctly with the \"on\" string that is sent", 
   "when you have a checked checkbox with no value clause.", 
   "Make the errors tag work with a Single string argument as well as a string", 
   "array."
  ], 
  "revision_id": "47679"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-13T22:45:44.000000Z", 
  "msg": [
   "Add two new tags, inspired by a contribution from Arun M. Thomas:", 
   "- ifAttributeExists -- Conditionally evaluate the tag body if the", 
   "specified attribute exists in the specified scope.", 
   "- ifAttributeMissing -- Conditionally evaluate the tag body if the", 
   "specified attribute does not exist in the specified scope.", 
   "The latter tag, in particular, can be used in JSP pages to check for a", 
   "valid user login (assuming this is signified by the existence of a", 
   "particular session-scope attribute), with forwarding to the login page", 
   "if it is not present, like this:", 
   "<struts:ifAttributeMissing name=\"userObject\">", 
   "<jsp:forward page=\"login.jsp\"/>", 
   "</struts:ifAttributeMissing>", 
   "Arun, I embellished and simplified your original code a little bit, by", 
   "making two tags instead of one (so we don't have to explain to page", 
   "developers how the \"not\" attribute was going to work) and named the", 
   "attribute \"name\" instead of \"id\" for consistency with other JSP tags", 
   "(and the likely changes we're going to make to the field tags that", 
   "should really use \"property\" instead of \"name\").", 
   "Submitted by: Arun M. Thomas <arun@ipin.com>"
  ], 
  "revision_id": "47678"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-13T02:40:29.000000Z", 
  "msg": [
   "Use the static factory method to retrieve MessageResources objects."
  ], 
  "revision_id": "47677"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-13T02:32:01.000000Z", 
  "msg": [
   "Fix a typo, and clarify what is needed if you only want to use the", 
   "custom tag library portion of Struts, instead of the entire framework."
  ], 
  "revision_id": "47676"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-13T02:05:18.000000Z", 
  "msg": [
   "Add the following new custom tags to the struts library:", 
   "ifParameterNull - Conditionally evaluate the body of this tag", 
   "if the specified request parameter is not present in this", 
   "request, or it is present with a zero length (as would be", 
   "returned by an input field the user forgot to fill in).", 
   "ifParameterNotNull - Conditionally evaluate the body of this tag", 
   "if the specified request parameter is present in this request,", 
   "and the value has a length greater than zero.", 
   "redirect - Issue a response.sendRedirect() to the specified URL,", 
   "after automatically encoding it so that sessions still work", 
   "in the absence of cookies (as the link tag does).  In addition,", 
   "skips evaluating the rest of the current page so that the user", 
   "does not have to remember to include a \"return\" statement to", 
   "avoid problems."
  ], 
  "revision_id": "47675"
 }
]