[
 {
  "author": "craigmcc", 
  "date": "2000-06-15T19:39:01.000000Z", 
  "msg": [
   "Refactor the ActionServlet code so that subclasses can override individual", 
   "functional methods more gracefully.", 
   "This code does not yet reflect a change in the return value from", 
   "Action.perform() methods.  That will be next."
  ], 
  "revision_id": "47684"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-15T18:15:19.000000Z", 
  "msg": [
   "Add the optional \"target\" attribute to <struts:form> and <struts:link>", 
   "for use in framed or multi-window presentations."
  ], 
  "revision_id": "47683"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-15T18:00:13.000000Z", 
  "msg": [
   "Modify the behavior of the <struts:errors> tag.  Now, the string array", 
   "it accesses is expected to contain the message keys for the error messages", 
   "you wish to display, instead of the text of the messages themselves.  This", 
   "allows validation methods to generate errors without requiring access to", 
   "the user's Locale, or to the application's MessageResources object."
  ], 
  "revision_id": "47682"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-15T03:18:53.000000Z", 
  "msg": [
   "Update the tag library descriptor, and associated documentation,", 
   "to reflect all the JavaScript event handler and stylesheet attributes", 
   "that were enabled by switching to BaseHandlerTag.", 
   "None of the new stuff has really been tested yet, but at least it does not", 
   "break the example application.", 
   "Fix a typo in the rendered HTML for the \"styleClass\" attribute -- it", 
   "should be \"class\", not \"styleClass\"."
  ], 
  "revision_id": "47681"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-15T01:27:36.000000Z", 
  "msg": [
   "Add the new <struts:button> custom tag, and the corresponding base class,", 
   "contributed by Don Clasen.  In addition, refactor most of the other input", 
   "tags to inherit from BaseHandlerClass so that they can be event-enabled", 
   "as well.", 
   "I have not yet modified the TLD (or the documentation) to reflect the new", 
   "attributes.  That is the next step."
  ], 
  "revision_id": "47680"
 }
]