[
 {
  "author": "craigmcc", 
  "date": "2000-06-18T22:21:39.000000Z", 
  "msg": [
   "Clarify the contents of the \"Struts Documentation Application\" that was", 
   "already included in the README file, but did not specifically identify", 
   "what could be found there."
  ], 
  "revision_id": "47689"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-16T22:18:16.000000Z", 
  "msg": [
   "Repair the <struts:textarea> and <struts:select> tags so that they work", 
   "again.  Textarea was throwing and exception, and select was not rendering", 
   "the internal <struts:option> entries."
  ], 
  "revision_id": "47688"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-16T07:12:19.000000Z", 
  "msg": [
   "Add the ActionForward class, which represents a path to which control", 
   "should be forwarded, or redirected, by the controller servlet.", 
   "Modfiy Action.perform() to return an ActionForward() entry, typically", 
   "configured for this <action> in the XML configuration file.", 
   "Modify ActionServlet to respect the value returned by the perform()", 
   "method of the called Action class.", 
   "Modify the example application to use the new technique for registering", 
   "any number of logically named <forward> entries, for use in determining", 
   "the next stage of the user interface dynamically."
  ], 
  "revision_id": "47687"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-16T04:41:12.000000Z", 
  "msg": [
   "Improve the consistency of custom tag attributes.  Now, attribute \"name\"", 
   "always refers to a bean stored in some scope, and \"property\" refers to", 
   "a property of such a bean (as well as the corresponding input field).", 
   "This change affects the following tags:  button, checkbox, hidden,", 
   "password, property, radio, select, submit, text, and textarea.", 
   "Adjust the example application's JSP pages to reflect these changes."
  ], 
  "revision_id": "47686"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-16T01:32:26.000000Z", 
  "msg": [
   "Add the ValidatingActionForm support contributed by Jeff Hutchison.  This", 
   "also necessitated some changes in the logic of the example application", 
   "(which was using query string parameters to identify which maintenance", 
   "action to perform).", 
   "Added two new custom tags:", 
   "<struts:ifPropertyEquals name=\"beanName\" property=\"propertyName\"", 
   "scope=\"scopeValue\" value=\"valueToCompare\" />", 
   "<struts:ifPropertyNotEquals name=\"beanName\" property=\"propertyName\"", 
   "scope=\"scopeValue\" value=\"valueToCompare\" />", 
   "for conditional generation depending on the value of an arbitrary property", 
   "of an arbitrary attribute.  These tags illustrate the clash we have over", 
   "the attribute name \"name\", which should (for consistency) refer to attributes,", 
   "not properties.  Those changes will occur later."
  ], 
  "revision_id": "47685"
 }
]