[
 {
  "author": "craigmcc", 
  "date": "2000-06-21T21:57:03.000000Z", 
  "msg": [
   "Remove the \"package\" and \"upload\" targets.  That stuff is now handled by the", 
   "external shell script that builds and uploads the nightly distributions."
  ], 
  "revision_id": "47694"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-21T19:58:27.000000Z", 
  "msg": [
   "(1) Add the ability to dynamically override the Java class used to", 
   "implement an ActionMapping or ActionForward when processing a particular", 
   "<action> or <forward> element.  This is accomplished by adding a", 
   "\"className\" attribute that is the fully qualified class name of the class", 
   "to use for this particular entry (instead of the default, which is used if", 
   "you don't specify a className attribute).  Use it like this:", 
   "<action className=\"MySpecialActionMapping\" .../>", 
   "(2) Improve the debugging messages logged when problems are encountered", 
   "loading resource bundles, so that we can see the actual stack traces.", 
   "Also, a check for the existence of these resources has been added to the", 
   "top of the \"index.jsp\" page so you will get an immediate notification that", 
   "there is some sort of problem.", 
   "(3) Separate the debugging detail level used for the Digester from the", 
   "debugging detail level used for the controller servlet itself.  Depending", 
   "on what problem you're trying to solve, you might want to turn up the", 
   "detail on one or the other, but not both.", 
   "(4) Slightly improve the documentation at the top of the Javadocs for the", 
   "Digester class.  It really needs a complete user's guide of its own, but", 
   "this is better than nothing."
  ], 
  "revision_id": "47693"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-20T20:06:08.000000Z", 
  "msg": [
   "Add the new <struts:cancel> tag and use it in the example application.", 
   "If the cancel button is pressed, any automatic form validation (from", 
   "using a ValidatingActionForm form bean) will be skipped.  An action can", 
   "tell if the request was cancelled by calling isCancelled(request) from", 
   "the ActionBase subclass.  In any other environment, you perform this", 
   "test by calling:", 
   "import org.apache.struts.taglib.Constants;", 
   "...", 
   "if (request.getParameter(Constants.CANCEL_PROPERTY) != null) {", 
   "... the action was cancelled ...", 
   "}", 
   "Submitted by: jhut@inst.stryker.com (with a couple of tweaks)"
  ], 
  "revision_id": "47692"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-20T16:34:14.000000Z", 
  "msg": [
   "Implement global and local forwarding lookups, including accepting global", 
   "forwarding definitions in the action.xml file.", 
   "Add David Geary's suggested ErrorMessages class with a couple of tweaks,", 
   "and utilize it in the example application.", 
   "Bring the user's guide documentation up to date with respect to action", 
   "forwarding and validating action forms.", 
   "NOT YET DONE:  The new \"cancel\" tag and associated functionality."
  ], 
  "revision_id": "47691"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-19T16:32:18.000000Z", 
  "msg": [
   "Allow the \"href\" attribute of <struts:link> and the \"action\" attribute", 
   "of <struts:form> to take runtime expression values so that they can be", 
   "calculated dynamically."
  ], 
  "revision_id": "47690"
 }
]