[
 {
  "author": "craigmcc", 
  "date": "2000-06-29T18:13:37.000000Z", 
  "msg": [
   "Implement the \"locale\" attribute on the <struts:message> tag in accordance with", 
   "the documentation.  This attribute lets you specify the session key under which", 
   "the user's locale is stored.  If you don't specify this, the default value is", 
   "the value of the Action.LOCALE_KEY constant string.", 
   "Submitted by: Wong Kok Wai <wongkw@pacific.net.sg>"
  ], 
  "revision_id": "47709"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-27T02:48:07.000000Z", 
  "msg": [
   "Remove all the cases I can remember where two setters (one for int and one", 
   "for String) are provided, per the clarification to the JSP 1.1 specs.", 
   "Why did I delete the \"int\" versions of the setters?  Good question -- the", 
   "answer is that keeping the \"int\" setters and deleting the \"String\" setters", 
   "does not work on Tomcat -- an issue I'm going to address separately,", 
   "because they should.", 
   "In the mean time, this fix should solve issues on Orion where the server", 
   "complained about \"size\" being a read-only property.  Could those who have", 
   "experienced this error please download the new version and confirm that it", 
   "has been fixed?"
  ], 
  "revision_id": "47708"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-27T01:58:34.000000Z", 
  "msg": [
   "Extend the <struts:link> tag by allowing you to optionally specify a bean", 
   "that implements Map (or a property of a bean that implements Map) with the", 
   "new \"name\" and \"property\" attributes.  If specified, this Map is", 
   "interpreted as a set of request parameters that should be added to the", 
   "hyperlink rendered by the tag, as suggested by Richard Backhouse", 
   "<richardbackhouse@hotmail.com>.", 
   "For JDK 1.1 users, the <struts:link1> tag is essentially equivalent, but", 
   "wants a Dictionary (which includes Hashtables) instead of a Map."
  ], 
  "revision_id": "47707"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-26T16:45:00.000000Z", 
  "msg": [
   "Actually implement the \"style\" and \"styleClass\" attributes on the", 
   "<struts:form> tag.", 
   "Explicitly specify \"index.jsp\" as a welcome file in the example", 
   "application, rather than relying on the container to support this", 
   "as a default value.", 
   "Submitted by:\tWong Kok Wai <wongkw@pacific.net.sg>"
  ], 
  "revision_id": "47706"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-25T01:48:46.000000Z", 
  "msg": [
   "Make the configuration properties \"forwardClass\" and \"mappingClass\"", 
   "visible through public getter methods."
  ], 
  "revision_id": "47705"
 }
]