[
 {
  "author": "craigmcc", 
  "date": "2000-06-25T01:36:21.000000Z", 
  "msg": [
   "Add a new <struts:options> tag that lets you generate any number of", 
   "<option> tags, when nested inside a <struts:select> element, from a", 
   "collection that is either stored as a bean or the property of a bean.", 
   "In addition, you can optionally specify a parallel collection of labels", 
   "for the user interface (typically internationalized).", 
   "Based on the OptionsTag (and related changes) contributed by", 
   "Florent Carpentier <fcarpent@rocketmail.com>."
  ], 
  "revision_id": "47704"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-24T23:28:40.000000Z", 
  "msg": [
   "Add \"offset\" and \"length\" optional attributes to the <struts:iterate>", 
   "and <struts:enumerate> tags.  Now, you can specify that you only want", 
   "to evaluate the body of these tags over a certain subset of the named", 
   "collection, rather than all of it.  This should be useful in constructing", 
   "multi-page reports over a given collection (the \"first 10 search results\"", 
   "type of situation).", 
   "Update the TODO file to remove stuff that has been done."
  ], 
  "revision_id": "47703"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-24T23:26:22.000000Z", 
  "msg": [
   "Create two subclasses of ActionForward with different default values for", 
   "the \"redirect\" property.  Now you can essentially change the global default", 
   "for whether to use RequestDispatcher.forward() or response.sendRedirect()", 
   "by changing which class you define as the value of the \"forward\"", 
   "initialization parameter to the controller servlet.", 
   "Any of the ActionForward implementations let you specifically set the value", 
   "of the \"redirect\" property if you want to ensure that certain cases are", 
   "always handled the same way.", 
   "The default if you do nothing is that ActionForward objects have their", 
   "\"redirect\" property set to false, so that RequestDispatcher.forward()", 
   "will be used."
  ], 
  "revision_id": "47702"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-24T19:09:39.000000Z", 
  "msg": [
   "Add a <struts:iterate> tag that is a superset of <struts:enumerate> that", 
   "supports collections of type Collection (including List, Set, and Vector),", 
   "Map (including Hashtable), or an array of objects.", 
   "This tag requires a Java2 (JDK 1.2 or later) platform to execute."
  ], 
  "revision_id": "47701"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-24T03:16:14.000000Z", 
  "msg": [
   "Add the 'accessKey' and 'tabIndex' optional attributes to the relevant", 
   "input field tags (button, cancel, checkbox, password, radio, reset,", 
   "select, submit, text, and textarea).  These allow generation of the HTML", 
   "attributes \"accesskey\" (set the character used to move focus immediately", 
   "to this field) and \"tabindex\" (set the tabbing order using positive", 
   "integers).", 
   "Clean up some of the instructions in the README file.", 
   "Make the \"build.bat\" file have DOS line endings so that it will actually", 
   "execute on Windows."
  ], 
  "revision_id": "47700"
 }
]