[
 {
  "author": "craigmcc", 
  "date": "2000-06-30T01:19:32.000000Z", 
  "msg": [
   "Link the ActionForwards lookups of a mapping to the corresponding global", 
   "ActionForwards collection.  Now, an Action can simply call", 
   "mapping.findForward(\"abc\") and not care whether a particular forwarding", 
   "was registered locally or globally.", 
   "At configuration time (in action.xml), this also lets you set up defaults", 
   "and then selectively override them on a per-mapping basis if you want."
  ], 
  "revision_id": "47714"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-30T00:46:42.000000Z", 
  "msg": [
   "Encapsulate the global \"forwards\" and \"mappings\" collections managed by", 
   "the controller servlet into collection classes (ActionForwards and", 
   "ActionMappings), and publish these collections as servlet context", 
   "attributes so that custom tags may access them.", 
   "Create a new <struts:forward name=\"xxx\"/> tag that will look up the", 
   "specified logical name in the global forwards collection published above,", 
   "and perform a forward or redirect to the corresponding actual path.  The", 
   "remainder of the current page will be skipped.", 
   "Create a new <struts:include name=\"xxx\"/> tag that will look up the", 
   "specified logical name in the global forwards collection published above,", 
   "and perform an include of the contents of the corresponding actual path at", 
   "this point in the output of the current page.  Unfortunately, this makes", 
   "the class name ActionForward something of a misnomer :-(, but it is useful", 
   "in decoupling logical and physical page names even within the View", 
   "components.", 
   "Fix an implementation bug in the <struts:redirect> tag that erroneously", 
   "returned SKIP_PAGE from the doStartTag() method."
  ], 
  "revision_id": "47713"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-29T22:25:11.000000Z", 
  "msg": [
   "Incorporate the \"mixed pickles\" suggested changes, as follows:", 
   "* Fix the cut-n-paste error on the redirect tag in tags.html.", 
   "* Modify the ErrorMessages object to support retrieving individual", 
   "message keys by index.", 
   "* Modify the MessageResources object to include a \"returnNull\" boolean", 
   "property.  If set to true (the default), the current behavior of", 
   "returning null for unknown message keys occurs.  If set to \"false\",", 
   "returns an encoded string \"???\" + key + \"???\" to help you debug your", 
   "missing message keys.", 
   "* Add a new ActionServlet initialization parameter \"null\" to set the", 
   "returnNull property of the application resources.  Default=true.", 
   "* Add an <app:checkLogon/> check to the main menu page as well."
  ], 
  "revision_id": "47712"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-29T21:54:03.000000Z", 
  "msg": [
   "Perform URL encoding on request parameters that are included in the \"href\"", 
   "attribute of a hyperlink.", 
   "Submitted by: Markus Blaurock <blaurock@dig.de>"
  ], 
  "revision_id": "47711"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-06-29T21:36:13.000000Z", 
  "msg": [
   "Fix the totally brain-dead CheckLogonTag implementation in the example", 
   "application (as outlined by Marius Barduta), and use these tags on all the", 
   "appropriate pages.", 
   "Testing this fix uncovered a bug in the message and errors tags, where", 
   "they would fail after the user logged off (and the current session was", 
   "invalidated).", 
   "Submitted by: Marius Barduta <marius@gamma.necomm.ro>"
  ], 
  "revision_id": "47710"
 }
]