[
 {
  "author": "craigmcc", 
  "date": "2000-07-16T00:49:22.000000Z", 
  "msg": [
   "Add a new way to set optional properties on <action> and <forward>", 
   "elements that is more tool friendly (i.e. you can have extended", 
   "ActionForward and ActionMapping implementation classes with additional", 
   "properties but still use a to-be-created DTD for the action.xml file).", 
   "The new technique lets you add as many <property> entries as you want,", 
   "nested inside an <action> element.  The previous mechanism of just adding", 
   "more attributes on the <action> element itself will continue to work for", 
   "those who prefer that approach -- but you will need to modify the", 
   "action.dtd DTD (when it is added later) for each new attribute."
  ], 
  "revision_id": "47724"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-15T23:20:55.000000Z", 
  "msg": [
   "Improve the functionality and perfomance of BeanUtils.populate(), which is", 
   "used to populate the properties of a form bean as well as when processing", 
   "the XML configuration files, in the following ways:", 
   "* Now uses the JavaBeans introspector to identify property setter", 
   "methods, even if they have been customized by a BeanInfo class.", 
   "* Now supports property types that are arrays as well as scalars.", 
   "Indexed property setters are not yet supported, but array-based", 
   "ones are.", 
   "* The first time a particular bean class is introspected, the list of", 
   "property descriptors is cached to save time on subsequent calls to", 
   "the populate() method.", 
   "The array setters have been lightly tested.  Additional testing would be", 
   "most appreciated."
  ], 
  "revision_id": "47723"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-09T05:20:50.000000Z", 
  "msg": [
   "Add an INSTALL document to the top-level directory of the Struts", 
   "distribution that describes special steps required to install and use", 
   "Struts on several servlet containers (currently, only Tomcat standalone,", 
   "Tomcat+Apache, and Orion are documented).", 
   "I am interested in adding any special steps needed to make Struts work in", 
   "other servlet containers as well -- please post them to STRUTS-DEV or", 
   "STRUTS-USER."
  ], 
  "revision_id": "47722"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-09T03:36:49.000000Z", 
  "msg": [
   "Add the ability to specify the collection to be enumerated or iterated", 
   "over directly from a scripting variable, like this:", 
   "<struts:iterate id=\"item\" collection=\"<%= myVector %>\">", 
   "or", 
   "<struts:enumerate id=\"item\" collection=\"<%= myVector %>\">", 
   "Submitted by:\tDavid Geary <sabreware@tri-lakesonline.net>"
  ], 
  "revision_id": "47721"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-09T03:00:20.000000Z", 
  "msg": [
   "Tweak the user's guide to reflect recent changes."
  ], 
  "revision_id": "47720"
 }
]