[
 {
  "author": "edgarpoce", 
  "date": "2006-11-20T23:07:30.850561Z", 
  "msg": [
   "adding missing license headers to jcr-browser"
  ], 
  "revision_id": "477390"
 }, 
 {
  "author": "jkuhnert", 
  "date": "2006-11-20T23:06:08.115324Z", 
  "msg": [
   "Fixes TAPESTRY-245. Any component now checks if it has any body content at all and appropriately", 
   "invokes writer.beginEmpty() if it doesn't."
  ], 
  "revision_id": "477389"
 }, 
 {
  "author": "snoopdave", 
  "date": "2006-11-20T23:04:46.849440Z", 
  "msg": [
   "Fixing Atom validation errors wand warnings"
  ], 
  "revision_id": "477388"
 }, 
 {
  "author": "agilliland", 
  "date": "2006-11-20T23:03:48.254781Z", 
  "msg": [
   "Adding new path column to folder and weblogcategory tables and updating domain model and managers accordingly.", 
   "I. Added a path column to folder and weblogcategory tables to track full path for each node within the hierarchy.", 
   "II. Updated FolderData and WeblogCategoryData pojos to use path as a simple attribute.", 
   "A. this mainly meant adding in a Hibernate mapping for the path attribute and updating the usage of constructors to ensure a path value is set when the object is created.", 
   "III. Updated impls of manager methods do operations against folder or category paths.", 
   "A. updated the way that folders and categories are looked up by path.", 
   "B. the big win here is when doing a lookup of associated classes against a whole branch of the folder or category hierarchy.  the happens in the getWeblogEntries(cat, subcats) and getBookmarks(folder, subfolders) methods.  we can now very efficiently get all bookmarks or weblogEntries which are associated with a given branch of the folder or category tree.", 
   "IV. Make a couple tweaks to unit test classes and a couple struts actions to accomodate for these changes."
  ], 
  "revision_id": "477387"
 }, 
 {
  "author": "ersiner", 
  "date": "2006-11-20T22:59:14.282151Z", 
  "msg": [
   "Detailed debug message."
  ], 
  "revision_id": "477386"
 }
]