[
 {
  "author": "craigmcc", 
  "date": "2000-07-17T21:19:07.000000Z", 
  "msg": [
   "Add client-side support for doing file uploads to Struts.  This involved", 
   "adding an \"enctype\" attribute to the <struts:form> tag (so that you can", 
   "set it to \"multipart/form-data\", and a new <struts:file> tag for the file", 
   "selector itself.", 
   "NOTE:  The Struts controller servlet currently has no concept of how to", 
   "deal with multipart/form-data uploads, so you will need to ensure that the", 
   "\"action\" URL of your form goes to a servlet that does know what to do", 
   "with it.", 
   "Submitted by:\tSuggested by Michael Roberts <michael.roberts@softcom.com>", 
   "-- and possibly others, to whom I apologize if I don't include you!"
  ], 
  "revision_id": "47734"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-17T16:54:11.000000Z", 
  "msg": [
   "Enhance the <struts:select> tag to support two new attributes:", 
   "* The \"multiple\" attribute causes the rendered <select> element to include", 
   "the \"multiple\" modifier.  (See below for important information on this.)", 
   "* The \"size\" attribute lets you define how many available options are", 
   "displayed.  If not specified, the browser default (typically 1) is used.", 
   "NOTE:  JSP custom tags must conform to the syntax requirements of XML, which", 
   "does not allow the HTML technique of \"attribute minimization\" (specifying an", 
   "attribute name with no value).  Thus, you must specify a value for the", 
   "\"multiple\" attribute, even though it is not used, like this:", 
   "<struts:select name=\"serverType\" multiple=\"multiple\" size=\"3\" ...>", 
   "... available options as before ...", 
   "</struts:select>", 
   "This enhancement is based on a suggestion by Jen Hsien Huang", 
   "<u5321007@ncnu.edu.tw>, but is implemented slightly differently than what", 
   "was proposed (I made the two attributes independent of each other)."
  ], 
  "revision_id": "47733"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-17T16:37:52.000000Z", 
  "msg": [
   "Properly implement the public release() method on all tags, to reset", 
   "property values back to their defaults.  If you do not do this, you can", 
   "run into problems when the JSP page compiler tries to recycle tag", 
   "instances.", 
   "Among other things, this fixes the problem reported by Jen Hsien Huang, in", 
   "a message entitled \"Bug of BaseFieldTag.java\"."
  ], 
  "revision_id": "47732"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-17T15:16:22.000000Z", 
  "msg": [
   "Correct bug in the new <struts:multibox> tag, where it was not actually", 
   "including the value in the rendered HTML tag.", 
   "Submitted by:\tJen Hsien Huang <u5321007@ncnu.edu.tw>"
  ], 
  "revision_id": "47731"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-07-17T03:05:23.000000Z", 
  "msg": [
   "Enhance the <struts:link> and <struts:link1> tags to have the option to", 
   "specify a link to the page URI included in a global <forward> declaration,", 
   "by using the \"forward\" attribute instead of the \"href\" attribute.  You", 
   "must specify exactly one of these to to define the destination of the", 
   "hyperlink.", 
   "The existing optional support for adding query parameters (based on", 
   "the \"name\" and \"property\" attributes) works for both kinds of hyperlinks.", 
   "Submitted by:\tFrank Nestel (although he suggested a separate tag,", 
   "it made more sense to enhance the existing tag functionality."
  ], 
  "revision_id": "47730"
 }
]