[
 {
  "author": "craigmcc", 
  "date": "2000-09-23T19:17:10.000000Z", 
  "msg": [
   "Add support for optionally calculating a Locale for the current user (based", 
   "on the HTTP request headers) and storing it in the user's session if no Locale", 
   "has been stored there by the application.", 
   "To enable this functionality on every request, set the servlet initialization", 
   "parameter \"locale\" to \"true\"."
  ], 
  "revision_id": "47794"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-23T18:26:48.000000Z", 
  "msg": [
   "Pass the current request as a parameter to the processMapping() method, so", 
   "that subclasses can make access control (or other) decisions based on request", 
   "parameters or other properties (such as user identity)."
  ], 
  "revision_id": "47793"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-21T03:39:34.000000Z", 
  "msg": [
   "Fix the following bugs:", 
   "* PropertyUtils.getPropertyType() incorrectly returned null for an indexed", 
   "property if there was also a non-indexed accessor method.", 
   "* PropertyUtils.setIndexedProperty() was missing a return statement if an", 
   "indexed setter was found.", 
   "Submitted by: Ate Douma <ate@iwise1.demon.nl>"
  ], 
  "revision_id": "47792"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-20T04:21:48.000000Z", 
  "msg": [
   "Update the build scripts to include all official DTDs in the documentation", 
   "application (so that they will be included on the web site), and update", 
   "the \"deploy\" targets for Tomcat 3.x and Tomcat 4.0 (i.e. Catalina)."
  ], 
  "revision_id": "47791"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-20T04:20:22.000000Z", 
  "msg": [
   "Modify ActionServlet to support the new configuration file format.  The", 
   "old format is still supported, but this will be phased out by 1.0 release.", 
   "Convert ActionMapping from an interface to a base class, and deprecate", 
   "ActionMappingBase.  This will not cause backwards compatibility problems", 
   "unless applications were implementing ActionMapping themselves.", 
   "Deprecate the ActionMapping methods that were used only in the old", 
   "configuration file format, in favor of the properties for the new format.", 
   "Support registration of form bean information by logical name, so that", 
   "particular form beans can be more easily shared between actions."
  ], 
  "revision_id": "47790"
 }
]