[
 {
  "author": "craigmcc", 
  "date": "2000-09-25T17:55:16.000000Z", 
  "msg": [
   "Update the docs to reflect changes to date since version 0.5."
  ], 
  "revision_id": "47799"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-24T03:59:49.000000Z", 
  "msg": [
   "Correctly compare the two passwords, instead of comparing the first password", 
   "to itself.", 
   "Submitted by:  Joe Peer <joepeer@wap-force.net>"
  ], 
  "revision_id": "47798"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-23T23:19:36.000000Z", 
  "msg": [
   "Back out the change of syntax for nested and indexed properties that", 
   "mistakenly got checked in.", 
   "The delimiters remain \".\" for nesting and \"[]\" for indexing, since there", 
   "are workarounds to the potential problems caused by the fact that these", 
   "delimiters are significant in JavaScript."
  ], 
  "revision_id": "47797"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-23T22:53:53.000000Z", 
  "msg": [
   "Adapt the example application to the recent changes in Action.  Basically,", 
   "three changes are involved for a user Action that extended ActionBase:", 
   "* Change the base class from ActionBase to Action.", 
   "* Remove the \"servlet\" parameter from the perform() method.", 
   "* If you are using ActionBase.getResource() -- which has become", 
   "Action.getResource() -- the servlet argument is no longer required."
  ], 
  "revision_id": "47796"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-09-23T22:51:47.000000Z", 
  "msg": [
   "Make Action into a base class, rather than an interface, to minimize the", 
   "pain of future enhancements to its functionality.  Add a variant of the", 
   "perform() method that takes ServletRequest and ServletResponse arguments.", 
   "Deprecate ActionBase -- 1.0-based applications should extend Action", 
   "instead.", 
   "Move responsibility for creating Action instances from the ActionMapping", 
   "implementation to the controller servlet itself.", 
   "Provide \"lifecycle\" support to Action instances (in preparation for", 
   "supporting the ability to \"reload\" an application's configuration files),", 
   "via the setServlet() method.  This is called with a non-null argument", 
   "identifying the owning ActionServlet instance when the Action is first", 
   "created, and called with a null argument before shutdown, allowing any", 
   "necessary resource cleanup to take place.", 
   "Remove \"servlet\" from the set of parameters for perform(), since it is now", 
   "set via the lifecycle functionality above."
  ], 
  "revision_id": "47795"
 }
]