[
 {
  "author": "dreid", 
  "date": "2006-11-22T00:34:08.212417Z", 
  "msg": [
   "First pass at updating how we build the projects site.", 
   "We still generate XDOCS documents that we then process into html, but", 
   "instead of pre-processing the files we just use them in situ. We therefore", 
   "simplify the processing dramatically. However, this comes at a slight cost", 
   "in that we now use exslt features to produce a lot of output from a", 
   "single template.", 
   "Indexes are still generated using an XML configuration file, but now with", 
   "a very much simplified stylesheet and fewer extra pieces. The end effect is", 
   "very similar but I think that most people who know xslt will now be able to", 
   "follow what's going on and therefore these files should be maintainable.", 
   "I've not removed the old files yet, but as soon as this is generating output", 
   "on the live server I will do.", 
   "Huge thanks go out to Jeremias Maerki for his help in getting this all", 
   "working."
  ], 
  "revision_id": "477990"
 }, 
 {
  "author": "crogers", 
  "date": "2006-11-22T00:26:35.393356Z", 
  "msg": [
   "This is a contribution from Andrew McCulloch for BEEHIVE-1160 to make sure the ClientInitalizer is generated without duplicate method declarations when multiple interfaces are extended on an event set. Thanks Andrew!", 
   "Tests: controls DRT/BVT, controlsWeb BVT (WinXP passed)"
  ], 
  "revision_id": "477989"
 }, 
 {
  "author": "bayard", 
  "date": "2006-11-22T00:21:08.086418Z", 
  "msg": [
   "Stretched the maven-1 build fail/succeed block to cover more so it doesn't try to do things with tar.gz/zips that don't exist"
  ], 
  "revision_id": "477988"
 }, 
 {
  "author": "nbubna", 
  "date": "2006-11-22T00:17:53.824781Z", 
  "msg": [
   "add notes on recent changes"
  ], 
  "revision_id": "477987"
 }, 
 {
  "author": "rgardler", 
  "date": "2006-11-22T00:12:41.258409Z", 
  "msg": [
   "Use version number of commons-logging rather than latest-release - it works!", 
   "(thanks to ken flaxman)"
  ], 
  "revision_id": "477986"
 }
]