[
 {
  "author": "craigmcc", 
  "date": "2000-10-16T16:50:04.000000Z", 
  "msg": [
   "Clean up the cleaning up of obsolete form beans, now that they are stored", 
   "in the request rather than the session.  As with bean creation, the action", 
   "logic is independent of the choice that the designer ultimately makes.", 
   "Submitted by: Ralph Schaer <schaer@ess.ch>"
  ], 
  "revision_id": "47834"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-16T05:02:39.000000Z", 
  "msg": [
   "Make the Struts example application use \"request\" scope for form beans,", 
   "which should become the normal practice for single-page forms.  Note that", 
   "the actions themselves will work either way - they ask the corresponding", 
   "mapping which scope to use if they are required to create the form beans."
  ], 
  "revision_id": "47833"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-16T03:39:28.000000Z", 
  "msg": [
   "Add a preprocessing hook that lets a custom subclass of ActionServlet get", 
   "control before any of the standard processing is performed.  The preprocess", 
   "method can examine and/or modify the request and response parameters, and", 
   "then return true to let the normal processing continue, or false if it has", 
   "generated the response and the rest of the normal processing should be", 
   "skipped.", 
   "Submitted by:  Chris Audley <CAudley@urbanfetch.com>"
  ], 
  "revision_id": "47832"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-15T03:35:58.000000Z", 
  "msg": [
   "Updated web components to match the changes in the example application."
  ], 
  "revision_id": "47831"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-10-15T03:34:55.000000Z", 
  "msg": [
   "Bring the Struts example application up-to-date with respect to recent", 
   "changes in the org.apache.struts.action and org.apache.struts.util", 
   "packages:", 
   "- Use reset() methods on each form bean to reset properties to default", 
   "values.", 
   "- Eliminate special-case handling for changing strings from null to \"\",", 
   "since it is unnecesasry.", 
   "- Use PropertyUtils.copyProperties() to populate form beans (in the", 
   "/editRegistration and /editSubscription actions) and to update the", 
   "underlying data beans (in the /saveRegistration and /saveSubscription", 
   "actions).", 
   "- Added an \"autoConnect\" property to the Subscription object, which can", 
   "be used to demonstrate that checkboxes now work correctly.", 
   "In addition, the following bugs were fixed:", 
   "- Correct the XML generation when DatabaseServlet so that it would not", 
   "generate the literal string \"null\" for a null String property value."
  ], 
  "revision_id": "47830"
 }
]