[
 {
  "author": "mschachter", 
  "date": "2000-11-10T02:55:45.000000Z", 
  "msg": [
   "- If there is no temporary directory specified in web.xml as an", 
   "init-param, the DiskMultipartRequestHandler first checks the servlet context value of", 
   "javax.servlet.context.tmpdir for a directory value from the servlet", 
   "container.  If that value is not specified, then it checks for the system", 
   "property java.io.tmpdir."
  ], 
  "revision_id": "47864"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-11-09T23:34:16.000000Z", 
  "msg": [
   "- removed duplicate \"name\" attribute in RadioTag"
  ], 
  "revision_id": "47863"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-11-09T23:31:08.000000Z", 
  "msg": [
   "- added missing name, value, and property attributes, my apologies for overlooking them in the", 
   "first place"
  ], 
  "revision_id": "47862"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-11-09T20:44:19.000000Z", 
  "msg": [
   "- added set and get methods for various upload-related parameters in", 
   "ActionServet", 
   "- added initUpload() method for initializing upload-related parameters", 
   "through web.xml, modified init() to call on initUpload()", 
   "- modified processPopulate() to set the servlet of the form instance, and", 
   "to pass some temporary contextual arguments to", 
   "BeanUtils.populate() through the current request", 
   "- modified BeanUtils.populate(bean,prefix,suffix,request) to check the", 
   "content type of the request for multipart content, and parse", 
   "accordingly.  for non-multipart requests, there are no changes to the", 
   "method", 
   "- modified BeanUtils.populate(bean,properties) to insure that there is no", 
   "attempted conversion of objects of type FormFile when populating bean", 
   "properties", 
   "Multipart Requests should now be functional within struts, an example app", 
   "demonstrating how to utilize this feature will be out soon, accompanied", 
   "by documentation."
  ], 
  "revision_id": "47861"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-11-09T20:34:12.000000Z", 
  "msg": [
   "- added methods for getting and setting the MultipartRequestHandler in", 
   "ActionForm, this is necessary for automated rollback of file uploading", 
   "- added methods for getting and setting the MultipartRequestHandler class", 
   "name in ActionMapping, so that you can either specify your multipart", 
   "request handler class in your struts config file per action"
  ], 
  "revision_id": "47860"
 }
]