[
 {
  "author": "craigmcc", 
  "date": "2000-11-28T18:37:44.000000Z", 
  "msg": [
   "Clarify the circumstances under which the \"input\" attribute of an <action>", 
   "element is required."
  ], 
  "revision_id": "47889"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-28T18:35:52.000000Z", 
  "msg": [
   "Rearrange the processing in processValidate() as follows:", 
   "* If there is a form bean, and the request is not cancelled, call the", 
   "form bean's validate() method.  Previously, validate() was only called", 
   "if the mapping included an \"input\" property, which could lead to errors", 
   "if the developer forgot to include the \"input\" definition.", 
   "* If the validate() method returns one or more errors, and there is no", 
   "\"input\" form to return control to, throw an error 500.  The reasoning is", 
   "that the application has been mis-configured (\"input\" attribute missing).", 
   "Submitted by:  Pierre Metras <genepi@sympatico.ca>"
  ], 
  "revision_id": "47888"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-11-28T07:17:17.000000Z", 
  "msg": [
   "- Fixed poor performance of MultipartIterator, and in turn overall", 
   "performance of file uploading", 
   "- Fixed goofy bug in getFileElements and getTextElements in", 
   "DiskMultipartRequestHandler, as well as allowing for use of the modified", 
   "MlutipartIterator class"
  ], 
  "revision_id": "47887"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-26T05:22:55.000000Z", 
  "msg": [
   "Add a commented-out example of what configuring the new data source", 
   "would look like if the same application used a database."
  ], 
  "revision_id": "47886"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-26T05:11:31.000000Z", 
  "msg": [
   "Initial implementation of a simple JDBC data source for Struts based", 
   "applications.  The data source implements the javax.sql.DataSource", 
   "interface, and may be configured by new extensions to the", 
   "struts-config.xml DTD.  More sophisticated data source implementations may", 
   "also be used, as long as they implement javax.sql.DataSource."
  ], 
  "revision_id": "47885"
 }
]