[
 {
  "author": "craigmcc", 
  "date": "2000-12-08T02:42:31.000000Z", 
  "msg": [
   "Add a new mechanism for specifying labels and values in the <form:options>", 
   "tag.  You can now specify a collection of beans, along with the property", 
   "names to be used to extract a label and value from each bean.  The example", 
   "application has been modified to use this new approach.", 
   "Previous approaches of specifying parallel collections will continue to", 
   "work, because that approach is more appropriate in application", 
   "environments."
  ], 
  "revision_id": "47909"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-08T00:16:43.000000Z", 
  "msg": [
   "Remove setting type to null in release().  This was a bug, because it is not a", 
   "property that was set by the JSP page container -- only by the constructor of", 
   "some appropriate subclass.  The bug would show up in containers that recycle", 
   "tag instances, as allowed by the JSP 1.1 spec.", 
   "Submitted by: David Winterfeldt <dwinterfeldt@yahoo.com>"
  ], 
  "revision_id": "47908"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-07T19:31:01.000000Z", 
  "msg": [
   "Make ActionError and ActionErrors serializable, and remove the \"final\"", 
   "modifier on ActionError so that it can be subclassed if desired."
  ], 
  "revision_id": "47907"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-07T19:10:51.000000Z", 
  "msg": [
   "Add a deprecated version of the validate() method that matches the calling", 
   "sequence used in Struts 0.5.  The returned error message will remind developers", 
   "that they need to migrate to the validate() method that takes an ActionMapping", 
   "and HttpServletRequest as parameters)."
  ], 
  "revision_id": "47906"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-07T01:19:11.000000Z", 
  "msg": [
   "Add a new \"ignore\" attribute to the <bean:write> tag.  If you set this", 
   "attribute to \"true\", attempts to write the content of a bean (specified", 
   "by the \"name\" attribute) that is not found will simply return no output,", 
   "rather than throwing an exception.  This is consistent with what happens", 
   "when <bean:write> is asked to render a bean property whose value is null.", 
   "The default behavior remains to throw an exception in this scenario, which", 
   "is consistent with how missing beans are handled by all the other tags."
  ], 
  "revision_id": "47905"
 }
]