[
 {
  "author": "craigmcc", 
  "date": "2000-12-06T19:24:03.000000Z", 
  "msg": [
   "As an aid to developers migrating from Struts 0.5, provide a deprecated", 
   "version of the perform() method that matches the old signature.  Otherwise,", 
   "if you forget to change an action, its perform() method will not be called,", 
   "and it is difficult to understand why.", 
   "Submitted by:  Pierre Metras <genepi@sympatico.ca>"
  ], 
  "revision_id": "47904"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-06T19:15:58.000000Z", 
  "msg": [
   "Enhance the usefulness of the \"attribute\" attribute on the <actino> element.", 
   "If a previous ActionForm instance is found at the specified attribute in the", 
   "specified scope, but it is not of the appropriate Java class, simply replace", 
   "it with a new instance of the appropriate class (rather than having an", 
   "application action later throw a ClassCastException).  Among other things, this", 
   "allows an application using session scope to maintain ActionForm beans to reuse", 
   "the same session attribute key for many ActionForms, thereby reducing the", 
   "potential for bloat in the session attributes.", 
   "Submitted by: Erwin Brinkhuis <Erwin.Brinkhuis@iWise.nl>"
  ], 
  "revision_id": "47903"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-05T01:11:22.000000Z", 
  "msg": [
   "Correct typos in the TLD.", 
   "Submitted by: David Winterfeldt <dwinterfeldt@yahoo.com>"
  ], 
  "revision_id": "47902"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-01T19:54:42.000000Z", 
  "msg": [
   "Correctly process the \"nocache\" initialization parameter.", 
   "Submitted by:  Jay Walters <jwalters@netnumina.com> and", 
   "Ralph Schaer <schaer@ess.ch>"
  ], 
  "revision_id": "47901"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-11-30T20:13:01.000000Z", 
  "msg": [
   "Make the call to the validate() method of a form bean optional, by adding", 
   "a new \"validate\" attribute on the <action> element.  You would typically", 
   "set this to false on actions that simply set up request and session scope", 
   "beans for a subsequent JSP page, rather than processing input forms.", 
   "The default value of the \"validate\" attribute is \"true\"."
  ], 
  "revision_id": "47900"
 }
]