[
 {
  "author": "craigmcc", 
  "date": "2000-12-16T19:01:44.000000Z", 
  "msg": [
   "Add placeholder for the utility package Developer's Guide information.  I", 
   "am using the Java2 JavaDoc facility of a \"package.html\" page included with", 
   "the source code, which is automatically integrated into the Package", 
   "Summary page of the generated documentation.  That way, people navigating", 
   "the entire web site or people navigating just the Javadocs will have the", 
   "benefit of this information."
  ], 
  "revision_id": "47919"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-16T19:00:05.000000Z", 
  "msg": [
   "Convert all remaining <rtexprvalue> directives to \"true\" so that runtime", 
   "expressions can be utilized everywhere.", 
   "Update the navigation information to include a reference to the", 
   "developer guide for the utility classes (under construction)."
  ], 
  "revision_id": "47918"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-15T03:08:11.000000Z", 
  "msg": [
   "Replace the previous implementation of MessageResources with a set of", 
   "classes offering the following features:", 
   "- The MessageResources instance is now Serializable, to make it work", 
   "in application servers that require this even for application scope", 
   "beans", 
   "- The MessageResources implementation class (and the implementation class", 
   "for the corresponding MessageResourcesFactory) are pluggable at run time", 
   "so that you can provide your own MessageResources implementations.", 
   "- The Struts controller servlet accepts a new \"factory\" initialization", 
   "parameter to set the name of the MessageResourcesFactory class to use.", 
   "- The default implementation reads resource property files from the", 
   "web app class path, just as the previous version did.", 
   "- No changes in existing classes are required if you always want the", 
   "currently registered default implementation class."
  ], 
  "revision_id": "47917"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-12-14T23:49:02.000000Z", 
  "msg": [
   "- Updated MultipartIterator to report malformed request data errors and", 
   "IOExceptions better", 
   "Submitted By: Scott Snyder"
  ], 
  "revision_id": "47916"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-14T09:03:36.000000Z", 
  "msg": [
   "Ignore an UnsupportedOperationException thrown in close() by the JDBD-ODBC", 
   "driver, which does not implement setTypeMap().", 
   "Submitted by:\tHoward Moore <Howard.Moore@Datapulse.com>"
  ], 
  "revision_id": "47915"
 }
]