[
 {
  "author": "craigmcc", 
  "date": "2000-12-27T02:29:25.000000Z", 
  "msg": [
   "Add a new \"locale\" attribute to the <form:html> tag so that you can", 
   "request Struts to store a Locale in the user's session if one does not", 
   "already exist, based on the request headers, equivalent to the", 
   "processLocale() method of the default servlet.", 
   "Remove redundant logic from ActionServlet.processLocale() -- we now count", 
   "on the servlet container to do this correctly for us.  Any compliant 2.2", 
   "container must implement ServletRequest.processLocale().", 
   "Update the example application to use the new attribute, like this:", 
   "<form:html locale=\"true\">", 
   "...", 
   "</form:html>", 
   "Submitted by:\tKare Nuorteva <kare.nuorteva@satama.com>"
  ], 
  "revision_id": "47929"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-27T01:10:55.000000Z", 
  "msg": [
   "Update the TODO list in the Struts Documentation app (and what will be", 
   "mirrored on the web site) to start reflecting work items that are not", 
   "going to make it into Struts 1.0, and will therefore be considered for", 
   "Struts 1.1 at a later date."
  ], 
  "revision_id": "47928"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-27T00:16:03.000000Z", 
  "msg": [
   "Make it possible to configure more than one data source in a single", 
   "instance of the Struts controller servlet.  You specify the servlet", 
   "context attribute name under which to store each data source using the", 
   "\"key\" attribute of the <data-source> element.  By default, the value", 
   "returned by Action.DATA_SOURCE_KEY is used.", 
   "Anyone using the current data source support will need to modify their", 
   "struts-config.xml file, and enclose the <data-source> element in a new", 
   "<data-sources> element.  Also, you will need to change any call to", 
   "servlet.getDataSource()", 
   "to the following:", 
   "servlet.findDataSource(null);", 
   "NOTE:  The current GenericDataSource implementation still does not", 
   "implement the getConnection() method that takes a username and password", 
   "as paramters.", 
   "Submitted by:\tJohan Compagner <jcompagner@j-com.nl>"
  ], 
  "revision_id": "47927"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-26T20:49:06.000000Z", 
  "msg": [
   "Add a method that returns an Iterator over the property names for which at", 
   "least one error message has been recorded.  Existing methods will return", 
   "you an Iterator of the actual errors for that property, or the count of", 
   "the number of errors for that property.", 
   "Submitted by:\tElod Horvath <elod@itfais.com>"
  ], 
  "revision_id": "47926"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-26T20:29:45.000000Z", 
  "msg": [
   "Change the default operational mode of the <bean:write> tag to filter the", 
   "rendered output for characters sensitive to HTML.  You can turn this of by", 
   "explicitly coding:", 
   "<bean:write ... filter=\"false\" ... />"
  ], 
  "revision_id": "47925"
 }
]