[
 {
  "author": "craigmcc", 
  "date": "2000-12-26T20:07:00.000000Z", 
  "msg": [
   "Fix the behavior of the new PropertyMessageResources implementation when", 
   "the default Locale of the JVM is set to something different than the US", 
   "standard (such as nl_NL).", 
   "NOTE 1:  I applied only the first two patches that Johan supplied.  In my", 
   "opinion, trading off space for time (by having multiple keys per message)", 
   "is a good deal for most Struts-based applications.  The number of message", 
   "strings in most apps is relatively small, and I want the dominant use case", 
   "(accessing the same message repeatedly as the application runs) to be as", 
   "fast when using a Locale of \"nl\" as when using a locale of \"nl_NL\"", 
   "(assuming you've selected one language or the other as the default :-).", 
   "NOTE 2:  Using the new architecture for message resources, you can now", 
   "create your own MessageResources implementation (that reads from a", 
   "ResourceBundle, for example, as Johan's third patch did) without having", 
   "to patch the existing implementation.  Simply subclass the", 
   "MessageResources and MessageResourcesFactory classes as appropriate.", 
   "Submitted by: Johan Compagner <jcompagner@j-com.nl>"
  ], 
  "revision_id": "47924"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-12-26T17:42:38.000000Z", 
  "msg": [
   "- fixed attribute case for html events on form:image tag", 
   "Submitted By: Michael Westbay"
  ], 
  "revision_id": "47923"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-12-19T19:23:07.000000Z", 
  "msg": [
   "- created a bare-bones demonstration of how to utilize file uploading in", 
   "struts", 
   "- the file will be build in the binary distribution as", 
   "/webapps/struts-upload.war"
  ], 
  "revision_id": "47922"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-12-19T18:56:20.000000Z", 
  "msg": [
   "- Removed debugging statement"
  ], 
  "revision_id": "47921"
 }, 
 {
  "author": "mschachter", 
  "date": "2000-12-18T18:33:20.000000Z", 
  "msg": [
   "- changed \"user-agent\" header name to \"User-Agent\".  This change should", 
   "have no effect on servlet spec compliant containers, but it's defined as", 
   "\"User-Agent\" in the HTTP 1.0/1.1 spec"
  ], 
  "revision_id": "47920"
 }
]