[
 {
  "author": "craigmcc", 
  "date": "2001-01-02T23:40:18.000000Z", 
  "msg": [
   "Do not bother trying to look up the alternate system ID for a null public ID.", 
   "(It was my understanding that a HashMap worked fine with a null key and/or a", 
   "null value, but just in case ...)", 
   "Submitted by: Colin Sampaleanu <colin@Bspark.com>"
  ], 
  "revision_id": "47959"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-02T20:17:34.000000Z", 
  "msg": [
   "Update the JavaDoc comments for the controller servlet to document the", 
   "configuration parameters for multipart file upload handling.", 
   "Change the default \"config\" value from \"/WEB-INF/action.xml\" to", 
   "\"/WEB-INF/struts-config.xml\", and the default \"validate\" value from \"false\"", 
   "to \"true\".  These changes have the effect of defaulting to the 1.0 config file", 
   "format, instead of the 0.5 version, which is more appropriate for a 1.0", 
   "release."
  ], 
  "revision_id": "47958"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-31T04:26:37.000000Z", 
  "msg": [
   "Add \"event and listener infrastructure for Struts\" to the 1.1 TODO list.", 
   "This is going to be dramatically affected by other changes contemplated in", 
   "1.1, and it looks like we'll be able to add it without a tremendous amount", 
   "of backwards compatibility pain anyway -- so I'd rather not hold up 1.0", 
   "while we figure out exactly what events are \"interesting\" and all the", 
   "other issues related to including this now.", 
   "Add a BeanUtils method to clone a JavaBean that follows the normal", 
   "conventions, even if the class itself does not implement Cloneable so that", 
   "the clone() method works.  This is based on a patch submitted by Taylor", 
   "Cowan <taylor@bondisoftware.com>, but takes advantage of the", 
   "PropertyUtils.copyProperties() method that was not available when the", 
   "patch was submitted."
  ], 
  "revision_id": "47957"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-31T00:17:20.000000Z", 
  "msg": [
   "Besides using a Map for dynamic request parameters, also allow the", 
   "generation of a single request parameter by looking up a bean property.", 
   "Submitted by:\tJames Strachan <james@metastuff.com>"
  ], 
  "revision_id": "47956"
 }, 
 {
  "author": "craigmcc", 
  "date": "2000-12-30T21:28:04.000000Z", 
  "msg": [
   "Small docco update, and keep the initialization of Digester rules in", 
   "alphabetical order (not because the Digester cares, but to make it easier", 
   "to see rules that are related to each other)."
  ], 
  "revision_id": "47955"
 }
]