[
 {
  "author": "craigmcc", 
  "date": "2006-11-27T21:08:26.008446Z", 
  "msg": [
   "Progress checkin to make it possible for others to provide feedback on the", 
   "remodelling I'm doing on the Shale - Commons Validator integration.  Key", 
   "pieces so far:", 
   "* Use a ServletContextListener to precalculate and cache a bunch", 
   "of stuff at application startup (no, I didn't measure it, but", 
   "doing string tokenizing on every call to every validator on every", 
   "request cannot be a good thing :-).  As an added bonus, configuration", 
   "errors that will cause later runtime problems are detected", 
   "and complained about.", 
   "* New AbstractValidator base class that makes it trivially simple", 
   "to implement a JSF validator class on top of Commons Validator --", 
   "just set up your vars array, select the Commons Validator you want", 
   "to use, and call a convenience method on the base class.", 
   "* New IntegerValidator that combines the functionality of \"integer\"", 
   "and \"intRange\" into its own Validator class (the choice is made", 
   "depending on whether the user specifies the min and max or not).", 
   "I haven't fleshed out a tag class for IntegerValidator yet (I'm toying", 
   "with changing the default tag library prefix so you can just say", 
   "\"<validate:integer/>\" for this :-), or finished up the client side", 
   "JavaScript generation yet, so there might still be some changes needed", 
   "due to that.", 
   "A bunch of stuff still remains to do, but feedback early on would be", 
   "appreciated.", 
   "SHALE-340"
  ], 
  "revision_id": "479765"
 }, 
 {
  "author": "geirm", 
  "date": "2006-11-27T21:05:53.177474Z", 
  "msg": [
   "HARMONY-2283", 
   "Committing as submitted with minor changes :", 
   "1) added the location info into lnx.properties", 
   "so that the update fetch works on linux", 
   "2) removed reg.test from the suite becuase right", 
   "now it doesn't pass, and we dont' want to break", 
   "the current test loop", 
   "Tested on Ubuntu 6"
  ], 
  "revision_id": "479764"
 }, 
 {
  "author": "mheath", 
  "date": "2006-11-27T21:02:40.286346Z", 
  "msg": [
   "Consolodated completion handlers"
  ], 
  "revision_id": "479763"
 }, 
 {
  "author": "tellison", 
  "date": "2006-11-27T21:01:26.379396Z", 
  "msg": [
   "Tweak javac task to remove unused attributes, and avoid getting the Ant runtime JARs.", 
   "Specify a bootclasspath to avoid getting the Java runtime JARs."
  ], 
  "revision_id": "479762"
 }, 
 {
  "author": "djencks", 
  "date": "2006-11-27T20:59:30.704308Z", 
  "msg": [
   "plan may be null, test for it"
  ], 
  "revision_id": "479761"
 }
]