[
 {
  "author": "craigmcc", 
  "date": "2001-01-07T21:40:49.000000Z", 
  "msg": [
   "Revert the changes to PropertyUtils that included optional \"convert\"", 
   "parameters.  The PropertyUtils module should deal purely with the", 
   "reflection aspects of getting and setting properties -- any required", 
   "conversions are more properly done in higher level methods that utilize", 
   "PropertyUtils underneath.", 
   "This is going to break the build for a little while, until other things", 
   "are brought back into synch as well."
  ], 
  "revision_id": "47984"
 }, 
 {
  "author": "mschachter", 
  "date": "2001-01-07T21:35:22.000000Z", 
  "msg": [
   "Split the user guide into four \"chapters\", each in it's own xml file."
  ], 
  "revision_id": "47983"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-07T04:39:47.000000Z", 
  "msg": [
   "Remove items that have been completed already."
  ], 
  "revision_id": "47982"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-07T04:37:06.000000Z", 
  "msg": [
   "Add transactional token support to Struts, and use it in the example", 
   "application to ensure that a user does not go to the edit registration", 
   "screen, press Save, use the back arrow on their browser, and press Save", 
   "again.", 
   "Use of transactional token support is totally under the control of your", 
   "Action classes.  See the following changes in the example app:", 
   "* EditRegistrationAction - Call saveToken() just before forwarding", 
   "* SaveRegistrationAction - Call isTokenValid() before accepting this", 
   "transaction, then call resetToken() to make sure the same transaction", 
   "is not accepted twice.", 
   "The approach taken has been inspired by the input of many Struts users,", 
   "including Robert Leland, William Jaynes, and David Geary.  In addition,", 
   "a similar model is used in:", 
   "Fields, Duane K. and Kolb, Mark A., WEB DEVELOPMENT WITH", 
   "JAVA SERVER PAGES, Manning Publications, 2000", 
   "NOTE:  There is still a problem with the subscription.jsp page, probably", 
   "related to recent changes in BeanUtils and PropertyUtils, that I am", 
   "going to look at next."
  ], 
  "revision_id": "47981"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-07T01:01:40.000000Z", 
  "msg": [
   "Add the completed Bean Tags Developer's Guide."
  ], 
  "revision_id": "47980"
 }
]