[
 {
  "author": "craigmcc", 
  "date": "2001-01-10T23:11:37.000000Z", 
  "msg": [
   "Clarify the differences between <bean:define> and <jsp:useBean>.", 
   "PR: BugRat Bug Report #207", 
   "Submitted by:\tDavid M. Karr <dkarr@tcsi.com>"
  ], 
  "revision_id": "48019"
 }, 
 {
  "author": "husted", 
  "date": "2001-01-10T22:39:27.000000Z", 
  "msg": [
   "Submitted by Ted Husted. Minor changes to hilight standard", 
   "ActionForm validate methods.", 
   "<snip>", 
   "<li>Generally, there will be very little input validation logic in an", 
   "<code>ActionForm</code> bean.  The primary reason such beans exist", 
   "is to save the most recent values entered by the user for the", 
   "associated form -- even if errors are detected -- so that the same", 
   "page can be reproduced, along with a set of error messages, so the", 
   "user need only correct the fields that are wrong.  Validation", 
   "of user input should be performed within <code>Action</code> classes", 
   "(if it is simple), or appropriate business logic beans.</li>", 
   "</snip>", 
   "<insert>", 
   "<li>The ActionForm object also offers a standard validation mechanism.", 
   "If you override a \"stub\" method, and provide error messages in the", 
   "standard application resource, Struts will automatically validate the", 
   "input from the form (using your method). If validation fails, Struts", 
   "can automatically return the user to the input form, re-populate", 
   "the form from the form bean, and display your error messages (via a", 
   "custom tag), all before the Action object is ever called. This is a", 
   "quick and easy way to get simple validation out of the way, but you", 
   "might also want to provide further  \"business logic\" validation as", 
   "part of your Action object. (See \"Action Form Validation\" for details.)", 
   "Of course, you can also ignore the ActionForm validation and provide", 
   "your own in the Action object</li>", 
   "</insert>"
  ], 
  "revision_id": "48018"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-10T22:38:32.000000Z", 
  "msg": [
   "Update the TODO lists some more.  In particular, migrate updating the", 
   "example app to include locale switching into 1.1 -- IMHO the docs are a", 
   "much more important place to spend our pre-1.0 time."
  ], 
  "revision_id": "48017"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-10T22:06:55.000000Z", 
  "msg": [
   "Make the \"formats\" object protected instead of private so that subclasses can", 
   "manipulate it directly if need be."
  ], 
  "revision_id": "48016"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-10T22:05:26.000000Z", 
  "msg": [
   "Expand the functionality of the <bean:include> tag to include a feature", 
   "that was supported by the 0.5 version of this tag -- you can know specify", 
   "how to find the requested resource by using one of three attributes:", 
   "* forward - Follow the context relative path of a global", 
   "ActionForward declaration", 
   "* href - Follow an absolute URL (which may be to an external webapp or", 
   "server)", 
   "* page - Follow the specified context-relative path (replaces the \"name\"", 
   "attribute, which is deprecated but maintained for backwards", 
   "compatibility).", 
   "In the first and third cases, the session identifier of the current", 
   "session (if any) will be included, so that the subrequest will appear to", 
   "be part of the same session.", 
   "Submitted by: Brian R. Robinson <brobinson@bluestone.com>", 
   "PR: BugRat Bug Report #736"
  ], 
  "revision_id": "48015"
 }
]