[
 {
  "author": "husted", 
  "date": "2001-01-21T12:57:51.000000Z", 
  "msg": [
   "Submitted by Ted Husted. Minor stylistic changes to introduction. Refactor section 1.2 to segue from 1.1 and 1.3.", 
   "[1.1]", 
   "Good Thing.", 
   "Java code.", 
   "in-and-of itself", 
   "resolve /the/ flow control issues", 
   "under the Sun ...", 
   "released, and IOHO, Java Model 2 development will never be quite the same.", 
   "<strike>If you are new ... </strike>", 
   "--", 
   "[1.2]", 
   "In the MVC design pattern, application flow is mediated by a central Controller. The Controller delegates requests to an appropriate handler. The handlers are tied to a Model, which act as an adapter between the request and the Model. The Model represents, or encapsulates, an application's business logic or state. Control is usually then forwarded back through the Controller to the appropriate View. The forwarding can be determined by consulting a set of mappings, usually loaded from a database or configuration file. This provides a loose coupling between the View and Model, which can make an applicaton significantly easier to create and maintain.", 
   "--", 
   "[1.3]", 
   "See the ASF license < http://www.apache.org/LICENSE-1.1 > for specifics.", 
   "--", 
   "[2.3]", 
   "Model.", 
   "object.", 
   "+ You may also place a bean instance on your form, and use nested property references. For example, you might have a \"customer\" bean on your Action Form, and then refer to the property \"customer.name\" in your JSP view. This would correspond to the methods customer.getName() and customer.setName(string Name) on your customer bean. See the Tag Library Developer Guides for more about nested syntax.", 
   "--", 
   "[2.6]", 
   "Struts can define the datasources for an application form within its standard configuration file. A simple JDBC connection pool is also provided. See The Action Mappings Configuration File section and the Utilities Developer Guide for details.", 
   "After the datasource is defined, here is an example of establishing a connection from within a Action perform method.", 
   "DataSource datasource = servlet.findDataSource(null);", 
   "--", 
   "[3.3]", 
   "../api", 
   "--", 
   "[3.3.1]", 
   "(based on", 
   "<html:form action=\"logon.do\" name=\"logonForm\">", 
   "using the specified Java class name. (The form bean name can also be specified in the Struts configuration file, and then omitted here. See \"The Action Mappings Configuration File\" for details.)", 
   "--", 
   "[3.3.4]", 
   "ActionMapping).", 
   "--", 
   "[3.4.2 Page Composition With Includes]", 
   "Another approach to this would be to use the Struts Template Tag library. See the Developer's Guide for details.", 
   "--", 
   "[4.2]", 
   "Most people would only use the \"HttpServletRequest\" version.", 
   "MVC/Model-2", 
   "--", 
   "[4.4", 
   "../api", 
   "--", 
   "[4.5.1]", 
   "You can also find these details in the Javadocs for the ActionServlet class.", 
   "../api", 
   "--", 
   "[Resources]", 
   "mailto:Thor", 
   "mailto:david", 
   "Change <u>'s to <b>'s", 
   "Make one \"master\" link to Husted dot Com.", 
   "Add mail-archive.com", 
   "--"
  ], 
  "revision_id": "48049"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-20T01:08:56.000000Z", 
  "msg": [
   "Clean up the stylesheet for the User's Guide so that the pages are", 
   "visually similar to the remainder of the Struts documentation, and", 
   "include quick links to the major sections.", 
   "TODO: There are still some spacing issues on some of the <pre> sections.", 
   "I suspect it is due to someone's editors inserting tabs instead of spaces."
  ], 
  "revision_id": "48048"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-01-20T00:32:43.000000Z", 
  "msg": [
   "Modify the build process to create the 1.0 version of the User's Guide in", 
   "a separate subdirectory.  This is in prep for sprucing up the stylesheet", 
   "used to generate the User's Guide, so that it is similar to the remainder", 
   "of the Struts documentation.  Also, added a table of contents page, and", 
   "cleaned up section numbering titles in the introduction."
  ], 
  "revision_id": "48047"
 }, 
 {
  "author": "husted", 
  "date": "2001-01-19T02:41:46.000000Z", 
  "msg": [
   "Assign tasks to Ted Husted and Martin Cooper, as requested."
  ], 
  "revision_id": "48046"
 }, 
 {
  "author": "dgeary", 
  "date": "2001-01-19T01:26:01.000000Z", 
  "msg": [
   "removed flushes from insert and put template tags"
  ], 
  "revision_id": "48045"
 }
]