[
 {
  "author": "mschachter", 
  "date": "2001-02-14T21:43:09.000000Z", 
  "msg": [
   "Made changes to classes in upload package to address problems with storing", 
   "files in memory.  This commit will break any code that implements the", 
   "org.apache.struts.upload.FormFile interface, because a new method was", 
   "added. Changed MultipartIterator to use the new MultipartValueStream class", 
   "from Jimmy Larsson  for", 
   "going through multipart elements.  This will fix a bug with null content types", 
   "for files. Also updated the upload example to use the new recommended method", 
   "for retrieving file content.", 
   "Submitted By: Jimmy Larsson"
  ], 
  "revision_id": "48144"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-14T19:01:28.000000Z", 
  "msg": [
   "Sign up Nic Hobbs where he has expressed interest (I hope I got all the", 
   "categorizations right)."
  ], 
  "revision_id": "48143"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-14T17:27:19.000000Z", 
  "msg": [
   "Modify the comments to make it clear that both Tomcat 4.0 and 3.2 are", 
   "optional - they are only needed if you want to use the \"deploy.catalina\"", 
   "or \"deploy.tomcat\" targets of the \"build.xml\" file.", 
   "Submitted by: Marcus Ahnve <marcus.ahnve@lecando.com>", 
   "PR: Bugzilla #588"
  ], 
  "revision_id": "48142"
 }, 
 {
  "author": "husted", 
  "date": "2001-02-14T14:02:46.000000Z", 
  "msg": [
   "(Submitted by Ted Husted). Correct Martin Cooper's mailto tag."
  ], 
  "revision_id": "48141"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-14T00:39:52.000000Z", 
  "msg": [
   "Partially restore the previous operation of the <html:password> tag.", 
   "Now, the <html:password> tag redisplays the existing contents of the", 
   "underlying property (echoed as asterisks on the HTML page, but visible in", 
   "the underlying page source) by default, in a manner consistent with the", 
   "way all other input fields redisplay their contents.  However, you can", 
   "turn this redisplay off (as would be appropriate on a login page):", 
   "<html:password property=\"password\" redisplay=\"false\"/>"
  ], 
  "revision_id": "48140"
 }
]