[
 {
  "author": "craigmcc", 
  "date": "2001-02-20T02:59:00.000000Z", 
  "msg": [
   "Retrofit the <html:image> tag so that it offers the same support for", 
   "dynamically looking up alternate text, context-relative URIs, or source", 
   "URLs in a message resources bundle that the <html:img> tag has.", 
   "NOTE:  This change is *not* backwards compatible, but the changes are very", 
   "easy:", 
   "* Change any use of 'src=\"foo\" isKey=\"true\"' to 'srcKey=\"foo\"' instead", 
   "* Change any use of 'path=\"/foo\"' to 'page=\"/foo\"' instead"
  ], 
  "revision_id": "48159"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-20T01:48:46.000000Z", 
  "msg": [
   "Add \"bundle\", \"key\", and \"locale\" attributes to the <html:option> tag so", 
   "that you can specify an internationalized value to display to the user,", 
   "without having to resort to a nested <bean:message> tag, although the", 
   "latter approach is still supported.  This can reduce the total number of", 
   "custom tags on a JSP page when you use large numbers of <html:option>", 
   "tags.", 
   "Refactor the lookup of messages based on \"bundle\", \"locale\", and \"key\"", 
   "type attributes into a support method named RequestUtils.message(), to", 
   "centralize this functionality and reduce the amount of repetitive code", 
   "found in tag implementation classes.  Modify <bean:message>,", 
   "<html:errors>, <html:img>, and <html:option> to use the new utility", 
   "method.", 
   "Submitted by: Martin Cooper <martin.cooper@tumbleweed.com>"
  ], 
  "revision_id": "48158"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-20T00:18:53.000000Z", 
  "msg": [
   "Enhance the <html:img> tag so that you can specify the ultimate values for", 
   "the \"src\" and \"alt\" attributes indirectly, by looking them up in the", 
   "application resources.  This is very useful if you want to use different", 
   "images (or alternate text) depending on the user's current Locale.", 
   "You have four options for setting the \"src\" attribute:", 
   "* \"src\" - Absolute SRC URL", 
   "* \"srcKey\" - Resources key to look up absolute SRC URL", 
   "* \"page\" - Context-relative page URI", 
   "* \"pageKey\" - Resources key to look up context-relative page URI", 
   "You have two options for setting the \"alt\" attribute:", 
   "* \"alt\" - Absolute alternate text", 
   "* \"altKey\" - Resources key to look up the alternate text", 
   "For any resources lookup (srcKey, pageKey, or altKey) you can also", 
   "specify:", 
   "* \"bundle\" - Servlet context attributes key for our message resources", 
   "(defaults to the application resources configured for this app)", 
   "* \"locale\" - Session attributes key for our current locale (defaults", 
   "to the Struts standard value)", 
   "Submitted by:  Oleg V. Alexeev <gonzo@penza.net>", 
   "PR: Bugzilla #601, #614."
  ], 
  "revision_id": "48157"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-19T22:06:38.000000Z", 
  "msg": [
   "Update the install docs to reflect the fact that problems have been reported", 
   "with 2.0 versions of Xalan.  Version 1.2 should be used instead.", 
   "Submitted by: Carl Tallis <carl@tallis.net>", 
   "PR:  Bugzilla #502"
  ], 
  "revision_id": "48156"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-19T22:03:25.000000Z", 
  "msg": [
   "Add a TODO for enhancing BeanUtils/ConvertUtils/PropertyUtils support for", 
   "properties that implement Collection, List, or Set.  They should be treated", 
   "in a manner similar to array-valued or indexed properties.", 
   "Submitted by:  alix.jermyn@iconmedialab.com", 
   "PR: Bugzilla #640"
  ], 
  "revision_id": "48155"
 }
]