[
 {
  "author": "craigmcc", 
  "date": "2001-02-19T21:41:39.000000Z", 
  "msg": [
   "Remove the default value for the \"redirect\" attribute, so that you can", 
   "use a global RedirectingActionForward if you want to, without having to", 
   "explicitly say redirect=\"true\" on every <forward> element.", 
   "Submitted by:  Howard Moore <howard.moore@datapulse.com>", 
   "PR:  Bugzilla #616"
  ], 
  "revision_id": "48154"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-19T21:35:14.000000Z", 
  "msg": [
   "Tweak the description of what the Digester actually does to make it clearer.", 
   "Submitted by:  Craig Tataryn <Craig.Tataryn@msdw.com>"
  ], 
  "revision_id": "48153"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-19T21:29:43.000000Z", 
  "msg": [
   "Remove the 1.0 docs that Ted is finishing up, and add entries for the unit", 
   "test modules to the 1.1 list."
  ], 
  "revision_id": "48152"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-19T20:48:16.000000Z", 
  "msg": [
   "Clean up a few stray hyperlinks."
  ], 
  "revision_id": "48151"
 }, 
 {
  "author": "husted", 
  "date": "2001-02-19T20:39:25.000000Z", 
  "msg": [
   "(Submitted by Ted Husted). Per Craig's suggestions: * Make the page names include just the server name, and not", 
   "the version number.  That way, you can have separate sections", 
   "on the page for each individual version of the same server.  New", 
   "sections can be conveniently added to the bottom as new versions", 
   "of the servers come out.  Maybe include a hyperlink index at the", 
   "top of each page for all the documented version numbers?", 
   "* On the Tomcat page, I've seen so many problems with bugs in", 
   "Tomcat 3.1 that I do not recommend it as a platform for Struts", 
   "based apps.  I'd like to have the install documents recommend", 
   "that people upgrade to at least Tomcat 3.2.1.", 
   "* The Tomcat instructions related to integration with Apache apply", 
   "only to 3.1 and 3.2 -- the instructions for 4.0 will be different.", 
   "Right", 
   "now, the 4.0 section should just talk about running stand alone,", 
   "though -- the 4.0 web connector is not ready for prime time."
  ], 
  "revision_id": "48150"
 }
]