[
 {
  "author": "husted", 
  "date": "2001-02-20T12:25:02.000000Z", 
  "msg": [
   "Add iPlanet instructions.", 
   "Submitted by Stanley Santiago."
  ], 
  "revision_id": "48164"
 }, 
 {
  "author": "husted", 
  "date": "2001-02-20T12:22:21.000000Z", 
  "msg": [
   "Minor fix to bio."
  ], 
  "revision_id": "48163"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-20T06:09:41.000000Z", 
  "msg": [
   "Check in the initial version of the Release Plan for Struts 1.0-beta-1."
  ], 
  "revision_id": "48162"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-20T05:20:11.000000Z", 
  "msg": [
   "Fix the <html:form action=\"xxx\"> attribute to correctly work for both", 
   "extension mapping and path mapping of the controller servlet -- at least", 
   "as long as your servlet container correctly allows the following to work:", 
   "InputStream is =", 
   "getServletContext().getResourceAsStream(\"/WEB-INF/web.xml\");", 
   "like it is supposed to.", 
   "The new recommended approach is to set the action attribute of <html:form>", 
   "to exactly the path of the Action to which you wish the form to be", 
   "submitted.  The <html:form> tag will understand how the action servlet is", 
   "being mapped, and will construct an appropriate URL accordingly.", 
   "For backwards compatibility, the existence of the extension-mapping", 
   "extension on an action attribute still works, so either of the following", 
   "tags would work in the Struts example application:", 
   "<html:form action=\"/logon.do\" ...>", 
   "<html:form action=\"/logon\" ...>", 
   "The latter path will also work if the controller servlet is path-mapped,", 
   "but you will need to adjust the paths for several of the <forward>", 
   "elements in this case.", 
   "Submitted by:  Marcus Ahnve <marcus.ahnve@lecando.com>", 
   "PR: Bugzilla #587"
  ], 
  "revision_id": "48161"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-02-20T03:11:20.000000Z", 
  "msg": [
   "Throw a runtime exception if we cannot identify the format in which error", 
   "messages were transmitted to this tag.  Among other things, this should catch", 
   "the case where class loader problems in WebLogic 5.1 cause the \"instanceof\"", 
   "test for ActionErrors to fail, resulting in no messages at all being rendered.", 
   "Submitted by: Jason Songhurst <jason.songhurst@valtech.com>", 
   "PR: Bugzilla #467"
  ], 
  "revision_id": "48160"
 }
]