[
 {
  "author": "brett", 
  "date": "2006-12-04T00:42:44.057090Z", 
  "msg": [
   "ignore"
  ], 
  "revision_id": "482000"
 }, 
 {
  "author": "tabish", 
  "date": "2006-12-04T00:41:27.313775Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQCPP-14", 
   "Added initail Time to Live processing to the Consumer, and the Time Stamping is now correct in the producer."
  ], 
  "revision_id": "481999"
 }, 
 {
  "author": "paulsp", 
  "date": "2006-12-04T00:37:37.865885Z", 
  "msg": [
   "Set eol-style property"
  ], 
  "revision_id": "481998"
 }, 
 {
  "author": "rgardler", 
  "date": "2006-12-04T00:22:21.818166Z", 
  "msg": [
   "Add nav.css for WicketBench"
  ], 
  "revision_id": "481997"
 }, 
 {
  "author": "jkuhnert", 
  "date": "2006-12-04T00:16:20.754983Z", 
  "msg": [
   "Made a few more improvements to the gzip compression && asset caching related portions of the system.", 
   "-) All of the correct logic needed to determine browser vendor/version is implemented to prevent issues from older", 
   "IE releases with gzip content.", 
   "-) Static assets now completely work off of the actual last modification time of the asset in question so", 
   "that assets are properly cached even in development.", 
   "-) Static asset content in raw byte or gzip form is now also cached in memory to prevent extraneous processing", 
   "of resources for each request.", 
   "-) AJAX and JSON responses now appropriately compress their output when possible using the same shared", 
   "logic that AssetService uses via GzipUtil.", 
   "-) Correctly implementing ~all~ caching header logic needed across the spectrum of options. This area will", 
   "probably undergoe more refactoring as the types/specifics will need to be configurable on a finer grained basis. Either", 
   "way, implementing the right caching headers alone has made a huge difference.", 
   "Needless to say, this stuff is fast. At least compared to what was happening before. So very much faster. Almost", 
   "enough to be shockingly fast. 200k dojo file pre-compressed to 50k and properly cached makes a difference."
  ], 
  "revision_id": "481996"
 }
]