[
 {
  "author": "craigmcc", 
  "date": "2001-03-12T00:07:30.000000Z", 
  "msg": [
   "Refine dependencies and remove debugging output."
  ], 
  "revision_id": "48229"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-11T02:50:12.000000Z", 
  "msg": [
   "Add a new capability to the controller servlet framework -- the ability to", 
   "specify an external servlet or JSP resource (called by", 
   "RequestDispatcher.include()), instead of an Action class, as the ultimate", 
   "processor of an incoming request.  This is done by specifying the new", 
   "\"include\" attribute, rather than the \"type\" attribute, on an <action>.", 
   "It is assumed that the included resource will have generated the", 
   "corresponding response (either directly, or by forwarding to some other", 
   "resource on its own).  Therefore, no forwarding via a <forward> element is", 
   "performed after the included resource returns.  This is equivalent to an", 
   "Action class that returns null from the perform() method.", 
   "If you specify a form bean in your <action> element, the standard form", 
   "bean processing (including calling the validate() method) is still", 
   "performed prior to including the requested resource.  Therefore, you can", 
   "integrate existing servlet-based technologies into the Struts framework,", 
   "and still take advantage of the Struts form bean processing, without", 
   "having to create Action wrappers around the existing resources.", 
   "The include capability also opens the door to experimentation around", 
   "\"scripting\" of actions via JSP pages -- using Struts logic and bean", 
   "manipulation tags, other scripting languages via the BSF tag library in", 
   "the Jakarta Taglibs project <http://jakarta.apache.org/taglibs>, or", 
   "servlet based workflow and content management solutions that are not", 
   "necessarily tightly integrated with the Struts framework."
  ], 
  "revision_id": "48228"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-11T00:58:45.000000Z", 
  "msg": [
   "Correct hyperlinks generated by <html:link> and <html:redirect> to", 
   "properly omit the port number if it is the default for this scheme (80 for", 
   "http, 443 for https).", 
   "PR: Bugzilla #918", 
   "Submitted by:\t<dmiser@wi.rr.com>"
  ], 
  "revision_id": "48227"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-11T00:42:47.000000Z", 
  "msg": [
   "Allow a parameter type other than String when reading the actual parameter", 
   "value from the body content.", 
   "PR: Bugzilla #915", 
   "Submitted by:\tHal Deadman <hal.deadman@tallan.com>"
  ], 
  "revision_id": "48226"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-11T00:35:17.000000Z", 
  "msg": [
   "Corrected documentation of the \"name\" attribute to reflect how it is", 
   "actually used.", 
   "PR: Bugzilla #896", 
   "Submitted by:\tMartin Cooper <martin.cooper@tumbleweed.com>"
  ], 
  "revision_id": "48225"
 }
]