[
 {
  "author": "bhupendrab", 
  "date": "2006-12-04T16:44:13.210862Z", 
  "msg": [
   "QPID-51"
  ], 
  "revision_id": "482240"
 }, 
 {
  "author": "dblevins", 
  "date": "2006-12-04T16:44:10.109414Z", 
  "msg": [
   "Intellij hadn't fully written this to disk on my last commit."
  ], 
  "revision_id": "482239"
 }, 
 {
  "author": "ritchiem", 
  "date": "2006-12-04T16:38:10.727690Z", 
  "msg": [
   "QPID-148", 
   "AMQMinaProtocolSession.java - updated comment", 
   "AbstractJMSMessage.java - removed a lot of getHeaders() == null checks. Updated logic accordingly.. Now a request for a property that doesn't exist will be consistent with calls on an empty table rather than just creating a default value.", 
   "BasicContentHeaderProperties.java - the culprit for QPID-148 changed new FieldTable() to setHeaders(new FieldTable()) to ensure propertyFlag is set to write headers to the wire.", 
   "Added PropertyValueTest.java - that tests all the valid values on the Message.", 
   "*NOTE*: A number of the tests are commented out as AMQP and therefore the FieldTable do not support these values. QPID-9", 
   "Added SVN ignores for the target directories.", 
   "Updated AbstractJMSMessage.java _readableProperties to be set correctly in the constructor."
  ], 
  "revision_id": "482238"
 }, 
 {
  "author": "steshaw", 
  "date": "2006-12-04T16:35:07.643851Z", 
  "msg": [
   "QPID-153 Initial port of URL parsing from Java client. Due to .NET Uri parser must support \"host\" name. Use \"default\" when you don't want to really supply one."
  ], 
  "revision_id": "482237"
 }, 
 {
  "author": "kelvingoodson", 
  "date": "2006-12-04T16:34:54.985732Z", 
  "msg": [
   "TUSCANY-935 - checking in the patch.  I have fixed up the assertion that was failing in XPathTestCase ,  but I have disabled two other parts of the XPathTestCase,  both I think concerned with the same issue (xpath indexing beyond the end of a list).  This code path needs fixing to avoid throwing exceptions."
  ], 
  "revision_id": "482236"
 }
]