[
 {
  "author": "aconway", 
  "date": "2006-12-04T21:31:08.178969Z", 
  "msg": [
   "Andrew Stitcher: Reduced CppUnit version requirement to 1.10.2"
  ], 
  "revision_id": "482365"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-04T21:25:07.915529Z", 
  "msg": [
   "First round of supporting events when DialogContextManager.create() or", 
   "DialogContextManager.remove() is called.  You can now register listeners of", 
   "type DialogContextManagerListener on the DialogContextManager instance.  One", 
   "remaining FIXME is to make it possible to be notified when DialogContextManager", 
   "instances themselves are placed in and out of service -- since these instances", 
   "are typically a session scoped managed bean, we need to do something", 
   "interesting in order to fire the necessary events.", 
   "Also did a bit of other cleanup:", 
   "* Renamed DialogListener to DialogContextListener (with associated", 
   "ripple effects on method names) for naming consistency", 
   "* Added synchronization in a couple of missing cases", 
   "* Provided getXxxxxListener() methods that returned an array of", 
   "registered listeners for each type", 
   "* Used the \"get\" methods in the abstract base classes to (a) avoid", 
   "problems if the list of listeners is modified while being traversed", 
   "to fire events, and (b) took the event firing calls out of the", 
   "synchronization blocks to avoid overhead when an event listener", 
   "might take a long time to return.", 
   "SHALE-251"
  ], 
  "revision_id": "482364"
 }, 
 {
  "author": "grahamd", 
  "date": "2006-12-04T21:25:02.771000Z", 
  "msg": [
   "Updates to documentation for apache.import_module()."
  ], 
  "revision_id": "482363"
 }, 
 {
  "author": "bdaniel", 
  "date": "2006-12-04T21:24:28.025691Z", 
  "msg": [
   "The DAS will now throw an exception when a user tries to add an unqualified primary key", 
   "using the ConfigHelper"
  ], 
  "revision_id": "482362"
 }, 
 {
  "author": "dblevins", 
  "date": "2006-12-04T21:23:46.906017Z", 
  "msg": [
   "Forgot this in my last commit"
  ], 
  "revision_id": "482361"
 }
]