[
 {
  "author": "jukka", 
  "date": "2006-12-05T00:07:05.703473Z", 
  "msg": [
   "1.1.1: Adding the release news."
  ], 
  "revision_id": "482420"
 }, 
 {
  "author": "dlouzan", 
  "date": "2006-12-05T00:05:24.461064Z", 
  "msg": [
   "Modified buildcycle for ensuring Java 1.4 compatibility"
  ], 
  "revision_id": "482419"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-05T00:04:26.882409Z", 
  "msg": [
   "Implement the remainder of the functionality needed for event processing in", 
   "shale-dialog (SHALE-251):", 
   "* A new listener interface (DialogLifecycleListener) and associated", 
   "abstract base class.  If the application defines an application scoped", 
   "(not required, but conventional) managed bean that implements this", 
   "interface under a reserved managed bean name (Constants.LIFECYCLE_ATTR),", 
   "this listener will be notified when new DialogContextManager instances", 
   "are created (placed into session scope) or removed (removed from session", 
   "scope either deliberatly or because the session timed out).  This gives", 
   "the application a hook to add listeners anywhere and everywhere it needs to.", 
   "* As a convenience, modify the contract for DialogContext.setData() such that,", 
   "if the specified \"data\" object is of a class that implements", 
   "DialogContextListener, automatically register it (upon entry) and", 
   "deregister it (upon completion of the dialog).  This makes it extremely", 
   "simple for applications that want to be notified as states change, since", 
   "the app will most likely have a \"data\" object to maintain conversational", 
   "state anyway.", 
   "I did not see anywhere else that shale-dialog-scxml messed with the", 
   "data field directly; if there are such places, they will need to have the", 
   "listener related logic added there as well."
  ], 
  "revision_id": "482418"
 }, 
 {
  "author": "dlouzan", 
  "date": "2006-12-05T00:03:23.652180Z", 
  "msg": [
   "Modified exception handling"
  ], 
  "revision_id": "482417"
 }, 
 {
  "author": "ate", 
  "date": "2006-12-05T00:02:46.640433Z", 
  "msg": [
   "Allow multiple path/page criteria in a locator: only when none provides a value (or none is provided in the first place), fallback to using the locator request path"
  ], 
  "revision_id": "482416"
 }
]