[
 {
  "author": "rleland", 
  "date": "2001-03-27T16:16:51.000000Z", 
  "msg": [
   "This is definately a first, Struts wouldn't compile.", 
   "Package name was incorrect corrected", 
   "so it would compile ! ! !"
  ], 
  "revision_id": "48249"
 }, 
 {
  "author": "rleland", 
  "date": "2001-03-25T21:16:24.000000Z", 
  "msg": [
   "Fix small typo in use of Iterator submitted by", 
   "Martin Cooper"
  ], 
  "revision_id": "48248"
 }, 
 {
  "author": "rleland", 
  "date": "2001-03-25T20:59:12.000000Z", 
  "msg": [
   "Fix small typo"
  ], 
  "revision_id": "48247"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-24T00:05:36.000000Z", 
  "msg": [
   "Update the README and installation information to reflect the use of \"ant\"", 
   "directly, rather than the build.sh and build.bat scripts, to run Struts", 
   "builds.", 
   "Eventually, the build.sh and build.bat scripts will be removed, once we've", 
   "gained some experience with the new approach and made sure there are no", 
   "gotchas."
  ], 
  "revision_id": "48246"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-03-23T22:21:34.000000Z", 
  "msg": [
   "Add support for the \"dispatch via method reflection\" mechanism that was", 
   "discussed on STRUTS-DEV a couple of weeks ago.  A detailed usage example", 
   "is found in the Javadoc comments of the new DispatchAction class.", 
   "This code is based on code proposed by Niall Pemberton, with the following", 
   "changes:", 
   "* Added a general-purpose configuration parameter attribute in the", 
   "ActionMapping class that implements a standard <action> element.", 
   "* Use this configuration attribute to identify the name of the request", 
   "parameter whose value will be the name of the method to be called.", 
   "* Used a request parameter (rather than extra path info) to represent", 
   "the method name, because extra path info is not available when you", 
   "are using extension mapping.", 
   "* Cached previously introspected Method objects so that the lookup", 
   "need be done only once for each method name.", 
   "* Created error responses for all possible processing problems (as well", 
   "as logging them) so that the user doesn't see just a blank page.", 
   "Submitted by:\tNiall Pemberton <niall.pemberton@btInternet.com>", 
   "and many others who liked the idea (apparently I'm not quite", 
   "brilliant enough to have thought of this one :-)"
  ], 
  "revision_id": "48245"
 }
]