[
 {
  "author": "felicity", 
  "date": "2006-12-05T18:46:00.654228Z", 
  "msg": [
   "bug 4459: add another test for: allow 127.0.0.\\d+, and look for other illegals"
  ], 
  "revision_id": "482735"
 }, 
 {
  "author": "felicity", 
  "date": "2006-12-05T18:43:58.092829Z", 
  "msg": [
   "bug 4459: allow 127.0.0.\\d+, and look for other illegals"
  ], 
  "revision_id": "482734"
 }, 
 {
  "author": "ritchiem", 
  "date": "2006-12-05T18:37:18.165969Z", 
  "msg": [
   "FieldTable change.", 
   "FieldTable is now an interface with a PropertyFieldTable.java implementation.", 
   "This PropertyFieldTable has been updated to handle the wire level encoding and decoding of the underlying map. It also allows XML encoding of the data as used by JMSMapMessage.", 
   "Currently the AMQP doesn't support all the Java primitives as a result all values are written out as XML using a prefix of 'X'. (See QPID-9 for further details)", 
   "Changes where not specified are changes from new FieldTable() to FieldTableFactory.newFieldTable()", 
   "AbstractJMSMessage.java - the type prefixing of properties is now not requried as all the functionality has been moved to PropertyFieldTable.java. In addition set/getObjectProperty is now implemented as PFT does this.", 
   "basic Tests have been updated to send all property values.", 
   "FieldTableKeyEnumeration.java has been removed as it is nolonger required. The PFT handles this internally.", 
   "ToDo: The Tests need to be consolidated so that there is a clear view of the code coverage. QPID-158"
  ], 
  "revision_id": "482733"
 }, 
 {
  "author": "scheu", 
  "date": "2006-12-05T18:28:55.671880Z", 
  "msg": [
   "AXIS2-1825", 
   "Contributor: Mike Rheinheimer", 
   "Make the Marshaller stateless.  6 JAX-WS", 
   "tests currently fail with this change...these are disabled."
  ], 
  "revision_id": "482732"
 }, 
 {
  "author": "bdaniel", 
  "date": "2006-12-05T18:28:33.990198Z", 
  "msg": [
   "TUSCANY-957 DAS will no longer generate a partial update statement when no fields are set. Instead,", 
   "it will generate an update statement containing each of the DataObject's dataType properties. The", 
   "values will all be null (as they are in the DataObject instance.)"
  ], 
  "revision_id": "482731"
 }
]