[
 {
  "author": "craigmcc", 
  "date": "2001-05-04T19:12:13.000000Z", 
  "msg": [
   "Modify build script to omit the source code from the binary distribution,", 
   "per agreement on the mailing lists.  The sources will always be available", 
   "online in the usual place:", 
   "http://jakarta.apache.org/builds/jakarta-struts/nightly/src/"
  ], 
  "revision_id": "48324"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-05-03T03:29:38.000000Z", 
  "msg": [
   "Modify RequestUtils.absoluteURL() to throw a MalformedURLException if one is", 
   "encountered while trying to reconstruct a URL from the specified page context", 
   "and context-relative path.  This will cause tags like <html:link>,", 
   "<bean:include>, and <logic:redirect> to throw an exception instead of create", 
   "null URLs.  In addition, these three tags will log the exception to the servlet", 
   "context's log to facilitate further analysis.", 
   "These changes are in direct response to Bugzilla #1586, where the main page", 
   "of the example application creates bogus hyperlinks that look like this:", 
   "<a>Log on to the MailReader Demonstration Application</a>", 
   "I suspect that this is due to misconfiguration of the servlet container", 
   "being used (WebSphere in the case of the bug report).  Throwing the exception,", 
   "and logging the details, will prove it one way or the other."
  ], 
  "revision_id": "48323"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-05-03T01:13:54.000000Z", 
  "msg": [
   "Correct the previous patch for generating <a name=\"...\"/> elements.  The", 
   "tests should really be for the \"linkName\" attribute, not the \"name\"", 
   "attribute.", 
   "PR: Bugzilla #1581", 
   "Submitted by:\tcurt@hagenlocher.org"
  ], 
  "revision_id": "48322"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-05-03T01:05:48.000000Z", 
  "msg": [
   "Put xerces.jar in the correct place when using \"deploy.catalina\"."
  ], 
  "revision_id": "48321"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-04-29T05:59:58.000000Z", 
  "msg": [
   "Add an optional \"flush\" attribute that, if set to true, will cause the", 
   "response to be flushed before the content specified by this <template:get>", 
   "tag is included.  This allows working around problems on broken servlet", 
   "containers (such as WebSphere in this particular case).", 
   "PR: Bugzilla #760", 
   "Submitted by:\tnathann@objectfx.com, dmiser@wi.rr.com"
  ], 
  "revision_id": "48320"
 }
]