[
 {
  "author": "craigmcc", 
  "date": "2001-06-02T23:13:39.000000Z", 
  "msg": [
   "Port data source fix to HEAD branch."
  ], 
  "revision_id": "48394"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-02T23:06:52.000000Z", 
  "msg": [
   "Add the ability to check for stale connections in GenericDataSource.  This", 
   "is configured by setting one or both of the following properties:", 
   "* pingCommand - An SQL command that does *not* return a result set", 
   "* pingQuery - An SQL SELECT command that does return a result set", 
   "Prior to returning a connection, GenericDataSource will execute any ping", 
   "command and/or query you have configured.  If either throws an exception,", 
   "this connection is considered stale and is thrown away.", 
   "Add a debugging detail level property to GenericDataSource, and associated", 
   "log methods, so that the activity of the data source can be traced.", 
   "Modify the initialization of data sources to configure the data source's", 
   "log writer to write to the web application's output logs.", 
   "To configure the appropriate properties in struts-config.xml, you would do", 
   "something like this:", 
   "<data-source>", 
   "...", 
   "<set-property property=\"debug\" value=\"5\"/>", 
   "<set-property property=\"pingCommand\" value=\"rollback\"/>", 
   "...", 
   "</data-source>", 
   "Tested with PostgreSQL 7.0.3, using \"rollback\" as the ping command.", 
   "Patch partially based on submission from Ted Husted.", 
   "PR: Bugzilla #1827", 
   "Submitted by:\tJohan Compagner <jcompagner@j-com.nl>"
  ], 
  "revision_id": "48393"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-02T18:20:48.000000Z", 
  "msg": [
   "Port DTD updates for data sources to the HEAD branch."
  ], 
  "revision_id": "48392"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-02T18:18:25.000000Z", 
  "msg": [
   "Update the struts-config DTD (and the associated examples) to indicate", 
   "that <set-property> elements should be used to configure *all* properties", 
   "of any <data-source> element you provide.  This makes it easier to", 
   "substitute alternate data source implementations (the only Struts-based", 
   "requirment is that it must implement javax.sql.DataSource) and configure", 
   "it, with no dependencies on the struts-config DTD."
  ], 
  "revision_id": "48391"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-06-02T04:08:51.000000Z", 
  "msg": [
   "Subscribe and unsubscribe links."
  ], 
  "revision_id": "48390"
 }
]