[
 {
  "author": "taylor", 
  "date": "2006-12-08T19:53:04.647328Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/JS2-621", 
   "Improve SSO Portlet implementation", 
   "This is an ongoing work, this first patch applies to:", 
   "Fix bug in PersistenceBrokerSSOProvider.java with unscrambling passwords", 
   "Specifically doing a “.toString()” on a byte[] object.", 
   "As part of this correction we refactored both the scramble and unscramble methods to be a little", 
   "more human readable and debugger friendly.", 
   "The second change centers around the WebContentPortlet.doHttpWebContent() method.", 
   "We changed the return type from Boolean to a byte[].", 
   "This byte[] represents the refactored page that should be sent to the browser.", 
   "It seems that Jetspeed was properly logging in to the remote site, it would receive the", 
   "html back from that site and refactor it in preparation to send back to the browser but", 
   "it would not actually send it back to the browser. It would only return a boolean true", 
   "that indicated that it had successfully received that new data. It never actually sent it to the browser.", 
   "We tested these changes with the NY Times example in Jetspeed and seems to work", 
   "contribution from Joe Kueser and Tom Campbell of Gestalt, LLC"
  ], 
  "revision_id": "484715"
 }, 
 {
  "author": "barrettj", 
  "date": "2006-12-08T19:51:18.777617Z", 
  "msg": [
   "Change behavior of service.createDispatch(...) to require port be defined either in WSDL or dynamically via getPort or addPort if no WSDL provided."
  ], 
  "revision_id": "484714"
 }, 
 {
  "author": "nbubna", 
  "date": "2006-12-08T19:48:04.117365Z", 
  "msg": [
   "add recent changes"
  ], 
  "revision_id": "484713"
 }, 
 {
  "author": "nbubna", 
  "date": "2006-12-08T19:47:23.993036Z", 
  "msg": [
   "replace layout example with new, layout-based, much more useful showcase example"
  ], 
  "revision_id": "484712"
 }, 
 {
  "author": "nbubna", 
  "date": "2006-12-08T19:41:50.717709Z", 
  "msg": [
   "catch exceptions in eval() (as the javadoc has long claimed to), but make old behavior optional via config"
  ], 
  "revision_id": "484711"
 }
]