[
 {
  "author": "dwinterfeldt", 
  "date": "2001-08-15T17:41:50.000000Z", 
  "msg": [
   "Added a clearer description of the message attribute for the messages tag."
  ], 
  "revision_id": "48539"
 }, 
 {
  "author": "martinc", 
  "date": "2001-08-15T06:15:51.000000Z", 
  "msg": [
   "Allow disabling of the Struts multipart request handling mechanism, by", 
   "specifying 'none' as the value of the 'multipartClass' init-param."
  ], 
  "revision_id": "48538"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-13T21:40:00.000000Z", 
  "msg": [
   "Tweaks to the workflow management system proposal, based on feedback on", 
   "STRUTS-DEV and JAKARTA-COMMONS:", 
   "* Names of the static components that represent workflows has been changed", 
   "from \"Workflow -> Step\" to \"Process -> Activity -> Step\".", 
   "* A \"Process\" (i.e. business process) is the concept that was not", 
   "reflected in the initial design proposal, where a particular business", 
   "transaction might involve more than one person.", 
   "* An \"Activity\" is the notion of an interaction with a particular person", 
   "to accomplish a particular task.  In a web app, a wizard-style user", 
   "interaction would typically be implemented as an Activity.", 
   "* The notion of core (environment independent), web application (based", 
   "on servlet API but not any specific framework) and Struts integration", 
   "layers is spelled out more clearly.", 
   "* An initial codebase to play with and explore these ideas has been", 
   "checked in to the jakarta-commons-sandbox repository in directory", 
   "\"workflow\" -- it will contain only the lower two layers.  Struts", 
   "integration will happen within the jakarta-struts repository at some", 
   "future point, after the APIs settle down some.", 
   "NOTE:  If you check out and build the workflow code, you can execute a", 
   "trivial demo by typing \"ant demo\".  But you *must* use the most recent CVS", 
   "source version of the digester JAR (build property \"commons-digester.jar\"", 
   "in order to pick up some bugfixes related to namespace handling)."
  ], 
  "revision_id": "48537"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-11T03:49:19.000000Z", 
  "msg": [
   "Commit a *first* crack at thoughts on what a workflow system", 
   "implementation for Struts should look like.  Comments and suggestions are", 
   "very welcome!"
  ], 
  "revision_id": "48536"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-08-08T04:25:01.000000Z", 
  "msg": [
   "Do not declare the \"name\" attribute on the edit actions, because there is", 
   "no need to accept an input form and populate it's properties for these", 
   "actions.", 
   "However, use the \"attribute\" attribute to identify the key under which the", 
   "form bean will be stored for use by the subsequent \"save\" action."
  ], 
  "revision_id": "48535"
 }
]