[
 {
  "author": "agilliland", 
  "date": "2006-12-11T19:50:59.082923Z", 
  "msg": [
   "Mostly finishing off the process of moving the Roller Planet code into it's own project workspace so that it can be built as a standalone application separate from the Roller Weblogger code.", 
   "1. Moved Roller Planet business code to sandbox/planetroller.  This includes the PlanetManager and PlanetManagerImpl as well as all the planet pojos, plus one of the planet tasks which is not specific to the Weblogger app.", 
   "2. Copied some parts of the Weblogger codebase to the sandbox/planetroller codebase.  This is done to keep things working and in some cases this copied code can actually be moved into a shared Roller Core library so that it's not longer duplicated.  This includes the RollerException class and some various utility classes in roller.util.", 
   "3. Moved Roller Planet unit tests to sandbox/planetroller, where it makes the most sense.", 
   "4. Updated build process so that all Roller Planet operations can happen on their own: building, testing, etc.  NOTE: the link between the Planet and Weblogger build process is not fully flushed out and will need further refinement, but this commit is a start.", 
   "5. Reorganized some of the remaining Planet code left in the Weblogger src to be moved under the roller.planet package.  This was for the planet struts actions and formbeans.", 
   "6. Updated the Weblogger configuration to easily include the Roller Planet component as an addon module.  This meant tweaking the planet.properties file included with the Weblogger app as well as adding a planet-hibernate.cfg.xml to the Weblogger app for configuring the planet hibernate session factory."
  ], 
  "revision_id": "485845"
 }, 
 {
  "author": "ngallardo", 
  "date": "2006-12-11T19:47:31.111365Z", 
  "msg": [
   "AXIS2-1860", 
   "Contributor: Mike Rheinhiemer", 
   "Mike's patch for throwing the right exception type."
  ], 
  "revision_id": "485844"
 }, 
 {
  "author": "geirm", 
  "date": "2006-12-11T19:45:53.114623Z", 
  "msg": [
   "tweaks to build on windows"
  ], 
  "revision_id": "485843"
 }, 
 {
  "author": "dos", 
  "date": "2006-12-11T19:45:50.735953Z", 
  "msg": [
   "bug 4304: in some setups, eg where a plugin implements 'spamd_child_init' with a long-running task, it's possible for child spamd processes to take too long to exit when the parent spamd is killed with SIGINT or SIGTERM.  if the caller then starts a new spamd immediately, it will die with 'address already in use', since the old children are still running.  Fix this race by unblocking the signals as soon as possible in child spamds after they are forked, and before calling the plugin hook; also add test cases"
  ], 
  "revision_id": "485842"
 }, 
 {
  "author": "geirm", 
  "date": "2006-12-11T19:45:22.169084Z", 
  "msg": [
   "HARMONY-2180", 
   "additions to fix build on windows"
  ], 
  "revision_id": "485841"
 }
]