[
 {
  "author": "craigmcc", 
  "date": "2001-12-29T19:35:33.000000Z", 
  "msg": [
   "As each request passes through the controller servlet, call the new", 
   "Request.selectApplication() utility method.  This method will identify the", 
   "appropriate sub-application by matching prefixes, and then expose two request", 
   "attributes that are used for the remainder of the processing:", 
   "* The ApplicationConfig object for the current application is exposed", 
   "under key Action.APPLICATION_KEY", 
   "* The MessageResources object for the current application is exposed", 
   "under key Action.MESSAGES_KEY", 
   "Now, the remaining logic can be modified to consult these two request", 
   "attributes to make decisions that depend on the current sub-application.", 
   "NOTE -- This processing is NOT performed on direct requests for JSP pages --", 
   "it is only done on requests through the controller.  In a Servlet 2.3", 
   "environment we will be able to deal with that by moving this logic to a", 
   "filter that is mapped to all requests.  In the mean time, applications that", 
   "will operate in a multi-app controller environment MUST pass all of their", 
   "requests through the controller servlet to work properly.", 
   "NOTE -- I am assuming that data sources are still accessed directly by their", 
   "servlet context attribute keys, and that all data source key names are unique", 
   "across sub-applications."
  ], 
  "revision_id": "48764"
 }, 
 {
  "author": "craigmcc", 
  "date": "2001-12-29T00:24:46.000000Z", 
  "msg": [
   "Integrate the configuration of multiple sub-applications (using the new", 
   "ApplicationConfig object and its subtree).  For backwards compatibility,", 
   "the \"old way\" of configuring the default application (which corresponds to", 
   "the way that the one-and-only Struts application was configured previuosly)", 
   "is still performed, although the methods that comprise it have been", 
   "deprecated.", 
   "None of the actual functional logic in the controller servlet or any of the", 
   "custom tags yet looks at the new-style configuration objects -- that is the", 
   "next step."
  ], 
  "revision_id": "48763"
 }, 
 {
  "author": "vmassol", 
  "date": "2001-12-28T13:34:58.000000Z", 
  "msg": [
   "added Cactus unit tests packaging as part of the sample application. That enabled me to test the sample application and discover several issues that were preventing it from running ... :-). There is only a single Cactus unit test for the time being, the goal was to automate caqctus unit testing as part of the build process and automatic packaging."
  ], 
  "revision_id": "48762"
 }, 
 {
  "author": "martinc", 
  "date": "2001-12-28T07:20:00.000000Z", 
  "msg": [
   "Fixed a bug in the toHex() method which caused leading zeros to be omitted", 
   "from the string representation.", 
   "Note that I do not plan on incorporating this fix into Struts 1.0.1. This", 
   "method is currently used only to generate tokens which will be exactly", 
   "matched. As such, accuracy is less important than uniqueness. The lack of", 
   "accuracy should not constitute a showstopper for Struts 1.0.1.", 
   "PR: 5458", 
   "Submitted by: Marcelo Collao Huper"
  ], 
  "revision_id": "48761"
 }, 
 {
  "author": "martinc", 
  "date": "2001-12-28T07:11:38.000000Z", 
  "msg": [
   "Added new consultants to the resources list.", 
   "PR: 5534, 5540", 
   "Submitted by: Torben Norling, Frank Lawlor"
  ], 
  "revision_id": "48760"
 }
]