[
 {
  "author": "esm", 
  "date": "2006-12-16T01:25:43.369615Z", 
  "msg": [
   "[PLUTO-283]: Refactored SupportedModesServiceImpl - moved its initialization from the PortalDriverServlet to the DriverConfiguration like all the other services."
  ], 
  "revision_id": "487745"
 }, 
 {
  "author": "snoopdave", 
  "date": "2006-12-16T01:11:16.896822Z", 
  "msg": [
   "Updated DE translation from John Doe (LogicTechnics at gmx.net)"
  ], 
  "revision_id": "487744"
 }, 
 {
  "author": "jeremias", 
  "date": "2006-12-16T01:10:50.844865Z", 
  "msg": [
   "Register xml-apis-ext.jar as output result."
  ], 
  "revision_id": "487743"
 }, 
 {
  "author": "djd", 
  "date": "2006-12-16T00:54:35.193985Z", 
  "msg": [
   "DERBY-2164 Add some comments to EngineType class and clean up its use."
  ], 
  "revision_id": "487742"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-16T00:51:06.235762Z", 
  "msg": [
   "Refine the dialog framework APIs as a foundation for improving handling of", 
   "browser navigation buttons:", 
   "* Provide an \"escape hatch\" (getOpaqueState/setOpaqueState) such that a", 
   "DialogContext implementation can optionally request that additional", 
   "information be saved and restored with each JSF component tree that", 
   "is rendered.  There is a restriction that any such opaque state data", 
   "must be Serializable.", 
   "* Modify the two existing implementations to obey the updated API", 
   "contract,but otherwise do nothing at the moment.", 
   "* Refactor DialogPhaseListener a bit:", 
   "- Make Constants.CONTEXT_ID_ATTR a private constant in this class.", 
   "This information is a private implementation detail.", 
   "- Create a private beforeRenderResponse() method, parallel to the", 
   "existing afterRestoreView() method, in case we have to deal with", 
   "more phases later.  These are private APIs, so no disruption of", 
   "apps can occur", 
   "- Implement the saving and restoring of opaque data, if requested", 
   "by the DialogContext implementation.  If saved, it will be stored", 
   "as another generic attribute on the view root component, but (again)", 
   "this is an implementation detail not visible to callers.", 
   "SHALE-61"
  ], 
  "revision_id": "487741"
 }
]