[
 {
  "author": "snoopdave", 
  "date": "2006-12-16T05:16:12.181155Z", 
  "msg": [
   "Adjusted comment for 'aggregated site-wide frontpage'"
  ], 
  "revision_id": "487760"
 }, 
 {
  "author": "dims", 
  "date": "2006-12-16T05:14:55.094790Z", 
  "msg": [
   "Fix for the InvalidClassException i was having (and others were having sporadically). Problem is similar to the one in GERONIMO-1020. Unless the exact same jar is used for ser/de-ser, we get InvalidClassException, if you build the geronimo-kernel-xxx-SNAPSHOT.jar on your box and the maven2 pulls another SNAPSHOT jar from the remote repo, you are %&^*&ed"
  ], 
  "revision_id": "487759"
 }, 
 {
  "author": "snoopdave", 
  "date": "2006-12-16T05:09:01.348341Z", 
  "msg": [
   "Added conditional register, login, logout links"
  ], 
  "revision_id": "487758"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-16T04:06:37.483250Z", 
  "msg": [
   "Define an adapter layer for logging that delegates to Apache Commons Logging", 
   "(if present), or JDK 1.4+ logging (if present), or writes to System.out.", 
   "Shale Remoting functional logic has not yet been modified to utilize these", 
   "adapters (to make it easy to review them separately, or consider placing them", 
   "in a shared module for use by other Shale modules).", 
   "There was pushback on SHALE-281 related to switching to JDK 1.4 logging", 
   "unconditionally, but this change (once completed) would allow the Commons", 
   "Logging dependency in Shale Remoting to be marked optional.  This is", 
   "particularly important for this module, because it will often be used in a", 
   "manner independent of the rest of the framework (such as embedded within a", 
   "JSF component library), and therefore should have zero required dependencies", 
   "outside the platform APIs that must be provided (servlet, JSP, JSF)."
  ], 
  "revision_id": "487757"
 }, 
 {
  "author": "snoopdave", 
  "date": "2006-12-16T03:49:25.360403Z", 
  "msg": [
   "Fixing a couple of test bugs that caused refreshEntries to fail"
  ], 
  "revision_id": "487756"
 }
]