[
 {
  "author": "chatra", 
  "date": "2006-12-20T14:33:18.141885Z", 
  "msg": [
   "did modifications regarding target directory"
  ], 
  "revision_id": "489100"
 }, 
 {
  "author": "gnodet", 
  "date": "2006-12-20T14:25:01.417396Z", 
  "msg": [
   "Fix poms due to wsdl4j dependency becoming optional"
  ], 
  "revision_id": "489099"
 }, 
 {
  "author": "kenney", 
  "date": "2006-12-20T14:22:32.010874Z", 
  "msg": [
   "Merged revisions 482819:HEAD from sandbox/surefire-plugin-merge and deleted surefire-plugin-merge", 
   "Relevant log from https://svn.apache.org/repos/asf/maven/sandbox/surefire-plugin-merge@489097:", 
   "(too bad merge doesn't record the diversion and insert the proper logs)", 
   "------------------------------------------------------------------------", 
   "r488512 | kenney | 2006-12-19 04:22:14 +0100 (Tue, 19 Dec 2006) | 5 lines", 
   "PR: MSUREFIRE-119", 
   "use 'UNKNOWN' for the method test name if no getName method is supplied.", 
   "Whatever value is used here doesn't seem to matter, though.", 
   "------------------------------------------------------------------------", 
   "r488511 | kenney | 2006-12-19 03:57:36 +0100 (Tue, 19 Dec 2006) | 11 lines", 
   "PR: MSUREFIRE-151", 
   "Fix 'No test frameworks available' when junit is not specified.", 
   "Fall back to the JUnit provider anyway, since it contains POJO support.", 
   "Btw, when first compiling a project with jUnit as a dep and JUnit testcode,", 
   "then removing src/test/java, followed by 'mvn test', the tests run normally.", 
   "Tested with a POJO test.", 
   "------------------------------------------------------------------------", 
   "r488508 | kenney | 2006-12-19 03:38:09 +0100 (Tue, 19 Dec 2006) | 13 lines", 
   "PR: MSUREFIRE-115, MSUREFIRE-121", 
   "Add boolean parameter 'useSystemClassLoader', used when forking tests, to put all tests", 
   "in the System classloader.", 
   "I also found a nice way to circumvent the possibly long commandline arguments when specifying", 
   "all classpath elements (and dependencies) at the '-classpath' parameter: I create an empty", 
   "uncompressed jar with a Main-Class attribute for SurefireBooter and a Class-Path entry containing", 
   "all the classpath elements. The fork is then done using 'java -jar'.", 
   "I do NOT allow a partial classpath to be specified with -classpath since that either requires", 
   "duplicate classpath entries, or all dependencies to be specified on the commandline too.", 
   "------------------------------------------------------------------------", 
   "r488451 | kenney | 2006-12-19 00:12:35 +0100 (Tue, 19 Dec 2006) | 19 lines", 
   "Don't add surefire boot classpath entries to surefire classpath entries.", 
   "Moved methods in surefirebooter to more logical place.", 
   "updated pom.xml: set surefire plugin version to use to 2.3-SNAPSHOT, which", 
   "has fixes (for quite some time now) to NOT add all the test classpath elements", 
   "to the surefire classpath elements.", 
   "Using the old plugin, the target/classes was in both loaders, and the surefire loader", 
   "had both the surefire plugin and the report plugin (which uses the new api) in the same", 
   "classloader.", 
   "By chance, the jar from the local repo (2.0) takes precedence. The surefire-report-plugin's", 
   "unit tests fail, since the ReportEntry from that project is not used, but the one from", 
   "the local repo, which is missing a constructor.", 
   "All this is fixed now - clean separation of classloaders and no duplicate entries in the", 
   "classpaths for the 3 loaders (system, tests, surefire). (Btw, this was fixed long ago", 
   "but the wrong plugin was used so due to a faulty surefire plugin the unit tests fail", 
   "on some systems due to jvm implementation differences).", 
   "------------------------------------------------------------------------", 
   "r488250 | kenney | 2006-12-18 13:37:07 +0100 (Mon, 18 Dec 2006) | 25 lines", 
   "Fix cyclic dep - move surefire config to pluginManagement.", 
   "Remove childDelegation configuration - it is no longer functional.", 
   "(the classloader is now 2 classloaders: tests-classloader with no parent, so", 
   "the setting doesn't apply anymore, and the surefire classloader, which has", 
   "tests-classloader as parent and always has childDelegation to false).", 
   "Add commented out forkMode never configuration, because I get a NoClassDefFound error when", 
   "the test for surefire-reporting-plugin is forked, running from the root pom.", 
   "Running from the report project itself works fine. Also, commenting out the", 
   "surefire-booter project from the modules section fixes this.", 
   "Uncomment to get a working build. I'm leaving this commented out so we don't forget to fix this.", 
   "------------------------------------------------------------------------", 
   "r482819 | handyande | 2006-12-05 23:59:16 +0100 (Tue, 05 Dec 2006) | 2 lines", 
   "merge in the maven-surefire-plugin and maven-surefire-remote-plugin, some pom modification along the way", 
   "surefire plugin is disabled for now, this is the topic of discussion", 
   "------------------------------------------------------------------------", 
   "r482817 | handyande | 2006-12-05 23:53:55 +0100 (Tue, 05 Dec 2006) | 1 line", 
   "create a sandbox for the combined surefire and maven-surefire-plugins", 
   "------------------------------------------------------------------------"
  ], 
  "revision_id": "489098"
 }, 
 {
  "author": "jhm", 
  "date": "2006-12-20T14:21:25.721238Z", 
  "msg": [
   "Make the tests runnable on systems without regexp matchers (e.g. JDK 1.2 without ORO)."
  ], 
  "revision_id": "489097"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2006-12-20T14:10:01.293629Z", 
  "msg": [
   "Updating Eclipse SWT dependency for each OS and Arch with latest version (3.2.1)."
  ], 
  "revision_id": "489096"
 }
]