[
 {
  "author": "craigmcc", 
  "date": "2002-03-10T00:37:17.000000Z", 
  "msg": [
   "Refine logging levels so that an INFO message is produced once per request,", 
   "with DEBUG and TRACE level messages for progressively more detailed tracking", 
   "of what is going on."
  ], 
  "revision_id": "48934"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-03-09T22:26:35.000000Z", 
  "msg": [
   "Switch to the non-deprecated log factory mechanism from commosn logging 1.0."
  ], 
  "revision_id": "48933"
 }, 
 {
  "author": "martinc", 
  "date": "2002-03-07T00:24:34.000000Z", 
  "msg": [
   "Fix a problem involving tag handler reuse, where an attribute value of the", 
   "tag was being assigned within the tag handler. This fixes the same bug the", 
   "previous change was intended to fix.", 
   "Submitted by: Matt Read"
  ], 
  "revision_id": "48932"
 }, 
 {
  "author": "mschachter", 
  "date": "2002-03-06T19:44:08.000000Z", 
  "msg": [
   "- whoops. missed a few."
  ], 
  "revision_id": "48931"
 }, 
 {
  "author": "mschachter", 
  "date": "2002-03-06T19:39:09.000000Z", 
  "msg": [
   "- Extracted/rewrote all multipart parsing logic to MultipartBoundaryInputStream,", 
   "supplied unit test", 
   "- Refactored classes accordingly", 
   "- Bug #2017, Encoding Issues: MultipartIterator now looks for the character", 
   "encoding first in the content type of the element, then uses HttpServletRequest's", 
   "getCharacterEncoding if that's not availabe. Otherwise it uses the default", 
   "encoding. I've been unable to verify whether this works, as I haven't been", 
   "able to properly set either of the necessary parts to make it work. It will", 
   "be verified and working by the final release though.", 
   "- Bug #2757, Redirection not working; still unaddressed", 
   "- Bug #4170, MaxLengthExceededException: No longer throws exception, error", 
   "is handled through ActionForm validation and request attributes, example", 
   "is in struts-upload webapp. But... the webapp example only seems to work", 
   "in Mozilla 0.9.8 (or does it only work with a persistent connection...)", 
   "That will be fixed before 1.1 final.", 
   "There might be some wrinkles, but overall file upload is better off than it", 
   "was before."
  ], 
  "revision_id": "48930"
 }
]