[
 {
  "author": "apetrenko", 
  "date": "2006-12-21T12:44:35.024061Z", 
  "msg": [
   "Patch for HARMONY-1691 \"[claaslib][rmi]java.rmi.server.LogStream.write(byte[], int,int) does not throw IndexOutOfBoundsException in case of boundary violation\""
  ], 
  "revision_id": "489340"
 }, 
 {
  "author": "kelvingoodson", 
  "date": "2006-12-21T12:39:44.229065Z", 
  "msg": [
   "TUSCANY-684 added register(HelperContext scope) method to generated Factory instance -- also added an introspectable pattern version to the Factory implementation, and commentary to the generated classes on the options that were used to generate the classes."
  ], 
  "revision_id": "489339"
 }, 
 {
  "author": "schor", 
  "date": "2006-12-21T12:32:25.859041Z", 
  "msg": [
   "UIMA-121 For PDF output, format Notes/Tips to not have a", 
   "paragraph break between the callout and the 1st (and usually", 
   "only) paragraph."
  ], 
  "revision_id": "489338"
 }, 
 {
  "author": "jacopoc", 
  "date": "2006-12-21T12:12:28.793790Z", 
  "msg": [
   "Some minor refactorings to the way the billing account is set in the cart: now it is sufficient to set the billing account id using the setBillingAccount* methods (already available) and it is no more necessary to set the payment method to EXT_BILLACT in the cart.", 
   "In fact the correct OrderPaymentPreference for the billing account is created by the cart when the order is created (if a billingAccountId is set).", 
   "So now, if you want to add a billing account to the cart you can simply do this:", 
   "cart.setBillingAccount(billingAccountId, maxAmount);", 
   "and you can remove the billing account from the cart with:", 
   "cart.setBillingAccount(null, 0.0);", 
   "This also fixes a bug that was happening when a billing account was selected and an error was returned (no credit available): the EXTBILLACT method was left in the cart, leading to an incorrect order."
  ], 
  "revision_id": "489337"
 }, 
 {
  "author": "robbinspg", 
  "date": "2006-12-21T12:12:15.742202Z", 
  "msg": [
   "Best guess for element namespace when writing xml"
  ], 
  "revision_id": "489336"
 }
]