[
 {
  "author": "rahul", 
  "date": "2006-12-28T00:20:17.438247Z", 
  "msg": [
   "Publish shale-dialog-scxml dialog-config.xml DTD to site.", 
   "SHALE-348"
  ], 
  "revision_id": "490610"
 }, 
 {
  "author": "jboynes", 
  "date": "2006-12-28T00:18:23.948337Z", 
  "msg": [
   "add a hanlder for changeSets encoded as XML"
  ], 
  "revision_id": "490609"
 }, 
 {
  "author": "rahul", 
  "date": "2006-12-28T00:05:28.956919Z", 
  "msg": [
   "Allow building shale-test with JDK 1.4 (important as most of framework depends on it). With the JSF 1.2 bits coming in place for shale-test, the Java EE 5 artifacts (JSF 1.2, Servlet 2.5, JSP 2.1 jars) that are pulled in are built with JDK 1.5, causing compilation (and thus, build) failures on JDK 1.4 (as expected).", 
   "Therefore, introduce two profiles in the shale-test pom (correct one gets activated automagically based on JDK version in use, so nothing needs to be done at the mvn command).", 
   "The shale-test-jdk14 profile depends on {myfaces-api-1.1.4,servlet 2.4,JSP 2.0} and excludes the sources that use Java EE 5 APIs. Thus, when built on JDK 1.4, the shale-test jar caters only to JSF 1.1 users.", 
   "The shale-test-jdk15 profile depends on {jsf-1.2_02,servlet 2.5,JSP 2.1} (and excludes nothing).", 
   "As a side-effect, when using the mock factories with a jar built with JDK 1.4, trying to load the JSF 1.2 classes may fail with a ClassNotFoundException (since the classes never get built in the first place). Code now accomodates for that.", 
   "Finally, this does introduce one additional thing to maintain. shale-test developers need to keep the exclusions in the 1.4 profile updated to this can continue to work beyond v1.0.4 (until we decide to drop JDK 1.4 support).", 
   "With this change, 'mvn -Papps install' from framework trunk works for me with JDK 1.4.", 
   "SHALE-375"
  ], 
  "revision_id": "490608"
 }, 
 {
  "author": "ab", 
  "date": "2006-12-28T00:03:04.371683Z", 
  "msg": [
   "This patch addresses several issues:", 
   "* NUTCH-415 - Generator should mark selected records in CrawlDb.", 
   "Due to increased resource consumption this step is optional.", 
   "Application-level locking has been added to prevent concurrent", 
   "modification of databases.", 
   "* NUTCH-416 - CrawlDatum status and CrawlDbReducer refactoring. It is", 
   "now possible to correctly update CrawlDb from multiple segments.", 
   "Introduce new status codes for temporary and permanent", 
   "redirection.", 
   "* NUTCH-322 - Fix Fetcher to store redirected pages and to store", 
   "protocol-level status. This also should fix NUTCH-273.", 
   "* Change default Fetcher behavior not to follow redirects immediately.", 
   "Instead Fetcher will record redirects as new pages to be added to CrawlDb.", 
   "This also partially addresses NUTCH-273.", 
   "* Detect and report when Generator creates 0-sized segments.", 
   "* Fix Injector to preserve already existing CrawlDatum if the seed list", 
   "being injected also contains such URL.", 
   "This development was partially supported by SiteSell Inc."
  ], 
  "revision_id": "490607"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-27T23:54:24.660943Z", 
  "msg": [
   "Add Joost Schouten as a contributor (SHALE-372, SHALE-373)"
  ], 
  "revision_id": "490606"
 }
]