[
 {
  "author": "jerenkrantz", 
  "date": "2006-12-29T06:42:08.904294Z", 
  "msg": [
   "Always initialize ->method_string.", 
   "* flood_round_robin.c", 
   "(parse_xml_url_info): If we don't have a method attribute, set ->method_string", 
   "to GET."
  ], 
  "revision_id": "490925"
 }, 
 {
  "author": "dims", 
  "date": "2006-12-29T06:05:37.429155Z", 
  "msg": [
   "woohoo! all our perf fixes are in! (http://www.nabble.com/Woodstox-3.2.0-released-%28SAX2-API-impl%2C-writer-side-fixes%29-tf2893457.html#a8084071)"
  ], 
  "revision_id": "490924"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-29T05:53:16.221130Z", 
  "msg": [
   "[SHALE-381] First pass at abstracting out the Rolodex APIs into a generic", 
   "API module, plus an initial implementation for a memory-based database.", 
   "At least the following FIXME issues need to be addressed:", 
   "* Add a helper class to shale-rolodex-dao which returns the JSF", 
   "SelectItem[] lists relevant to a webapp.  JSF will be an optional", 
   "dependency, because you should only need the extra class in a JSF app.", 
   "* Flesh out the Digester rules and loading of the default resources for", 
   "shale-rolodex-dao-memory", 
   "* Construct a JPA based implementation (shale-rolodex-dao-jpa) as well,", 
   "both to verify the accuracy of the basic APIs and to support apps that", 
   "want a persistent data version of this.", 
   "* Probably at shale-goodies due to LGPL issues, do the same for a", 
   "pure Hibernate implementation."
  ], 
  "revision_id": "490923"
 }, 
 {
  "author": "craigmcc", 
  "date": "2006-12-29T05:39:55.061545Z", 
  "msg": [
   "First pass at updating the API stability page for SHALE-379.  Major changes:", 
   "* Divide into two tables, one for app developers and one for", 
   "framework extenders, with a column for which module jar contains", 
   "the corresponding classes.", 
   "* FIXME - need to review whether shale-clay classes are intended", 
   "for direct application use.", 
   "* FIXME - need to review the proposed stability rankings and add", 
   "any relevant additional comments."
  ], 
  "revision_id": "490922"
 }, 
 {
  "author": "jonesde", 
  "date": "2006-12-29T05:30:28.085909Z", 
  "msg": [
   "Now that this is an ASF project Andy and I shouldn't be pulling funds for even this, so I changed it to the ASFs amazon account"
  ], 
  "revision_id": "490921"
 }
]