[
 {
  "author": "husted", 
  "date": "2002-07-07T18:45:18.000000Z", 
  "msg": [
   "Change \"convertHack\" to \"convertNull\" so that we don't have the H-word in the public API (jeez, this guy is ~such~ a spoil-sport =:0) and also to use a more descriptive term. Also, after trying it both ways in various contexts (:don't tell my wife:), change documentation to use term \"application module\" for \"sub-application\" and \"module-relative\" for \"application-context\". Corresponding changes to other documentation to follow."
  ], 
  "revision_id": "49264"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-07-07T02:26:12.000000Z", 
  "msg": [
   "Check in a list of the remaining bugs reported against 1.1 (or the recent", 
   "nightly builds).  Please update this list as you check in bugfixes for them,", 
   "or as new bugs are reported.", 
   "I'm going to need some assistance on the bugs in file upload, tiles, and", 
   "validator since they aren't my area of expertise!"
  ], 
  "revision_id": "49263"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-07-07T02:24:24.000000Z", 
  "msg": [
   "Document the restrictions on using <bean:include> against a resource", 
   "protected by a security constraint, or in the /WEB-INF subdirectory.", 
   "Applications should use <jsp:include ... flush=\"false\"/>, or the <c:import>", 
   "tag from the JSP Standard Tag Library (JSTL) to perform these tasks."
  ], 
  "revision_id": "49262"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-07-06T23:36:30.000000Z", 
  "msg": [
   "Make <html:submit> no longer generate a \"name\" attribute unless a \"property\"", 
   "element on <html:submit> is explicitly specified.  This avoids Javascript", 
   "problems with the default name that as being created (\"submit\").", 
   "For consistency, make <html:reset> operate in the same manner.", 
   "Based on a patch submitted by Ben Tomasini -- thanks!", 
   "PR: Bugzilla #9594", 
   "Submitted by:\tBen Tomasini <btomasini at neteverything.com>"
  ], 
  "revision_id": "49261"
 }, 
 {
  "author": "husted", 
  "date": "2002-07-06T19:11:06.000000Z", 
  "msg": [
   "Update JavaDoc"
  ], 
  "revision_id": "49260"
 }
]