[
 {
  "author": "ritchiem", 
  "date": "2007-01-12T01:03:21.812801Z", 
  "msg": [
   "QPID-146 QPID-112 QPID-278", 
   "Summary", 
   "Reworked a lot of the distribution work done by the build system.", 
   "This ended up with me creating a reduced client distribution (hope that is ok Steve)", 
   "Each module now has has a distribution directory (except common it may need a tests build later) This will build the individual components in to a distribution binary only, binary with tests and source.", 
   "To build the binary with tests in the distribution directory use profile tests so $mvn -Ptests", 
   "In all cases the dependencies have been reduced and correctly assigned to the correct scope.", 
   "There were a couple of cases where a runtime dependency of one of our dependencies didn't make it in to the distributions so they were added explicitly. This should be looked at again.", 
   "Specifics", 
   "Broker:", 
   "Three new assembly files are located in the distribution/src directory (broker-bin taking heavily from distribution - bin) these generate the three distributions.", 
   "SimpleFilterManager.java removed slf4j reference", 
   "broker/test directory removed as it was left over from the ant system", 
   "Client:", 
   "Added intelij files to ignore list.", 
   "client/dist deleted as it was left over from the ant system", 
   "client/distribution as for the broker three assemblies matching the three distributions", 
   "Renamed log4j.properties to client.log4j to prevent issues when it is packaged into the jar.", 
   "Removed old_test ping and requestreply1 as they have been moved to perftests", 
   "Moved broker back to a test dependency. This required modifying AMQSession.java to remove reference to ExchangeBoundHandler.java", 
   "Common:", 
   "Added more common dependencies from broker and client here.", 
   "Distribution:", 
   "Reduced the assemblies to only build the full project binary, binary with tests and source.", 
   "Perftests:", 
   "Added building of perftests distribution so this can be bundled separately.", 
   "Resources:", 
   "Moved Resources from distribution project to root level this allows them to be easily incorporated in all projects.", 
   "Systests:", 
   "as with perftests now builds a separate distribution that can be used on an existing installation.", 
   "renamed log4j.properties to systests.log4j to prevent logging problems.", 
   "As systests is a module having the code under the test folder isn't accurate as it is the main code. Test code here should be testing the tests :D !!"
  ], 
  "revision_id": "495455"
 }, 
 {
  "author": "", 
  "date": "2007-01-12T01:02:54.454892Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "495454"
 }, 
 {
  "author": "sebor", 
  "date": "2007-01-12T00:56:15.392926Z", 
  "msg": [
   "2007-01-11  Martin Sebor  <sebor@roguewave.com>", 
   "* numpunct.cpp (make_german_locale): Corrected a logic error", 
   "introduced in revision 431272."
  ], 
  "revision_id": "495453"
 }, 
 {
  "author": "jdillon", 
  "date": "2007-01-12T00:25:25.594167Z", 
  "msg": [
   "Configure DM for:", 
   "geronimo-annotation_1.0_spec 1.0", 
   "geronimo-ejb_3.0_spec 1.0", 
   "geronimo-interceptor_3.0_spec 1.0", 
   "geronimo-jpa_3.0_spec 1.0", 
   "geronimo-jta_1.1_spec 1.0"
  ], 
  "revision_id": "495452"
 }, 
 {
  "author": "rajith", 
  "date": "2007-01-12T00:17:13.931634Z", 
  "msg": [
   "new class to hold message headers"
  ], 
  "revision_id": "495451"
 }
]