[
 {
  "author": "agilliland", 
  "date": "2007-01-12T16:58:10.513028Z", 
  "msg": [
   "Fixes for race conditions in lock acquisition via HibernateThreadManagerImpl from Jira issue ROL-1306.  A number of fixes are included in this commit ...", 
   "1. Added a database uniqueness constraint on the roller_tasklock.name column to", 
   "prevent any possibility of there being duplicate insertions for a given task lease.", 
   "2. Updated the acquireLock() method to use a more robust acquisition method based on a single sql update statement as suggested by Elias.  This should adequately eliminate race conditions when 2 or more members of a cluster attempt to acquire a lock at the same time.", 
   "3. Updated the acquireLock() method to perform all lease activities based on database time, which should negate any potential clock skew issues between cluster", 
   "members.", 
   "4. Introduced a new clientId attribute for a task which makes it possible for each member of a cluster to be uniquely identified with regards to ownership of a", 
   "lease."
  ], 
  "revision_id": "495640"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-01-12T16:57:58.195076Z", 
  "msg": [
   "QPID-285", 
   "Added MultipleClients script that allows the specification of the number of clients to run.", 
   "The output from this is not very clear as all clients write to a file and the Provider doesn't quit automatically so it is set to quit after a set time based on the number of messages."
  ], 
  "revision_id": "495639"
 }, 
 {
  "author": "tellison", 
  "date": "2007-01-12T16:57:50.851625Z", 
  "msg": [
   "Apply patch HARMONY-2989 ([classlib][sql] Several methods signatures are not compatible with spec in javax.sql.rowset.serial package)"
  ], 
  "revision_id": "495638"
 }, 
 {
  "author": "jm", 
  "date": "2007-01-12T16:53:30.071066Z", 
  "msg": [
   "oops, C++-style comment. bad Justin.  also fix the test, which wasn't failing"
  ], 
  "revision_id": "495637"
 }, 
 {
  "author": "mturyn", 
  "date": "2007-01-12T16:51:44.910162Z", 
  "msg": [
   "Removed underlining from links since it looked bad for the default font.", 
   "Made default color \"blue\", since there's no longer an underline to mark the link.", 
   "Made color a darker blue on mouseover."
  ], 
  "revision_id": "495636"
 }
]