[
 {
  "author": "abrown", 
  "date": "2007-01-12T21:53:04.228256Z", 
  "msg": [
   "DERBY-64 (partial): Implement CREATE TABLE ... AS ... WITH NO DATA", 
   "functionality in accordance with SQL 2003 standards.  In this patch:", 
   "- SQLState.java and messages.xml were modified to add three messages", 
   "to flag various errors. These error messages are similar to those", 
   "used by CREATE VIEW.", 
   "- sqlgrammer.jj was modified to support the following syntax:", 
   "CREATE TABLE new_table AS subquery WITH [NO] DATA", 
   "- CreateTableNode.java was modified to define a new init method to", 
   "take a result column list and a query expression. The bindStatement", 
   "method was modified to bind the quiery expression and create the", 
   "table element list from the result column list and the query", 
   "expression.", 
   "- A new JUnit test, CreateTableFromQueryTest, was added to the lang", 
   "suite.", 
   "The current patch does not implement the WITH DATA option.", 
   "Contributed by James F. Adams (derby@xemaps.com)"
  ], 
  "revision_id": "495750"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-01-12T21:49:07.679018Z", 
  "msg": [
   "fix bug in folder save action where updates where not taking effect."
  ], 
  "revision_id": "495749"
 }, 
 {
  "author": "ppoddar", 
  "date": "2007-01-12T21:49:05.844644Z", 
  "msg": [
   "Modified handling of class level UniqueConstraints to be similar to field level constraints."
  ], 
  "revision_id": "495748"
 }, 
 {
  "author": "mrglavas", 
  "date": "2007-01-12T21:48:00.832538Z", 
  "msg": [
   "Fixing JIRA Issue #1221:", 
   "http://issues.apache.org/jira/browse/XERCESJ-1221", 
   "E13 [1] of the XML 1.0 3rd edition errata clarifies that even internal parameter entity references", 
   "are enough to make undeclared entities into mere validity errors rather than well-formedness errors.", 
   "Xerces was reporting a fatal error for undeclared entities in a document containing any parameter", 
   "entities (not just internal ones). This should be fixed now.", 
   "[1] http://www.w3.org/XML/xml-V10-3e-errata#E13"
  ], 
  "revision_id": "495747"
 }, 
 {
  "author": "joachim", 
  "date": "2007-01-12T21:40:47.227975Z", 
  "msg": [
   "initial commit for JAMES-761, only partial working"
  ], 
  "revision_id": "495746"
 }
]