[
 {
  "author": "kenney", 
  "date": "2007-01-19T13:43:11.513380Z", 
  "msg": [
   "Enable all tests again"
  ], 
  "revision_id": "497810"
 }, 
 {
  "author": "stefan", 
  "date": "2007-01-19T13:34:32.761235Z", 
  "msg": [
   "JCR-713: ConcurrentModificationException during registration of nodetypes"
  ], 
  "revision_id": "497809"
 }, 
 {
  "author": "kenney", 
  "date": "2007-01-19T13:27:44.746253Z", 
  "msg": [
   "Fix IT0043.", 
   "With a clean repo, the help plugin is not available.", 
   "Since the central repo was overridden to /tmp/emptyRepo,", 
   "it can not be retrieved.", 
   "Solved this by moving the project to child2, which has", 
   "a dep on child1, and adding a parent pom.", 
   "Child1 makes sure the help plugin is available because it doesn't", 
   "override central.", 
   "Also, because of MPH-21, I had to use the 2.0.2 snapshot version.", 
   "Previously there was only 1 project in the reactor, so the effective pom", 
   "only contained one project. 2.0.1 will write ALL poms in 1 file,", 
   "and the it test fails since 'repo1.maven.org' is in that file, though", 
   "not in the child2 project.", 
   "Further, I found a new/old bug, where if you DON'T specify the 2.0.2-snap", 
   "in child2, maven-artifact tries to resolve the help plugin from the central", 
   "repo, which fails because it's empty (/tmp/emptyRepo).", 
   "It then does NOT use the available metadata in the local repo to get the", 
   "proper plugin version, but simply fails with the message that no valid", 
   "version for the help plugin could be found.", 
   "Even specifying the snapshot plugin repo in child2 doesn't matter - it is not", 
   "searched.", 
   "UPDATE: as a sideeffect, this also fixed it0075. The problem with the original", 
   "setup of this IT was that it created an empty maven-metadata-central.xml", 
   "for the maven-help-plugin, and due to MNG-900 (and not specifying the explicit", 
   "version), it0075 failed because it thinks there are no versions for the plugin.", 
   "IMPORTANT: this IT should NOT modify the metadata in the local repo outside", 
   "the normal maven operations, for instance storing WRONG metadata for central,", 
   "as this metadata came from an empty dir instead of the real repository."
  ], 
  "revision_id": "497808"
 }, 
 {
  "author": "husted", 
  "date": "2007-01-19T13:26:15.311183Z", 
  "msg": [
   "WW-1588 Update POMs for 2.0.4-SNAPSHOT (as discussed)."
  ], 
  "revision_id": "497807"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2007-01-19T13:23:57.757673Z", 
  "msg": [
   "Removing ldapstudio-dsml-command, ldapstudio-dsml-plugin and ldapstudio-importexport-plugin projects from trunks. Fixing a bug that prevented to build LDAP Studio for Mac OS X any system other than Mac OS X."
  ], 
  "revision_id": "497806"
 }
]