[
 {
  "author": "keithc", 
  "date": "2007-01-20T02:53:42.497757Z", 
  "msg": [
   "1. Added a map to axisservice which holds httplocation to axisoperation mapping. Used to dispatch rest messages.", 
   "2. Added a couple of constants", 
   "3. Added safty property to axisoperation, populated the map above", 
   "3. Added couple of default values", 
   "4. Added CONTENT_TYPE_OF_FAULT to hold the content type of a fault message", 
   "5. Updated to support httpLocation templating", 
   "6. Added method applyURITemplating which can be used by both restsender and soapsender to perform URITemplating", 
   "7. Fixed status code of one way operation of rest message and add headers if responce is gzip", 
   "8. Added media types MEDIA_TYPE_MULTIPART_FORM_DATA, MEDIA_TYPE_APPLICATION_ECHO_XML", 
   "9. Changed the tranfer coding header (Still not sure which header to use, must fix it once get confirmation from w3c member)", 
   "10. Updated to handle MEDIA_TYPE_MULTIPART_FORM_DATA content type, fixed location templating.", 
   "11. Fixed dataout of fault message in rest case, added support to gzip output messages", 
   "12. Updated to read MEDIA_TYPE_MULTIPART_FORM_DATA encoded messages and fixed it to work correctly with application/x-www-form-urlencoded", 
   "content type", 
   "13. Used to create a complex part when creating a multipart request entity", 
   "14. Fixed a bug. Need to create appropriate soap factory. It was always creating SOAP 11 stuff", 
   "15. Fixed to dispatch rest messages using the newly addes map to axisservice", 
   "16. added cabability to schemaUtil to extract data from multipart messages and also to handle custom quaryParameterSeparator", 
   "17. AxisServiceBasedMultiLanguageEmitter updated to use default httpMethod (when operation safty is involved). Added mustUnderstand to intermediate XML"
  ], 
  "revision_id": "498050"
 }, 
 {
  "author": "markt", 
  "date": "2007-01-20T02:47:25.500542Z", 
  "msg": [
   "Improved patch for 39088 based on patch by Wouter Zelle."
  ], 
  "revision_id": "498049"
 }, 
 {
  "author": "jdcasey", 
  "date": "2007-01-20T02:45:20.979014Z", 
  "msg": [
   "Fixing plugin-discovery when one plugin depends on another, and the pluginCollector sees a plugin before that plugin is meant to be added with its componentRealm."
  ], 
  "revision_id": "498048"
 }, 
 {
  "author": "dain", 
  "date": "2007-01-20T02:43:53.510382Z", 
  "msg": [
   "App interface must be passed as first interface to ProxyManager or the wrong classloader will be selected"
  ], 
  "revision_id": "498047"
 }, 
 {
  "author": "dain", 
  "date": "2007-01-20T02:42:47.387246Z", 
  "msg": [
   "Get services from system instance instead of assembler context."
  ], 
  "revision_id": "498046"
 }
]