[
 {
  "author": "husted", 
  "date": "2002-12-01T20:22:41.000000Z", 
  "msg": [
   "Move sections 4.6.2 through 4.7.4.2 and 4.8 to a new chapter (\"Configuring Applications\") to be uploaded later.", 
   "Add references to new chapter, but no content changes."
  ], 
  "revision_id": "49929"
 }, 
 {
  "author": "husted", 
  "date": "2002-12-01T16:03:22.000000Z", 
  "msg": [
   "Proof-reading / formatting / spell-check pass. No significant content changes.", 
   "Most of the changes are line-wraps from applying the coding rules to our XML:", 
   "* Line wraps at column 78.", 
   "* Sentences (\"statements\") begin a new line.", 
   "Starting a new line at each sentence minimizes future changes, since the rest of the paragraph does not need to be re-wrapped.", 
   "It also helps highlight longer sentences (a readability issue).", 
   "Other conventions:", 
   "* For paragraph and paragraph-like elements (UL, LI, TD), the element is placed above and below the text to increase legibility.", 
   "* Single space between paragraph-like elements, unless there is only one element in the block.", 
   "I apologize if this annoys anyone, but the XML formatting is getting out of control", 
   "and it's sometimes difficult to make routine changes.", 
   "I didn't use a specific tool to do this,but just applied the rules during an overall review of the documentation."
  ], 
  "revision_id": "49928"
 }, 
 {
  "author": "rleland", 
  "date": "2002-12-01T01:24:22.000000Z", 
  "msg": [
   "Remove Link"
  ], 
  "revision_id": "49927"
 }, 
 {
  "author": "dmkarr", 
  "date": "2002-11-30T22:25:16.000000Z", 
  "msg": [
   "Added detailed FAQ on indexed & mapped properties, and indexed tags.  Added", 
   "short section to user guide mentioning indexed/mapped properties, providing", 
   "link to new FAQ.", 
   "I'd appreciate it if people familiar with this area would review this", 
   "documentation."
  ], 
  "revision_id": "49926"
 }, 
 {
  "author": "husted", 
  "date": "2002-11-30T14:41:59.000000Z", 
  "msg": [
   "Move0 Books about Struts to the Welcome page."
  ], 
  "revision_id": "49925"
 }
]