[
 {
  "author": "pamarcelot", 
  "date": "2007-01-24T23:32:37.628528Z", 
  "msg": [
   "Updating icons for the Schema Browser of the LDAP Studio Browser UI Plugin."
  ], 
  "revision_id": "499615"
 }, 
 {
  "author": "alally", 
  "date": "2007-01-24T23:31:15.902349Z", 
  "msg": [
   "Fixed incorrect and missing xrefs in introduction"
  ], 
  "revision_id": "499614"
 }, 
 {
  "author": "dos", 
  "date": "2007-01-24T23:25:25.955139Z", 
  "msg": [
   "bug 5305: implement msa_networks for detecting MSAs and extending trust accordingly", 
   "If a host acts solely as an MSA (and not a combined MX/MSA and/or", 
   "intermediate relay) we can rely on it to take care of making sure", 
   "its clients pass some sort of auth check, and thus are trusted", 
   "(trusted in the sense of SAs trusted_networks).", 
   "Similar functionality exists now so long as the MSA included an", 
   "auth token in its Received header which is supported by SA.", 
   "msa_networks supports identifying clients of MSAs that don't include", 
   "any sort of visibile auth token, such as older versions of Postfix", 
   "and whatever it is that gmx.net is using (probably old Postfix).", 
   "Supporting MSAs without visible auth tokens (which includes new", 
   "versions of Postfix which has visible auth tokens disabled by", 
   "default) also satisfies the vocal minority who are super paranoid", 
   "(for some unknown reason) about others knowing that a client passed", 
   "some sort of auth check before relaying mail.", 
   "Usage notes:", 
   "If your MSA acts solely as an MSA, put the MSA in all three of", 
   "trusted_networks, internal_networks, msa_networks.", 
   "If your MSA is also acting as an MX server never, NEVER, include it", 
   "in msa_networks since you'll end up trusting everyone who submits", 
   "mail to the MX server.", 
   "If your MSA is also acting as an intermidiate relay that may", 
   "receive mail that was submitted to an MX server never, NEVER, include", 
   "it in msa_networks since you'll end up trusting everyone who submits", 
   "mail to the MX server."
  ], 
  "revision_id": "499613"
 }, 
 {
  "author": "rajith", 
  "date": "2007-01-24T23:21:40.175197Z", 
  "msg": [
   "This contain fixes for compilation errors in the systests package"
  ], 
  "revision_id": "499612"
 }, 
 {
  "author": "cam", 
  "date": "2007-01-24T23:17:50.480168Z", 
  "msg": [
   "1. Moved missing convertToLsRGB method to Commons."
  ], 
  "revision_id": "499611"
 }
]