[
 {
  "author": "ekbush", 
  "date": "2002-12-25T09:01:46.000000Z", 
  "msg": [
   "Make ExceptionHandler obey the controller's inputForward rule.  Also, create", 
   "ActionError instance by passing ex.getMessage() as the first replacement", 
   "parameter.", 
   "PR: 12871"
  ], 
  "revision_id": "50024"
 }, 
 {
  "author": "jmitchell", 
  "date": "2002-12-25T06:25:04.000000Z", 
  "msg": [
   "Removing Povoglie, cannot find reference anywhere to Struts, or even Apache.", 
   "If I'm wrong, please resubmit with correct link."
  ], 
  "revision_id": "50023"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-12-24T19:23:14.000000Z", 
  "msg": [
   "Refine the Bugzilla queries for the current bugs (under Struts 1.1) and", 
   "the bugs marked for later review (under Struts 1.2), and make the text", 
   "a little more obvious."
  ], 
  "revision_id": "50022"
 }, 
 {
  "author": "craigmcc", 
  "date": "2002-12-24T18:49:52.000000Z", 
  "msg": [
   "The second half of the fix for 14800.  The problem with mutable property", 
   "values is *not* limited to array elements -- it will also occur when a", 
   "scalar property is of a mutable type.  As a solution to this, initial()", 
   "now calculates and returns a new value every time, rather than caching", 
   "the old one.  This is a relatively minor performance hit, but not (in", 
   "principle at least) any worse than evaluating the initialization expression", 
   "for an instance variable in a JavaBean every time one is created.", 
   "As an added benefit, the initial() method will also attempt to create", 
   "instances of properties (via a zero-args constructor) if you did not specify", 
   "an \"initial\" value to pass in to ConvertUtils.convert().  This is true both", 
   "for scalar properties and for elements of arrays constructed with the", 
   "\"size\" attribute.  In general, DynaActionForm beans now act very much more", 
   "like standard ActionForm beans with respect to preinitialized property", 
   "values than they did before these changes.", 
   "PR: Bugzilla #14800", 
   "Submitted by:\tJames Turner <turner at blackbear.com>"
  ], 
  "revision_id": "50021"
 }, 
 {
  "author": "ekbush", 
  "date": "2002-12-24T05:30:07.000000Z", 
  "msg": [
   "The forward returned from execute should be contextRelative no matter which", 
   "way it is obtained."
  ], 
  "revision_id": "50020"
 }
]