[
 {
  "author": "jdillon", 
  "date": "2007-01-27T22:42:15.255790Z", 
  "msg": [
   "Sandbox for gbuild distributed support muck"
  ], 
  "revision_id": "500650"
 }, 
 {
  "author": "dandiep", 
  "date": "2007-01-27T22:40:15.143252Z", 
  "msg": [
   "o Refactored the Buses so that we now have", 
   "- ExtensionManagerBus: This bus does not have any dependencies on Spring. It", 
   "will still find components dynamically, but has more limited configuration", 
   "as Spring isn't needed.", 
   "- CXFBusImpl: This is a simple bean Bus that anyone can use (Spring,", 
   "developers, etc). It doesn't have any pre built in extension or", 
   "configuration mechanisms, its up to the container to provide it.", 
   "o The working assumption in the above is that if people need Configuration,", 
   "they need Spring anyway, so they should use the SpringBus. Now we have a", 
   "non-Spring option which makes Spring an optional dependency.", 
   "o Made it so bindings & transports didn't have to register themselves with", 
   "their respective managers (it wasn't working anyway as not all of them did", 
   "it). Instead, use a \"DeferredMap\" which can load the extensions non-", 
   "invasively.", 
   "o Removed redundant cxf.bus.cxf package", 
   "o Refactored configuration per the discussion on the cxf-dev list.", 
   "ConfigurationProviders aren't needed any more so the cxf-tools-xjc-cfg", 
   "modules were removed.", 
   "o Removed caching of bindings in SoapBindingFactory as it will leak memory.", 
   "Also, I started on Spring 2.0 configuration schemas for JAX-WS. This has", 
   "highlighted that we need a way to reuse schemas in WSDL and in Spring which", 
   "doesn't force people to use our own JaxbApplicationContext class. Spring 2.0", 
   "provides a mechanism to do this via NamespaceHandlers and", 
   "BeanDefinitionParsers. However, these don't operate directly on the beans,", 
   "but instead on the BeanDefinitions. I've committed a small example to the jaxws", 
   "module for interested parties. This will definitely change in the future", 
   "though. I'll try to write up a better summary for the dev list soon..."
  ], 
  "revision_id": "500649"
 }, 
 {
  "author": "henning", 
  "date": "2007-01-27T22:39:05.289353Z", 
  "msg": [
   "Creating a release branch"
  ], 
  "revision_id": "500648"
 }, 
 {
  "author": "meerajk", 
  "date": "2007-01-27T22:37:54.583977Z", 
  "msg": [
   "Deleted services/discovery"
  ], 
  "revision_id": "500647"
 }, 
 {
  "author": "jleroux", 
  "date": "2007-01-27T22:35:57.845132Z", 
  "msg": [
   "A patch from Adrian Crum \"<textarea> bug in maincss.css file\" (https://issues.apache.org/jira/browse/OFBIZ-664)"
  ], 
  "revision_id": "500646"
 }
]