[
 {
  "author": "martinc", 
  "date": "2003-01-07T06:32:25.000000Z", 
  "msg": [
   "Detab sources."
  ], 
  "revision_id": "50124"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-01-07T06:14:59.000000Z", 
  "msg": [
   "The beginnings of a standard PlugIn that attempts to verify the configuration", 
   "information encapsulated in the ModuleConfig for the current module.  It logs", 
   "any error reports it finds via ServletContext.log(), and optionally (but", 
   "does by default) throws an initialization exception if any error was actually", 
   "found.", 
   "The standard struts-example webapp has been modified to register this PlugIn.", 
   "Known Limitation:  Checking things here will not catch some kinds of errors", 
   "like defining two <forward> elements with the same \"name\" value.  We'll need", 
   "some additional help (perhaps in the addFoo() methods of ModuleConfig) to", 
   "catch that kind of thing.", 
   "This PlugIn is at least partially in response to Bugzilla #14749, which", 
   "reports something that really is pilot error (incorrect value in the", 
   "configuration file), but is something that is hard for a newbie to track", 
   "down.  We need to reduce the number of errors that are hard to trace."
  ], 
  "revision_id": "50123"
 }, 
 {
  "author": "martinc", 
  "date": "2003-01-07T05:57:36.000000Z", 
  "msg": [
   "Update end year for documentation copyright notices. If someone knows how", 
   "to do this dynamically in XSLT, a la Stefan's JavaDoc trick, please let me", 
   "know."
  ], 
  "revision_id": "50122"
 }, 
 {
  "author": "martinc", 
  "date": "2003-01-07T05:50:11.000000Z", 
  "msg": [
   "Fix line ends."
  ], 
  "revision_id": "50121"
 }, 
 {
  "author": "martinc", 
  "date": "2003-01-07T05:42:56.000000Z", 
  "msg": [
   "Dynamically specify the end year for JavaDoc copyright notices, so that we", 
   "don't have to update the build script each year.", 
   "Many thanks to Stefan Bodewig for the tip!"
  ], 
  "revision_id": "50120"
 }
]