[
 {
  "author": "peterjones", 
  "date": "2007-01-31T20:51:55.732799Z", 
  "msg": [
   "Remove reference to cxf-tools-xjc-cfg from distribution module.", 
   "cxf-tools-xjc-cfg was removed."
  ], 
  "revision_id": "501985"
 }, 
 {
  "author": "rdonkin", 
  "date": "2007-01-31T20:49:21.462447Z", 
  "msg": [
   "Step one in moving towards allowing SEDA"
  ], 
  "revision_id": "501984"
 }, 
 {
  "author": "alally", 
  "date": "2007-01-31T20:48:00.535435Z", 
  "msg": [
   "Added section on setting timeouts to the", 
   "application developer's guide chapter.", 
   "Also eliminated one level of section nesting in CPE Descriptor", 
   "Reference so I could have a section number to link to (and I think", 
   "the new nesting makes more sense anyway).", 
   "UIMA-246: https://issues.apache.org/jira/browse/UIMA-246"
  ], 
  "revision_id": "501983"
 }, 
 {
  "author": "dandiep", 
  "date": "2007-01-31T20:46:59.828005Z", 
  "msg": [
   "Start of migration to support Spring 2.0 NamespaceHandlers instead of", 
   "our own property editor mechanism. This allows a much more compact syntax:", 
   "<h:conduit id=\"{urn:test:ns}Foo.http-conduit\">", 
   "<h:client ConnectionTimeout=\"97\"/>", 
   "</h:conduit>", 
   "It also means that people won't have to use our custom ApplicationContext.", 
   "As part of this I consolidated the conduit and configuration schemas into the", 
   "http-conf schema. Otherwise people would have to use multiple namespaces to", 
   "write their configuration which was annoying and confusing.", 
   "I'm not sure I'm happy with our configuration syntax though. It has mix", 
   "conventions for naming things (some start with an upper case letter and some", 
   "do not). Also, it still seems overly verbose/redundat. Not sure what the", 
   "best strategy is here though.", 
   "Also, I changed the SpringBusFactory/BusApplicationContext so we didn't refresh()", 
   "twice as the logging was a bit annoying."
  ], 
  "revision_id": "501982"
 }, 
 {
  "author": "sebb", 
  "date": "2007-01-31T20:42:01.174994Z", 
  "msg": [
   "Bug 41457 - Add TCP Sampler option to not re-use connections"
  ], 
  "revision_id": "501981"
 }
]