[
 {
  "author": "craigmcc", 
  "date": "2003-02-08T23:34:37.000000Z", 
  "msg": [
   "Forgot a closing </p>."
  ], 
  "revision_id": "50229"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-02-08T23:31:30.000000Z", 
  "msg": [
   "There was a discrepancy between the description of the \"path\" parameter", 
   "on an <exception> element between the DTD (which said \"module relative\")", 
   "and the ExceptionConfig class (which said \"context relative\").  Making it", 
   "module relative is the right answer, so correct the documentation discrepancy", 
   "and the behavior of ExceptionHandler when it configures an ActionForward", 
   "to be processed.", 
   "A side effect of this change is that the included path will be processed", 
   "through any \"forwardPattern\" property you have set on the <controller>", 
   "element."
  ], 
  "revision_id": "50228"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-02-08T22:12:09.000000Z", 
  "msg": [
   "Unit tests for the current behavior of RequestUtils.pageURL().  We deliberately", 
   "do *not* do slash prepending here -- the input value must start with a slash.", 
   "(Doing '/' prepending in forwardURL() was a bad idea IMHO, but apparently it", 
   "was needed for Tiles, and now it's too late)."
  ], 
  "revision_id": "50227"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-02-08T21:20:19.000000Z", 
  "msg": [
   "Formally document the behavior of forwardURL() so that people will know", 
   "what to expect (and what we test for).  No functionality changes."
  ], 
  "revision_id": "50226"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-02-08T21:01:52.000000Z", 
  "msg": [
   "As part of the investigation of Bugzilla ticket #16603, create unit tests", 
   "that validate the current behavior of RequestUtils.forwardURL() -- in other", 
   "words, practice what I've started preaching about \"test first\" design.", 
   "I think I've got 100% coverage on the functional behavior of this method,", 
   "and have found no functional flaws yet.  Now, on to pageURL().", 
   "PR: 16603", 
   "Submitted by:\tMalik Recoing"
  ], 
  "revision_id": "50225"
 }
]