[
 {
  "author": "sichen", 
  "date": "2007-02-01T20:02:51.186149Z", 
  "msg": [
   "Workflow improvements in ordermgr checkout:", 
   "- Directing successful create-customer requests to the EditShipAddress screen, via the new checkout parameter 'finalizeReqNewShipAddress'", 
   "- Adding COD as a payment option in the non-quick checkout flows. This required a restructuring of the form that appears when no payment methods are available to the customer - now a Javascript directs the browser either to the finalizeOrder request (if EXT_OFFLINE or EXT_COD are selected) or to the setBilling request (if CC or EFT are selected, to create a new payment method).", 
   "- Directing successful payment method creation ahead in the checkout. Includes a fix for OFBIZ-583 (using a similar but lighter approach to the one proposed by Anil Patel and Iain Fogg) via detection of the paymentMethodId request attribute. The newly-created CC/EFT account becomes selected as the only payment method for the order.", 
   "- Directing errors in payment setting or creation to the payment settings screen instead of all the way back to orderentry, by discriminating between the 'error' response and a new 'paymentError' response from CheckOutEvents.finalizeOrderEntry()"
  ], 
  "revision_id": "502340"
 }, 
 {
  "author": "svkrish", 
  "date": "2007-02-01T20:01:47.051764Z", 
  "msg": [
   "changes to fix broken build, fixed IDLTransformerTestCase.java to use javabeans databinding transformers"
  ], 
  "revision_id": "502339"
 }, 
 {
  "author": "erodriguez", 
  "date": "2007-02-01T19:59:43.832434Z", 
  "msg": [
   "Added standard author and version tags to sources in the kerberos-shared module."
  ], 
  "revision_id": "502338"
 }, 
 {
  "author": "nagy", 
  "date": "2007-02-01T19:56:02.797655Z", 
  "msg": [
   "AXIS2-2076", 
   "Contributor: Ann Robinson", 
   "Improved trace correlation for message context serialization and dealt with some serialization exceptions more gracefully."
  ], 
  "revision_id": "502337"
 }, 
 {
  "author": "svkrish", 
  "date": "2007-02-01T19:55:28.760248Z", 
  "msg": [
   "changes to fix broken build, deleted Node2Object and Object2Node transformers"
  ], 
  "revision_id": "502336"
 }
]