[
 {
  "author": "fielding", 
  "date": "2003-05-15T03:52:25.000000Z", 
  "msg": [
   "An ABNF production for URI has been introduced to correspond to the", 
   "common usage of the term: an absolute URI with optional fragment.", 
   "Section 2.2 on reserved characters has been rewritten to clearly explain", 
   "what characters are reserved, when they are reserved, and why they are", 
   "reserved even when not used as delimiters by the generic syntax.", 
   "Likewise, the section on escaped characters has been rewritten, and", 
   "URI normalizers are now given license to unescape any octets", 
   "corresponding to unreserved characters.  The crosshatch (\"#\") character", 
   "has been moved back from the excluded delims to the reserved set.", 
   "I am in the midst of rewriting the ABNF for URI to make it more", 
   "friendly to LALR parsers and significantly reduce complexity.", 
   "As a result, the layout form of syntax description has been removed,", 
   "along with the opaque-part and uric-no-slash ABNF productions.", 
   "All references to \"opaque\" URIs have been replaced with a better", 
   "description of how the path component may be opaque to hierarchy.", 
   "The fragment identifier has been moved back into the URI components,", 
   "though I am still working on the text.", 
   "The ambiguity regarding the parsing of net-path, abs-path, and rel-path", 
   "is now fully explained and disambiguated in the same section.", 
   "Fixed 038-qualified: The ABNF of qualified has been simplified to remove", 
   "a parsing ambiguity without changing the allowed syntax.  The toplabel", 
   "production has been removed because it served no useful purpose.", 
   "The ambiguity regarding the parsing of host as IPv4address or hostname", 
   "is now fully explained and disambiguated in the same section."
  ], 
  "revision_id": "503015"
 }, 
 {
  "author": "fielding", 
  "date": "2003-05-08T20:46:07.000000Z", 
  "msg": [
   "use Julian's latest xslt"
  ], 
  "revision_id": "503014"
 }, 
 {
  "author": "fielding", 
  "date": "2003-05-08T20:45:18.000000Z", 
  "msg": [
   "Incorporate latest revision from Julian Reschke at", 
   "http://greenbytes.de/tech/webdav/rfc2629.xslt"
  ], 
  "revision_id": "503013"
 }, 
 {
  "author": "fielding", 
  "date": "2003-05-08T01:15:39.000000Z", 
  "msg": [
   "mark abnf artwork for validation"
  ], 
  "revision_id": "503012"
 }, 
 {
  "author": "fielding", 
  "date": "2003-05-08T00:53:08.000000Z", 
  "msg": [
   "add link to ID nits"
  ], 
  "revision_id": "503011"
 }
]