[
 {
  "author": "ajborley", 
  "date": "2007-02-08T14:14:05.779902Z", 
  "msg": [
   "Changes to Alert Aggregator sample to improve display in IE6. This change stops IE caching the \"GET\" requests"
  ], 
  "revision_id": "504905"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2007-02-08T14:09:27.673121Z", 
  "msg": [
   "Updated ObjectClass Editor to reflect the current modification state of the object class (insted of the saved state) in the Source Code page.", 
   "(Fixed a part of DIRSTUDIO-40)"
  ], 
  "revision_id": "504904"
 }, 
 {
  "author": "jm", 
  "date": "2007-02-08T13:59:19.458837Z", 
  "msg": [
   "lots more commenting of score lines, let the perceptron think about it"
  ], 
  "revision_id": "504903"
 }, 
 {
  "author": "schor", 
  "date": "2007-02-08T13:59:14.304054Z", 
  "msg": [
   "UIMA-284.  3 fixes.  1) added volatile to fields in this class", 
   "not otherwise under synch locks for read/writing, where the", 
   "fields are set/read on different threads.  Without this,", 
   "different threads can see different values for these because", 
   "the JVM may keep the value of these in \"registers\" local", 
   "to the thread.", 
   "2) Moved tests leading to wait/notify actions into the same", 
   "synch lock used for the wait/notify - to avoid a race condition.", 
   "3) In the method runSingleThreaded was a call to", 
   "ifPaused() with the comment // blocks if CPM is paused.  But", 
   "ifPaused() just tests a variable, doesn't wait for CPM to", 
   "resume.  There is a similarly named method, ifCpmPaused(), that", 
   "is a method of ProcessingUnit. I copied this method, changing", 
   "it slightly to get it to work in CPMEngine class, and renamed it", 
   "to \"waitForCpmToResumeIfPaused\" which is closer to what", 
   "it does, and changed the ifPaused() call to this new method.", 
   "At some point the other method in ProcessingUnit might be deleted", 
   "and this one used in all cases (a refactoring saved for later)."
  ], 
  "revision_id": "504902"
 }, 
 {
  "author": "aadamchik", 
  "date": "2007-02-08T13:56:12.166626Z", 
  "msg": [
   "CAY-749: Resource folder names misspelled for Postgres and Ingres"
  ], 
  "revision_id": "504901"
 }
]