[
 {
  "author": "ritchiem", 
  "date": "2007-02-13T11:52:15.493604Z", 
  "msg": [
   "set release revision"
  ], 
  "revision_id": "506980"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-02-13T11:46:37.391546Z", 
  "msg": [
   "QPID-346 Message loss after rollback/recover", 
   "With Multiple consumers closing and requeuing occasionally a message would be lost given the use of msg.getDeliveredToConsumer() as this will be set on the first send an so on the infrequent occasion that a subscriber closes whilst a message is being delivered then that message would be lost.", 
   "AMQChannel - Fixed bug where messages would not be requeued on consumer closure. Increased quantity of logging.", 
   "AMQMessage - Added method to get 'taken' status.", 
   "AMQQueue - Wrapped all log messages with correct is<X>Enabled() also removed debug() method as this makes debugging very difficult (log4j will always report the same log line, requiring searching of the file to fine the actual log line.)", 
   "ConcurrentSelectorDeliveryManager - Increased and enclosed logging (isXEnabled). Wrapped the send calls with a lock on the Subscription(Impl) such that a send will not occur if the Subscription(Impl) has been closed.", 
   "SubscriptionImpl - Used sendLock to set SI closed. This is used to mark subscription as suspended so no messages will be sent to it. Increased and wrapped logging.", 
   "SubscriptionSet - Added locking around the insertion and removal of entries to _subscription. As we need to retrieve the actual Subscription from the map when removing rather than the dummy object created for lookup. This requires two call to _subcription which is there for not thread safe.", 
   "log4j - updated to have handy debug defaults that simply need uncommented.", 
   "Test to follow, once cleaned up."
  ], 
  "revision_id": "506979"
 }, 
 {
  "author": "cziegeler", 
  "date": "2007-02-13T11:42:16.992574Z", 
  "msg": [
   "Update ehcache to 1.2.3"
  ], 
  "revision_id": "506978"
 }, 
 {
  "author": "reinhard", 
  "date": "2007-02-13T11:41:41.120254Z", 
  "msg": [
   "fix allblocks build too; add commons-lang to portal-api"
  ], 
  "revision_id": "506977"
 }, 
 {
  "author": "cziegeler", 
  "date": "2007-02-13T11:40:57.019333Z", 
  "msg": [
   "Add missing toString implementation to TemplateObjectModelHelper.ParametersMap", 
   "Fixes bug #COCOON-1984"
  ], 
  "revision_id": "506976"
 }
]