[
 {
  "author": "jliu", 
  "date": "2007-02-14T02:07:15.383953Z", 
  "msg": [
   "CXF-249. Replace XMLStreamWriter with DOMStreamWriter when JAX-WS Soap handlers are registered with the chain. The idea is to create a SAAJ DOM model up front if we know that we are going to need a SAAJ tree in a later stage anyway, then let interceptors use a DOMXMLStreamWriter to write content into this SAAJ DOM model directly. This can avoid the unnecessary parsing time from Stax output stream to SAAJ model."
  ], 
  "revision_id": "507355"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-02-14T02:00:37.065823Z", 
  "msg": [
   "ref attribute handling changes ...", 
   "o removed the code in the search handler which injected the ref attribute into", 
   "the returningAttributes list for the search operation", 
   "o added code to the returningAttributes handling code to always return the", 
   "ref attribute of an entry regardless of the ref attribute's presence in", 
   "the list of attributes to return", 
   "o checking in OperationalAttributeService to make sure we do not remove the", 
   "ref attribute from entries.", 
   "NOTE: this has one drawback, other non-btree based implementations must also", 
   "implement this functionality to make sure referral handling succeeds", 
   "if this code was in an interceptor then we wouldn't have this problem", 
   "however having an interceptor much with the returningAttributes causes", 
   "problems"
  ], 
  "revision_id": "507354"
 }, 
 {
  "author": "jboynes", 
  "date": "2007-02-14T01:52:11.484530Z", 
  "msg": [
   "implement ComponentContext#getService"
  ], 
  "revision_id": "507353"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-02-14T01:48:55.236610Z", 
  "msg": [
   "making sure unknown attributeTypes are handled with the correct exception type"
  ], 
  "revision_id": "507352"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-02-14T01:47:33.244472Z", 
  "msg": [
   "upgrading to mina 1.0.1 for now"
  ], 
  "revision_id": "507351"
 }
]