[
 {
  "author": "dblevins", 
  "date": "2007-02-15T20:39:51.630345Z", 
  "msg": [
   "no longer supports entity-manager-factory-ref, supports persistence-unit-ref instead as per the latest version of the naming-1.2 schema", 
   "Fixes OPENEJB-515"
  ], 
  "revision_id": "508135"
 }, 
 {
  "author": "tabish", 
  "date": "2007-02-15T20:39:50.178742Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQCPP-30"
  ], 
  "revision_id": "508134"
 }, 
 {
  "author": "dain", 
  "date": "2007-02-15T20:39:14.572533Z", 
  "msg": [
   "Added CMP1 generator which simply generates an empty subclass; subclasses are used to differentiate cmp beans that have the same ejb-class", 
   "Cmp implementation class is now named \"openejb.${ejbClass.package}.${abstractSchemaName}\"", 
   "Currently a subclass is always generated due to OPENJPA-142", 
   "Queries are now declared in the jpa mapping file so the jpa implementation can preprocess the queries", 
   "Queries are named ${deploymentId}.${methodName}(${paramType[0]},(${paramType[1]}...) or without parenthesis if parameters are not specified", 
   "Added org.apache.openejb.core.transaction.TransactionRolledbackException which is a simple subclass of TransactionRolledbackException that supports initCause", 
   "Split AutoConfigAndDeploy into AutoConfig and AutoDeploy so deploymentInfo is available in converters", 
   "Added sun conversion"
  ], 
  "revision_id": "508133"
 }, 
 {
  "author": "scotsmatrix", 
  "date": "2007-02-15T20:37:45.035330Z", 
  "msg": [
   "Derby-1842: Added or corrected the ALT text for all of the graphic files in the dev and tuning guides. Patch submitted by me."
  ], 
  "revision_id": "508132"
 }, 
 {
  "author": "gshimansky", 
  "date": "2007-02-15T20:31:53.108752Z", 
  "msg": [
   "Applied HARMONY-3079 [dlrvm][classloader][opt] Opt does not handle exception raised by classloader (assertion fails classloader.cpp:1521)", 
   "Tests passwd on Ubuntu6 x86, Windows XP x86 and SuSE9 x86_64"
  ], 
  "revision_id": "508131"
 }
]