[
 {
  "author": "nadiramra", 
  "date": "2007-02-17T08:04:06.549062Z", 
  "msg": [
   "With new transport code, which will be released soon, exceptions", 
   "were being thrown due to invalid lengths.  The attempts to correct", 
   "CRLF anomalies has been improved as long as chunk sizes are ###. So", 
   "we need to ensure that lengths are not hard-coded in response files."
  ], 
  "revision_id": "508725"
 }, 
 {
  "author": "gdamour", 
  "date": "2007-02-17T08:01:26.447418Z", 
  "msg": [
   "Second attempt to change the way the online/offline deployers and the JSR88", 
   "deployment driver work. The first attempt was breaking the TCK amd the", 
   "eclipse plugin.", 
   "Online deployer, i.e. deployer.jar, boots a Kernel to load its dependencies,", 
   "e.g. geronimo-deploy-tool, and registers the available ModuleConfigurers with", 
   "the DeploymentManager.", 
   "ModuleConfigurers to be registered are loaded by the persistent configuration", 
   "list jsr88-configurer-config.xml.", 
   "In the case of an offline deployment, the online deployer starts the", 
   "offline-deployer configuration within the same Kernel. In turn, the", 
   "offline-deployer configuration starts a list of configurations to register", 
   "the available module builders.", 
   "Add a log4j configuration for the online deployer.", 
   "DeploymentFactoryBootstrapper is the new JSR88 deployment driver. It boots a", 
   "kernel; starts the configuration list jsr88-configurer-config.xml; retrieves", 
   "the \"actual\" DeploymentFactory implementation from the kernel; and delegates", 
   "to this retrieved imoplementation.", 
   "The JSR88 JAR driver is now named jsr88-deploymentfactory.jar.", 
   "This fixes:", 
   "* GERONIMO-2794 - Improve online deployer to register ModuleConfigurers from the repository; and", 
   "* GERONIMO-2767 - Minimize side effects of the offline deployer"
  ], 
  "revision_id": "508724"
 }, 
 {
  "author": "byersa", 
  "date": "2007-02-17T07:57:29.151538Z", 
  "msg": [
   "Not quite finished product export utility. Available off the keyword search page of the catalog manager"
  ], 
  "revision_id": "508723"
 }, 
 {
  "author": "byersa", 
  "date": "2007-02-17T07:54:44.323510Z", 
  "msg": [
   "Modified subscription generating services to set the orderItemSeqId field in the Subscription entity."
  ], 
  "revision_id": "508722"
 }, 
 {
  "author": "rajdavies", 
  "date": "2007-02-17T07:30:08.530013Z", 
  "msg": [
   "for getValue() ensure the StoreEntry is up to date"
  ], 
  "revision_id": "508721"
 }
]