[
 {
  "author": "dandiep", 
  "date": "2007-02-18T21:12:14.571414Z", 
  "msg": [
   "Some simple package level javadoc info."
  ], 
  "revision_id": "509005"
 }, 
 {
  "author": "dandiep", 
  "date": "2007-02-18T21:06:58.855186Z", 
  "msg": [
   "o Unify the Provider and Service code for JAX-WS so we have one ServiceFactory", 
   "for both. This simplifies usage of EndpointImpl a fair amount and also", 
   "makes it possible for Providers to use lots of the other utilities we have", 
   "around like WS-Address or WS-RM.", 
   "o Remove unnecessary ProviderObserver/ProviderInvoker classes", 
   "o Remove the hard dependency in JAXB on SAAJ for the simple frontend and", 
   "separate out Source handling into a separate databinding.", 
   "o Remove the DataReader/WriterFactory concept as it is overly redundant.", 
   "Now the schema & attachments can be set directly on the DataReader and", 
   "DataWriters.", 
   "o Add a flag to the BindingFactorys to optionally disable databinding", 
   "so that users may provide their own databinding interceptors. In the Provider", 
   "case we use Provider(In/Out)DatabindingInterceptors.", 
   "o Add some more code first tests in the JAX-WS module for Providers", 
   "o Change the RestSourcePayloadProvider class to use the XML binding as it", 
   "is not a SOAP endpoint.", 
   "o Add dependency on SAAJ to ws-addressing module as it seems to through", 
   "SOAPFaultExceptions in some places. I think this is probably just a", 
   "holdover from the old Celtix code?", 
   "o Add a DispatchTest to the JAX-WS module"
  ], 
  "revision_id": "509004"
 }, 
 {
  "author": "danj", 
  "date": "2007-02-18T21:06:35.130113Z", 
  "msg": [
   "Overloaded publish() to add arrays of content, as requested on muse-user. Users can now publish notifications", 
   "with multiple events (they can already receive them)."
  ], 
  "revision_id": "509003"
 }, 
 {
  "author": "danj", 
  "date": "2007-02-18T21:06:32.349790Z", 
  "msg": [
   "Overloaded publish() to add arrays of content, as requested on muse-user. Users can now publish notifications", 
   "with multiple events (they can already receive them)."
  ], 
  "revision_id": "509002"
 }, 
 {
  "author": "ngallardo", 
  "date": "2007-02-18T21:03:20.124056Z", 
  "msg": [
   "Moving dispatch related code to \"dispatch\" package."
  ], 
  "revision_id": "509001"
 }
]