[
 {
  "author": "lofwyr", 
  "date": "2007-02-19T12:10:55.194682Z", 
  "msg": [
   "Using StringUtils.contains instead of String.indexOf > -1 to prevent NullPointerException"
  ], 
  "revision_id": "509175"
 }, 
 {
  "author": "lofwyr", 
  "date": "2007-02-19T12:10:28.953961Z", 
  "msg": [
   "remove deprecated \"width\" attribute. Using layoutmanager"
  ], 
  "revision_id": "509174"
 }, 
 {
  "author": "rjung", 
  "date": "2007-02-19T12:01:40.831467Z", 
  "msg": [
   "Change semantics of empty defaults for JkEnvVar variables."
  ], 
  "revision_id": "509173"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-02-19T11:55:47.307239Z", 
  "msg": [
   "QPID-372, QPID-376 Broker now ignores all frames for closing channels.", 
   "When a close-ok is received the channel can be reopened and used", 
   "All uses of getChannel check the return type is not null and throw a NOT_FOUND AMQException. If the channel is not found during a method handler then the Channel will be closed.", 
   "ChannelCloseHandler - Now throws a connection exception if trying to close a a non exisitant channel.", 
   "AMQMinaProtocolSession - Added pre-check for closing channels to ignore all but Close-OK methods", 
   "- Updated ChannelException method to close connection if the CE was a result of not having a valid channel.", 
   "- Changed state to CLOSING when writing out a connection close frame.", 
   "AMQConnection - Wrapped all _logging calls , Updated comment formatting", 
   "AMQSession - called startDispatcherIfRequired when receiving a message as without it a producer will not get a returned message. This is because there is no consumer setup to consume.", 
   "ConnectionCloseMethodHandler - Wrapped code in try finally so that the protocol session would always be closed correctly.", 
   "AMQStateManager - Added state to the logging values", 
   "Modified AMQTimeoutException to include a new constant value to identify the failure reason.", 
   "AMQConstant - Added 408 REQUEST_TIMEOUT fixed error with NOT_ALLOWED value was 530 should be 507."
  ], 
  "revision_id": "509172"
 }, 
 {
  "author": "dreid", 
  "date": "2007-02-19T11:49:15.219218Z", 
  "msg": [
   "Add Solr's DOAP file"
  ], 
  "revision_id": "509171"
 }
]