[
 {
  "author": "", 
  "date": "2003-08-11T04:55:34.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create tag 'start'."
  ], 
  "revision_id": "50929"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-08-11T04:55:34.000000Z", 
  "msg": [
   "Initial check-in of a library that decomposes the Struts 1.1 request", 
   "procoessor, using the newly checked in Commons Sandbox project called", 
   "\"chain\" supporting the Chain of Responsibility pattern.  None of this", 
   "code has been tested at all yet ... it should be considered incomplete", 
   "and conceptual, but it also serves as a proof of concept that decomposing", 
   "RequestProcessor seems pretty feasible.", 
   "Nightly builds of jakarta-commons-sandbox/chain should show up as of tonight", 
   "at <http://jakarta.apache.org/builds/jakarta-commons/nightly/chain/>.", 
   "If this idea works out in practice, I'm going to propose an architecture", 
   "based on the \"chain\" concept to be the fundamental architecture of", 
   "Struts 2.0.  Among other things, it lets you build the Cocoon concept", 
   "of a \"site map\" with Java classes rather than XSLT transformations being", 
   "the key element to creating and modifying dynamic content.  In addition,", 
   "the jakarta-commons-sandbox/chain package is useful in its own right to", 
   "compose complex processing pipelines from simple (individually unit", 
   "testable) \"command pattern\" classes with very simple interfaces."
  ], 
  "revision_id": "50928"
 }, 
 {
  "author": "", 
  "date": "2003-08-11T04:55:32.000000Z", 
  "msg": [
   "This commit was manufactured by cvs2svn to create branch", 
   "'jakarta-struts-chain'."
  ], 
  "revision_id": "50927"
 }, 
 {
  "author": "craigmcc", 
  "date": "2003-08-11T04:55:32.000000Z", 
  "msg": [
   "Initial revision"
  ], 
  "revision_id": "50926"
 }, 
 {
  "author": "dmkarr", 
  "date": "2003-08-10T21:42:21.000000Z", 
  "msg": [
   "Added action attribute added in base class"
  ], 
  "revision_id": "50925"
 }
]