[
 {
  "author": "carnold", 
  "date": "2007-02-19T20:34:29.990239Z", 
  "msg": [
   "Add log4net to gump profile"
  ], 
  "revision_id": "509325"
 }, 
 {
  "author": "djencks", 
  "date": "2007-02-19T20:28:37.264686Z", 
  "msg": [
   "fix a double typo. <jtaDataSource>foo</jtaDataSource> should now work"
  ], 
  "revision_id": "509324"
 }, 
 {
  "author": "taylor", 
  "date": "2007-02-19T20:22:10.205368Z", 
  "msg": [
   "missing dep"
  ], 
  "revision_id": "509323"
 }, 
 {
  "author": "rolandw", 
  "date": "2007-02-19T20:00:39.223047Z", 
  "msg": [
   "HttpConn package JavaDoc. Desperately needed."
  ], 
  "revision_id": "509322"
 }, 
 {
  "author": "jaz", 
  "date": "2007-02-19T19:53:06.879616Z", 
  "msg": [
   "Content Permission & Service Refactoring: A number of big changes to content services including new permission services. This is the first pass with detailed testing on blogs in ecommerce. Tested low level screens as well.", 
   "This is the first pass, there are still a number of references to old permission checking, some services need to be refactored, some replaced with better practices. This is a work in progress.", 
   "This first pass includes the removal of special BLOG_ roles and status. Replaced with a generic CONTENT_ and CTNT_. Also adds new ECAs to base createContent service which creates OWNER role as well as associations when passed a contentIdTo or contentIdFrom (and TYPE). This will probably replace the persistContentAndAssoc service which is used in many places. Some have been updated in the revision, others will follow.", 
   "Most code which calls the older permission services are found in .java files. Almost all simple methods have been converted to have the permission in the service def and the code removed from the implementation. Java methods still need to be addressed.", 
   "The older permission service will output a warning in logs with a stack trace to help track down places where this service is still being called. This is not an error, but may show in logs for the time being."
  ], 
  "revision_id": "509321"
 }
]