[
 {
  "author": "andreasmyth", 
  "date": "2007-02-21T12:02:05.073429Z", 
  "msg": [
   "[JIRA CXF-376] Enabled resolution of external policy references.", 
   "[JIRA CXF-378] Support for external attachments - framework, APIs and basic EPR based implementation of DomainExpression.", 
   "Changed some package names to use singular.", 
   "Added policy interceptor provider for WS-Addressing, removed addressing interceptors from RM policy interceptor provider."
  ], 
  "revision_id": "509980"
 }, 
 {
  "author": "antelder", 
  "date": "2007-02-21T12:00:45.437194Z", 
  "msg": [
   "Add a javadoc comment describing the tests"
  ], 
  "revision_id": "509979"
 }, 
 {
  "author": "ate", 
  "date": "2007-02-21T11:59:48.370085Z", 
  "msg": [
   "Fixing images src paths which were expected to have the (portal) base tag set.", 
   "With the implementation of JS2-275: Option to make Action URLs relative or absolute, the base tag is no longer (by default) provided.", 
   "Resolved by prefixing the image paths with the contextPath of the portal."
  ], 
  "revision_id": "509978"
 }, 
 {
  "author": "ate", 
  "date": "2007-02-21T11:54:37.621666Z", 
  "msg": [
   "Reverting back the last changes made by David for attempting to get the CategoryPortletSelector working again", 
   "under the default strict parameter merging settings (see: JS2-605)", 
   "I've just enhanced JS2-605 allowing individual portlets to override the global settings though jetspeed-portlet.xml metadata.", 
   "I've added these overriding metadata properties for the CategoryPortletSelector and its now working again as expected."
  ], 
  "revision_id": "509977"
 }, 
 {
  "author": "ate", 
  "date": "2007-02-21T11:51:09.512730Z", 
  "msg": [
   "Enforcing again the intended default behavior for JS2-605: Query string parameters should not (by default) be provided to portlets to be compliant to JSR 168 spec requirements", 
   "I just enhanced the JS2-605 feature allowing individual legacy portlets to override the global settings through jetspeed-portlet.xml metadata.", 
   "That makes it possible to use the strict global setting, and still support portlets depending on the old behavior."
  ], 
  "revision_id": "509976"
 }
]