[
 {
  "author": "cziegeler", 
  "date": "2007-02-23T10:48:46.536514Z", 
  "msg": [
   "Clean up imports and set svn properties"
  ], 
  "revision_id": "510900"
 }, 
 {
  "author": "rajdavies", 
  "date": "2007-02-23T10:46:43.059538Z", 
  "msg": [
   "Add a default policy entry, now that FixedSizeSubsctionRecoveryPolicy is no longer set by default on a Topic.", 
   "It was a memory issue for large messages."
  ], 
  "revision_id": "510899"
 }, 
 {
  "author": "azeez", 
  "date": "2007-02-23T10:46:42.032357Z", 
  "msg": [
   "Adding a default constructor to SessionContext.", 
   "This is needed for the following reason;", 
   "When HTTP transport based sessions are used in Axis2 Web services, a SessionContext object is used.", 
   "This SessionContext is added to the HTTP session as an attribute.", 
   "When Axis2 is deployed on Tomcat, it persists the session information in the work directory. When Tomcat is restarted, it tries to reconstruct the", 
   "SessionContext object. If no default constructor is available, an exception is thrown."
  ], 
  "revision_id": "510898"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-02-23T10:20:44.346140Z", 
  "msg": [
   "QPID-346 Message loss after rollback", 
   "QPID-348 Problems of prefetching messages", 
   "QPID-355 Closing a consumer does not ensure messages delivery will stop for that subscription", 
   "BROKER", 
   "AMQChannel - updated requeue to either resend via the Delivery Manager not directly via msg.writedeliver.", 
   "BasicRejectMethodHandler - initial place holder.", 
   "TxRollbackHandler - Added comment", 
   "AMQMessage - added ability to record who has taken the message so that it can be resent to that subscriber on resend/requeue.", 
   "AMQQueue - added the queue reference to the Subscription creation", 
   "ConcurrentSelectorDeliveryManager - Added methods to correctly monitor the size of queue messages. Including messages on the resend queue of a Subscriber. Additional locking to ensure that messages are not sent to the subscriber after Closure. QPID-355", 
   "DeliveryManager - adjusted deliver call to allow delivery to the head of the queue.", 
   "Subscription - changes to allow selction of queue(resend or predelivery) methods to add to resend and getSendLock to ensure that sending to the Subscription is allowed.", 
   "SubscriptionFactory - changes to allow the AMQQueue to be passed to the Subscription.", 
   "SubscriptionImpl - implementation of the interfaces. Local storage of messages to be resent and requeuing of the messages during closure.", 
   "SubscriptionSet - changes to retrieve the actual stored Subscription when performing removeSubscriber. So we have access to the the resend queue.", 
   "AMQStateManager - Added BasicRejectMethodHandler", 
   "TransactionalContext - Added option to deliver the messages to the front of the queue.", 
   "LocalTransactionalContext - cleared the _postComitDeliveryList on rollback. Added option to deliver the messages to the front of the queue.", 
   "NonTransactionalContext - Added option to deliver the messages to the front of the queue.", 
   "DeliverMessageOperation.java DELELTED AS NOT USED.", 
   "CLIENT", 
   "AMQSession - added ability to get the pervious state of the dispatcher when settting Stopped, fixed the channel suspension problems on broker so uncommented clean up code in rollback and recover.", 
   "BasicMessageConsumer - updated the rollback so that it sends reject messages to server.", 
   "AbstractJMSMessage - whitespace + added extra message properties to the toString()", 
   "AMQProtocolHandler - whitespace + extra debug output", 
   "TransactedTest - updated expect to prevent NPEs also added extra logging to help understand what is going on.", 
   "CLUSTER", 
   "ClusteredQueue - AMQQueue changes for message deliveryFirst.", 
   "RemoteSubscriptionImpl - Implementation of Subscription", 
   "SYSTESTS", 
   "AbstractHeadersExchangeTestBase - AMQQueue changes for message deliveryFirst.", 
   "AMQQueueMBeanTest - changes for message deliveryFirst.", 
   "ConcurrencyTest - changes for message deliveryFirst.", 
   "DeliveryManagerTest - changes for message deliveryFirst.", 
   "SubscriptionTestHelper - Implementation of Subscription", 
   "WhiteSpace only", 
   "UnacknowledgedMessageMapImpl.java"
  ], 
  "revision_id": "510897"
 }, 
 {
  "author": "davidillsley", 
  "date": "2007-02-23T10:16:27.864829Z", 
  "msg": [
   "Fix for AXIS2-2147", 
   "Changed the value of the constant which seems to fix the problem."
  ], 
  "revision_id": "510896"
 }
]