[
 {
  "author": "chirino", 
  "date": "2007-02-23T20:24:30.612364Z", 
  "msg": [
   "r241@34:  chirino | 2007-02-23 14:49:05 -0500", 
   "Fixed some Stream tests that broke a little with the latest changes..", 
   "Added better network flow control."
  ], 
  "revision_id": "511085"
 }, 
 {
  "author": "chirino", 
  "date": "2007-02-23T20:24:06.769719Z", 
  "msg": [
   "r240@34:  chirino | 2007-02-23 14:48:56 -0500", 
   "Enhanced the JMX stats so that the enqueue and dequeue attributes on the connection object actually reflect what's been enqueued and dequeued on it.  Also fixed stats on Topics so they make sense."
  ], 
  "revision_id": "511084"
 }, 
 {
  "author": "chirino", 
  "date": "2007-02-23T20:23:49.342966Z", 
  "msg": [
   "r239@34:  chirino | 2007-02-23 14:48:46 -0500", 
   "Sync oneway of a ShutdownInfo from the broker to the client could deadlock the vm transport.  Sending that ShutdownInfo in the async dispatch thread now."
  ], 
  "revision_id": "511083"
 }, 
 {
  "author": "chirino", 
  "date": "2007-02-23T20:23:35.819200Z", 
  "msg": [
   "r238@34:  chirino | 2007-02-23 14:48:37 -0500", 
   "You can now disable a connection from watching topic advisories by setting the 'watchTopicAdvisories' option on the ActiveMQConnectionFactory to true.", 
   "For large networks were lots of temporary topic consumers are being created and destroyed, this can result in lower overhead since those events do not need to get replicated to all the connections on the network.", 
   "This improves the handling of temp  destination over networks but it relaxed a few restrictions to get around timing issues with the networks.  If a message is sent to non-existant temp destination, the temp destination will be created so that the message is not dropped.  This could potentially create temp destinations for connections that will never get re-established."
  ], 
  "revision_id": "511082"
 }, 
 {
  "author": "chirino", 
  "date": "2007-02-23T20:23:08.266161Z", 
  "msg": [
   "r237@34:  chirino | 2007-02-23 14:48:28 -0500", 
   "Fixing memory leak that could occur if a connection attemp is not successful (for example if the broker is down and failover is not being used).", 
   "If the client app loops re-attempting to reconnect and continues to fail, the leak to lead to a OOM exception quickly."
  ], 
  "revision_id": "511081"
 }
]