[
 {
  "author": "faridz", 
  "date": "2007-02-23T16:57:54.386753Z", 
  "msg": [
   "2007-02-23 Farid Zaripov <faridz@kyiv.vdiweb.com>", 
   "ChangeLog:", 
   "* 21.strings.h: #included 23.containers.h;", 
   "struct StringIds inherited from struct ContainerIds;", 
   "removed definitions of the AllocId and IteratorId.", 
   "* 23.containers.h: New file with definitions of helpers used", 
   "in clause 23 tests.", 
   "* 23.containers.cpp: Ditto."
  ], 
  "revision_id": "511015"
 }, 
 {
  "author": "mrglavas", 
  "date": "2007-02-23T16:53:57.474417Z", 
  "msg": [
   "Fixing JIRA Bugs #206, #380 and #773:", 
   "http://issues.apache.org/jira/browse/XERCESJ-206", 
   "http://issues.apache.org/jira/browse/XERCESJ-380", 
   "http://issues.apache.org/jira/browse/XERCESJ-773", 
   "For larger values of maxOccurs in a schema document an OutOfMemoryError may occur when Xerces builds", 
   "the DFA representation. Similarly, large values of minOccurs with maxOccurs equal to unbounded may", 
   "exhaust the available memory.  If enough space has been allocated on the heap the VM may not run out", 
   "of memory but it may take several minutes before processing completes. The workaround for this limitation", 
   "has always been for the schema author to change the value of maxOccurs to unbounded (and change minOccurs", 
   "to 1 or some small number).", 
   "For a number of users the workaround is unnacceptable and they really do need to work with the large", 
   "maxOccurs values. The following fix eliminates this long standing limtiation for a number of common", 
   "cases. We now build a representation of large minOccurs/maxOccurs in constant time and memory (which", 
   "uses a counter during validation) for element and wildcard particles when each model group particle", 
   "in the content model:", 
   "* has minOccurs/maxOccurs == 1; or", 
   "* contains only one element/wildcard particle with minOccurs/maxOccurs == 1", 
   "Handling sequences, choices and nested minOccurs/maxOccurs is somewhat tricker. We might tackle those", 
   "one day with a more general solution but what I've done for now should allivate the pain for a large", 
   "number of the users who couldn't workaround the limitation."
  ], 
  "revision_id": "511014"
 }, 
 {
  "author": "rfeng", 
  "date": "2007-02-23T16:45:08.977438Z", 
  "msg": [
   "[sca-integration-branch] Use XMLType as the logical type for all XML-related databindings"
  ], 
  "revision_id": "511013"
 }, 
 {
  "author": "ngn", 
  "date": "2007-02-23T16:36:20.388124Z", 
  "msg": [
   "Specifying Surefire plugin version"
  ], 
  "revision_id": "511012"
 }, 
 {
  "author": "jacopoc", 
  "date": "2007-02-23T16:25:08.105952Z", 
  "msg": [
   "Added support for deleting empty bins and for removing items from bins."
  ], 
  "revision_id": "511011"
 }
]