[
 {
  "author": "mbr", 
  "date": "2007-02-24T15:35:53.280409Z", 
  "msg": [
   "added newInstance(String, Class) method to support type check"
  ], 
  "revision_id": "511285"
 }, 
 {
  "author": "ngn", 
  "date": "2007-02-24T15:23:53.423578Z", 
  "msg": [
   "Adding version and defaults of the Eclipse plugin"
  ], 
  "revision_id": "511284"
 }, 
 {
  "author": "mamta", 
  "date": "2007-02-24T15:10:23.438056Z", 
  "msg": [
   "DERBY-2334 Accept the new collation attribute and store it as a database property. Will be used for language based collation ordering.", 
   "This patch has code for new JDBC url attribute collation in DataDictionaryImpl.java'boot method. Once the value for this attribute is validated, it is converted to database property derby.database.collation. This property will get saved in the property conglomerate.", 
   "Patch description in brief", 
   "1)Changes in DataDictionaryImpl.java will validate the value for the optional collation attribute and use the default UCS_BASIC if no value supplied (this is all at database create time). This JDBC url attribute will be saved as database property derby.database.collation in the property conglomerate.", 
   "2)All the JDBC url attributes are defined in Attribute.java. Added collation to that file. Removed existing attribute collate which is not", 
   "used anywhere in the Derby code. Removal of unused \"collate\" attribute will save confusion in future between the new \"collation\" attribute", 
   "and unused \"collate\" attribute.", 
   "3)The 2 valid values for collation attribute are defined in Property.java. They are UCS_BASIC and TERRITORY_BASED. Also, the database property is defined in this file for collation attribute.", 
   "4)Changes in Driver20 class adds the new string attribute so it can be detected by the generic GUI tools through getPropertyInfo method.", 
   "5)Added new SQLState and message id for new attribute in messages.xml, SQLState.java and MessageId.java", 
   "6)Needed to update master GetPropertyInfoTest.out so it is aware of the new collation attribute."
  ], 
  "revision_id": "511283"
 }, 
 {
  "author": "antelder", 
  "date": "2007-02-24T15:09:51.719891Z", 
  "msg": [
   "Get properties working for script components and tests for ruby python and javascript"
  ], 
  "revision_id": "511282"
 }, 
 {
  "author": "sppatel", 
  "date": "2007-02-24T15:07:19.624954Z", 
  "msg": [
   "move to WTP 2.0 M5"
  ], 
  "revision_id": "511281"
 }
]