[
 {
  "author": "ehatcher", 
  "date": "2007-02-25T20:38:29.977368Z", 
  "msg": [
   "Add ChineseAnalyzer to the mix for *_zh_text fields"
  ], 
  "revision_id": "511600"
 }, 
 {
  "author": "ehatcher", 
  "date": "2007-02-25T20:37:06.468701Z", 
  "msg": [
   "* Added DocumentController to control search results detail rendering.  SOLR_ENV selects one of the", 
   "Solr environment configuration mappings defined in environment.rb ('development' by default).  solr.yml", 
   "eliminated (Ruby is a fine configuration language!).", 
   "* With the new DocumentController, a few custom results views have been added, one for UVa data (linking to VIRGO),", 
   "Tang poetry example (blending multiple languages), and a default development one that shows all fields returned", 
   "by Solr.", 
   "* Added paging to search results, finally.", 
   "* Configured in-place-editor of query to redirect, thereby refreshing the view with the changed criteria.", 
   "* Set Simile Exhibit/Timeline field mappings to MARC data example."
  ], 
  "revision_id": "511599"
 }, 
 {
  "author": "jstrachan", 
  "date": "2007-02-25T20:31:23.822033Z", 
  "msg": [
   "An improvement of AMQ-1075 so that the BLOB upload policy can be configured more easily together with a simple provider of the BlobUploadStrategy (with the actual implementation detail stubbed out). Also added brokerUploadUrl to BrokerInfo so that the broker can inform the clients where to upload out-of-band messages to. Finally added a JMSXMimeType helper method to the ActiveMQ extension API for doing selectors on MIME types"
  ], 
  "revision_id": "511598"
 }, 
 {
  "author": "jochen", 
  "date": "2007-02-25T20:30:49.180052Z", 
  "msg": [
   "Making commons-parent 2 the parent."
  ], 
  "revision_id": "511597"
 }, 
 {
  "author": "tabish", 
  "date": "2007-02-25T20:29:02.673019Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQCPP-30", 
   "Refactored the Prefered WireFormat info setup code, so that we can", 
   "get tight encoding working."
  ], 
  "revision_id": "511596"
 }
]