[
 {
  "author": "cschoett", 
  "date": "2007-02-27T17:39:43.005124Z", 
  "msg": [
   "Some cleanup of the controls-lifecycle sample."
  ], 
  "revision_id": "512335"
 }, 
 {
  "author": "bpendleton", 
  "date": "2007-02-27T17:38:53.597508Z", 
  "msg": [
   "DERBY-2371: Altering VARCHAR default fails when column contains data", 
   "Merged trunk revision 512019 to the 10.2 branch. Description of change:", 
   "Using ALTER TABLE to modify the default value for a VARCHAR column when", 
   "the column already contains data throws ERROR 22018: Invalid character", 
   "string format for type long.", 
   "The problem arises in AlterTableConstantAction.modifyColumnDefault, which", 
   "only understands two types of modifications that can be made to a", 
   "column's default value:", 
   "- changing the INCREMENT BY value for a generated IDENTITY column", 
   "- changing the RESTART WITH value for a generated IDENTITY column", 
   "But there is a third type of modification that can be made to a column's", 
   "default value, which is simply to change the default value that is to", 
   "be used for an ordinary column if no value is provided when inserting", 
   "a new row into that table.", 
   "The fix is to add a new ColumnInfo modification type code:", 
   "MODIFY_COLUMN_DEFAULT_VALUE", 
   "and to teach ModifyColumnNode and AlterTableConstantAction what to do", 
   "for modifications of type MODIFY_COLUMN_DEFAULT_VALUE."
  ], 
  "revision_id": "512334"
 }, 
 {
  "author": "handyande", 
  "date": "2007-02-27T17:34:44.352647Z", 
  "msg": [
   "Handle build results now too.", 
   "There is a continuum server side bug with getBuildResultsForProject though, so it is not working yet"
  ], 
  "revision_id": "512333"
 }, 
 {
  "author": "jstrachan", 
  "date": "2007-02-27T17:32:00.755828Z", 
  "msg": [
   "Allow an environment variable to be used to default the broker URL"
  ], 
  "revision_id": "512332"
 }, 
 {
  "author": "dkulp", 
  "date": "2007-02-27T17:30:28.700118Z", 
  "msg": [
   "MGPG-1, MGPG-2 - remove requirement of password being passed"
  ], 
  "revision_id": "512331"
 }
]