[
 {
  "author": "jvanzyl", 
  "date": "2007-02-28T01:24:26.347855Z", 
  "msg": [
   "o don't need settings in here anymore, as we'll move toward session and request level configuration and eventually have a single source passing through", 
   "the core."
  ], 
  "revision_id": "512545"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2007-02-28T01:23:32.866130Z", 
  "msg": [
   "o have very much simplified the use of settings use so the settings advice is not required as it is the job", 
   "of the client using the embedder to decide the semantics of use. some uses may have only one settings file, some may have five and", 
   "some may have none. trying to move away from hardwired usage patterns for the embedder. the cli is now responsible for dealing with what", 
   "is now standard insofar as user and global settings."
  ], 
  "revision_id": "512544"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2007-02-28T01:21:11.708395Z", 
  "msg": [
   "o use a MavenExecutionRequest to hold all the information we need so that we can move toward referencing a single source of configuration information", 
   "for session and request level."
  ], 
  "revision_id": "512543"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2007-02-28T01:18:01.787010Z", 
  "msg": [
   "o adding a way to set the local repository using a -D option", 
   "o make the cli handle things that are CLI specific like:", 
   "- the $m2_home/conf/settings.xml file and the standard ~/.m2/settings.xml file, i am still falling back", 
   "to this as people using the embedder have become used to this. but this has the effect of greatly", 
   "simplifying settings handling because it is up to the client code to define where settings are", 
   "and how they should be processed", 
   "o use an embedder configuration for things like settings and the local repository which generally remain constant, another", 
   "push toward a single source for session and request configuration information"
  ], 
  "revision_id": "512542"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2007-02-28T01:13:33.589588Z", 
  "msg": [
   "o we'll use the embedder now for some default values because we still have an asymmetry for many of the methods that", 
   "don't use an execution request, or configuration, but require direct use of things like settings and the local repository. an", 
   "example being the profile manager."
  ], 
  "revision_id": "512541"
 }
]