[
 {
  "author": "", 
  "date": "2007-03-03T01:23:40.995707Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "514045"
 }, 
 {
  "author": "hlship", 
  "date": "2007-03-03T01:22:56.532018Z", 
  "msg": [
   "Add missing resources needed to build the site."
  ], 
  "revision_id": "514044"
 }, 
 {
  "author": "jta", 
  "date": "2007-03-03T01:22:38.368601Z", 
  "msg": [
   "DERBY-2304 (partial)  Convert derbynet/callable.java to JUnit.", 
   "The old testBatch, which was commented out, is replaced by two new junit tests:", 
   "- xtestBatchUpdate() batches up calls to a SQL procedure that updates a", 
   "row in a table.", 
   "- xtestBatchUpdateError() does what the first test does, only now one of", 
   "the commands in the batch tries to update the row to a value that violates", 
   "the constraint check.", 
   "The old test is mildly complicated, with a two table schema and primary/foreign", 
   "keys. It looked to me like the test had two goals: test a batch that includes", 
   "calls to a sql procedure, and test a batch that does an sql update that", 
   "violates a constraint. (Incidently, the sql update seemed out of place in a", 
   "file that otherwise tests sql procedures and functions.)", 
   "I simplified the test for the junit conversion, and it now uses a single table", 
   "with a check constraint on column to test what happens when the constraint is", 
   "violated.  Also the constraint violation is split into a separate test and", 
   "tested in the context of a sql procedure call (in keeping with the rest of", 
   "the tests).", 
   "Left to do: remove derbynet/callable.java"
  ], 
  "revision_id": "514043"
 }, 
 {
  "author": "jfclere", 
  "date": "2007-03-03T01:20:48.860111Z", 
  "msg": [
   "Add a long note about the vulnerability."
  ], 
  "revision_id": "514042"
 }, 
 {
  "author": "awiner", 
  "date": "2007-03-03T01:16:23.991274Z", 
  "msg": [
   "ADFFACES-393: checking in latest patch from Gary Kind to support correct focus path for duplicate menu items"
  ], 
  "revision_id": "514041"
 }
]