[
 {
  "author": "hlship", 
  "date": "2007-03-05T21:55:16.614454Z", 
  "msg": [
   "TAPESTRY-1291: Make CaseInsensitiveMap threadsafe as long as it isn't being modified (it was completely non-threadsafe before)", 
   "TAPESTRY-1291: On an error inside OneShotServiceCreator, log the error and reset the lock flag (in case we try to instantiate the service again, later).", 
   "TAPESTRY-1308: Log exceptions as well as rendering the exception report page.", 
   "Split up the tapestry-core test suite into a few named tests."
  ], 
  "revision_id": "514880"
 }, 
 {
  "author": "rickhall", 
  "date": "2007-03-05T21:48:02.398094Z", 
  "msg": [
   "Added support for \"private\" and \"reexport\" require-bundle dependencies.", 
   "This required a change to the IWire interface to provide access to the", 
   "corresponding IRequirement for the wire so that the appropriate", 
   "\"visibility\" directive could be inspected. This change was rather tricky", 
   "given some of the ugliness of require-bundle. In particular, one", 
   "require-bundle dependency can effectively override the private-ness of", 
   "another require-bundle dependency if the required bundles export the", 
   "same packages. This required calculating the set of all required", 
   "packages and then merging it with a modules exported and re-exported", 
   "packages. Ugly stuff. I tried to add some more comments in the source", 
   "code to explain some of this stuff. (FELIX-28)"
  ], 
  "revision_id": "514879"
 }, 
 {
  "author": "kevan", 
  "date": "2007-03-05T21:45:45.466008Z", 
  "msg": [
   "GERONIMO-2838 Fix transaction recovery errors. A few changes from the last go-round. One, derby configuration problems have been fixed. Also, in AbstractConnectionManager we now insure that we're using the correct ManagedConnectionInfo. Also added additional logging in MCFConnectionInterceptor to capture failure information."
  ], 
  "revision_id": "514878"
 }, 
 {
  "author": "kmarsden", 
  "date": "2007-03-05T21:45:01.015497Z", 
  "msg": [
   "DERBY-2399 convert setTransactionIsolationIsolation to JUnit", 
   "Fix  setTransactionIsolation output to have single master and", 
   "include in JDBCHarnessJavaTest"
  ], 
  "revision_id": "514877"
 }, 
 {
  "author": "jboynes", 
  "date": "2007-03-05T21:40:03.818047Z", 
  "msg": [
   "move standalone plugin to contrib"
  ], 
  "revision_id": "514876"
 }
]