[
 {
  "author": "husted", 
  "date": "2004-07-07T10:00:24.000000Z", 
  "msg": [
   "Extend prior draft of bylaws page with additional material from Jakarta site and link into main menu."
  ], 
  "revision_id": "51619"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-07T01:46:42.000000Z", 
  "msg": [
   "As an exercise in pragmatism, I'm setting the shutdown port for the", 
   "Tomcat 5.0 tests from 9005 back to 8005 (the default).  This means you", 
   "have to shut down any standard installation of Tomcat 5.0 before running", 
   "the unit tests, but it also means they won't hang trying to shut down", 
   "Tomcat at the end of the test run.", 
   "Feel free to revert if this is controversial -- but then *you* get to", 
   "figure out why Tomcat does not respect the modified port number. :-)"
  ], 
  "revision_id": "51618"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-07T01:21:55.000000Z", 
  "msg": [
   "Swallow whitespace characters that were causing bogus equality failures", 
   "(^M^J does not match ^J).  With this change, and the previously commented", 
   "out tests on cookies (because Cactus appears not to include them in the", 
   "test request), 100% of \"ant test.tomcat.41\" now works for me.  I still get", 
   "a shutdown failure on \"test.tomcat.50\" but that doesn't appear to be related", 
   "to the tests themselves."
  ], 
  "revision_id": "51617"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-06T07:26:35.000000Z", 
  "msg": [
   "Include jakarta-oro.jar in the example and example2 webapps, since the", 
   "validator framework now relies on it."
  ], 
  "revision_id": "51616"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-06T06:38:52.000000Z", 
  "msg": [
   "Comment out the Cactus tests that require a cookie to be transmitted from", 
   "the test client, because it appears that my Cactus, at least", 
   "(jakarta-cactus-13-1.4.1) does not set cookies in the test request.  This", 
   "does not clear all the outstanding test issues, but does avoid a bunch of", 
   "them -- partial penance for disappearing from the face of the earth for", 
   "a couple of months :-)", 
   "Also cleaned up some ^M characters in the unit test sources that caused", 
   "the line numbers reported in exception stack traces to be off by a few", 
   "lines, which was *very* confusing."
  ], 
  "revision_id": "51615"
 }
]