[
 {
  "author": "craigmcc", 
  "date": "2004-07-08T04:17:47.000000Z", 
  "msg": [
   "Fix several flaws in the href URL being returned by <s:base>:", 
   "- A servler-relative URI (starting with \"/\") was being returned,", 
   "but the HTML spec says it must be absolute.", 
   "- The calculated URI was being mapped to FacesServlet, but we", 
   "really want the URI of a JSP page itself (if that's your", 
   "view technology).  This happens now, and the generated href", 
   "is identical in form to what the Struts <html:base> tag does.", 
   "While I was at it, I implemented a portlet-specific version of this", 
   "calculation as well, using reflection so that nothing bad happens if", 
   "the portlet API classes are not visible.  I don't have an environment", 
   "available to test this at the moment, but it *should* work."
  ], 
  "revision_id": "51629"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-08T01:11:28.000000Z", 
  "msg": [
   "Improve toolability by adding components with concrete properties, plus", 
   "more complete metadata describing the components and their properties.", 
   "Add \"binding\" attributes to the tags to enable component binding like that", 
   "used with standard JSF components."
  ], 
  "revision_id": "51628"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-07T22:31:33.000000Z", 
  "msg": [
   "Switch to client side state saving for one example app, to verify that", 
   "things work correctly."
  ], 
  "revision_id": "51627"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-07T22:08:56.000000Z", 
  "msg": [
   "Make locale changes performed in the usual Struts manner (session attribute", 
   "Globals.LOCALE_KEY) affect JSF component rendering as well.  This is done in", 
   "a custom ViewHandler implementation that decorates the standard one.", 
   "PR: 26895", 
   "Submitted by:  Arthur Fitt <arthur.fitt AT netregulus.com>"
  ], 
  "revision_id": "51626"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-07-07T21:12:43.000000Z", 
  "msg": [
   "Ensure that the tokens returned by TokenProcessor.generateToken() are", 
   "not the same, even if called quickly (within the same session) on a", 
   "fast processor.  A modified version of the submitted patch (thanks!)", 
   "was applied, leveraging David Graham's suggestion to simply keep track", 
   "of the last value that was used so it will not be repeated.", 
   "PR: 29943", 
   "Submitted by:\tErik van Oosten"
  ], 
  "revision_id": "51625"
 }
]