[
 {
  "author": "siren", 
  "date": "2007-03-11T07:36:56.207446Z", 
  "msg": [
   "change urlnormalizer-regex to use regular expressions from jre"
  ], 
  "revision_id": "516865"
 }, 
 {
  "author": "mamta", 
  "date": "2007-03-11T07:34:25.001544Z", 
  "msg": [
   "Patch for DERBY-2416 : Provide a shell for a subclass of SQLChar which will use the passed Collator to do the collation rather than", 
   "SQLChar's default collation of UCS_BASIC", 
   "This patch introduces a new class called CollatorSQLChar which extends SQLChar. The new class has a RuleBasedCollator associated with it", 
   "and that Collator object determines the collation. A new format id is added for this class and code regarding format id has gone into", 
   "RegisteredFormatIds, StoredFormatIds and DTSClassInfo.", 
   "The new class is bare minimum at this point and new collation related methods will be added to this class in later patches. This new class", 
   "does not get used in Derby at this point. The query compiler code will need to be changed so that this class can get some action. This will", 
   "happen in upcoming patches.", 
   "Dan had some suggestion on creating collation elements as required rather than doing it all upfront. Dag also had suggestion on alternative", 
   "implementation for array handling involved with collation element creation. We agreed on tackling these issues once the basic functionality", 
   "is in for language based ordering."
  ], 
  "revision_id": "516864"
 }, 
 {
  "author": "buschmi", 
  "date": "2007-03-11T07:06:40.548684Z", 
  "msg": [
   "LUCENE-761: The proxStream is now cloned lazily in SegmentTermPositions when nextPosition() is called for the first time."
  ], 
  "revision_id": "516863"
 }, 
 {
  "author": "siren", 
  "date": "2007-03-11T06:50:10.395983Z", 
  "msg": [
   "change urlnormalizer-basic to use regular expressions from jre"
  ], 
  "revision_id": "516862"
 }, 
 {
  "author": "nadiramra", 
  "date": "2007-03-11T06:22:39.925000Z", 
  "msg": [
   "AXISCPP-543 Code formatting to make more readable."
  ], 
  "revision_id": "516861"
 }
]