[
 {
  "author": "jkuhnert", 
  "date": "2007-03-17T18:11:43.929519Z", 
  "msg": [
   "Updated all relevant sections to bring surefire compatibility up to version 5.1 of TestNG.", 
   "-) Modified core TestNGDirectorySuite/ XmlSuite executors to use some testng internal annotation helpers in order to", 
   "correctly operate in 1.4 or >= 1.5 jre's.", 
   "-) Modified TestNGReporter to properly handle failures after a test suite has finished.", 
   "Still have more changes on reporting, and then attack the biggest pita of all of finding a way to prevent all those silly breaks."
  ], 
  "revision_id": "519380"
 }, 
 {
  "author": "danj", 
  "date": "2007-03-17T17:48:00.132511Z", 
  "msg": [
   "Fix for MUSE-211 - we were duplicating some tasks in SerializerRegistry.registerSerializer() in", 
   "AbstractIsolationLayer.initialize() and it was screwing up how the array versions of custom", 
   "serializers were mapped to the custom types. Also, there was logic in ReflectionMessageHandler.fromXML()", 
   "that goes against our WSDL conventions - array parameters should always have a wrapper element, even", 
   "if there's only one (array) parameter. The logic removed allowed there to be no wrapper if there was", 
   "just one (array) parameter, but this only confuses things."
  ], 
  "revision_id": "519379"
 }, 
 {
  "author": "gshimansky", 
  "date": "2007-03-17T17:41:49.774772Z", 
  "msg": [
   "Applied patch to fix HARMONY-3407 [drlvm][winx64][thread] 3 unit tests on thread manager fail on assertions", 
   "I've corrected types definitions to make IDATA and UDATA 64 bits long on all", 
   "x86_64 bits systems"
  ], 
  "revision_id": "519378"
 }, 
 {
  "author": "brianf", 
  "date": "2007-03-17T17:37:26.350525Z", 
  "msg": [
   "fixed up analyze output"
  ], 
  "revision_id": "519377"
 }, 
 {
  "author": "sebb", 
  "date": "2007-03-17T17:36:09.508650Z", 
  "msg": [
   "Bug 41873 - Add name to AssertionResult and display AssertionResult in ViewResultsFullVisualizer"
  ], 
  "revision_id": "519376"
 }
]