[
 {
  "author": "dushshantha", 
  "date": "2007-03-19T11:23:14.368166Z", 
  "msg": [
   "removed macros and corrected indentation."
  ], 
  "revision_id": "519910"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-03-19T11:13:45.059844Z", 
  "msg": [
   "Moved the principal-database and access sections in the xml under security.", 
   "Updated PlainPasswordFilePrincipalDatabase to include an AMQPLAIN authentication mechanism", 
   "Changed PlainPasswordVhostFilePrincipalDatabase to extend PlainPasswordFilePrincipalDatabase as it was the same code.", 
   "A few other whitespace changes and additional logging to better show why an error occurred such as was shown by the python tests."
  ], 
  "revision_id": "519909"
 }, 
 {
  "author": "gdamour", 
  "date": "2007-03-19T11:03:35.145380Z", 
  "msg": [
   "* Do not start jsr88-cli within the server. It defines a GBean implementing", 
   "the PluginInstaller type, GBean named ModuleConfigurerRegistry, which", 
   "is not intended to be used within a server as the other GBeans of this", 
   "module. This causes a NPE during the installation of plugins via the command", 
   "line deployer: CommandInstallCAR tries to execute startInstall", 
   "against all the GBeans implementing the PluginInstaller type and this", 
   "invokation fails with a NPE against ModuleConfigurerRegistry.", 
   "* Push up the DeploymentFactoryImpl implementation to BaseDeploymentFactory,", 
   "such that DeploymentFactoryWithKernel can extend it instead of", 
   "DeploymentFactoryImpl. This refactoring is done to ensure that", 
   "DeploymentFactoryWithKernel does not register a DeploymentFactoryImpl", 
   "instance with DeploymentFactoryManager (done via a static block).", 
   "This fixes GERONIMO-2983 Installation of plugins via the command line is", 
   "broken."
  ], 
  "revision_id": "519908"
 }, 
 {
  "author": "jstrachan", 
  "date": "2007-03-19T11:00:33.282008Z", 
  "msg": [
   "Moved the modules up out of the camel directory"
  ], 
  "revision_id": "519907"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-03-19T10:59:58.698689Z", 
  "msg": [
   "Added target to svn ignore list"
  ], 
  "revision_id": "519906"
 }
]