[
 {
  "author": "jsdelfino", 
  "date": "2007-03-19T18:38:09.416587Z", 
  "msg": [
   "Adjusted level of servlet API and junit"
  ], 
  "revision_id": "520040"
 }, 
 {
  "author": "mrglavas", 
  "date": "2007-03-19T18:34:38.994530Z", 
  "msg": [
   "Fixing the fix made to IDC in Revision 319835. There may be several", 
   "instances of the same field that may be active at a time so we", 
   "need a mayMatch flag per active XPath. This state is now stored in", 
   "the XPathMatcher. Incidentally, this should also improve performance", 
   "a bit since we're no longer churning a HashMap."
  ], 
  "revision_id": "520039"
 }, 
 {
  "author": "bpendleton", 
  "date": "2007-03-19T18:34:00.932344Z", 
  "msg": [
   "DERBY-1861: ASSERT when combining references and expressions in ORDER BY", 
   "An ORDER BY clause wihch combines both column references and expressions", 
   "causes the sort engine to throw an ASSERT failure in sane builds.", 
   "The data structure problems that are exposed by DERBY-1861 both have to do", 
   "with the duplicate elimination processing. When the duplicate pulled-up", 
   "columns are eliminated from the result column list, the OrderByColumn and", 
   "ResultColumn instances may both end up with incorrect values.", 
   "The OrderByColumn class contains a field named addedColumnOffset. This", 
   "field records the offset of this particular OrderByColumn within the", 
   "portion of the result column list which contains pulled-up columns.", 
   "Each time a column is pulled up into the result column list, its", 
   "addedColumnOffset is set; thus the first pulled-up column has", 
   "addedColumnOffset = 0, the second pulled-up column has", 
   "addedColumnOffset = 1, etc.", 
   "However, later, when duplicate pulled-up result columns are detected", 
   "and removed by bind processing, the addedColumnOffset field is not", 
   "re-adjusted, and ends up with an invalid value.", 
   "The ResultColumn class contains a field named virtualColumnId. For columns", 
   "which are not directly from the underlying table, but rather are the result", 
   "of expressions that are computed at runtime, the columns are assigned a", 
   "virtualColumnId. For reasons similar to those of the addedColumnOffset,", 
   "this field also ends up wiht an invalid value when the duplicate", 
   "pulled-up columns are detected and removed from the result column list.", 
   "I decided that the best thing was to arrange to call each of the", 
   "OrderByColumn instances and ResultColumn instances at the point that", 
   "the duplicate result column is detected and removed, to give each of", 
   "those objects a chance to adjust its addedColumnOffset and", 
   "virtualColumnId value to reflect the removed column. Although this change", 
   "required a number of small changes, none of them was terribly complicated,", 
   "and the effect of the fix is that the data structures are as desired."
  ], 
  "revision_id": "520038"
 }, 
 {
  "author": "rfeng", 
  "date": "2007-03-19T18:26:52.400017Z", 
  "msg": [
   "Add a test case for HelperContextProcessor"
  ], 
  "revision_id": "520037"
 }, 
 {
  "author": "chirino", 
  "date": "2007-03-19T18:26:09.156090Z", 
  "msg": [
   "renamed the seda component to queue"
  ], 
  "revision_id": "520036"
 }
]