[
 {
  "author": "chirino", 
  "date": "2007-03-20T00:22:28.697755Z", 
  "msg": [
   "Intial setup for future xbean integration.", 
   "- camel-core can now produce xbean annotated jars but does not directly depend on xbean", 
   "- add camel-xbean for camel extensions that depend on xbean.", 
   "- Hopefully one day we can also configure camel routes using xbean XML"
  ], 
  "revision_id": "520195"
 }, 
 {
  "author": "antelder", 
  "date": "2007-03-20T00:21:23.503316Z", 
  "msg": [
   "Update script mediator for latest BSF 3.0 snapshot"
  ], 
  "revision_id": "520194"
 }, 
 {
  "author": "djd", 
  "date": "2007-03-20T00:13:16.692460Z", 
  "msg": [
   "DERBY-2242 Add pattern testing to DatabaseMetaDataTest for the getColumnsModify() fixture,", 
   "hopefully in a way that will allow easy additon of other pattern matching tests for", 
   "other metadata methods."
  ], 
  "revision_id": "520193"
 }, 
 {
  "author": "reinhard", 
  "date": "2007-03-20T00:08:31.172069Z", 
  "msg": [
   "remove test tag"
  ], 
  "revision_id": "520192"
 }, 
 {
  "author": "abrown", 
  "date": "2007-03-20T00:06:00.866117Z", 
  "msg": [
   "DERBY-47 (partial): Patch which creates a new JUnit test based on the repro", 
   "program attached to the Jira.  The test creates the same kind of table and", 
   "data as that repro, and then runs three types of queries with larger and", 
   "larger IN lists. The three types of queries are:", 
   "1 - \"Markers\" : same as in the repro program", 
   "2 - \"Literals\" : same as in the repro program", 
   "3 - 'MixedIds\": IN list has a combination of parameter markers and literals.", 
   "For each query we check to make sure the results are correct and then we look", 
   "at the query plan to determine whether or not the optimizer chose to do multi-", 
   "probing. If the results are incorrect or if the optimizer did *not* choose", 
   "multi-probing then the test will fail.", 
   "The test determines that \"multi-probing\" was in effect by looking at the query", 
   "plan and verifying two things:", 
   "1. We did an index scan on the target table AND", 
   "2. The number of rows that \"qualified\" is equal to the number of rows that", 
   "were actually returned for the query."
  ], 
  "revision_id": "520191"
 }
]