[
 {
  "author": "jonesde", 
  "date": "2007-03-24T10:00:57.480056Z", 
  "msg": [
   "Added a bit of code to put FALSE in an SQL where clause instead of an empty IN set when that is detected; not sure if this is the best way to go, but it should be close to what we want and avoid a database error as happens now; chose FALSE because even though a value in the db could either always or never match an empty set, the never match seems to make more sense because if you would normally select various values and select none, you would be excluding all, unless you consider selecting none to mean that you want to include everything..."
  ], 
  "revision_id": "522000"
 }, 
 {
  "author": "jonesde", 
  "date": "2007-03-24T09:52:10.222065Z", 
  "msg": [
   "This is a fairly complete rework of the UtilCache use and the loading code in the service engine; a reload of service definitions should now be possible by clearing the cache; also removed a bunch of the other caches that were either redundant and annoying, or dangerous because clearing them would break things, perhaps unknowingly; these are some problems and really messy weird code that has been around for quite a while, finally got sick of it and decided it needed to go"
  ], 
  "revision_id": "521999"
 }, 
 {
  "author": "vmassol", 
  "date": "2007-03-24T09:09:15.853178Z", 
  "msg": [
   "* MCLOVER-66: The report goal doesn't support a user-provided Clover license", 
   "* MCLOVER-67: Remove deprecated licenseFile configuration parameter", 
   "* Update Clover license used in intergation tests"
  ], 
  "revision_id": "521998"
 }, 
 {
  "author": "elecharny", 
  "date": "2007-03-24T09:04:51.130937Z", 
  "msg": [
   "Backported Enrique modifications in 1.0 version. Lot of modifications,", 
   "because the classes now inherit IoHandler.", 
   "No more need of BouncyCastle in our code, except in Shared."
  ], 
  "revision_id": "521997"
 }, 
 {
  "author": "elecharny", 
  "date": "2007-03-24T09:01:17.322180Z", 
  "msg": [
   "Remove calls to Integer.valueOf( int) (not available in jdk 1.4)", 
   "Replaced the javax.naming.LdapName import by the com.sun.jndi.ldap.LdapName import", 
   "Replaced the use of LdapName with \", the sun version of LdapName does not handle correctly them."
  ], 
  "revision_id": "521996"
 }
]