[
 {
  "author": "gdaniels", 
  "date": "2007-03-27T20:55:44.033832Z", 
  "msg": [
   "A bunch of work to improve fault handling and SOAP version independence.  Still working on this a little, need to review tests a bit more, and at some point we really need to settle on a firmer design for version-independent fault handling.", 
   "* SOAP 1.1 doesn't have a fault <Node> concept, remove the APIs and tests.", 
   "* SOAP 1.1 doesn't have a faultCode <Value> concept, remove the APIs.", 
   "* Same with <Text> and <SubCode>.", 
   "* The above APIs mostly throw UnsupportedOperationException when called on SOAP 1.1 fault objects.", 
   "* Improve SOAPVersion API and use it more places.  Less string compares, and use the correct names for elements (we formerly were using the SOAP 1.2 local names even for the SOAP 1.1 elements, which was fine because of course that's what the tests were looking for... :) ).", 
   "* Fix tests to look for correct elements.", 
   "* Stop testing bad faults - soap11message.xml had incorrect fault elements (<soapenv:faultcode> instead of <faultcode>, etc).  Fix them and correctly build faults by looking for the right QNames (not just localnames).", 
   "* Adjust QName handling in OMText so that the actual text (i.e. \"prefix:local\") is preserved, and we use resolveQName() to get the value when asked.", 
   "* Fix a number of places where we were looking for the wrong child element now that getFirstChildWithName() accurately searches for QNames.", 
   "* Various bits of code cleanup."
  ], 
  "revision_id": "523075"
 }, 
 {
  "author": "dkulp", 
  "date": "2007-03-27T20:51:51.777446Z", 
  "msg": [
   "Switch to geronimo version of jsr181"
  ], 
  "revision_id": "523074"
 }, 
 {
  "author": "ate", 
  "date": "2007-03-27T20:48:34.655156Z", 
  "msg": [
   "removing dependency already \"provided\" by root pom"
  ], 
  "revision_id": "523073"
 }, 
 {
  "author": "cutting", 
  "date": "2007-03-27T20:47:48.961382Z", 
  "msg": [
   "HADOOP-1162.  Fix a bug in record CSV and XML serialization of binary values.  Contributed by Milind."
  ], 
  "revision_id": "523072"
 }, 
 {
  "author": "wisneskid", 
  "date": "2007-03-27T20:47:21.727476Z", 
  "msg": [
   "fixing indentation and few changes suggested by Abe for OpenJPA patch-168"
  ], 
  "revision_id": "523071"
 }
]