[
 {
  "author": "dandiep", 
  "date": "2007-03-31T20:17:23.375169Z", 
  "msg": [
   "Create an \"Object binding\". This allows local invocation of services", 
   "without any serialization. The binding and operation are selected", 
   "via properties on the message. I.e.", 
   "message.put(ObjectBinding.BINDING, new QName(\"someBinding\"));", 
   "message.put(ObjectBinding.OPERATION, new QName(\"someOperation\"));", 
   "We could maybe enhance this to work with URIs like James was suggesting", 
   "as well.", 
   "I made a few slight changes to the local transport to support this.", 
   "There is a DIRECT_DISPATCH flag which just tells the local transport", 
   "not to use streams, but instead to copy the content from the sent message", 
   "to a new message which is passed on to a Destination."
  ], 
  "revision_id": "524475"
 }, 
 {
  "author": "elecharny", 
  "date": "2007-03-31T19:57:28.816422Z", 
  "msg": [
   "Fixed DIRSERVER-889 : the ou attribute values where compared case sensitive when they shouldn't have been.", 
   "This was a consequence of using constants instead of Strings into the code."
  ], 
  "revision_id": "524474"
 }, 
 {
  "author": "elecharny", 
  "date": "2007-03-31T19:55:19.839223Z", 
  "msg": [
   "Used another constructor for MINA sockectAcceptor, to be able to use processors efficiently.", 
   "It solves a scaling pbs on multi-processors systems."
  ], 
  "revision_id": "524473"
 }, 
 {
  "author": "dandiep", 
  "date": "2007-03-31T19:19:09.102724Z", 
  "msg": [
   "o Fixed AbstractEndpointFactory to use the correct SOAP transport ID", 
   "o Added support for auto-detection of Spring. Now the extension manmager bus", 
   "will be used if Spring is not auto-detected on the classpath.", 
   "o Removed support for <endpoints> in CXFServlet. Now we just load Spring files.", 
   "I ran into a minor issue with a servlet test, but I'll post about that on", 
   "the mailing list shortly.", 
   "o Changed the DynamicClientFactory to use the JAXB simple binding if JAXB 2.1", 
   "is on the classpath. This helps JAXB generate better, friendlier objects.", 
   "o Move a test schema in the jaxb module which was being included in main/", 
   "o Removed a few spurious references to Spring classes which was preventing", 
   "users from running CXF without Spring.", 
   "o Fixed an issue with the easymock and the PolicyVerificationInInterceptorTest", 
   "and GC."
  ], 
  "revision_id": "524472"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2007-03-31T19:12:41.466927Z", 
  "msg": [
   "Added support for associating policy intents and policy sets to operations"
  ], 
  "revision_id": "524471"
 }
]