[
 {
  "author": "abrown", 
  "date": "2007-04-05T18:37:40.530059Z", 
  "msg": [
   "DERBY-2500: Fix PredicateList.orderUsefulPredicates() to recognize when we're", 
   "doing a hash join and to explicitly avoid generating probe predicates in that", 
   "case.  Also re-enable the \"testResultSetInOrderWhenUsingIndex()\" fixture for", 
   "lang/DistinctTest.java and add some additional test cases.  Finally, update", 
   "comments where appropriate to better explain the need for this restriction", 
   "on probe predicates."
  ], 
  "revision_id": "525925"
 }, 
 {
  "author": "rhillegas", 
  "date": "2007-04-05T18:31:44.188052Z", 
  "msg": [
   "DERBY-2502: Fix error in XMLTypeAndOpsTest introduced by ResultSet-closing patch."
  ], 
  "revision_id": "525924"
 }, 
 {
  "author": "dain", 
  "date": "2007-04-05T18:31:22.091676Z", 
  "msg": [
   "fix legal file additions for sources and javadoc archives"
  ], 
  "revision_id": "525923"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-04-05T18:15:32.002332Z", 
  "msg": [
   "Some refactoring of the object model regarding Templates, Resources, and Themes.", 
   "This commit introduces a more natural OO design with regards to weblog Themes and their relationship to Templates and Resources.  Here is an overview of what these changes are ...", 
   "Template (interface) - more abstract version of the old Template interface", 
   "ThemeTemplate (interface) - effectively the same as the old Template interface, a Template tied to a Theme", 
   "Resource (interface) - a generic interface representing a static resource", 
   "ThemeResource (interface) - a Resource tied to a Theme", 
   "Theme (interface) - access to the things which compose a weblog theme", 
   "WeblogTheme (abstract class) - an instance of a Theme for a given weblog", 
   "There are then included a variety of implementation classes and subclasses for these various interfaces."
  ], 
  "revision_id": "525922"
 }, 
 {
  "author": "gshimansky", 
  "date": "2007-04-05T18:12:49.775505Z", 
  "msg": [
   "Excluded stress.Sync on interpreter because of crash described in HARMONY-3581"
  ], 
  "revision_id": "525921"
 }
]