[
 {
  "author": "mamta", 
  "date": "2007-04-07T07:04:25.246780Z", 
  "msg": [
   "Committing the patch DERBY2530_create_alter_table_collation_type_v1_diff.txt attached to DERBY-2530. This patch changes alter table and", 
   "create table code so that the persistent user defined character types will have collation type of their schema.", 
   "svn stat -q", 
   "M      java\\engine\\org\\apache\\derby\\impl\\sql\\compile\\AlterTableNode.java", 
   "M      java\\engine\\org\\apache\\derby\\impl\\sql\\compile\\CreateTableNode.java", 
   "M      java\\engine\\org\\apache\\derby\\iapi\\sql\\dictionary\\SchemaDescriptor.java", 
   "This patch includes following changes", 
   "1)If a character type is getting added by alter table statement then AlterTable node needs to set the collation type of that character", 
   "column to same value as schema descriptor's collation type. Collation derivation of this column will be set to implicit.", 
   "2)For all the character columns that get added by create table statement, CreateTable node should set their collation type to same value", 
   "as schema descriptor's collation type. Collation derivation of such columns will be set to implicit.", 
   "3)Provide a method called getCollationType on SchemaDescriptor so that AlterTable node and CreateTable node can call that method."
  ], 
  "revision_id": "526385"
 }, 
 {
  "author": "azeez", 
  "date": "2007-04-07T06:54:36.189179Z", 
  "msg": [
   "Removing a System.out"
  ], 
  "revision_id": "526384"
 }, 
 {
  "author": "crossley", 
  "date": "2007-04-07T06:52:44.196526Z", 
  "msg": [
   "Remove the old document-v13 example. There is a copy at f.a.o/dtdx/"
  ], 
  "revision_id": "526383"
 }, 
 {
  "author": "azeez", 
  "date": "2007-04-07T06:48:44.509077Z", 
  "msg": [
   "Improving the displayed message", 
   "Set the event type in the event"
  ], 
  "revision_id": "526382"
 }, 
 {
  "author": "dain", 
  "date": "2007-04-07T06:44:40.418599Z", 
  "msg": [
   "NoSuchObjectException is an application exception"
  ], 
  "revision_id": "526381"
 }
]