[
 {
  "author": "cschoett", 
  "date": "2007-04-09T17:02:29.586793Z", 
  "msg": [
   "Fix for BEEHIVE-1189, JDBC system control batch updates not supporting bean parameters.", 
   "Added the ability to correctly process bean array parameter types on JDBC control methods which include the batchUpdate setting in their SQL annotation. This turned out to be more of an enhancement than a bug fix since this functionality did not previously exist.", 
   "In addition, added new JDBC control DRTs to test this fix.", 
   "DRTs: JDBC System control, controls core"
  ], 
  "revision_id": "526830"
 }, 
 {
  "author": "snoopdave", 
  "date": "2007-04-09T16:59:32.967172Z", 
  "msg": [
   "Having Ant 1.6.2 in the test path causes problems with Ant 1.7"
  ], 
  "revision_id": "526829"
 }, 
 {
  "author": "myrnavl", 
  "date": "2007-04-09T16:58:37.459165Z", 
  "msg": [
   "DERBY-2429 - remove file belonging to old resultset test (converted to junit, into ResultSetMiscTest, NullIfTest, and pieces into CastingTest)"
  ], 
  "revision_id": "526828"
 }, 
 {
  "author": "gdaniels", 
  "date": "2007-04-09T16:57:27.944630Z", 
  "msg": [
   "* Allow <handler> specifications inside a <phase> tag to parse WITHOUT requiring an <order> tag - it's silly to have handlers which are cleary inside the Dispatch phase, for instance, have to have <order phase=\"Dispatch\"/> when we can just infer it.  TODO - should confirm that handlers inside a <phase> don't actually conflict by claiming they're in another phase!", 
   "* Fix FileSystemConfigurator to actually look for an \"axis2.xml\" file in the root of the supplied repository directory.  If it's not there, don't throw a fault but instead use the default axis2.xml from the classpath.", 
   "* Fix broken SAAJ axis2.xml which was never being picked up because of the above.", 
   "* Fix tests which use \"basedir\" property to default to \".\" so that they can be used within an IDE.  Introduce a static AbstractTestCase.basedir which can be used by anyone.", 
   "* Code cleanup, fix misspellings."
  ], 
  "revision_id": "526827"
 }, 
 {
  "author": "rjung", 
  "date": "2007-04-09T16:56:54.167295Z", 
  "msg": [
   "Add missing svn properties."
  ], 
  "revision_id": "526826"
 }
]