[
 {
  "author": "mamta", 
  "date": "2007-04-12T18:18:22.684202Z", 
  "msg": [
   "Committing patch DERBY2535_Return_Collator_api_On_DVD_v1_diff.txt attached to DERBY2535. This patch adds the api on DVF to return the", 
   "Collator object depending on the collation type. The new api looks as follows", 
   "RuleBasedCollator getCharacterCollator(int collationType);", 
   "If the collation type is UCS_BASIC, then Collator object returned by the new api above will be null. If the collation type is", 
   "TERRITORY_BASED, then Collator object returned will be the one based on the territory of the database.", 
   "This new api will be used in a method on DataValueFactory(DVF) which will take format id and collation type and return a DVD based on", 
   "those 2 values. That method on DVF will first consturct a DVD using just the format id. For character trype format ids, this means that", 
   "the DVF will always be SQLChar/SQLVarchar/SQLLongvarchar/SQLClob. This is ok if we are dealing with collation type of UCS_BASIC. But if", 
   "the collation type is TERRITORY_BASED, then we shoould construct a DVD of type", 
   "CollatorSQLChar/CollatorSQLVarchar/CollatorSQLLongvarchar/CollatorSQLClob. In order to construct these collation sensitive DVDs, the method", 
   "on DVF will call the new api on DVF (getCharacterCollator) and it will use the return Collator from getCharacterCollator to construct the", 
   "right kind of character DVD."
  ], 
  "revision_id": "528070"
 }, 
 {
  "author": "jaz", 
  "date": "2007-04-12T18:11:46.937744Z", 
  "msg": [
   "added missing SecureRandom to SSL Factory"
  ], 
  "revision_id": "528069"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-04-12T18:09:50.307656Z", 
  "msg": [
   "The PlanetManager.getEntries() method for a single group should allow for a start and end date as well."
  ], 
  "revision_id": "528068"
 }, 
 {
  "author": "mikedd", 
  "date": "2007-04-12T18:03:24.006197Z", 
  "msg": [
   "rewording statement re Java6"
  ], 
  "revision_id": "528067"
 }, 
 {
  "author": "barrettj", 
  "date": "2007-04-12T18:00:29.665366Z", 
  "msg": [
   "AXIS2-2517", 
   "Fix the validation of checked exceptions between an SEI and a service implementation"
  ], 
  "revision_id": "528066"
 }
]