[
 {
  "author": "nettings", 
  "date": "2007-04-13T17:20:59.295017Z", 
  "msg": [
   "jdk-1.4-compatible precompiled anttasks (thanks to jonathan", 
   "addison)"
  ], 
  "revision_id": "528560"
 }, 
 {
  "author": "leosimons", 
  "date": "2007-04-13T17:19:54.301057Z", 
  "msg": [
   "Licensing fun with RDFStore.", 
   "* For all files that have a copyright identifying Alberto, Dirk or Asemantics,", 
   "replace the header with the apache standard one", 
   "* Normalize changelogs in headers of lib/RDFStore files", 
   "* For all files that seem part of the W3C testsuite do nothing", 
   "* W3C is known-bad at providing licenses for these testsuites, Dan Brickley", 
   "says probably no-one knows what the license is exactly, consider removing", 
   "from SVN completely", 
   "* For all files that are part of SFL, do nothing", 
   "* merge sfl-license.txt into LICENSE", 
   "* For all files that have no copyright header but where the CVS logs for the", 
   "file on sourceforge arguably show that they were written by Alberto, Dirk", 
   "or Asemantics, add the apache standard header", 
   "* For fraenkel_compress.c which has no clear origin, do nothing", 
   "* we should trace the true origin of this file and add an appropriate", 
   "header, or we should not use it!", 
   "* add a NOTICE file that complies with the SFL license, includes the same", 
   "information as the original notice appendix in the license header, and lists", 
   "copyright information"
  ], 
  "revision_id": "528559"
 }, 
 {
  "author": "ehillenius", 
  "date": "2007-04-13T17:16:39.878596Z", 
  "msg": [
   "More cleaning up. Session#update is not used anymore, and the detach logic is put into one method now. Also brought deferred invalidation of the session from WebSession to Session as there really wasn't a good reason not to have it there and it simplifies our code."
  ], 
  "revision_id": "528558"
 }, 
 {
  "author": "jm", 
  "date": "2007-04-13T17:12:30.561518Z", 
  "msg": [
   "bug 5403: trivial documentation fix: note that Mail::DomainKeys is officially unsupported, and quote the author of that module's thoughts on the matter in the SpamAssassin plugin's POD doc"
  ], 
  "revision_id": "528557"
 }, 
 {
  "author": "jm", 
  "date": "2007-04-13T17:09:00.294548Z", 
  "msg": [
   "bug 5398: 'remove' typoed as 'remote'. trivial fix"
  ], 
  "revision_id": "528556"
 }
]