[
 {
  "author": "antelder", 
  "date": "2007-04-17T18:16:57.480427Z", 
  "msg": [
   "Update for correct service URIs"
  ], 
  "revision_id": "529700"
 }, 
 {
  "author": "antelder", 
  "date": "2007-04-17T18:14:22.922918Z", 
  "msg": [
   "Axis2 binidng, more fixes for endpoint URIs"
  ], 
  "revision_id": "529699"
 }, 
 {
  "author": "jcompagner", 
  "date": "2007-04-17T18:13:46.313000Z", 
  "msg": [
   "switch component render and header contributions (so ajax and normal do have the same flow)"
  ], 
  "revision_id": "529698"
 }, 
 {
  "author": "mamta", 
  "date": "2007-04-17T18:08:49.750119Z", 
  "msg": [
   "This change provides a new interface on DataValueFactory(DVF) which will be used by Store. Store has format ids and collation types and needs", 
   "to have Objects created based on that information. This object creation will be supported by the new interface on DVF and it is called", 
   "getInstanceUsingFormatIdAndCollationType.", 
   "DVF will keep an array of InstanceGetters for all the format ids supported by Derby. Initially, this array won't have anything. Every time", 
   "this new interface is called on a new format id, the InstnaceGetter obtained will be saved in that array so next time around, we don't need", 
   "to create a new InstanceGetter for the same format id. The next time around, the new interface will find the InstanceGetter in the array", 
   "and will use that to create an object based on format id. If the collation type passed to the interface is UCS_BASIC, then the new interface", 
   "will simply return that object. If the collation type is territory based and the object returned for the format id is of type", 
   "StringDataValue, then the new interface will create a new DVD which is based on the territory based collation by calling", 
   "DVD.getValue(TerritoryBasedCollator)."
  ], 
  "revision_id": "529697"
 }, 
 {
  "author": "jaz", 
  "date": "2007-04-17T18:08:25.153742Z", 
  "msg": [
   "added Array to List conversion"
  ], 
  "revision_id": "529696"
 }
]