[
 {
  "author": "szoerner", 
  "date": "2007-04-17T18:42:25.260978Z", 
  "msg": [
   "A first version for a DOAP (\"Description Of A Project\") file for Apache Directory Server. It is needed to be listed at projects.apache.org."
  ], 
  "revision_id": "529705"
 }, 
 {
  "author": "ajaypaibir", 
  "date": "2007-04-17T18:38:22.678608Z", 
  "msg": [
   "Updated coloc binding to check for same OperationInfo and Class instance of parts on sender/receiver end."
  ], 
  "revision_id": "529704"
 }, 
 {
  "author": "imario", 
  "date": "2007-04-17T18:33:47.990679Z", 
  "msg": [
   "using url instead of relative path to ease (or make it work at all) site", 
   "building"
  ], 
  "revision_id": "529703"
 }, 
 {
  "author": "imario", 
  "date": "2007-04-17T18:33:09.410216Z", 
  "msg": [
   "added apache-site configuration"
  ], 
  "revision_id": "529702"
 }, 
 {
  "author": "jleroux", 
  "date": "2007-04-17T18:30:15.384698Z", 
  "msg": [
   "This fix \"Problem in the pos module related to item discount and sales discount\" (https://issues.apache.org/jira/browse/OFBIZ-828)", 
   "Fix a double bug in POS when using a discount (on item(s) or sale) and a cash amount higher than total (hence issuing change).", 
   "Though I'm sure that it corrects this double bug (in InvoiceServices.java) I commit it as CTR because I'm still not sure it corrects all the problems in accounting.", 
   "I also applied Si'advice from https://issues.apache.org/jira/browse/OFBIZ-828#action_12483045 in OrderServices.java even if I guess it was not needed (because I agree that  \"A payment of a negative amount is highly suspicious\")", 
   "This is enough from a POS POV, but I'm not sure that the corrects payments are generated (it generates paiements of zero value).", 
   "Anyway all the informations are there and it's usable as is. Let me know if you find the payments an issue, thanks.", 
   "BTW I noticed that there are still a *lot of* Doubles where BigDecimals should be used... (even after recent Scott's effort).", 
   "I hope to do an exhaustive work on this begining from POS (where there are only Doubles for now) ... one day... (before 2007 end, hopefully)"
  ], 
  "revision_id": "529701"
 }
]