[
 {
  "author": "asankha", 
  "date": "2007-04-25T17:59:55.848296Z", 
  "msg": [
   "minor refactoring to support conversion of a message into a response, even from script mediator code"
  ], 
  "revision_id": "532425"
 }, 
 {
  "author": "boisvert", 
  "date": "2007-04-25T17:59:11.437546Z", 
  "msg": [
   "Upgrade to Axis2 1.1.1, Axiom 1.2.4 and Woodstox 3.2.1"
  ], 
  "revision_id": "532424"
 }, 
 {
  "author": "jheymans", 
  "date": "2007-04-25T17:54:14.846247Z", 
  "msg": [
   "preparing for release -> 1) rolling back artifact versions and 2) setting the scope of pool-instrumented to provided, which is the only reason for this reason"
  ], 
  "revision_id": "532423"
 }, 
 {
  "author": "gdaniels", 
  "date": "2007-04-25T17:50:48.320187Z", 
  "msg": [
   "* Refactor deployment a bit to clean things up and get custom deployers actually working.  Get rid of a bunch of code that looked at (via string compares) the \"type\" field in order to decide what to do, and instead use polymorphism to do deployment.  Essentially this means we figure out which Deployer to use early on for DeploymentFileData/WSInfo, and store that away.  Then we can just call fileData.deploy() and it does the right thing.  Also notice how this simplifies WSInfoList.addWSInfoItem().", 
   "* Add a custom Deployer test", 
   "* Refactor DispatchPhase to do the work of InstanceDispatcher, to avoid a separate Handler which has confusing deployment characteristics.  Now at the end of the Dispatch phase, all the contexts and metadata are set up, instead of doing it afterwards in a separate place.  Will remove InstanceDispatcher next.", 
   "* Add convenience method addParameter(String, Object) to AxisDescription", 
   "* The usual general fixing up of code, spelling, JavaDoc, etc", 
   "TODO - This needs a little more cleanup and I'd like to merge WSInfo and DeploymentFileData into a single structure if possible to simplify further", 
   "TODO - Consider whether to make Deployers stateless/singletons?", 
   "TODO - Remove InstanceDispatcher"
  ], 
  "revision_id": "532422"
 }, 
 {
  "author": "eae", 
  "date": "2007-04-25T17:47:34.030840Z", 
  "msg": [
   "UIMA-275"
  ], 
  "revision_id": "532421"
 }
]