[
 {
  "author": "rayb", 
  "date": "2007-04-30T17:12:06.880435Z", 
  "msg": [
   "Applied fix from trunk for revision: 533801", 
   "Bug fixes for the findorders screen and new underlying service, hopefully all sorted now including links in from other screens. OFBIZ-933"
  ], 
  "revision_id": "533805"
 }, 
 {
  "author": "jacopoc", 
  "date": "2007-04-30T17:01:11.195736Z", 
  "msg": [
   "Applied small css change from Adrian Crum OFBIZ-947"
  ], 
  "revision_id": "533804"
 }, 
 {
  "author": "bago", 
  "date": "2007-04-30T16:57:17.191524Z", 
  "msg": [
   "Refactored the AbstractYamlTest so that most behaviour is configurable:", 
   "1) Ability to switch from mocked dnsservice to local \"fake dnsservice\".", 
   "2) Ability to swtich from SynchronousExecutor to the StagedAsynchronous resolver and to use the single threaded dnsjava lookup, the multithreaded dnsjava lookup or the SEDA 2-threads dnsjnio lookup.", 
   "3) Ability to run \"test groups\" (a group is a sequence of tests sharing the same \"fake\" dns zone) as a single test (to be able to run all of them and check results at the end, asynchronously if the executor was asynchronous)", 
   "Reconfigured the default testsuite as follow:", 
   "1) run all tests as before via mocked dns server and synchronous executor", 
   "2) run the full mailzone tests asynchronously via fake dnsserver and staged_dnsjnio_resolver", 
   "3) run the full rfc4408 tests asynchronously (each block separately because they define different dns zones) via fake dnsserver and staged_dnsjava_multithread_resolver.", 
   "It takes 50 seconds on my laptop to complete..."
  ], 
  "revision_id": "533803"
 }, 
 {
  "author": "sppatel", 
  "date": "2007-04-30T16:57:07.276238Z", 
  "msg": [
   "accept wildcards in include to ensure all features get picked up"
  ], 
  "revision_id": "533802"
 }, 
 {
  "author": "rayb", 
  "date": "2007-04-30T16:54:38.134543Z", 
  "msg": [
   "Bug fixes for the findorders screen and new underlying service, hopefully all sorted now including links in from other screens. OFBIZ-933"
  ], 
  "revision_id": "533801"
 }
]