[
 {
  "author": "gdaniels", 
  "date": "2007-05-07T18:39:30.951300Z", 
  "msg": [
   "Rejigger MetaDataEntry a little to make more sense (better names), and a variety of other small bits of cleanup."
  ], 
  "revision_id": "535950"
 }, 
 {
  "author": "kmarsden", 
  "date": "2007-05-07T18:37:48.940270Z", 
  "msg": [
   "DERBY-2230 AssertFailure: ByteCode Conditional then/else stack mismatch", 
   "The compiler/bytecode generator code does not load classes to check relationships or any other information. This is making things difficult to fix this bug. Also, I think it is not worth to go this way for a simple check that too in a DEBUG block.", 
   "Check for non-matching return types of then and else blocks in Conditional statement is made during bindExpression call and 42X89 is thrown if false. Hence, During byte code generation, check for non-matching return types is not required. I believe the assert check was included just to make sure that the stacks are consistent. But, it seems they do not consider a valid case where the two return types can have different vmNames (StringValue, ConcatableDataValue) which are assignable.", 
   "I have created a patch that works around this problem by adding another check for vmTypes. One of the reasons I chose vmType is because I saw BCMethod making its casting decision based on vmType.", 
   "Contributed by Mayuresh Nirhali (Mayuresh.Nirhali@Sun.COM)"
  ], 
  "revision_id": "535949"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-05-07T18:33:49.080285Z", 
  "msg": [
   "struts2 requires a recent version of commons-fileupload and commons-io to work properly."
  ], 
  "revision_id": "535948"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-05-07T18:33:12.384163Z", 
  "msg": [
   "more struts2 migration work.", 
   "- Template managment actions updated to remove ajax stuff 'cuz we aren't really ready for that yet.", 
   "- Uploaded Resources action migrated.", 
   "- Bookmarks management actions migrated."
  ], 
  "revision_id": "535947"
 }, 
 {
  "author": "tijs", 
  "date": "2007-05-07T18:32:33.486412Z", 
  "msg": [
   "Small fix for SYNAPSE-97 issue"
  ], 
  "revision_id": "535946"
 }
]