[
 {
  "author": "esm", 
  "date": "2007-05-17T01:02:52.364435Z", 
  "msg": [
   "Updating svn:ignore on base directory."
  ], 
  "revision_id": "538780"
 }, 
 {
  "author": "jwaldman", 
  "date": "2007-05-17T00:44:01.474481Z", 
  "msg": [
   "If the skin's stylesheetdocument id does not match the one that is on the requestMap, then we get a warning message.", 
   "This checkin elaborates more on what the possible problems could be if the stylesheetdocument ids don't match --", 
   "the jars are different or there are skin-additions in a trinidad-skins.xml file in a jar on one classpath but not the other."
  ], 
  "revision_id": "538779"
 }, 
 {
  "author": "awiner", 
  "date": "2007-05-17T00:39:21.579491Z", 
  "msg": [
   "TRINIDAD-21: dialog framework does not pin view state of launching page", 
   "- Enhance the TokenCache to support the concept of \"pinned\" tokens, which won't", 
   "be flushed until everything that is pinning them down is gone", 
   "- Add a unit test for token cache to verify the above is working", 
   "- Add StateManagerImpl APIs to get the state token used for a request,", 
   "and to store a token that should be \"pinned\" by the current request", 
   "- Add DialogServiceImpl APIs to stash off a state token for use", 
   "in the dialog about to be launched and to pin that state token later,", 
   "in each case using the StateManagerImpl APIs", 
   "- Call the DialogService CoreRenderKit to invoke the DialogServiceImpl APIs", 
   "at the start and end of rendering", 
   "- Fix use of generics in LRUCache", 
   "- Add enough to the launchDialog demo to verify this is working"
  ], 
  "revision_id": "538778"
 }, 
 {
  "author": "hlship", 
  "date": "2007-05-17T00:39:12.402536Z", 
  "msg": [
   "Fix bad markup on the project's index page."
  ], 
  "revision_id": "538777"
 }, 
 {
  "author": "boisvert", 
  "date": "2007-05-17T00:07:03.047939Z", 
  "msg": [
   "Prevent a condition where Ode is unable to restart after deploying a corrupted deployment unit"
  ], 
  "revision_id": "538776"
 }
]