[
 {
  "author": "mamta", 
  "date": "2007-05-17T18:23:41.572831Z", 
  "msg": [
   "DERBY-2599", 
   "Committing the patch DERBY2599_correct_collation_for_cast_v1_diff.txt attached to DERBY-2599 which will ensure that when an operand is", 
   "CASTed to string datatype, the result type will take the collation of the current schema. So, if current schema is user schema for a", 
   "database with territory based collation, then a comparison between a persistent character column from system table and a constant character", 
   "string will fail because persistent character column from system table will have the collation of UCS_BASIC but the constant character", 
   "string will pick up it's collation from current schema which is user schema and hence the collation will be territory based. Since the 2", 
   "collations don't match, we will get a compilation error for the query. To get around this, a user can rewrite the query to CAST persistent", 
   "character column from system table to one of the character types and that resultant character type will pickup it's collation from current", 
   "schema, so now both the operands will have collation of territory based and the query will execute without collation mismatch failure."
  ], 
  "revision_id": "539060"
 }, 
 {
  "author": "carlos", 
  "date": "2007-05-17T18:21:35.192999Z", 
  "msg": [
   "Use the right parent for trunk"
  ], 
  "revision_id": "539059"
 }, 
 {
  "author": "carlos", 
  "date": "2007-05-17T18:21:17.006066Z", 
  "msg": [
   "Merged 524429-524438 from wagon-1.x branch that were missing in trunk"
  ], 
  "revision_id": "539058"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2007-05-17T18:18:33.859600Z", 
  "msg": [
   "Bundle in r539054 as well to this backport proposal collection."
  ], 
  "revision_id": "539057"
 }, 
 {
  "author": "felixk", 
  "date": "2007-05-17T18:18:02.143393Z", 
  "msg": [
   "-add views and other matchers", 
   "-use servlet services", 
   "-reformatted"
  ], 
  "revision_id": "539056"
 }
]