[
 {
  "author": "tim", 
  "date": "2004-10-08T20:09:25.695595Z", 
  "msg": [
   "Change the private fireWidgetEvents() in Form.java to public", 
   "fireEvents() and have the js showForm(...) call it before", 
   "showing a form the first time.  This change is the most likely", 
   "to cause people trouble, so please check it and we can revert", 
   "the call in showForm() if necessary, since people who want it", 
   "could now add the call to their own flowscripts.", 
   "Fix a field widget bug that caused DeferredValueChangedEvent's", 
   "getOldValue() to always return null.", 
   "Have a union widget register a value changed listener against", 
   "its caseWidget so that it can track its inital case properly.", 
   "Clean up some whitespace."
  ], 
  "revision_id": "54109"
 }, 
 {
  "author": "chirino", 
  "date": "2004-10-08T19:31:30.931975Z", 
  "msg": [
   "Moved to 1.2-SNAPSHOT of activemq."
  ], 
  "revision_id": "54108"
 }, 
 {
  "author": "ddewolf", 
  "date": "2004-10-08T19:30:58.568606Z", 
  "msg": [
   "Adding JavaDocs."
  ], 
  "revision_id": "54107"
 }, 
 {
  "author": "ddewolf", 
  "date": "2004-10-08T19:28:04.566886Z", 
  "msg": [
   "Adding the beginings of a todo list.  This may give people an idea of where to start if they're looking to get involved.  Hopefully others will add to it."
  ], 
  "revision_id": "54106"
 }, 
 {
  "author": "kylem", 
  "date": "2004-10-08T19:23:17.556017Z", 
  "msg": [
   "Modified ControlBean serialization so all references to contextual services will be nulled", 
   "prior to serialization.  If the bean instance is deserialized, contextual services refs are", 
   "lazily reconnected upon the first invocation on the bean.   The implication, though, is that", 
   "all contextual services should be stateless, at least w.r.t. serialization boundaries of the", 
   "container controls are executing in.", 
   "Added a junit test case to validate that behavior, that will inspect service references in", 
   "writeObject (to ensure they are null) and exercises contextual services after deserialization.", 
   "Also did some minor cleanup on how control impl initialization is done so it could be", 
   "leverage for the service re-init above.  Pushed invocation of nested control ref initializer", 
   "down into the generated impl initializer, instead of doing it generically using reflection", 
   "in the ControlBean base class."
  ], 
  "revision_id": "54105"
 }
]