[
 {
  "author": "rbowen", 
  "date": "2007-05-25T15:11:46.471911Z", 
  "msg": [
   "Adds an example using multiple file extensions, to answer a", 
   "frequently-asked (IRC) question that came up yet again today."
  ], 
  "revision_id": "541685"
 }, 
 {
  "author": "tabish", 
  "date": "2007-05-25T15:10:07.010357Z", 
  "msg": [], 
  "revision_id": "541684"
 }, 
 {
  "author": "tabish", 
  "date": "2007-05-25T15:09:43.394445Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQCPP-108", 
   "MAde the connector use a Stomp Connection Negotiator that handles the connection phase, no other changes to the Connector other than to use this were made.  The negotiator requires that the ConnectedCommand is no longer a Response derived object, but once it gets it it creates a ConnectedWrapper instnace that is a response so that request can return it."
  ], 
  "revision_id": "541683"
 }, 
 {
  "author": "hlship", 
  "date": "2007-05-25T15:07:05.037012Z", 
  "msg": [
   "TAPESTRY-1373: Recreate T4's Palette component for T5", 
   "Partial support for controlling whether the Palette supports reordering or not.", 
   "Improve the L&F of the Palette control images (select, deselect, etc.)", 
   "Introduce SelectModelVisitor interface, to navigate a SelectModel in proper order.", 
   "Move common rendering logic in Select and Palette to a new SelectModelRenderer class.", 
   "New TransformationException catches errors when transforming a class, or loading a transformed class, plus hooks to properly format the transformation inside the exception report page."
  ], 
  "revision_id": "541682"
 }, 
 {
  "author": "dasarath", 
  "date": "2007-05-25T15:06:24.862185Z", 
  "msg": [
   "* server-only-config_with_WSBA.wsdd", 
   "if you run a WS-BA and WS-BA-I coordination service (you do your", 
   "coordination yourself or provide coordination services)", 
   "* server-participant-only-config_with_WSBA.wsdd", 
   "if you run a WS-BA participant only service (e.g. you are an airline,", 
   "hotel chain, ...)", 
   "* server-participant-only-with-test-config_with_WSBA.wsdd", 
   "if you run a WS-BA participant with additional services enabled to", 
   "facilitate testing.", 
   "Hannes Erven, Georg Hicker"
  ], 
  "revision_id": "541681"
 }
]