[
 {
  "author": "dfs", 
  "date": "2001-05-17T21:16:14.000000Z", 
  "msg": [
   "Made a backwards-incompatible change in the Substitution interface.", 
   "The input parameter is now a PatternMatcherInput instance instead", 
   "of a String.  A new substitute method was added to Util to allow", 
   "programmers to reduce the number of string copies in the existing", 
   "substitute() implementation and also to provide the oft-requested", 
   "ability to know how many substitutions were performed.  This", 
   "required that the Substitution interface be changed.  The existing", 
   "Substitution implementing classes do not use the input parameter and", 
   "it is very easy for anyone implementing the Substitution interface in", 
   "a custom class to update their class to the new interface.  A", 
   "deprecation phase was skipped because it would have still required", 
   "implementors of the interface to implement a method with the new signature."
  ], 
  "revision_id": "54319"
 }, 
 {
  "author": "dfs", 
  "date": "2001-05-17T19:00:55.000000Z", 
  "msg": [
   "Added description of supported Perl5 regular expression syntax from the old", 
   "OROMatcher user's guide.  This will be moved into a new user's guide."
  ], 
  "revision_id": "54318"
 }, 
 {
  "author": "dfs", 
  "date": "2001-05-17T18:59:47.000000Z", 
  "msg": [
   "Applied Mark Murphy's patch that adds case modification support to", 
   "substitution processing.  Also updated the class documentation to", 
   "reflect the new behavior.  Also started process of updating javadoc", 
   "version tags and adding since tags to javadocs, moving the RCS Id tag", 
   "to the top of the file (well, after the license)."
  ], 
  "revision_id": "54317"
 }, 
 {
  "author": "dfs", 
  "date": "2001-05-17T03:51:48.000000Z", 
  "msg": [
   "Fixed error in README.  The information in this and other \"all-caps\" files", 
   "will probably be moved into xdocs as part of the documentation effort."
  ], 
  "revision_id": "54316"
 }, 
 {
  "author": "dfs", 
  "date": "2001-05-17T00:44:44.000000Z", 
  "msg": [
   "Added garish logo to documentation (modified build.xml, project.xml.  added", 
   "logo.gif and logoSmall.gif).", 
   "Added Mark Murphy to CONTRIBUTORS.", 
   "Added Id RCS tag to index.xml."
  ], 
  "revision_id": "54315"
 }
]