[
 {
  "author": "erodriguez", 
  "date": "2007-06-09T02:39:23.810934Z", 
  "msg": [
   "Sample keytab file and config file for jGSS."
  ], 
  "revision_id": "545685"
 }, 
 {
  "author": "erodriguez", 
  "date": "2007-06-09T02:34:52.089695Z", 
  "msg": [
   "Initial commit of example demonstrating Kerberos-authentication to a Wicket application."
  ], 
  "revision_id": "545684"
 }, 
 {
  "author": "dwoods", 
  "date": "2007-06-09T02:30:11.707365Z", 
  "msg": [
   "GERONIMO-3232 Change J2G sources tool to pickup import changes on the fly instead of needing to be run twice"
  ], 
  "revision_id": "545683"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-06-09T02:11:23.580566Z", 
  "msg": [
   "refining theme stylesheet integration.", 
   "1. stylesheets are now a first class citizen of themes such that all themes provide a getStylesheet() method which returns the stylesheet for the theme if it is available.", 
   "2. stylesheets are treated a little better in our theme.xml descriptor files.  stylesheets are no longer just a simple path but are actually a template with a little special consideration.", 
   "3. there is no longer a need for different theme stylesheet and a stylesheet override, they are now just the same thing which makes things easier on users and theme developers.", 
   "4. the stylesheet editor in the UI can now start by copying the stylesheet from the theme, giving users a starting point for their css edits and eliminating the need for css styling overrides which is more confusing and error prone due to the way css inheritance works.", 
   "5. eliminated the old weblog.getPageByXXX() methods since those have been replaced with the getTheme().getTemplateByXXX() methods.", 
   "6. updated built-in themes to take advantage of these changes which simplifies the theme styling, eliminates the old _css template, and makes css customization easier."
  ], 
  "revision_id": "545682"
 }, 
 {
  "author": "myrnavl", 
  "date": "2007-06-09T02:01:04.132304Z", 
  "msg": [
   "DERBY-1355 - ClientDriver ResultSetMetaData.isAutoIncrement(column) now returns appropriate value.", 
   "Patch contributed by Mayuresh Nirhali.", 
   "In addition, corrected text to be printed out in case of a failure in one of the test cases in test AIjdbc.java."
  ], 
  "revision_id": "545681"
 }
]