[
 {
  "author": "apetrenko", 
  "date": "2007-06-14T10:48:09.162293Z", 
  "msg": [
   "x86_64 fontlib build fix", 
   "clean target added for frontlib"
  ], 
  "revision_id": "547210"
 }, 
 {
  "author": "oching", 
  "date": "2007-06-14T10:47:02.567787Z", 
  "msg": [
   "MRM-409 and MRM-376", 
   "-Added pom validation in ProjectModelToDatabaseConsumer", 
   "-Added handling of ObjectNotFoundException in ShowArtifactAction", 
   "-Created a new class CorruptArtifactReport for corrupt/invalid pom or artifact repository problem (to be added in database)"
  ], 
  "revision_id": "547209"
 }, 
 {
  "author": "tellison", 
  "date": "2007-06-14T10:43:55.590602Z", 
  "msg": [
   "Apply patch HARMONY-4157 ([classlib][luni][java6] Modify NetworkInterfaceTest for the new methods of Java6)"
  ], 
  "revision_id": "547208"
 }, 
 {
  "author": "tellison", 
  "date": "2007-06-14T10:39:57.117956Z", 
  "msg": [
   "Apply patch HARMONY-4156 ([classlib][luni][java6] Add new methods for java.net.NetworkInterface)"
  ], 
  "revision_id": "547207"
 }, 
 {
  "author": "mamta", 
  "date": "2007-06-14T10:35:13.624785Z", 
  "msg": [
   "DERBY-2723", 
   "The RoutineAliasInfo for user defined function stores the collation infomraiton about it's return type and parameters if they happen to be", 
   "character string type. This commit makes sure that for those DTDs, we use the collation of the schema in which the function is getting", 
   "defined. The existing code creates these DTDs at the parse time but the SchemaDescriptor for the function is not available at that stage. To", 
   "get around this, at the bind time, we check in CreateAliasNode if we are dealing with any character string types in the function definition.", 
   "If yes, then we create new DTDs which are based on the ones created during the parse time, but we set the correct collation informaiton on", 
   "them. And then we recreate a new RoutineAliasInfo using the infomration from parse time RoutineAliasInfo and the newly created DTDs. I have", 
   "added a CREATE FUNCTION using character string types in CollationTest. Code to use this collation information correctly when the function", 
   "gets used inside a sql will go in as a separate patch."
  ], 
  "revision_id": "547206"
 }
]