[
 {
  "author": "craigmcc", 
  "date": "2004-10-16T00:14:53.335332Z", 
  "msg": [
   "Commit the proposed change (from Piero Colagrosso, <pcolagrosso AT yahoo.com>)", 
   "to FacesTileRequestProcessor.  This change cures the \"blank page\" scenarios", 
   "that I was able to reproduce -- hopefully others will download tonight's", 
   "nightly build (20041016) and test this in their own code.", 
   "PR:  Bugzilla #30696."
  ], 
  "revision_id": "54884"
 }, 
 {
  "author": "craigmcc", 
  "date": "2004-10-16T00:07:05.530653Z", 
  "msg": [
   "Rearrange the license text so that it doesn't cause script parsing errors", 
   "in Mozilla/1.6."
  ], 
  "revision_id": "54883"
 }, 
 {
  "author": "aslom", 
  "date": "2004-10-15T23:01:20.130718Z", 
  "msg": [
   "applied patch"
  ], 
  "revision_id": "54882"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-10-15T22:14:44.221104Z", 
  "msg": [
   "updating names of classes that are BootstrapProducers"
  ], 
  "revision_id": "54881"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-10-15T22:11:06.152656Z", 
  "msg": [
   "Commit changes ...", 
   "o removed all factory interfaces in favor of producers that announce each", 
   "schema object created as they are created", 
   "o modified any factory implementations to now fit the producer cb model", 
   "o drastically simplified the BootstrapSchemaLoader using new producer cb model", 
   "o added a type safe enumeration for ProducerTypes", 
   "Conclusions ...", 
   "o the cb based producers have resulted in much less and cleaner code without", 
   "all those darn factories", 
   "o the cb model solves several issues with schema objects that depend on other", 
   "schema objects of the same type", 
   "- ObjectClasses depend on other ObjectClasses and hence there is potential", 
   "for an ObjectClass definition a schema to be reused by another ObjectClass", 
   "definition in the same schema; this presents a problem with the bulk load", 
   "approach which does not update the registry as we go", 
   "- AttributeTypes also depend on other superior AttributeTypes and hence have", 
   "the same issues as ObjectClasses"
  ], 
  "revision_id": "54880"
 }
]