[
 {
  "author": "ayza", 
  "date": "2007-06-20T15:28:58.190859Z", 
  "msg": [
   "Applying patch and unit test from HARMONY-4011 ([classlib][beans] compatibility: java.beans.beancontext.BeanContextSupport allows registering the same listener several times)"
  ], 
  "revision_id": "549135"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-06-20T15:28:09.961042Z", 
  "msg": [
   "update to sql script runner test missing from last commit."
  ], 
  "revision_id": "549134"
 }, 
 {
  "author": "antelder", 
  "date": "2007-06-20T15:28:00.682393Z", 
  "msg": [
   "TUSCANY-1363, add osgi sample conributed by Rajini Sivaram"
  ], 
  "revision_id": "549133"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-06-20T15:27:15.077724Z", 
  "msg": [
   "a number of tweaks and improvements for Weblogger application lifecycle management which is meant to improve the auto install process a bit.", 
   "1. Introduced new WebloggerStartup class which acts as the managing class for the core application startup services such as getting the database provider, mail provider, and running db install/upgrade logic.", 
   "2. Sectioned out and setup a bootstrapping state and initialization state of the application, each of which are run independently.", 
   "3. Removed attempts to run a fallback RollerImpl during the bootstrapping process when the configured Roller class fails, this just doesn't make sense in the end.  If your desired Roller backend fails for some reason you may not want the fallback alternative.", 
   "4. Merged many of the install related struts2 actions into one Install action because it was easier that way and the multiple actions weren't really needed.", 
   "5. Cleaned up RollerContext startup procedures to make use of this new layered startup procedure."
  ], 
  "revision_id": "549132"
 }, 
 {
  "author": "jorton", 
  "date": "2007-06-20T15:27:08.766991Z", 
  "msg": [
   "Tweak text for PR 39245 fix; handling of 1xx interim responses is", 
   "not affected by this change."
  ], 
  "revision_id": "549131"
 }
]