[
 {
  "author": "sebb", 
  "date": "2007-06-23T00:55:46.766038Z", 
  "msg": [
   "Replace deprecated delete by nested version"
  ], 
  "revision_id": "549985"
 }, 
 {
  "author": "sebb", 
  "date": "2007-06-23T00:54:58.195806Z", 
  "msg": [
   "Update version check for SampleSaveConfigurationConverter"
  ], 
  "revision_id": "549984"
 }, 
 {
  "author": "wsmoak", 
  "date": "2007-06-23T00:25:35.763365Z", 
  "msg": [
   "MRM-424 include 'apache' and the version number in the distribution filenames", 
   "How do I get the source distro to unpack to a directory ending in -src?"
  ], 
  "revision_id": "549983"
 }, 
 {
  "author": "kenney", 
  "date": "2007-06-22T23:54:45.827761Z", 
  "msg": [
   "Move osgi bundle manifest generation to osgi profile.", 
   "The generated manifests are incorrect, for instance, maven-project's manifest", 
   "misses the package-import org.apache.maven.artifact.transform which should come from", 
   "maven-artifact CacheAware*.java.", 
   "Further, this doesn't work in an osgi environment, since if each artifact", 
   "is a bundle, then maven-embedder must have access to all component.xml files", 
   "in all maven core artifacts, and in all dependencies (which aren't bundles", 
   "but that can be fixed).", 
   "Osgi import/exports for packages work for resources too, but META-INF/ isn't", 
   "a package so this doesn't work. This may work with 'Require-Bundle'", 
   "(it does in my implementation although i don't think i follow the spec entirely ;)).", 
   "The next problem you get is classcasts for wagon (httplightweightwagon). This", 
   "has to be included in a bundle too and get proper exports. The same goes", 
   "for all other dependencies (plexus-*).", 
   "Maven and plexus are not suited for osgi yet - too much changing is required", 
   "in both the metadata structure, the code, and all dependencies and/or", 
   "packaging and binary inclusion of dependencies to make this work.", 
   "The best bet is to use the one-artifact embedder."
  ], 
  "revision_id": "549982"
 }, 
 {
  "author": "wsmoak", 
  "date": "2007-06-22T23:43:02.989970Z", 
  "msg": [
   "MRM-423 include license and notice in the source distribution"
  ], 
  "revision_id": "549981"
 }
]