[
 {
  "author": "apatel", 
  "date": "2007-06-24T05:37:09.314957Z", 
  "msg": [
   "first pass of confirm service."
  ], 
  "revision_id": "550170"
 }, 
 {
  "author": "jacopoc", 
  "date": "2007-06-24T05:36:49.208640Z", 
  "msg": [
   "This is a poc for the new code and features inplemented in rev. 550168.", 
   "I've modified the list form in the Catalog--> Product --> Locations screen to show the new features now available in form widgets:", 
   "1) each item in the list is split into two different rows (position 1 and 2): position 1 is for the facility name, position 2 is for all the remaining fields, including input/hidden/buttons that will go in the form", 
   "2) since the fields are derived from a service using the auto-fields-service, I've used the new attribute 'default-position' to set for them the position2", 
   "3) we want to show the field at position 1 (facility name) only when facility is different from the previous record: I've used a row-action to set the boolean variable (the action uses the new 'previousItem' map that is now available in the context and contains the data of the previous item in the list) and a use-when attribute"
  ], 
  "revision_id": "550169"
 }, 
 {
  "author": "jacopoc", 
  "date": "2007-06-24T05:09:41.217532Z", 
  "msg": [
   "Implemented support for the 'position' attribute in list based form widgets.", 
   "1) added new attribute,  'default-position', to the auto-fields-entity and auto-fields-service element: this is useful to specify a default position for the fields inherited by an entity or service definition", 
   "2) change the signature of two methods in the FormStringRendered interface (and classes that implement it), to pass the number of columns spanned (in header and item rows)", 
   "3) a lot of code has been refactored/modified in the ModelForm class: new support for position in list, code cleanups with no functional changes, bug fixes (including bugs reported in OFBIZ-1071 and OFBIZ-542), added comments to code, formatting fixes"
  ], 
  "revision_id": "550168"
 }, 
 {
  "author": "jacopoc", 
  "date": "2007-06-24T04:53:09.922057Z", 
  "msg": [
   "Misc cleanups to a form definition, found while testing the new form widget enhancements."
  ], 
  "revision_id": "550167"
 }, 
 {
  "author": "schor", 
  "date": "2007-06-24T03:49:59.271528Z", 
  "msg": [
   "no Jira - substitute itemized list for simplelist which wasn't doing the right thing, and", 
   "generating \"severe\" error messages from FOP 0.93"
  ], 
  "revision_id": "550166"
 }
]