[
 {
  "author": "mamta", 
  "date": "2007-07-06T05:13:13.133893Z", 
  "msg": [
   "DERBY-2777", 
   "TernaryOperatorNode was incorrectly setting up collation for non-character string type. Collation only applies to character", 
   "string types. Also, fixed a comment to be more meaningful."
  ], 
  "revision_id": "553735"
 }, 
 {
  "author": "pyang", 
  "date": "2007-07-06T05:10:30.524972Z", 
  "msg": [
   "create tag based on trunk@r553714 to mark the latest merge revision from trunk to java6 branch"
  ], 
  "revision_id": "553734"
 }, 
 {
  "author": "pyang", 
  "date": "2007-07-06T05:10:09.807277Z", 
  "msg": [
   "Remove the old tag based on r552679"
  ], 
  "revision_id": "553733"
 }, 
 {
  "author": "pyang", 
  "date": "2007-07-06T05:09:57.115359Z", 
  "msg": [
   "Merge updates from classlib trunk@553714 since r552679"
  ], 
  "revision_id": "553732"
 }, 
 {
  "author": "mamta", 
  "date": "2007-07-06T05:01:24.279987Z", 
  "msg": [
   "Merging checkin 553727 from main into 10.3.1.1 codeline. The checkin comment for main were as follows", 
   "DERBY-2777", 
   "Currently, the parameters in TRIM clause always pickup their collation from the compilation schema. That logic is not", 
   "complete. I am fixing that logic here along with addition of some tests.", 
   "For the sake of explanation, let me use the following syntax for TRIM clause", 
   "TRIM (leftOperand FROM receiver)", 
   "With the fix in this patch, if receiver is a parameter, it will set it's collation using following logic", 
   "1)check if leftOperand is not a parameter. If yes, then receiver will pick up collation from leftOperand. If not, goto step 2", 
   "2)receiver picks up the collation of the compilation schema because everything in the TRIM clause is ?", 
   "Next, if leftOperand is a parameter, it will set it's collation using receiver. By this time, even if receiver is a", 
   "parameter, we have set correct collation for receiver and hence leftOperand can simply rely on receiver for correct", 
   "collation IF leftOperand is a parameter."
  ], 
  "revision_id": "553731"
 }
]