[
 {
  "author": "clombart", 
  "date": "2007-07-10T21:32:45.242410Z", 
  "msg": [
   "patch for issue JCR-998 provided by Carlos Sanchez ( annotation support - still in progress)"
  ], 
  "revision_id": "555085"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-07-10T21:25:59.029676Z", 
  "msg": [
   "introducing comment plugins to provide greater control and flexibility over how weblog comments are handled.  A number of things changed in this commit ...", 
   "1. Added new column 'plugins' to roller_comment table, varchar(255).", 
   "2. Added new attribute 'plugins' to WeblogEntryComment pojo, including mapping elements in jpa and hibernate mapping files.", 
   "3. Added new interface WeblogEntryCommentPlugin in business.plugins.comment package.  Interface has 1 method, render(comment) which returns a string of the transformed content.", 
   "5. Added 2 new comment plugins, AutoformatPlugin and HTMLSubsetPlugin, to replace old functionality.", 
   "6. Added 2 new methods to PluginManager and PluginManagerImpl. applyCommentPlugins(comment) which returns a string, and getCommentPlugins() which returns the list of plugins.", 
   "7. Added new property 'comments.plugins.classnames' in roller.properties which lists the configured comment plugin classes.", 
   "8. Added new runtime property 'users.comments.plugins' which is a comma separated list of the plugins which are enabled.", 
   "9. Modified CommentServlet to basically call comment.setPlugins(runtimeConfig.getProp('users.comments.plugins')). This basically applies whatever comment plugins are configured to the specific comment as it gets saved.", 
   "10. Modified Comment pojo wrapper so that the call to getContent() actually applies plugins and other transformations before returning output.", 
   "11. Unit test for AutoformatPlugin.", 
   "12. Add to the current upgrade process to set 'users.comments.plugins' global property and each individual comment.plugins property if existing autoformat or htmlsubset functionality was enabled.", 
   "13. Cleanup current comment macros and move logic out of macro and into pojo wrapper.", 
   "TODO: the last remaining item regarding this work is to polish up the global settings page and remove the old comment properties and provide a nicer UI for enabling/disabling comment plugins."
  ], 
  "revision_id": "555084"
 }, 
 {
  "author": "gawor", 
  "date": "2007-07-10T21:21:27.559791Z", 
  "msg": [
   "updated to new javamail snapshot"
  ], 
  "revision_id": "555083"
 }, 
 {
  "author": "tabish", 
  "date": "2007-07-10T21:21:05.826051Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQCPP-128", 
   "Adding Iterator to the Collections classes to avoid having to call toArray as much."
  ], 
  "revision_id": "555082"
 }, 
 {
  "author": "ate", 
  "date": "2007-07-10T21:20:57.280846Z", 
  "msg": [
   "Minor textual correction"
  ], 
  "revision_id": "555081"
 }
]