[
 {
  "author": "psmith", 
  "date": "2007-07-10T22:18:23.759974Z", 
  "msg": [
   "Committing patch for Bug 42789 supplied by Isuru Suriarachchi", 
   "which allows saving of previous log filter expressions for named LogPanels.", 
   "This change uses a serialization version number to support previous older", 
   "versions of serialized settings."
  ], 
  "revision_id": "555100"
 }, 
 {
  "author": "ate", 
  "date": "2007-07-10T22:16:55.420028Z", 
  "msg": [
   "Automatically include Jetspeed-2 schemas in generated site to make it easier to update/replace the full site online and not accidentally forget or delete the schemas."
  ], 
  "revision_id": "555099"
 }, 
 {
  "author": "mbenson", 
  "date": "2007-07-10T22:16:02.416934Z", 
  "msg": [
   "small refactoring"
  ], 
  "revision_id": "555098"
 }, 
 {
  "author": "anathaniel", 
  "date": "2007-07-10T22:09:10.800656Z", 
  "msg": [
   "Some more hints what to do if build fails"
  ], 
  "revision_id": "555097"
 }, 
 {
  "author": "bpendleton", 
  "date": "2007-07-10T22:06:02.695913Z", 
  "msg": [
   "DERBY-2351: Certain ORDER BY clauses should be rejected as invalid", 
   "This change modifies the ORDER BY clause so that it rejects certain", 
   "queries as invalid: specifically, queries which:", 
   "a) specify the set quantifier DISTINCT,", 
   "b) and also contain an ORDER BY clause which refers to a column", 
   "or expression which is not in the query result.", 
   "The problem with such queries is that we are told to return only", 
   "a single instance of the DISTINCT columns, but since the ORDER BY", 
   "clause refers to columns which are not in the DISTINCT set, if there", 
   "should be multiple candidate rows from which we choose the DISTINCT", 
   "result, we don't know which of those rows to use for the ORDER BY", 
   "processing.", 
   "When the DISTINCT and ORDER BY clauses are in conflict, Derby should", 
   "reject the query. This change modifies Derby to do so."
  ], 
  "revision_id": "555096"
 }
]