[
 {
  "author": "jmsnell", 
  "date": "2007-07-12T21:39:44.440829Z", 
  "msg": [
   "Certain proxy servers return really wierd values for things like Age.  For instance, it appears that the WAS Edge Caching Proxy will return \"Age: -(\" on occasion, which", 
   "is really not all that cool"
  ], 
  "revision_id": "555780"
 }, 
 {
  "author": "rdonkin", 
  "date": "2007-07-12T21:36:51.157318Z", 
  "msg": [
   "Added license headers I missed."
  ], 
  "revision_id": "555779"
 }, 
 {
  "author": "mikem", 
  "date": "2007-07-12T21:36:37.371614Z", 
  "msg": [
   "DERBY-2931", 
   "In soft upgrade mode the format id of the new heap format was being written", 
   "out along with the old format metadata.  On reboot system would try to read", 
   "new format and fail.  Problem was that wrong format id was associated with", 
   "the soft upgrade version of the heap conglomerate class (Heap_v10_2.java).", 
   "The code change is just changing that format id from", 
   "StoredFormatIds.ACCESS_HEAP_V3_ID to StoredFormatIds.ACCESS_HEAP_V2_ID.  The", 
   "rest of the changes is comments in the code and updates to the upgrade test", 
   "suite.  The changes to the upgrade suite showed the problem before the fix in", 
   "both 10.3 branch and trunk and then passed once the fix was applied.  Adding", 
   "those tests actually caused some other tests in the upgrade suite to fail", 
   "which passed previously, and those cases were also fixed by this change."
  ], 
  "revision_id": "555778"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-07-12T21:35:11.918803Z", 
  "msg": [
   "plugins test suite"
  ], 
  "revision_id": "555777"
 }, 
 {
  "author": "agilliland", 
  "date": "2007-07-12T21:33:47.601282Z", 
  "msg": [
   "more work on fixing up handling of submitted comments and their formatting.", 
   "1. Introduced a new 'contentType' attribute to the comment pojo for tracking the content type of a comment.  Current valid options are 'text/plain' and 'text/html'.  Also added new db column roller_comment.contenttype defaulting to 'text/plain' and corresponding hbm and orm mapping file edits.", 
   "2. Updated comment pojo wrapper so that if the content type of a comment is 'text/plain' then it's content gets html escaped before plugins are rendered.", 
   "3. Added new runtime config property 'users.comments.htmlenabled' which defines the content type to be set for incoming comments.  if html is enabled then the content type is set to 'text/html' otherwise it is set to 'text/plain'.", 
   "4. Updated comment servlet so that an appropriate content type is set for incoming comments based on the 'users.comments.htmlenabled' setting.", 
   "5. Updated the database upgrade process to set a content type for all existing comments and to initialize the value of the 'users.comments.htmlenabled' property based on the values of old properties.", 
   "6. EOLed the old 'users.comments.escapehtml' and 'users.comments.autoformat' properties."
  ], 
  "revision_id": "555776"
 }
]