[
 {
  "author": "vsiveton", 
  "date": "2007-07-12T23:09:57.968260Z", 
  "msg": [
   "o bumped to maven-parent:6-SNAPSHOT", 
   "o renamed the artifact to doxia-site to be more conventional with other Maven projects", 
   "o removed non necessary images and style", 
   "o added the same site.css of Maven site", 
   "o updated the site.xml to take care of images"
  ], 
  "revision_id": "555810"
 }, 
 {
  "author": "andreas", 
  "date": "2007-07-12T23:04:31.740383Z", 
  "msg": [
   "Add area parameter to sitetree node URLs. This fixes bug 42877."
  ], 
  "revision_id": "555809"
 }, 
 {
  "author": "mikem", 
  "date": "2007-07-12T22:58:27.328523Z", 
  "msg": [
   "DERBY-2931, backporting from trunk to 10.3", 
   "In soft upgrade mode the format id of the new heap format was being written", 
   "out along with the old format metadata.  On reboot system would try to read", 
   "new format and fail.  Problem was that wrong format id was associated with", 
   "the soft upgrade version of the heap conglomerate class (Heap_v10_2.java).", 
   "The code change is just changing that format id from", 
   "StoredFormatIds.ACCESS_HEAP_V3_ID to StoredFormatIds.ACCESS_HEAP_V2_ID.  The", 
   "rest of the changes is comments in the code and updates to the upgrade test", 
   "suite.  The changes to the upgrade suite showed the problem before the fix in", 
   "both 10.3 branch and trunk and then passed once the fix was applied.  Adding", 
   "those tests actually caused some other tests in the upgrade suite to fail", 
   "which passed previously, and those cases were also fixed by this change."
  ], 
  "revision_id": "555808"
 }, 
 {
  "author": "ozeigermann", 
  "date": "2007-07-12T22:57:44.037082Z", 
  "msg": [
   "Completition of all features 2.0 should have. This still is work in progress and subject to change. Might not even compile right now."
  ], 
  "revision_id": "555807"
 }, 
 {
  "author": "kmarsden", 
  "date": "2007-07-12T22:52:09.646138Z", 
  "msg": [
   "DERBY-2931 move test case to BasicSetup"
  ], 
  "revision_id": "555806"
 }
]