[
 {
  "author": "brett", 
  "date": "2007-07-17T08:48:18.786281Z", 
  "msg": [
   "[SUREFIRE-338] allow disabling of assertions"
  ], 
  "revision_id": "556850"
 }, 
 {
  "author": "ivavladimir", 
  "date": "2007-07-17T08:42:18.342299Z", 
  "msg": [
   "patch for HARMONY-4291 was appliead"
  ], 
  "revision_id": "556849"
 }, 
 {
  "author": "brett", 
  "date": "2007-07-17T08:41:31.500853Z", 
  "msg": [
   "some clean up"
  ], 
  "revision_id": "556848"
 }, 
 {
  "author": "ritchiem", 
  "date": "2007-07-17T08:35:35.353760Z", 
  "msg": [
   "Update to the MessageStore Tool to provide Move and Purge functionality.", 
   "Updated to remove the AMQExceptions that will be removed from the Exchange class."
  ], 
  "revision_id": "556847"
 }, 
 {
  "author": "gsim", 
  "date": "2007-07-17T08:28:48.503902Z", 
  "msg": [
   "Some refactoring towards a more decoupled handler chain structure:", 
   "* Connection no longer depends on Channel; it contains a map of", 
   "FrameHandler::Chains. (The construction of the chains still refers", 
   "to specific handlers).", 
   "* Channel is no longer tied to ChannelAdapter through inheritance. The", 
   "former is independent of any particular handler chain or protocol", 
   "version, the latter is still used by ConnectionAdapter and", 
   "SemanticHandler in the 0-9 chain.", 
   "* A DeliveryAdapter interface has been introduced as part of the", 
   "separation of ChannelAdapter from Channel. This is intended to adapt", 
   "from a version independent core to version specific mechanisms for", 
   "sending messages. i.e. it fulfills the same role for outputs that", 
   "e.g. BrokerAdapter does for inputs. (Its not perfect yet by any", 
   "means but is a step on the way to the correct model I think).", 
   "* The connection related methods sent over channel zero are", 
   "implemented in their own adapter (ConnectionAdapter), and are", 
   "entirely separate from the semantic layer. The channel control", 
   "methods are still bundled with the proper semantic layer methods;", 
   "they too can be separated but would have to share the request id", 
   "with the semantic method handler due to the nature of the 0-9 WIP."
  ], 
  "revision_id": "556846"
 }
]