[
 {
  "author": "mamta", 
  "date": "2007-07-18T21:45:37.137537Z", 
  "msg": [
   "DERBY-2896", 
   "Backporting changes 557334 from main into 10.3 codeline. The commit comments for 557334 were as follows", 
   "Metadata calls getTables and getUDTs were failing when run from a user schema in a territory based collated database.", 
   "The reason for it is that these metadata calls were not getting compiled in SYS schema when they were executed from", 
   "a user schema. Metadata calls should always compile in SYS schema no matter what the current schema might be. The", 
   "reason getTables was not getting compiled in SYS schema was because we were trying to modify it's metadata sql on", 
   "the fly and then were compiling that modified sql in whatever the current schema might be. I have changed the", 
   "metadata sql for getTables in metadata.properties so that we do not need to modify it on the fly anymore. This will", 
   "allow getTables to follow the same codepath as other metadata queries which will also ensure that the sql gets", 
   "compiled in SYS schema.", 
   "As for getUDTs, it was merely a coding bug that we didn't follow the same logic as other metadata queries for it.", 
   "I have changed getUDTs implementation to follow the same codepath as other metadata queries."
  ], 
  "revision_id": "557405"
 }, 
 {
  "author": "bayard", 
  "date": "2007-07-18T21:37:11.580680Z", 
  "msg": [
   "Applying Petteri Ra:ty's build.xml improvement from DIGESTER-89 so you can build the jar without the javadoc. I did modify it so you are forced to run the tests when building the jar"
  ], 
  "revision_id": "557404"
 }, 
 {
  "author": "kelvingoodson", 
  "date": "2007-07-18T21:29:57.016140Z", 
  "msg": [
   "hide sample infrastructure in javadoc"
  ], 
  "revision_id": "557403"
 }, 
 {
  "author": "kelvingoodson", 
  "date": "2007-07-18T21:29:16.016772Z", 
  "msg": [
   "hide sample infrastructure in javadoc"
  ], 
  "revision_id": "557402"
 }, 
 {
  "author": "carnold", 
  "date": "2007-07-18T21:28:25.772267Z", 
  "msg": [
   "log4php restart"
  ], 
  "revision_id": "557401"
 }
]