[
 {
  "author": "akarasulu", 
  "date": "2004-10-28T19:02:22.302775Z", 
  "msg": [
   "Changes ...", 
   "o abstract test case now cleans up eve working directory on setup as opposed to", 
   "tearDown", 
   "o added a new search and lookup filtering service which other services will", 
   "depend upon instead of adding their own decorating wrappers around search", 
   "enumerations; this is an optimization which prevents us from needlessly", 
   "cloning Attributes or having too many wrappers around a search result enum", 
   "o properly used a service interface - other services should follow this proper", 
   "model by also defining a POJI.", 
   "o added new lookup filter interface to differentiate between times when values", 
   "are filtered via a lookup as opposed to when results are filtered in a search;", 
   "plus accept verses the filter methods connotate different kinds of filtering", 
   "where on can actually reject entire entries from being returned in a search", 
   "and the other cannot unless they through a NameNotFound exception", 
   "o renamed and modified the search result filter to accept search parameters", 
   "to better make decisions about how to filter - other parameters like LDAP", 
   "controls may also make their way into this method as arguments; this new", 
   "added argument specific to search further justifies the LookupFilter to", 
   "SearchResultFilter separation: its very natural", 
   "o refurbished the OperationalAttributeService to now use the FilterService", 
   "instead of yet again wrapping the returned enumeration.", 
   "o made the necessary changes to the initialization code in the", 
   "EveContextFactory", 
   "Todos ...", 
   "o I need to rename ResultFilterService to just FilterService because the", 
   "Result part makes it sound like its only for SearchResults and this does", 
   "both for search and for lookup operations."
  ], 
  "revision_id": "55884"
 }, 
 {
  "author": "steveh", 
  "date": "2004-10-28T18:56:12.639075Z", 
  "msg": [
   "First draft of a \"read me first\" topic for the v1-alpha dist.  Users should read this topic first when they unzip the dist."
  ], 
  "revision_id": "55883"
 }, 
 {
  "author": "roku", 
  "date": "2004-10-28T18:29:52.576250Z", 
  "msg": [
   "[Merged from 1.2.x]", 
   "Improved error message on missing kupu build"
  ], 
  "revision_id": "55882"
 }, 
 {
  "author": "roku", 
  "date": "2004-10-28T18:27:43.737021Z", 
  "msg": [
   "Improved error message on missing kupu build"
  ], 
  "revision_id": "55881"
 }, 
 {
  "author": "stefano", 
  "date": "2004-10-28T18:19:34.889940Z", 
  "msg": [
   "gump should not run the tests for the blocks since the blocks are not compiled yet"
  ], 
  "revision_id": "55880"
 }
]