[
 {
  "author": "craigmcc", 
  "date": "2004-10-30T03:31:26.542655Z", 
  "msg": [
   "Add some debugging messages, and change \".impl.\" to \".faces\" in the", 
   "names of the manifest constants (to match the package name change).", 
   "Finally, clean up a couple of bugs.", 
   "This view controller implementation is now sufficient to run mailreader --", 
   "I'll check in (yet another) version of that in a few minutes."
  ], 
  "revision_id": "56014"
 }, 
 {
  "author": "felicity", 
  "date": "2004-10-30T03:14:39.383204Z", 
  "msg": [
   "A bunch of changes to ArchiveIterator.", 
   "First, functions were moved around to be grouped into the two operational", 
   "sections that AI has: scanning (finds messages) and running (processes", 
   "messages).", 
   "Second, added some more comments to document what is going on.", 
   "Third, the old code for --head and --tail looked like it didn't work as", 
   "documented, specifically the -N values.", 
   "Fourth, and this is the big one, a massive change to the internals of AI.", 
   "Instead of storing the messages in a large hash, storing the receive date", 
   "multiple times per record, doing complicated sorts of data, etc.", 
   "In the end, my testing found the scan time and memory usage both went", 
   "down pretty significantly (20-50%).  For a generic nightly run (~100k", 
   "messages), opt_n==0 went from 40s/48M to 32s/26M.  opt_n==1 from 10s/54M", 
   "to 5s/30M.  Most dramatically, for a full corpus run (~2.4m messages),", 
   "opt_n==1, 911s/964M to 440s/447M.", 
   "Testing also shows that the new version returns slightly differently", 
   "ordered (expected) but the same total data."
  ], 
  "revision_id": "56013"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-10-30T03:07:10.514908Z", 
  "msg": [
   "forgot this"
  ], 
  "revision_id": "56012"
 }, 
 {
  "author": "martinc", 
  "date": "2004-10-30T02:50:56.189779Z", 
  "msg": [
   "New abstract action that provides the nuts and bolts for downloading files from a Struts application."
  ], 
  "revision_id": "56011"
 }, 
 {
  "author": "mmerz", 
  "date": "2004-10-30T02:28:01.437131Z", 
  "msg": [
   "Added a new sample for control and web service integrtation.", 
   "Contributor: Daryoush Mehrtash"
  ], 
  "revision_id": "56010"
 }
]