[
 {
  "author": "akarasulu", 
  "date": "2004-11-01T21:36:40.149421Z", 
  "msg": [
   "Changes ...", 
   "o found and fixed bug in ResultFilteringEnumeration where", 
   "we were not skipping entries whose filters rejected them", 
   "o relative path names are a PITA for now we'll do without it", 
   "it was causing bugs in the filter service on the list hook", 
   "o AuthorizationFilter was not checking to block access to", 
   "the admin user account.  We made sure it does.", 
   "o added many more tests for list only", 
   "o created another test case base class that initializes a", 
   "non-admin user context on ou=system so we can test auth", 
   "rules as akarasulu", 
   "Todos ...", 
   "o still have to test authorization rules on search invocations", 
   "before we can close all tests"
  ], 
  "revision_id": "56284"
 }, 
 {
  "author": "", 
  "date": "2004-11-01T21:27:45.296566Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "56283"
 }, 
 {
  "author": "ekoneil", 
  "date": "2004-11-01T21:15:17.971085Z", 
  "msg": [
   "Significant rework of the NetUI build.", 
   "- removed all custom Ant tasks -- buildModules and junit", 
   "- switched to <subant> and <junit>", 
   "- changed \"compile\" target to \"build\" so the netui/src/<module-name> and netui/test/src/<module-name> targets are more consistent with regular Ant builds", 
   "- remove the webappBuild-test webapp", 
   "- remove the junitReport.xml Ant file as this isn't needed any longer", 
   "- move the NetUI test targets into netui/test/ant/build.xml", 
   "- remove the netui/ant/buildModules.xml Ant file", 
   "- break the build dependence from NetUI on Tomcat.  jstl.jar and standard.jar were referenced in Tomcat and are now installed in netui/external/jstl/...", 
   "BB: self", 
   "DRT: Beehive pass", 
   "BVT: NetUI pass"
  ], 
  "revision_id": "56282"
 }, 
 {
  "author": "steveh", 
  "date": "2004-11-01T21:09:10.912914Z", 
  "msg": [
   "Pageflow tutorial now works from a distribution perspective, not a \"source\" perspective."
  ], 
  "revision_id": "56281"
 }, 
 {
  "author": "djencks", 
  "date": "2004-11-01T20:55:35.631183Z", 
  "msg": [
   "GERONIMO-413. Transaction support is now defaulted from ra.xml if not in plan.  XA default config set in ConnectorModuleBuilder gbean attributes"
  ], 
  "revision_id": "56280"
 }
]