[
 {
  "author": "dreid", 
  "date": "2007-08-06T14:12:10.926943Z", 
  "msg": [
   "Whoops, add the correct json for AC US..."
  ], 
  "revision_id": "563145"
 }, 
 {
  "author": "jim", 
  "date": "2007-08-06T14:08:37.338925Z", 
  "msg": [
   "Aha! This explains some of the weird things I was seeing.", 
   "Pull down and fold in patch from r109510 for event.c"
  ], 
  "revision_id": "563144"
 }, 
 {
  "author": "dreid", 
  "date": "2007-08-06T14:05:36.996344Z", 
  "msg": [
   "Change the ad to AC US 2007...", 
   "Was anything done about a full fledged ad serving replacement?"
  ], 
  "revision_id": "563143"
 }, 
 {
  "author": "jeremias", 
  "date": "2007-08-06T14:03:00.520121Z", 
  "msg": [
   "Preparations for supporting \"PDF in PDF\" (PDF file as \"src\" attribute for fo:external-graphic).", 
   "Changes in the PDF library:", 
   "- Support all basic PDF objects as generic classes.", 
   "- Reworked some of the PDF classes to use the new generic classes instead of writing to StringBuffers everywhere (less code, less error-prone in the long run).", 
   "- Finished Form XObject support.", 
   "- Manage Image XObjects together with Form XObjects in PDFDocument", 
   "- Tweaked the filters so externally applied filters can more easily be handled.", 
   "Changes to image package:", 
   "- Added a very simple and temporary dynamic registration for image implementations (in order to plug in external image implementations)", 
   "(\"temporary\" since the image package redesign is still on the task list for this year)", 
   "Changes to the PDF Renderer:", 
   "- Added a PDFImageHandler interface which can be used to create arbitrary XObjects (in the case of PDF-in-PDF: Form XObjects)."
  ], 
  "revision_id": "563142"
 }, 
 {
  "author": "jstrachan", 
  "date": "2007-08-06T13:59:14.094302Z", 
  "msg": [
   "tidied up the test cases and made it a little easier to derive from the validator component to support other schema languages etc"
  ], 
  "revision_id": "563141"
 }
]