[
 {
  "author": "erodriguez", 
  "date": "2004-11-03T04:31:28.568372Z", 
  "msg": [
   "ASN.1 DER encoders for Kerberos Application Reply messages and their encrypted payload."
  ], 
  "revision_id": "56474"
 }, 
 {
  "author": "erodriguez", 
  "date": "2004-11-03T04:27:46.660476Z", 
  "msg": [
   "ASN.1 DER encoders for Kerberos Private Messages and their Encrypted Private Message Parts."
  ], 
  "revision_id": "56473"
 }, 
 {
  "author": "erodriguez", 
  "date": "2004-11-03T04:21:22.889196Z", 
  "msg": [
   "Value object implementations for message parts related to application (AP) message support."
  ], 
  "revision_id": "56472"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-11-03T04:19:53.875643Z", 
  "msg": [
   "Changes ...", 
   "o added authorization code to reject alterations to root DSE in", 
   "authorization service before calls even reach the target nexus", 
   "o added root DSE attribute to the nexus", 
   "o implemented nexus' getRootDSE method and added some code to", 
   "add to the namingContexts attribute of the rootDSE as more", 
   "ContextPartitions are registered with the system", 
   "o also added the vendorName attribute to rootDSE in constructor", 
   "which is proudly fixed at \"Apache Software Foundation\"", 
   "o added hooks to catch lookups and hasEntry calls for the rootDSE", 
   "Note:", 
   "o note that lookup(Name) will return empty Attributes since all attributes", 
   "in the DSE are operational and these are filtered out by the op attr", 
   "service interceptor", 
   "o the lookup(Name,String) method is the only one that returns attributes", 
   "when they are explicitly asked for", 
   "o other methods are protected by the authorization service: basically no", 
   "alterations are allowed on the root DSE!"
  ], 
  "revision_id": "56471"
 }, 
 {
  "author": "erodriguez", 
  "date": "2004-11-03T04:16:19.782218Z", 
  "msg": [
   "Closed access to a method that did not properly pad data prior to encryption."
  ], 
  "revision_id": "56470"
 }
]