[
 {
  "author": "dkulp", 
  "date": "2007-08-20T21:48:44.685642Z", 
  "msg": [
   "Add (commented out until fixed) testcase for CXF-926"
  ], 
  "revision_id": "567840"
 }, 
 {
  "author": "pquerna", 
  "date": "2007-08-20T21:46:53.832088Z", 
  "msg": [
   "Use APR_STATUS_IS_NOTFOUND() rather than comparing against NOTFOUND directly."
  ], 
  "revision_id": "567839"
 }, 
 {
  "author": "pcl", 
  "date": "2007-08-20T21:32:54.288390Z", 
  "msg": [
   "OPENJPA-317. Changed OpenJPA published API pre-1.0. Reduced the scope of the dependencies in OpenJPAEntityManager and the other published interfaces; converted JDK1.4-style symbolic constant usage to new enums; changed some method names for clarity and consistency; removed old javax.resource dependencies; updated @published and @nojavadoc tags. The published interfaces should now only reference other published interfaces in method signatures, and it should be possible to build javadoc for just the published interfaces.", 
   "Removed getDelegate() calls from the published interfaces, as they expose internals. They are still available on the impl classes themselves, or the SPI ifaces when available.", 
   "Added covariant return types to JDBCFetchPlan.", 
   "Changed BrokerFactoryListener interface to not encode event types in the listener signature.", 
   "Moved some methods from OpenJPAPersistence to JPAFacadeHelper.", 
   "We will need to grow these published interfaces to provide access to some things in the internal interfaces. However, these interfaces will remain stable moving forward within the constraints of the OpenJPA deprecation policies."
  ], 
  "revision_id": "567838"
 }, 
 {
  "author": "boisvert", 
  "date": "2007-08-20T21:32:21.554094Z", 
  "msg": [
   "Remove deprecated <bpel:then> element that never made it to BPEL 2.0 final (c.f. issue 237)"
  ], 
  "revision_id": "567837"
 }, 
 {
  "author": "jgenender", 
  "date": "2007-08-20T21:30:44.071082Z", 
  "msg": [
   "Refactor and begin adding chunking"
  ], 
  "revision_id": "567836"
 }
]