[
 {
  "author": "dettborn", 
  "date": "2007-08-21T06:17:43.704276Z", 
  "msg": [
   "Committed 2. patch:    container_runtime_options.plus_properties.200707.patch  from JIRA 418 (http://issues.apache.org/jira/browse/PLUTO-418).", 
   "The patch includes the patch  container_runtime_options.200707.patch. And solves first problems with Container Options.", 
   "Thanks Christian"
  ], 
  "revision_id": "567970"
 }, 
 {
  "author": "manjula", 
  "date": "2007-08-21T06:01:05.376441Z", 
  "msg": [
   "code cleaning and memory leaks fixing."
  ], 
  "revision_id": "567969"
 }, 
 {
  "author": "brett", 
  "date": "2007-08-21T05:57:12.931252Z", 
  "msg": [
   "[MNGSITE-22] update docs for dependency mediation", 
   "Submitted by: Herve Boutemy"
  ], 
  "revision_id": "567968"
 }, 
 {
  "author": "psmith", 
  "date": "2007-08-21T05:55:40.016549Z", 
  "msg": [
   "Added command-line option to pinpoint-service to allow user to specify SocketHubReceivers to connect to remote systems.", 
   "By default, only a SocketReceiver is configured, which relies on remote applications knowing where Pinpoint might be.", 
   "This allows users to decide between a central Event Clearhousing model, or a \"Service knows where stuff is\" approach.", 
   "Changed graph produced to simply show # events the indexer is behind, which is vastly easier to understand than", 
   "my lame attempt at rate conversion and comparision (thanks to Alison Winters for pointing me at an obvious solution).", 
   "Added QA/DEBUG JMX attribute so that one can slow the indexing rate to the point of observing an event backlog; obviously", 
   "this option is not on by default... :)", 
   "Created an assembly that bundles up the service into a standalone project.  At this point both the -service", 
   "and -cli modules are seperate, but I'm thinking that a combined module that ships a combined artifact", 
   "with both the -service and -cli shell scripts might be easier to download and install."
  ], 
  "revision_id": "567967"
 }, 
 {
  "author": "brett", 
  "date": "2007-08-21T05:54:51.475225Z", 
  "msg": [
   "[MNG-3141] only canonicalize paths on Windows (to prevent path length issues, but not obliterate symlinks on unix)", 
   "Merged from: r567954 on trunk"
  ], 
  "revision_id": "567966"
 }
]