[
 {
  "author": "mrglavas", 
  "date": "2007-08-22T04:19:29.382344Z", 
  "msg": [
   "JIRA Issue #1264:", 
   "http://issues.apache.org/jira/browse/XERCESJ-1264", 
   "As part of its normal control flow the XMLEntityScanner will throw an EOFException when it reaches the end of the document. For small documents, this can take up as much as 20-25% of the total execution time in the parser but could be even more than that depending on the depth of the call stack at the point where parse() is called. To eliminate most of this cost we now cache the exception and avoid filling in its stack trace (thus also saving some memory)."
  ], 
  "revision_id": "568405"
 }, 
 {
  "author": "stack", 
  "date": "2007-08-22T04:05:08.028498Z", 
  "msg": [
   "HADOOP-1747 On a cluster, on restart, regions multiply assigned", 
   "M src/contrib/hbase/src/java/org/apache/hadoop/hbase/HMaster.java", 
   "Removed some empty lines so I can squeeze more code into a screenful.", 
   "(assignedRegions): Factored out some code into own methods so", 
   "this method is made a bit shorter.  Added early returns near", 
   "top -- if nothing to assign, etc. -- so less nesting.", 
   "Added fix: Instead of iterating over unassignedRegions after", 
   "all the loadings have been calculated, instead iterate over", 
   "the locally calculated  map, regionsToAssign (Otherwise, we", 
   "were running over the same territory each time through the", 
   "loop and were thus giving out same region multiple times).", 
   "(regionsPerServer, assignRegionsToOneServer,", 
   "getRegionsToAssign): Added."
  ], 
  "revision_id": "568404"
 }, 
 {
  "author": "mikedd", 
  "date": "2007-08-22T04:01:07.771949Z", 
  "msg": [
   "OPENJPA-326 Initialize discType"
  ], 
  "revision_id": "568403"
 }, 
 {
  "author": "dblevins", 
  "date": "2007-08-22T03:52:41.192634Z", 
  "msg": [
   "Added java version and os version, name, and arch to the comments"
  ], 
  "revision_id": "568402"
 }, 
 {
  "author": "vsiveton", 
  "date": "2007-08-22T03:52:01.848278Z", 
  "msg": [
   "o fixed encoding and revert r567233", 
   "o used WriterFactory.newPlatformWriter(...) and WriterFactory.newXmlWriter(...) instead of FileWriter(...)", 
   "o fixed javadoc", 
   "o Thanks to Hervé BOUTEMY's inputs"
  ], 
  "revision_id": "568401"
 }
]