[
 {
  "author": "rajdavies", 
  "date": "2007-08-24T06:29:18.090820Z", 
  "msg": [
   "ensure exception is logged if one is raised sending a message to a dead letter queue"
  ], 
  "revision_id": "569270"
 }, 
 {
  "author": "cziegeler", 
  "date": "2007-08-24T06:27:40.048034Z", 
  "msg": [
   "Prevent npe due to possible race condition."
  ], 
  "revision_id": "569269"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2007-08-24T06:23:18.234272Z", 
  "msg": [
   "Added the unit test for CascadeControl."
  ], 
  "revision_id": "569268"
 }, 
 {
  "author": "imario", 
  "date": "2007-08-24T06:21:09.510787Z", 
  "msg": [
   "started off a new example - mops - MyFaces Orchestra PetStore"
  ], 
  "revision_id": "569267"
 }, 
 {
  "author": "psmith", 
  "date": "2007-08-24T06:15:25.148881Z", 
  "msg": [
   "Tweaked the CLI options so that other modules can easily add standard CLI options without needing ALL the standard ones.", 
   "Changed the way the ignoredProperties is configured, now using a PropertyPlaceholderConfigurer with a set of known defaults.", 
   "You can set customized defaults with a 'pinpoint.properties' placed in your Pinpoint home directory.", 
   "This PropertyPlaceholderConfigurer is used to configure some other standard defaults as well.", 
   "Added a jmx.xml config that enables the configuring of the underlying JMX subsystem to be done by default without the need to pass", 
   "ugly System properties.", 
   "The Logger name when indexed is now also tokenized so that for a given logger \"com.foo.bar.Eeek', you can search for it just by", 
   "using term 'Eeek' without needing to do either prefix or suffix searching.  You can still search for things like 'com.foo*' etc.", 
   "Rewrote the NIO serialization and deserialization.  After discussing things with an NIO expert (hell, my cat's more experienced", 
   "in this area than I) decided to go with a far less complicated approach.  Apparantly constant MMap'ing not such a good idea here.", 
   "This rewrite appears (touch wood) to have fixed this odd corrupted stream problem.  Of course 2 seconds after I commit this", 
   "it'll probably come back."
  ], 
  "revision_id": "569266"
 }
]