[
 {
  "author": "dlydick", 
  "date": "2007-09-03T13:25:50.832964Z", 
  "msg": [
   "Corrected a use of 'jvm_object_hash_null' where it", 
   "was 'jvm_class_index_null' required."
  ], 
  "revision_id": "572325"
 }, 
 {
  "author": "dlydick", 
  "date": "2007-09-03T13:25:25.923718Z", 
  "msg": [
   "Added comment for a to-do item."
  ], 
  "revision_id": "572324"
 }, 
 {
  "author": "dlydick", 
  "date": "2007-09-03T13:24:58.150939Z", 
  "msg": [
   "Corrected class path creation with proper delimiter.", 
   "Ignore CLASSPATH entries that are too large for defined", 
   "maximum length JVMCFG_PATH_MAX, either JAR files or", 
   "individual class file names.", 
   "Added debug print message when JAR member or individual", 
   "class file not found in CLASSPATH.", 
   "Corrected JAR search match logic."
  ], 
  "revision_id": "572323"
 }, 
 {
  "author": "jleroux", 
  "date": "2007-09-03T13:24:16.247323Z", 
  "msg": [
   "Revert 572172 on David's advice"
  ], 
  "revision_id": "572322"
 }, 
 {
  "author": "ate", 
  "date": "2007-09-03T13:24:05.514522Z", 
  "msg": [
   "WICKET-650: New Wicket Portlet support: use a RequestContext for abstracted url generation,  writing header response and namespacing", 
   "See: https://issues.apache.org/jira/browse/WICKET-650 and https://issues.apache.org/jira/browse/WICKET-660", 
   "- New portlet support package with features like the WicketPortlet and the PortletRequestContext extension of RequestContext, as well as", 
   "several Portlet \"wrapper\" classes used when serving a Portlet request.", 
   "These portlet-support objects are all hooked in transparent, e.g. hidden from developers POV: all the portlet-support integration API is handled", 
   "through the generic (e.g. Portlet independant) o.a.w.RequestContext class.", 
   "For bootstrapping the portlet-support only WicketFilter needs a few internal changes which are transparent as well.", 
   "- As the portlet-support is and should be optional, the required build dependencies (portlet-api, portal-bridges-common) are optional as well.", 
   "Furthermore, the way the portlet-support will be bootstrapped by WicketFilter (to be committed after this), runtime dependency will be optional as well,", 
   "e.g. unless a Portlet Context is (dynamically) discovered, none of these classes will be loaded.", 
   "- This contains changes originally committed to the wicket-1.3-portlet-support branch for WiCKET-650 and -660 as well as several new improvements,", 
   "now applied to the new wicket-1.3.0-beta3-portlet-support branch."
  ], 
  "revision_id": "572321"
 }
]