[
 {
  "author": "imario", 
  "date": "2007-09-03T15:50:55.421272Z", 
  "msg": [
   "added a way to configure a jsf converter in the spring configuration to being able to use the conversation framework for the persistence stuff.", 
   "added a new scope \"viewController\" which allows one to configure a bean which will live in the same conversation as the view backing bean and thus use the same persistence context. Useful for converter things which can live an many different conversation.", 
   "This is an experiment, lets see how well it will make.", 
   "move with the example."
  ], 
  "revision_id": "572370"
 }, 
 {
  "author": "vamsic007", 
  "date": "2007-09-03T15:49:48.347697Z", 
  "msg": [
   "Switch to released version of Tuscany SDO."
  ], 
  "revision_id": "572369"
 }, 
 {
  "author": "jstrachan", 
  "date": "2007-09-03T15:46:31.503148Z", 
  "msg": [
   "added some more debug logging for CAMEL-134"
  ], 
  "revision_id": "572368"
 }, 
 {
  "author": "jstrachan", 
  "date": "2007-09-03T15:44:20.455457Z", 
  "msg": [
   "added some more debug logging for CAMEL-134"
  ], 
  "revision_id": "572367"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2007-09-03T15:42:29.344915Z", 
  "msg": [
   "o separating out the MavenEmbedderProjectWithExtensionReadingTest which shows that the artifacts handlers must be loaded up-front", 
   "in the readProjectWithDependencies method because it is not being done in the core unless projects are executed. So Milos' assertion", 
   "is correct. I'm now looking at a layered approach for project resolution and then execution so that the readProjectWithDependencies", 
   "(which is essential for IDE integration) will yield something that can be pushed into the lifecycle executor. Right now there", 
   "is much duplication which makes the IDE integration crappy.", 
   "Another result of this is trying to create a simple IDE import model that gives back client code the fully resolved, topo sorted", 
   "set of projects which point to binary dependencies outside the reactor, and to source folders inside the reactor. The result will", 
   "be a useful model for all IDE integration, right now everyone is doing their own thing. This model will need hooks for customization", 
   "to take into account turning \"workspace resolution\" on/off and allow easy overriding of this process.", 
   "o Fixed IT0035"
  ], 
  "revision_id": "572366"
 }
]