[
 {
  "author": "mamta", 
  "date": "2007-09-05T05:50:34.052369Z", 
  "msg": [
   "DERBY-2946", 
   "The character string literals take their collation from the current compilation schema. Derby's metadata queries have lots of comparisons where a character string literal is compared with a character string column from SYS schema. The character string columns from SYS schema have the collation of UCS_BASIC. If the metadata queries get run with user schema as current compilation schema, then the character string constants in metadata queries will get a collation of territory based and this mismatch in collation of character string constants and character string columns will cause the metadata queries to fail. This situation can arise in the current softupgrade code. In softupgrade mode, we do not ensure that the current compilation schema is SYS schema. A simple change in GenericLanguageConnectionContext(GLCC) takes care of that problem. In GLCC, with this checkin, we check if the query being executed is a metadata query and if yes, then we should set the current compilation schema to be SYS schema for that metadata query execution. This takes care of the soft upgrade problem. Outside of soft upgrade mode, we do not have problems with metadata queries because during a normal run/hard upgrade, we go to SYSSTATEMENTS to run metadata queries and that code path ensures that the current compilation schema is SYS schema."
  ], 
  "revision_id": "572880"
 }, 
 {
  "author": "sanka", 
  "date": "2007-09-05T05:34:12.683126Z", 
  "msg": [
   "Fixed the _uacct code."
  ], 
  "revision_id": "572879"
 }, 
 {
  "author": "sanka", 
  "date": "2007-09-05T05:33:24.798802Z", 
  "msg": [
   "Fixed _uacct code."
  ], 
  "revision_id": "572878"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2007-09-05T05:30:26.240511Z", 
  "msg": [
   "o cleaning up more dead code in the hunt for \"why the release plugin doesn't work again\""
  ], 
  "revision_id": "572877"
 }, 
 {
  "author": "sanka", 
  "date": "2007-09-05T05:29:17.397291Z", 
  "msg": [
   "Added the Google download tracking script."
  ], 
  "revision_id": "572876"
 }
]