[
 {
  "author": "jdillon", 
  "date": "2007-09-11T01:23:02.338412Z", 
  "msg": [
   "Giving the banner a facelift and some color", 
   "Fixed --color option to allow color to be turned off"
  ], 
  "revision_id": "574420"
 }, 
 {
  "author": "dblevins", 
  "date": "2007-09-11T00:54:27.702449Z", 
  "msg": [
   "Added constructors for better use outside of jaxb"
  ], 
  "revision_id": "574419"
 }, 
 {
  "author": "lresende", 
  "date": "2007-09-11T00:53:13.246411Z", 
  "msg": [
   "Calculator samples for Brazilian article on SCA"
  ], 
  "revision_id": "574418"
 }, 
 {
  "author": "mmartinec", 
  "date": "2007-09-11T00:49:35.137260Z", 
  "msg": [
   "Util::helper_app_pipe_open_unix : contain a failing exec with", 
   "an eval to prevent additional cases of process cloning. The exec", 
   "could fail this way when given tainted arguments. While at it,", 
   "also eval-protect an open($fh,'-|'), which need eval-trapping", 
   "when implied fork fails due to system resource quotas exceeded."
  ], 
  "revision_id": "574417"
 }, 
 {
  "author": "jdillon", 
  "date": "2007-09-11T00:49:15.771171Z", 
  "msg": [
   "Created facade to simplify container construction and facilitate simple usage", 
   "Renamed flavor to branding", 
   "Update many places to use the branding to get well... branding details", 
   "Moved a bunch of common init to DefaultShell", 
   "Added factory lookups for IO, Environment and Terminal", 
   "Fixed type problem with Arguments.shift()", 
   "Go back to using ${version} for now", 
   "Bring back JEXL to handle the ${} expansion.  For a little more weight it adds a lot of use functionality", 
   "Bind ${env} to the map of environment variables for easy shell access", 
   "Put the shell related interfaces into o.a.g.g.shell", 
   "Add the local host to the shell info obj", 
   "Split up Shell intf into InteractiveShell and CommandExecutor", 
   "Split up adding DefaultCommandExecutor, moved out from DefaultShell to componentize", 
   "Adding a nicer prompt", 
   "Moved \"echo\" to builtins", 
   "Eh, probably a lot of other stuff too"
  ], 
  "revision_id": "574416"
 }
]