[
 {
  "author": "jwoolley", 
  "date": "2001-08-10T00:10:50.000000Z", 
  "msg": [
   "Clarify just a bit.  You can in fact change the bucket pointed to by e", 
   "in various ways.  Change the data it points to all you want.  Change its", 
   "type or start/length if you want.  None of that matters.  Changing its", 
   "prev and next pointers is what's sticky, but even that can be done if", 
   "you're careful that it's what you really want.  As long as you don't", 
   "destroy the bucket or change the value of e, you're probably okay.  Sidebar:", 
   "you _could_ change e's value if you wanted as long is it has a valid value", 
   "by the time the next iteration of the loop comes around.  However, doing this", 
   "would almost certainly not have the effect you expect, so it should", 
   "be avoided.  =-)"
  ], 
  "revision_id": "58364"
 }, 
 {
  "author": "jwoolley", 
  "date": "2001-08-09T23:55:27.000000Z", 
  "msg": [
   "Misunderstandings about APR_BRIGADE_FOREACH() must be just about one of", 
   "the most common problems people stumble on when they try to use the", 
   "buckets API.  This adds a big honkin warning to the documentation for", 
   "APR_BRIGADE_FOREACH and APR_RING_FOREACH that explains the limitations", 
   "and gives an example for how to work around them."
  ], 
  "revision_id": "58363"
 }, 
 {
  "author": "rbb", 
  "date": "2001-08-08T22:24:04.000000Z", 
  "msg": [
   "Remove the block argument from apr_brigade_partition.  This looked good", 
   "in theory, but in reality, we should just rely on the timeouts to handle", 
   "this."
  ], 
  "revision_id": "58362"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-08-08T21:25:51.000000Z", 
  "msg": [
   "We don't need to include libtool.m4 anymore as we blindly use the one", 
   "that APR has."
  ], 
  "revision_id": "58361"
 }, 
 {
  "author": "rbb", 
  "date": "2001-08-08T19:53:21.000000Z", 
  "msg": [
   "Change how apr_brigade_partition handles error conditions.  If we have", 
   "hit an error, apr_brigade_partition sets the after_point parameter to the", 
   "last bucket that it was able to deal with.  This means that if we asked", 
   "for the brigade to be partitioned at point 9 and we are using non-blocking", 
   "I/O on the brigade, but we only have 5 char's in the brigade, then we", 
   "partition at spot 5, return the bucket after the 5th char, and return", 
   "APR_EAGAIN."
  ], 
  "revision_id": "58360"
 }
]