[
 {
  "author": "aadamchik", 
  "date": "2007-10-27T16:17:39.426244Z", 
  "msg": [
   "finally a solution, although hackish for Oracle ResultSetMetadata woes... may need to undo some of the earlier hacks to work around it", 
   "(undoing earlier unit test hack)"
  ], 
  "revision_id": "589145"
 }, 
 {
  "author": "adrianc", 
  "date": "2007-10-27T16:16:25.582230Z", 
  "msg": [
   "Moved Party Manager embedded permission checking to new permission checking service.", 
   "Some important notes about this commit:", 
   "1. This commit changes some of the Party Manager permission checking behavior. The previous extended permission checks (PARTYMGR_CME, PARTYMGR_GRP, PARTYMGR_PCM, PARTYMGR_QAL, PARTYMGR_REL, PARTYMGR_ROLE, PARTYMGR_STS, PARTYMGR_SRC) only checked those permissions, and not the base (PARTYMGR) permission. This commit checks both sets of permissions - PARTYMGR and PARTYMGR_xxx. Example: to create a party relationship the following permissions would be checked - PARTYMGR_CREATE, PARTYMGR_ADMIN, PARTYMGR_REL_CREATE, PARTYMGR_REL_ADMIN.", 
   "This change was discussed on the dev ml - http://mail-archives.apache.org/mod_mbox/ofbiz-dev/200710.mbox/%3c47150A51.6080908@hlmksw.com%3e", 
   "2. There are a number of security holes in the Party Manager services - some services have no permission checking. I didn't attempt to fix those issues in this commit because I believe they should be discussed on the mailing list first.", 
   "3. This commit adds a new error message property (PartyPermissionErrorPartyId) to the PartyUiLabels.properties file. In the international copies of that file I copied an existing error message to the new property - international users should update their versions by replacing \"this operation\" with \"${resourceDescription}\".", 
   "4. Some of the Party Manager services have not been converted to the new permission checking service - communication events for example. I ran out of time."
  ], 
  "revision_id": "589144"
 }, 
 {
  "author": "aadamchik", 
  "date": "2007-10-27T16:13:24.456727Z", 
  "msg": [
   "finally a solution, although hackish for Oracle ResultSetMetadata woes... may need to undo some of the earlier hacks to work around it"
  ], 
  "revision_id": "589143"
 }, 
 {
  "author": "aadamchik", 
  "date": "2007-10-27T16:12:53.922211Z", 
  "msg": [
   "finally a solution, although hackish for Oracle ResultSetMetadata woes... may need to undo some of the earlier hacks to work around it"
  ], 
  "revision_id": "589142"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2007-10-27T15:51:18.320420Z", 
  "msg": [
   "SLING-28 Provide the resource path through getResourcePath (not getContentPath)"
  ], 
  "revision_id": "589141"
 }
]