[
 {
  "author": "jorton", 
  "date": "2004-02-06T12:52:38.000000Z", 
  "msg": [
   "* include/apr_optional.h (APR_REGISTER_OPTIONAL_FN),", 
   "include/apr_optional_hooks.h (APR_OPTIONAL_HOOK): Rewrite to avoid", 
   "calling a function through a function pointer of incompatible type,", 
   "which is not conformant C99 code (by section 6.3.2.3 para 8) and", 
   "triggers a warning from gcc 3.4.", 
   "Reviewed by: Ben Laurie"
  ], 
  "revision_id": "58984"
 }, 
 {
  "author": "jorton", 
  "date": "2004-02-06T11:10:47.000000Z", 
  "msg": [
   "* Makefile.in: Use portable make syntax."
  ], 
  "revision_id": "58983"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2004-02-05T17:37:40.000000Z", 
  "msg": [
   "Apply Joe Orton's APR patch to APR-util as well to allow VPATH builds."
  ], 
  "revision_id": "58982"
 }, 
 {
  "author": "gstein", 
  "date": "2004-02-05T10:17:32.000000Z", 
  "msg": [
   "record recent changes for a single top-level make"
  ], 
  "revision_id": "58981"
 }, 
 {
  "author": "gstein", 
  "date": "2004-02-05T10:16:27.000000Z", 
  "msg": [
   "First whack at switching to a single top-level make. This adds a dependency", 
   "upon Python at packaging time, but not at end-user config/build time. As far", 
   "as I can tell, the build continues to function properly. (out-of-dir", 
   "config/make not tested, and apr-iconv prolly needs some work)", 
   "The buildconf scripts now generate a build-outputs.mk file which is included", 
   "by the root's Makefile (via the build/gen-build.py script). bulid-outputs.mk", 
   "specifies all of the various files present in the distribution.", 
   "The top-level Makefiles were simplified to use an $(OBJECTS) symbol rather", 
   "than 'find'ing them. Similarly, a $(HEADERS) symbol is used for the exports.", 
   "The corresponding delete-* targets were eliminated since we have a precise", 
   "set of inputs.", 
   "The subdirs' Makefiles were removed since they are no longer called/used.", 
   "The apr-util/uri Makefile was responsible for compiling a C program to", 
   "generate the uri_delims.h file. That process was replaced by a Python script", 
   "to generate the header (called by buildconf). The .c and .dsp were left for", 
   "the Windows build to continue, but that should be revamped.", 
   "build/apr_rules.mk was revamped somewhat to avoid recursion, but a lot of", 
   "cleanup is still needed. Much of the recursive/local/x- logic is no longer", 
   "needed and can be elimianated. rules.mk was created for inclusion by N", 
   "makefiles, but that isn't really true any more, so it could probably be", 
   "tossed (caveat: test/Makefile). Saved for a phase 2.", 
   "Some additional work was added to properly clean up files in */build/,", 
   "rather than relying on a makefile in there."
  ], 
  "revision_id": "58980"
 }
]