[
 {
  "author": "reschke", 
  "date": "2007-10-30T16:48:32.806137Z", 
  "msg": [
   "JCR-1152: JCR2SPI: use own ValueFactory, wrapping the SPI's QValueFactory: spi-commons: add implementations of ValueFactory wrapping QValueFactory and Value wrapping a QValue. QValueFactoryImpl: Fix conversions that weren't called before. ValueFormat: take advantage of known ValueFactory/Value implementations."
  ], 
  "revision_id": "590140"
 }, 
 {
  "author": "tellison", 
  "date": "2007-10-30T16:48:16.479036Z", 
  "msg": [
   "Tidy-up in regex test cases (formatting, compiler warnings, etc).", 
   "No functional changes."
  ], 
  "revision_id": "590139"
 }, 
 {
  "author": "tellison", 
  "date": "2007-10-30T16:37:17.460678Z", 
  "msg": [
   "Apply regression test for HARMONY-4396 ([classlib][regex] Matcher.hitEnd() returns invalid value if a match isn't found after find() method is called)"
  ], 
  "revision_id": "590138"
 }, 
 {
  "author": "jorton", 
  "date": "2007-10-30T16:31:33.658120Z", 
  "msg": [
   "* test/testlfs.c (test_open): Fix style issues introduced in", 
   "r589929; no functional change."
  ], 
  "revision_id": "590137"
 }, 
 {
  "author": "vhennebert", 
  "date": "2007-10-30T16:21:39.019331Z", 
  "msg": [
   "- factored the management of column numbers into a separate helper class", 
   "- moved the PendingSpan inner class from TableFObj into TableCellContainer, where it's a bit more appropriate", 
   "- simplified the getTable method in TableFObj by overriding it in Table", 
   "- simplified the propertyMaker for column-number: now it's the table-cell which notifies the parent table-body that it starts a new row. As an additional benefit the propertyMaker for starts-row is now called only once, instead of twice before", 
   "- reworked, factored and simplified the handling of column indices in TableCellContainer", 
   "- bugfix: repeated fo:table-column were not added at the right place in the column lists", 
   "- bugfix: width set on cell on second row was applied to the column's width, whereas it shouldn't", 
   "- checkstyle cleanup"
  ], 
  "revision_id": "590136"
 }
]