[
 {
  "author": "mriou", 
  "date": "2007-11-01T21:52:16.409964Z", 
  "msg": [
   "Creating buildr root repository."
  ], 
  "revision_id": "591150"
 }, 
 {
  "author": "jmargaris", 
  "date": "2007-11-01T21:52:16.348701Z", 
  "msg": [
   "From Michael Mikhaylov: Fix for first row sizing in IE."
  ], 
  "revision_id": "591149"
 }, 
 {
  "author": "rajdavies", 
  "date": "2007-11-01T21:49:13.871264Z", 
  "msg": [
   "Fix for https://issues.apache.org/activemq/browse/AMQ-1486"
  ], 
  "revision_id": "591148"
 }, 
 {
  "author": "seelmann", 
  "date": "2007-11-01T21:32:24.510866Z", 
  "msg": [
   "Fixed NPE when calling iterator() of an empty Rdn, added Tests and fixed Javadoc."
  ], 
  "revision_id": "591147"
 }, 
 {
  "author": "kmarsden", 
  "date": "2007-11-01T21:26:56.203372Z", 
  "msg": [
   "merges from trunk", 
   "DERBY-766 (partial) Add initial code/method and many comments as to how to split expressions out of large generated methods. New code is not called yet and doesn't do much, first step in incremental development of this method.", 
   "merge 428910 to 10.1 from trunk", 
   "DERBY-766 (partial) Modify the approach in the split expressions method of CodeChunk to only identify self-contained chunks of byte code from a limited set of instructions. Thus this is a \"fail-safe\" approach, rather than trying to catch all the opcodes that would make a set of byte code not self-contained. Incremental development, method is still not called and does not perform any splits yet,", 
   "I test it with calls from BCMethod and a reduced split threshold (e.g. split if the method s ~3k big instead of the limit of 64k).", 
   "merge 430193 to 10.1 from trunk", 
   "DERBY-766 (partial) Catch IOExceptions written while generating byte code in CodeChunk as an exception means a limit of the class file format has been hit and subsequently the generated code will be invalid. E.g. by trying to represent a invalid constant pool index which is greater than 64k in two bytes. Remove the unused class BCUnsupported.", 
   "merge 430293 to 10.1 from trunk"
  ], 
  "revision_id": "591146"
 }
]