[
 {
  "author": "jorton", 
  "date": "2007-11-02T16:48:37.317085Z", 
  "msg": [
   "- unmark as TODO; works for trunk"
  ], 
  "revision_id": "591395"
 }, 
 {
  "author": "andreas", 
  "date": "2007-11-02T16:46:06.928604Z", 
  "msg": [
   "Removed unused container documents"
  ], 
  "revision_id": "591394"
 }, 
 {
  "author": "jorton", 
  "date": "2007-11-02T16:45:46.273137Z", 
  "msg": [
   "Fix handling of buffered request body for per-location SSL", 
   "renegotiation when an internal redirect occurs:", 
   "* modules/ssl/ssl_engine_io.c (ssl_io_buffer_fill): Remove", 
   "protocol-level filters before inserting the buffering filter.", 
   "(ssl_io_filter_buffer): Return an EOS if invoked with an empty", 
   "brigade; do not remove the filter after exhausting the buffer.", 
   "(ssl_io_filter_buffer): Increase the type of the buffer filter to be", 
   "AP_FTYPE_PROTOCOL.", 
   "PR: 43738"
  ], 
  "revision_id": "591393"
 }, 
 {
  "author": "dwoods", 
  "date": "2007-11-02T16:44:04.239166Z", 
  "msg": [
   "update scm info in children poms"
  ], 
  "revision_id": "591392"
 }, 
 {
  "author": "jdcasey", 
  "date": "2007-11-02T16:44:00.173499Z", 
  "msg": [
   "Switching back to selectively import extensions into a project-specific ClassRealm, except this time extension realms will be shared (the origin of the aforementioned imports) to conserve memory tied up by classloading. Similarly, plugin realms are managed using a key produced from g:a:v of the plugin, plus the hashcode of all g:a:v of the plugin-level dependencies aggregated into one string, to distinguish the deploy plugin 2.0 with no deps from the deploy plugin 2.0 with a plugin-level dep on wagon-webdav. Plugin realms have their parent realms managed by the pluginManager now prior to lookup or execution of the mojo instance, and PluginDescriptor.(classRealm|artifacts) attributes are set for each execution. Likewise, the MavenPluginCollector now tracks plugin descriptors with their version information included, instead of just using g:a.", 
   "Had to bump the plexus-container-default version up to alpha-36 to fix a problem in ClassicSingletonComponentManager. All realms for extensions, plugins, and projects (which contain only imports from extensions) are now managed by the MavenRealmManager."
  ], 
  "revision_id": "591391"
 }
]