[
 {
  "author": "jvanzyl", 
  "date": "2007-11-06T07:54:42.102044Z", 
  "msg": [
   "o repositories specified in distribution management sections don't have policies set but many functions expect them so populate one if necessary to prevent the rest of the system from barfing", 
   "o allow the specification of a release policy to work around a repository not having one to start, which distribution management repositories don't have. it may be that eventually there are some policies around deployment but there are none currently."
  ], 
  "revision_id": "592320"
 }, 
 {
  "author": "pcl", 
  "date": "2007-11-06T07:36:55.109151Z", 
  "msg": [
   "OPENJPA-430 -- strip hungarian notation prefixes. Checking in patch for Ben Short, along with minor whitespace reformatting and a small tweak to reduce computation if branch logic in correctName() will not use the calculated name.", 
   "The initial patch included a test for fields that would end up having duplicate names after truncation. The code, however, does not do anything to resolve / avoid duplicates. To make it work, we would need to change MappingDefaultsImpl.correctName() to take a ValueMapping as an argument, and do a two-pass algorithm to check for other fields that would turn into duplicates. Even doing this will not be foolproof, as a duplicate column might come from a subclass or an embedded class. Since this option is not enabled by default anyways, and the duplicate error would become evident during testing / schema creation, I do not believe that it would be worthwhile to spend much time addressing this."
  ], 
  "revision_id": "592319"
 }, 
 {
  "author": "smishura", 
  "date": "2007-11-06T07:33:44.990513Z", 
  "msg": [
   "Revert commit r591908: Correct macros for unzipping downloaded archives"
  ], 
  "revision_id": "592318"
 }, 
 {
  "author": "bommel", 
  "date": "2007-11-06T07:10:43.786679Z", 
  "msg": [
   "Required links on all ASF PMC Pages"
  ], 
  "revision_id": "592317"
 }, 
 {
  "author": "milinda", 
  "date": "2007-11-06T07:01:43.228483Z", 
  "msg": [], 
  "revision_id": "592316"
 }
]