[
 {
  "author": "evenisse", 
  "date": "2007-11-08T15:13:29.740917Z", 
  "msg": [
   "package src archive with the release profile"
  ], 
  "revision_id": "593190"
 }, 
 {
  "author": "jeremias", 
  "date": "2007-11-08T15:13:24.828714Z", 
  "msg": [
   "Improved font auto-detection and handling of AWT-supplied fonts in order to achieve better results when using multiple output formats. Whenever possible, the font names appearing in the operating system can also be used in XSL-FO.", 
   "Better distinction between Font Family Name (\"Arial\"), Full Font Name (\"Arial Bold\") and PostScript Name (\"Arial-BoldMT\"). This allows a better generation of FontTriplets. The same is done for AWT fonts where I have switch from font-family detection to enumerating all java.awt.Font instances so I can extract Family Name, Full Name and PostScript Name. FontInfoFinder and AWT's FontSetup are synchronized as well as possible at this time.", 
   "Register \"extra-bold\" (weight 800) and \"light\" (weight 200) in triplets when detected.", 
   "Tweaked FontInfo.fontLookup() for better fallback behaviour. This approach is rapidly nearing its flexibility limits. We should rethink the FontTriplet structure.", 
   "Fixed font-autodetection so fonts with uppercase extensions are detected, too.", 
   "Made the way TrueType fonts are embedded in PDF compliant to the specification so viewers correctly identify subset fonts. The name prefix in MultiByteFont was incorrect.", 
   "Support the detection of the special Type 1 Symbol font. Symbol used to be detected with \"ExpertSubsetEncoding\" instead of \"SymbolEncoding\".", 
   "Type1FontLoader tries to construct a \"full name\" from the PostScript name. This is a temporary hack until we have a PFB or PFA parser."
  ], 
  "revision_id": "593189"
 }, 
 {
  "author": "manolito", 
  "date": "2007-11-08T15:12:48.202267Z", 
  "msg": [
   "better to have maven-compiler-plugin in <pluginManagement> so that it is not automatically executed for every child pom,", 
   "removed the checkstyle plugin from <build> but left it in <reporting>"
  ], 
  "revision_id": "593188"
 }, 
 {
  "author": "imario", 
  "date": "2007-11-08T15:12:35.018464Z", 
  "msg": [
   "set id on generated components, additional API (to make my Facelets components work)"
  ], 
  "revision_id": "593187"
 }, 
 {
  "author": "dogacan", 
  "date": "2007-11-08T15:08:47.376019Z", 
  "msg": [
   "NUTCH-548 - Move URLNormalizer from Outlink to ParseOutputFormat. Contributed by Emmanuel Joke."
  ], 
  "revision_id": "593186"
 }
]