[
 {
  "author": "vsiveton", 
  "date": "2007-11-12T13:38:47.665414Z", 
  "msg": [
   "o fixed title"
  ], 
  "revision_id": "594120"
 }, 
 {
  "author": "vsiveton", 
  "date": "2007-11-12T13:37:58.172605Z", 
  "msg": [
   "o updated test cases"
  ], 
  "revision_id": "594119"
 }, 
 {
  "author": "kristwaa", 
  "date": "2007-11-12T13:37:22.277866Z", 
  "msg": [
   "DERBY-3199: Minor cleanup of DRDAProtocolTest.", 
   "Patch file: derby-3199-1a-minor_cleanup.diff"
  ], 
  "revision_id": "594118"
 }, 
 {
  "author": "gdamour", 
  "date": "2007-11-12T13:35:48.126254Z", 
  "msg": [
   "Add support for:", 
   "* static configuration of cluster members: this is the purpose of the", 
   "o.a.g.c.config package. BasicClusterInfo is used to statically configure", 
   "a cluster. At this stage, only the name of the cluster can be defined.", 
   "BasicNodeInfo is used to statically configure a cluster member. This", 
   "configuration encompasses the name of a member along with the necessary", 
   "JMX connection info, abstracted by ExtendedJMXConnectorInfo, in order", 
   "to connect to it.", 
   "* clustered deployments of configuration: this is the purpose of the", 
   "o.a.g.c.deployment package. MasterConfigurationStore abstracts a clustered", 
   "repository: when a configuration is installed to it, it cascades to the", 
   "cluster members, statically configured, the installation of this", 
   "configuration. Also, it automcallically creates \"master\" configurations,", 
   "which are able to remote start or stop the configurations cascaded to", 
   "cluster members..", 
   "* clustered start/stop of configuration: also in o.a.g.c.deployment.", 
   "ClusterConfigurationController is a GBean, which knows how to remote", 
   "start or stop a given configuration on a given cluster member.", 
   "Following this commit, two new repositories will be listed for the", 
   "geronimo-jetty6-jee5 assembly: master-repository and cluster-repository.", 
   "master-repository is a repository where the \"master\" configurations will", 
   "be maintained along with a carbon-copy of the associated \"raw\" configurations.", 
   "cluster-repository is a repository, which is a target of the", 
   "MastConfigurationStore.", 
   "This fixes GERONIMO-3597 - Distribution and start/stop of clustered deployments"
  ], 
  "revision_id": "594117"
 }, 
 {
  "author": "olegk", 
  "date": "2007-11-12T13:35:43.403968Z", 
  "msg": [
   "Eliminated intermediate buffering of session data during channel transfer in LengthDelimitedDecoder and IdentityDecoder"
  ], 
  "revision_id": "594116"
 }
]