[
 {
  "author": "davenewton", 
  "date": "2007-11-13T00:51:00.086685Z", 
  "msg": [
   "Spelling error in tag param description."
  ], 
  "revision_id": "594370"
 }, 
 {
  "author": "dos", 
  "date": "2007-11-13T00:47:38.277625Z", 
  "msg": [
   "updated scores for revision 594052 active rules added since last mass-check"
  ], 
  "revision_id": "594369"
 }, 
 {
  "author": "jdillon", 
  "date": "2007-11-13T00:41:34.871630Z", 
  "msg": [
   "(GSHELL-55) Added getCommandName(), getCommandId() and getAliasName() to CommandContext"
  ], 
  "revision_id": "594368"
 }, 
 {
  "author": "cam", 
  "date": "2007-11-13T00:40:53.985688Z", 
  "msg": [
   "Enhanced DOM Viewer window.  This commit is Ivan's patch from", 
   "http://issues.apache.org/bugzilla/show_bug.cgi?id=42697 with some", 
   "changes (reformatting, moving some classes to different packages).", 
   "The features of the DOM Viewer enhancements are, in Ivan's words:", 
   "* Added better document inspection using the DOMViewer:", 
   "- Added support for viewing elements of the document as xml", 
   "and their attributes in the attributes table,", 
   "- Allowed live tracking the changes in the document by refreshing", 
   "the DOMViewer's document tree and the xml text area.", 
   "* Added support for editing the documents through the DOMViewer:", 
   "- Allowed changing elements directly by editing their xml,", 
   "or using the attributes table,", 
   "- Allowed switching nodes position in the document by", 
   "adding the dnd support for the DOMViewer's document tree,", 
   "- Allowed adding the most commonly used elements (element templates)", 
   "with their attributes set to default values,", 
   "- Allowed adding new elements by editing their xml directly,", 
   "- Allowed removing the nodes from the document using DOMViewer's", 
   "document tree.", 
   "* Added support for history browsing. The DOMViewer is able", 
   "to undo and redo the changes made from the DOMViewer,", 
   "as well as the changes made on the document from outside", 
   "of the DOMViewer. Added the scrollable drop down menu to", 
   "support undo / redo of a custom number of last actions.", 
   "* Allowed searching the element on the canvas from the DOMViewer", 
   "and vice versa, by selecting the tree node in the document tree", 
   "or on the canvas and painting the found element(s).", 
   "* Added syntax highlighting to elements xml representation", 
   "using JEditTextArea component. Created the enhanced JEditTextArea,", 
   "the JEnhEditTextArea with the cut / copy / paste, select all,", 
   "undo / redo shortcuts added and mouse wheel scroll as well.", 
   "Congratulations to Ivan, for successfully completing his Google Summer of", 
   "Code project.  I hope that he can continue to contribute to Batik!", 
   "Submitted by: Ivan Andjelkovic <andjelkovic.ivan@gmail.com>"
  ], 
  "revision_id": "594367"
 }, 
 {
  "author": "gnodet", 
  "date": "2007-11-13T00:35:43.220625Z", 
  "msg": [
   "ServiceMix has graduated"
  ], 
  "revision_id": "594366"
 }
]