[
 {
  "author": "rbb", 
  "date": "1999-11-10T16:47:04.000000Z", 
  "msg": [
   "Using the filename \"PIPE\" to determine if an apr_file_t refers to an", 
   "anonymous pipe is a bad idea.  We will now use the stated flag == -1", 
   "for this purpose.  This makes sense because we shouldn't be stat'ing", 
   "anonymous pipes anyway, if this is wrong, it is easy enough to add", 
   "another flag to the file type if we have to, but I would rather not."
  ], 
  "revision_id": "59469"
 }, 
 {
  "author": "rbb", 
  "date": "1999-11-10T15:49:55.000000Z", 
  "msg": [
   "Add timeouts to pipes.  I also fixed a minor bug in timeout code for sending", 
   "and receiving data over the network.  Specifying a negative timeout will", 
   "result in the send or recv blocking until the operation is done."
  ], 
  "revision_id": "59468"
 }, 
 {
  "author": "rbb", 
  "date": "1999-11-10T15:25:04.000000Z", 
  "msg": [
   "Fix a logic error for mmap on unix.  Basically, if you are going to check for", 
   "the existance of an autoconf generated defintion, the check must be after", 
   "you include all of your header files.  Also, you must include apr_config.h.", 
   "Lastly, include statements for system headers should ALWAYS be wrappered", 
   "but #ifdef's checking for the availability of those header files."
  ], 
  "revision_id": "59467"
 }, 
 {
  "author": "rbb", 
  "date": "1999-11-10T13:40:52.000000Z", 
  "msg": [
   "Fix a problem with the configure script.  AC_CHECK_SIZEOF is only meant to", 
   "be used for built-in types.  ssize_t is not a built-in type on all systems,", 
   "so SIZEOF_SSIZE_T was consistently getting defined to 0 on all of my", 
   "systems.  This fixes that problem by re-writing AC_TRY_RUN (the default", 
   "AC_TRY_RUN has issues that don't allow for getting the return code from the", 
   "program) and using it to get the size of SSIZE_T."
  ], 
  "revision_id": "59466"
 }, 
 {
  "author": "ben", 
  "date": "1999-11-09T09:01:14.000000Z", 
  "msg": [
   "Add printf format for ssize_t."
  ], 
  "revision_id": "59465"
 }
]