[
 {
  "author": "sebor", 
  "date": "2007-11-14T00:33:51.691717Z", 
  "msg": [
   "2007-11-13  Martin Sebor  <sebor@roguewave.com>", 
   "* util/target.h (target_status): Changed the type of user, system, and", 
   "wall clock time counters from clock_t* to plain clock_t and renamed to", 
   "usr_time, sys_time, and wall_time, respectively.", 
   "* util/exec.cpp (calculate_usage, exec_file): Eliminated static locals", 
   "and instead directly used the target_status object passed in by caller.", 
   "(exec_file):", 
   "* util/display.cpp (print_status_plain, print_status_verbose): Checked", 
   "for times equal to -1 as an indicator of validity.", 
   "(print_footer_plain): Printed cumulative times for all targets.", 
   "* util/runall.cpp (run_target): Accumulated target times."
  ], 
  "revision_id": "594730"
 }, 
 {
  "author": "jm", 
  "date": "2007-11-14T00:30:59.863682Z", 
  "msg": [
   "avoid a 'Can't use an undefined value as an ARRAY reference' warning"
  ], 
  "revision_id": "594729"
 }, 
 {
  "author": "remm", 
  "date": "2007-11-14T00:19:20.726747Z", 
  "msg": [
   "- Votes."
  ], 
  "revision_id": "594728"
 }, 
 {
  "author": "bpendleton", 
  "date": "2007-11-14T00:12:45.625146Z", 
  "msg": [
   "DERBY-3175: NullPointerException on INSERT after ALTER TABLE DROP COLUMN", 
   "The implementation of ALTER TABLE DROP COLUMN needs to adjust the", 
   "SYSCOLUMNS information for some of the columns in the table. Specifically,", 
   "columns with a higher column position than the dropped column need to", 
   "have their column position adjusted (decremented by 1).", 
   "The algorithm which did this column position adjustment was flawed,", 
   "because it was losing the auto-increment information for generated columns.", 
   "The code adjusts the column position by:", 
   "- reading the old column information into a ColumnDescriptor", 
   "- deleting the old column information from SYSCOLUMNS", 
   "- modifying the ColumnDescriptor to set the new column position", 
   "- adding the new column information to SYSCOLUMNS", 
   "But the generated column information in the ColumnDescriptor was not being", 
   "preserved properly in this process.", 
   "The fix involved ensuring that the ColumnDescriptor information was", 
   "accurate for generated columns, and ensuring that SYSCOLUMNSRowFactory.makeRow", 
   "was correctly loading the generated column information into the new row."
  ], 
  "revision_id": "594727"
 }, 
 {
  "author": "jm", 
  "date": "2007-11-14T00:07:39.958673Z", 
  "msg": [
   "set up some big -j's"
  ], 
  "revision_id": "594726"
 }
]