[
 {
  "author": "jacopoc", 
  "date": "2007-11-20T20:35:35.199401Z", 
  "msg": [
   "Added support for the <description> element to the ModelChild class, which all of ModelField, ModelIndex, and ModelRelation extend.", 
   "Thanks to Adrian Crum for the patch: OFBIZ-1389"
  ], 
  "revision_id": "596815"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-11-20T20:32:33.064003Z", 
  "msg": [
   "fixing slight issue with UberjarMain not being able to utilize defaults"
  ], 
  "revision_id": "596814"
 }, 
 {
  "author": "rjung", 
  "date": "2007-11-20T20:29:28.024835Z", 
  "msg": [
   "Because of some changed indentations, this one is easier to read in full text,", 
   "not as a diff :(", 
   "1) Still use static length format string for subsecond resolution time", 
   "stamp formats, otherwise we would have to allocate a corresponding", 
   "buffer dynamically for each log line.", 
   "In case sub second precision is used, we only allow a format string", 
   "of JK_TIME_MAX_SIZE-1=63 characters after replacement of subsecond", 
   "format character by the respective digit sequence.", 
   "Without subsecond resolution we still allow longer format strings.", 
   "2) Since the length of the sub second format string is restricted,", 
   "use static length for the char array log_fmt_subsec", 
   "3) Since everything is static length, we have no more dynamic allocation.", 
   "Remove jk_free_time_fmt() and revert r596746.", 
   "4) Make length checks during strncpy more explicit.", 
   "5) Move logging of used log time stamp format into the util method.", 
   "The logger is completely initialized at the time we call this", 
   "method."
  ], 
  "revision_id": "596813"
 }, 
 {
  "author": "aadamchik", 
  "date": "2007-11-20T20:26:36.249035Z", 
  "msg": [
   "java5 : generics"
  ], 
  "revision_id": "596812"
 }, 
 {
  "author": "ecraig", 
  "date": "2007-11-20T20:17:43.364122Z", 
  "msg": [
   "Updated view add/edit pages to utilize checkboxes", 
   "Added graph edit/delete functionality", 
   "Added significant error checking on graph add/edit", 
   "Added ability to create graphs through both selecting data series as", 
   "well as from selecting nothing to start with", 
   "Added back-end handling of various math options from graph add/edit"
  ], 
  "revision_id": "596811"
 }
]