[
 {
  "author": "dfabulich", 
  "date": "2007-11-20T21:00:55.436440Z", 
  "msg": [
   "More integration tests"
  ], 
  "revision_id": "596825"
 }, 
 {
  "author": "bpendleton", 
  "date": "2007-11-20T20:54:01.482962Z", 
  "msg": [
   "DERBY-2352: Assertion failure with order by and group by on SUBSTR expression", 
   "For a query plan which involves a sort, the compilation system generates a", 
   "method called a \"row allocator\" which allocates a template row of the", 
   "correct shape (correct number of columns of the correct data types) to hold", 
   "the row that is being provided to the sorter. The row allocator determines", 
   "the data type of the column in the row allocator by examining the", 
   "ResultColumn's type, which in turn is computed by the compilation system", 
   "during bind processing.", 
   "For the SUBSTR expression, TernaryOperatorNode.substrBind() is called, and", 
   "the logic in that method was determining that the data type of the SUBSTR", 
   "result depended on the data type of the operand on which SUBSTR was called;", 
   "i.e., a SUBSTR of a CHAR became a CHAR, while a SUBSTR of a VARCHAR became", 
   "a VARCHAR. But this is incorrect; SUBSTR always returns a VARCHAR type,", 
   "unless it is called on a BLOB/CLOB object.", 
   "This patch modifies the substrBind() processing to perform result data type", 
   "analysis in the same way as is done for the trim family of methods in trimBind."
  ], 
  "revision_id": "596824"
 }, 
 {
  "author": "elecharny", 
  "date": "2007-11-20T20:53:59.173751Z", 
  "msg": [
   "Added some more tests to complete all the cases for a modification applied to an entry."
  ], 
  "revision_id": "596823"
 }, 
 {
  "author": "elecharny", 
  "date": "2007-11-20T20:53:15.605530Z", 
  "msg": [
   "Slightly improved Felix fix : Instead of dumping bytes as if they were just bytes for a DN, translating this byte array back to a String.", 
   "(the DN is always a valid byte array representation of a String )"
  ], 
  "revision_id": "596822"
 }, 
 {
  "author": "adrianc", 
  "date": "2007-11-20T20:52:05.973518Z", 
  "msg": [
   "Updated the Webtools services to use the new description methods in the entity classes (Revision 596815). The Entity Reference page now contains much more documentation."
  ], 
  "revision_id": "596821"
 }
]