[
 {
  "author": "jimk", 
  "date": "2007-11-20T21:53:30.570719Z", 
  "msg": [
   "HADOOP-2139 (phase 1) Increase parallelism in region servers", 
   "There are a lot of changes in this patch. The memcache has been changed from a per/region object to a per/column object, and HLocking has been removed since we do not have to maintain any locks across RPC calls.", 
   "This necessitated major changes to HRegion and HStore", 
   "Additionally there were many changes required to the unit tests since they tend to exploit some private interfaces that weren't designed to be public. Some of those interfaces changed so the test cases did as well.", 
   "This patch is the result of extensive analysis of the multiple threads in HBase that contend for shared resources: updates, reads, scanners, cache flushing, compaction and region splitting.", 
   "Many of the tests are timing sensitive, and since we tend to make \"dormant\" intervals as short as possible to speed up the Hudson build, we may go through several iterations of getting them right before Hudson is happy. This is especially true since two test cases failed on my dual cpu windows machine while running the tests under Ant, but ran fine under Eclipse.", 
   "However, now that the tests are passing locally, I believe the changes are doing the right thing, but may require some parameter tweaks."
  ], 
  "revision_id": "596835"
 }, 
 {
  "author": "jfaath", 
  "date": "2007-11-20T21:45:05.314361Z", 
  "msg": [
   "Changes made to de-couple the \"web service\" portion of juddi into a separate jar."
  ], 
  "revision_id": "596834"
 }, 
 {
  "author": "dfabulich", 
  "date": "2007-11-20T21:43:51.600986Z", 
  "msg": [
   "[SUREFIRE-168] Added test for @BeforeMethod annotation"
  ], 
  "revision_id": "596833"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-11-20T21:43:50.157090Z", 
  "msg": [
   "wiring through spring should not start or stop the services"
  ], 
  "revision_id": "596832"
 }, 
 {
  "author": "trawick", 
  "date": "2007-11-20T21:36:36.490433Z", 
  "msg": [
   "generated rotatelogs docs"
  ], 
  "revision_id": "596831"
 }
]