[
 {
  "author": "rederpj", 
  "date": "2007-11-27T03:01:25.175423Z", 
  "msg": [
   "Altered some comments and minor formatting of log calls in prep for a refactoring of this routine.", 
   "I wanted the diffs to be human readable and understandable. This should just be formatting and", 
   "shouldn't alter any semantics."
  ], 
  "revision_id": "598500"
 }, 
 {
  "author": "ningjiang", 
  "date": "2007-11-27T02:58:34.615785Z", 
  "msg": [
   "Merged revisions 598358-598464 via svnmerge from", 
   "https://svn.apache.org/repos/asf/incubator/cxf/trunk", 
   "........", 
   "r598358 | ajaypaibir | 2007-11-27 01:45:15 +0800 (Tue, 27 Nov 2007) | 1 line", 
   "CXF-1238 DispatchInDataBindingInterceptor assumes incoming message to have been read removes out the inputstream from the message.", 
   "........", 
   "r598464 | gmazza | 2007-11-27 07:33:05 +0800 (Tue, 27 Nov 2007) | 1 line", 
   "Minor comments added.", 
   "........"
  ], 
  "revision_id": "598499"
 }, 
 {
  "author": "ate", 
  "date": "2007-11-27T02:54:57.810892Z", 
  "msg": [
   "Fixing some registry related testcases: the registry.xml assembly now requires a PropertyPlaceholderConfigurer to provide values for the supported.portletmode.autoswitch.* feature properties.", 
   "As the AbstractSpringTestCase already dynamically provides a PropertyPlaceHolderConfigurer, adding one through a (test only) assembly configuration doesn't work, that one needs to setup these properties.", 
   "The AbstractSpringTestCase now has a protected getPostProcessProperties() method which can be used to add additional required property values for this purpose."
  ], 
  "revision_id": "598498"
 }, 
 {
  "author": "ate", 
  "date": "2007-11-27T02:54:06.695383Z", 
  "msg": [
   "Fixing TestPipeline testcase which was broken (once again) because a new Valve was added to pipelines.xml.", 
   "Now fixed for good: replacing positional valve checks (which really didn't make much sense) with map based lookup checks."
  ], 
  "revision_id": "598497"
 }, 
 {
  "author": "trustin", 
  "date": "2007-11-27T02:53:57.843784Z", 
  "msg": [
   "* Changed AbstractPollingIoProcessor.dispose() to be synchronous and to disconnect all connections immediately", 
   "* Fixed runtime exception due to dependency problem in integration-ognl"
  ], 
  "revision_id": "598496"
 }
]