[
 {
  "author": "herven", 
  "date": "2007-11-28T20:54:46.078654Z", 
  "msg": [
   "DEBUG: Tell maven to use the Subversion Changelog Plugin (fixes maven 1.0.2 build errors)"
  ], 
  "revision_id": "599145"
 }, 
 {
  "author": "rajith", 
  "date": "2007-11-28T20:53:51.097299Z", 
  "msg": [
   "Modified the code to not keep the command in the map if \"enable_command_replay\" is false.", 
   "However we still need to keep the command_id to implement sync properly.", 
   "By default \"enable_command_replay\" is false.", 
   "The earlier implementation completely avoided incrementing the command count and putting it in the map.", 
   "This causes a problem as it will break the contract for sync. When the client code calls sync we need to only return when the broker has sent the EM that is at or above that command_id. So we need to keep that around.", 
   "Keeping track of command_ids is different from keeping commands around. We keep commands around for reply, but we need to keep track of command_id's to implement the execution layer properly."
  ], 
  "revision_id": "599144"
 }, 
 {
  "author": "rpluem", 
  "date": "2007-11-28T20:53:30.593236Z", 
  "msg": [
   "* Remove unused variable and thus remove compiler warning"
  ], 
  "revision_id": "599143"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-11-28T20:52:57.470359Z", 
  "msg": [
   "Changes made to changelog feature:", 
   "o Moved revert() into DirectoryService from ChangeLog", 
   "o ChangeLog non-null by default yet the service is off", 
   "o Interceptor included by default yet disabled", 
   "o Implemented add and delete revert() capabilities", 
   "o Added some tests to revert adds and deletes", 
   "o Started working on AbstractTestCase to revert if changelog is enabled", 
   "o Fixed serious interceptor issue with replication and mitosis based", 
   "tombstoning of deleted entries", 
   "o Fixed some issues with pom files and dependencies around constants", 
   "in the core."
  ], 
  "revision_id": "599142"
 }, 
 {
  "author": "rpluem", 
  "date": "2007-11-28T20:52:37.101134Z", 
  "msg": [
   "* No need for an else block here because we do a return above."
  ], 
  "revision_id": "599141"
 }
]