[
 {
  "author": "apatel", 
  "date": "2007-12-03T23:39:14.010198Z", 
  "msg": [
   "Implement an automatic GL posting service triggered when InventoryItem.unitCost is changed.", 
   "Jyotsna Rathore, Thanks for providing implementation. And also our thanks to Vikas Mayur, Ashish Vijaywargiya, Mridul Pathak, Pankaj Savita and others for managing and helping the team implementing these services."
  ], 
  "revision_id": "600730"
 }, 
 {
  "author": "akarasulu", 
  "date": "2007-12-03T23:38:50.154209Z", 
  "msg": [
   "changes to integration framework ...", 
   "o introduced state pattern to get rid of some serious complexity in the CiRunner", 
   "o removed sample suite and same test classes since people can just look at doco and or", 
   "the existing tests for now", 
   "o added all the logic needed to get integration tests working again reusing the same", 
   "service across tests in the same suite or across test runs even - highely configurable", 
   "o removed some unneeded annotations", 
   "o made the methods on the context static so static imports can be used: this works because", 
   "of the ThreadLocal for thread specific context lookups", 
   "o using inheritable settings class now to manage inheritance of properties from suites to", 
   "classes to methods", 
   "o new scope annotation created for the \"intended scope\" of a service: the intended scope", 
   "is what is used to force a cleanup at that level.", 
   "o the default service factory now turns on the changelog by default"
  ], 
  "revision_id": "600729"
 }, 
 {
  "author": "jm", 
  "date": "2007-12-03T23:38:21.691220Z", 
  "msg": [
   "kill perl processes on the remote slaves, before starting more"
  ], 
  "revision_id": "600728"
 }, 
 {
  "author": "dkulp", 
  "date": "2007-12-03T23:37:42.412774Z", 
  "msg": [
   "[CXF-1180] Don't map Exchange objects as parts in the wsdl"
  ], 
  "revision_id": "600727"
 }, 
 {
  "author": "nbubna", 
  "date": "2007-12-03T23:33:40.619145Z", 
  "msg": [
   "point tool links to javadoc, not svn repo"
  ], 
  "revision_id": "600726"
 }
]