[
 {
  "author": "jeremias", 
  "date": "2007-12-04T10:27:51.720067Z", 
  "msg": [
   "Note: The API of the new image package has changed a bit. (it became necessary when I introduced caching)", 
   "The direct dependency on FOUserAgent has been removed to make the image package more universally usable. Instead an ImageContext (provided by FopFactory in FOP) and ImageSessionContext (provided by FOUserAgent in FOP) was introduced.", 
   "Introduced image caching with soft references (I didn't reintroduce the FOUserAgent lock, yet, because it doesn't help much)", 
   "ImageInfo doesn't carry the Source for the image anymore. The Source is provided by the new ImageSessionContext.java and only shared within the same thread to make things simpler and to avoid complex synchronization and cleanup.", 
   "Image instances now indicate whether they are cacheable (not all Image instances are cacheable, for example when they just carry an InputStream).", 
   "Moved the converter pipeline functionality into its own subpackage to keep \"spi\" clean.", 
   "Added checks in ImageSize to detect incomplete Preloaders.", 
   "ImageSource can now indicate whether its a fast source (loading from local file) or a slow source (loading over the network). (but this isn't used, yet)", 
   "Fixed a bug in WMF and SVG preloaders: they didn't close their Sources after fully loading the images.", 
   "Bugfix in ImageRawJPEG: it illegally reported being an EPS file", 
   "ImageRawStream got an \"InputStreamFactory\" so it is possible to reuse raw images if they have been loaded into memory (or to a local file which hasn't been implemented, yet).", 
   "The pipeline code now converts single-use raw images to reusable raw images when possible. But there's nothing built in to restrict the image size to a maximum, yet.", 
   "Improved JPEG preloader so it can stop early an deal with images that have to APP0 segment. Images from digicams are such an example. They carry the resolution info in the EXIF block which is currently not interpreted. Fallback is to the configured source resolution."
  ], 
  "revision_id": "600870"
 }, 
 {
  "author": "apavlenko", 
  "date": "2007-12-04T10:23:04.953934Z", 
  "msg": [
   "Fixed tests removed from the exclude list"
  ], 
  "revision_id": "600869"
 }, 
 {
  "author": "varlax", 
  "date": "2007-12-04T10:18:14.558853Z", 
  "msg": [
   "HARMONY-5097 [drlvm][build] Repair ICL build bugs for DRLVM"
  ], 
  "revision_id": "600868"
 }, 
 {
  "author": "robbinspg", 
  "date": "2007-12-04T10:12:11.279295Z", 
  "msg": [
   "Allow hyphen '-' in property names"
  ], 
  "revision_id": "600867"
 }, 
 {
  "author": "ffang", 
  "date": "2007-12-04T10:09:51.068314Z", 
  "msg": [
   "[SM-1154] add spring support for servicemix camel component"
  ], 
  "revision_id": "600866"
 }
]