[
 {
  "author": "skitching", 
  "date": "2007-12-07T09:01:59.662529Z", 
  "msg": [
   "Add docs", 
   "Move jetty def out of a profile into the main defs; easier to use.", 
   "Move some deps to runtime.", 
   "Update Cargo plugin version"
  ], 
  "revision_id": "602035"
 }, 
 {
  "author": "jeremias", 
  "date": "2007-12-07T09:01:34.762417Z", 
  "msg": [
   "Don't use \"content\" filter for ICC profiles. Instead compress using \"default\". \"content\" is for page content."
  ], 
  "revision_id": "602034"
 }, 
 {
  "author": "jeremias", 
  "date": "2007-12-07T08:59:57.621611Z", 
  "msg": [
   "Small optimization from my failed experiments to support native PNG embedding."
  ], 
  "revision_id": "602033"
 }, 
 {
  "author": "jeremias", 
  "date": "2007-12-07T08:59:10.906868Z", 
  "msg": [
   "Added color space information and an optional ICC color profile to the basic Image interface.", 
   "Reimplemented transparency support (for now only for ImageIO loader and PDF output)", 
   "ImageIO preloader passes the already loaded metadata to the ImageIO loader through the \"custom objects\" so it doesn't have to load them again.", 
   "PDF library: Corrected the naming of the method indicating the \"bits per component\" (bits per component != bits per pixel)", 
   "PDF library: Added a method which lets a user override values in an XObject's dictionary after the major values have been set (useful not to make the PDFImage interface more complicated).", 
   "PDF library: Support for gray transparent colors.", 
   "PDF library: Added a convenience class for alpha channel bitmaps (AlphaRasterImage)", 
   "Integration of the new image package into the PDFRenderer (currently supports all previous embedding methods except deprecated EPS embedding and CCITT embedding, now supports even more transparency options than before)"
  ], 
  "revision_id": "602032"
 }, 
 {
  "author": "rinku", 
  "date": "2007-12-07T08:58:07.264909Z", 
  "msg": [
   "o  playing around with generics to implement a leaner JpaStore and drop specific extensions for Project, ProjectGroup etc.", 
   "o  added unit tests.", 
   "o  Some more unit tests required before earlier implementations can be deprecated."
  ], 
  "revision_id": "602031"
 }
]