[
 {
  "author": "psteitz", 
  "date": "2007-12-10T00:55:07.889429Z", 
  "msg": [
   "Added a wrapper for the shared idle object eviction timer for all pools.", 
   "The wrapper class wraps the Timer and keeps track of how many pools are", 
   "using it. If no pools are using the timer, it is canceled. This prevents", 
   "a thread being left running which, in application server environments,", 
   "can lead to memory leads and/or prevent applications from shutting down", 
   "or reloading cleanly.", 
   "JIRA: POOL-97", 
   "Patched by Mark Thomas"
  ], 
  "revision_id": "602765"
 }, 
 {
  "author": "billbarker", 
  "date": "2007-12-10T00:43:42.518401Z", 
  "msg": [
   "Adding tomcat's trunk to Gump"
  ], 
  "revision_id": "602764"
 }, 
 {
  "author": "jdcasey", 
  "date": "2007-12-10T00:40:45.112789Z", 
  "msg": [
   "Use a touch-file to track the last check date for metadata files, instead of the lastUpdated field in a stubbed-out metadata file, since the latter appears to mess up plugin resolution."
  ], 
  "revision_id": "602763"
 }, 
 {
  "author": "sebor", 
  "date": "2007-12-10T00:29:28.692662Z", 
  "msg": [
   "2007-12-09  Martin Sebor  <sebor@roguewave.com>", 
   "* bin/genxviews (process_results): Composed title for the detailed", 
   "page.", 
   "Added a link to script version in Subversion.", 
   "Corrected Red Hat update number from 2 to 4 for gcc 3.4.6 on AMD64.", 
   "Used the duration script to compute the amount of time to generate", 
   "all logs.", 
   "* bin/xbuildgen (-T <text>): Added a new option to set the page", 
   "title.", 
   "(myname, today, viewvc, revurl, svnpath): Made global constants", 
   "read only.", 
   "(get_times): Enhanced function to extract real, user, and system", 
   "times for individual stages of the build and format each time as", 
   "\"M:SS\" on stdout.", 
   "(get_build_date): New function to extract from the build log and", 
   "format the date and time the build started (function is currently", 
   "unused).", 
   "(get_lib_size): New function to extract from the build log the size", 
   "of the library binary and format it on stdout.", 
   "(get_buildtype): New function to extract the build type from the", 
   "log name and format it on stdout.", 
   "(get_os): New function to extract from the build log the name of", 
   "the operating system and its version (including the Linux distro", 
   "name) and format both on stdout.", 
   "(get_arch): New function to extract from the build log the hardware", 
   "architecture and format it on stdout.", 
   "(get_compiler): New function to extract the compiler name and", 
   "version from the build log and format both on stdout.", 
   "(resultstyle.css): Reduces the size of the font and changed colors", 
   "to make them slightly less obtrusive.", 
   "Added descriptive mouseovers for a few table column headers.", 
   "(Logs and Columms): Added new headers for OS, arch[itecture], and", 
   "compiler, removed the excessively wide build log column, and made", 
   "the first column (\"col.\") a link to the build log.", 
   "Avoided formatting \"unknown\" for indedeterminate values and instead", 
   "left such table cells empty.", 
   "Simplified log processing loop by factoring out complex code and", 
   "calling get_times(), get_lib_size(), get_buildtype(). Added calls", 
   "to get_os(), get_arch(), get_compiler().", 
   "Improved formatting of the column headers in Results tables and", 
   "added links from each to build logs.", 
   "Removed .sh and .bat suffixes from locale test names and the .exe", 
   "suffix from Windows executables to make them match their names on", 
   "UNIX and changed the awk pattern to match names with said suffixes.", 
   "Added a link to script version in Subversion."
  ], 
  "revision_id": "602762"
 }, 
 {
  "author": "ate", 
  "date": "2007-12-10T00:27:58.929346Z", 
  "msg": [
   "Fix for JS2-666: Clustered Environment: constraint violation if clones are started at the same time", 
   "See: https://issues.apache.org/jira/browse/JS2-666", 
   "Initial patch provided by Joachim Müller, applied by hand and slightly modified (only on the logging handling/messages).", 
   "Thanks Joachim."
  ], 
  "revision_id": "602761"
 }
]