[
 {
  "author": "rbb", 
  "date": "2000-07-31T23:30:04.000000Z", 
  "msg": [
   "Update the bucket brigade patch to work with the latest code.  This is", 
   "a much smaller patch than previous ones IMO.  It also contains a lot of", 
   "comments to help explain what is happening.  This patch works with all", 
   "legacy modules, as well as newer modules.  I have removed the chunking", 
   "filter with the understanding that it was mucking up the patch, and making", 
   "things hard to follow.  After we decide on a filter design, adding chunking", 
   "back in should be easy to do."
  ], 
  "revision_id": "60464"
 }, 
 {
  "author": "rbb", 
  "date": "2000-07-31T23:23:38.000000Z", 
  "msg": [
   "bucket_brigade is too long to type in every function name.  This just", 
   "changes to names of all of the brigade functions to ap_brigade_foo.", 
   "I don't think this should cause any confusion, and it sure makes coding", 
   "this stuff much easier."
  ], 
  "revision_id": "60463"
 }, 
 {
  "author": "rbb", 
  "date": "2000-07-31T22:28:58.000000Z", 
  "msg": [
   "Combine the create and write functions.  I am leaving the write function", 
   "pointer in the structure because I think it is still useful, but having", 
   "one API to create a bucket and put data in it is much cleaner.  If we", 
   "decide to have a list of free buckets, then the create function may not", 
   "call malloc, it may grab a bucket off the free list.  Regardless of where", 
   "the memory comes from, create's job is to grab the memory from someplace", 
   "and fill out the structure."
  ], 
  "revision_id": "60462"
 }, 
 {
  "author": "stoddard", 
  "date": "2000-07-31T19:51:22.000000Z", 
  "msg": [
   "Win32: Return error codes on ap_generate_random()"
  ], 
  "revision_id": "60461"
 }, 
 {
  "author": "trawick", 
  "date": "2000-07-31T15:39:01.000000Z", 
  "msg": [
   "Fix some problems with which error code to use after a pthread_ failure.", 
   "Most of the changes added support for PTHREAD_SETS_ERRNO; a few of the", 
   "changes fixed bugs in existing code which always used errno (which", 
   "doesn't get the right error code on most platforms)."
  ], 
  "revision_id": "60460"
 }
]