[
 {
  "author": "smilek", 
  "date": "2007-12-18T20:03:23.064483Z", 
  "msg": [
   "improved portlet maximize:", 
   "1) react to browser window-resize (adjusting size of maximized window)", 
   "2) scroll to top of browser window when portlet is maximized", 
   "3) in IE6, fix restore from maximized problems with window size (restored width of portlet window would be incorrect if browser window was resized while the porlet was maximized) - fixes JS2-824 http://issues.apache.org/jira/browse/JS2-824", 
   "improved portlet rendering to allow portlet content which uses dojo.addOnLoad to work properly in IE6/older browsers", 
   "if dom elements were added by code called via dojo.addOnLoad, IE6 would not display added content", 
   "fixes IE6 portlet-selector problem described in JS2-821 http://issues.apache.org/jira/browse/JS2-821", 
   "improved add-portlet transition to return to the mode (edit or view) which was active when add-portlet was initiated"
  ], 
  "revision_id": "605315"
 }, 
 {
  "author": "rpluem", 
  "date": "2007-12-18T20:03:01.635627Z", 
  "msg": [
   "* Only sent a flush bucket down the chain if buckets where sent down the chain", 
   "before that could still be buffered in the network filter. This is the case", 
   "if we have sent an EOS bucket or if we actually sent buckets with", 
   "data down the chain. In all other cases we either have not sent any", 
   "buckets at all down the chain or we only sent meta buckets that are", 
   "not EOS buckets down the chain. The only meta bucket that remains in", 
   "this case is the flush bucket which would have removed all possibly", 
   "buffered buckets in the network filter.", 
   "If we sent a flush bucket in the case where not ANY buckets were", 
   "sent down the chain, we break error handling which happens AFTER us."
  ], 
  "revision_id": "605314"
 }, 
 {
  "author": "mriou", 
  "date": "2007-12-18T19:48:56.303026Z", 
  "msg": [
   "Added loan approval example from the BPEL spec, several small fixes on the grammar come with it around namespaces, try/catch and path expressions."
  ], 
  "revision_id": "605313"
 }, 
 {
  "author": "smilek", 
  "date": "2007-12-18T19:42:25.907745Z", 
  "msg": [
   "change ajax requests to set encoding to \"utf-8\" - fixes JS2-820 http://issues.apache.org/jira/browse/JS2-820", 
   "added jetspeed.widget.openDialog to common.js so that it can be used by dojo admin portlets (openDialog fixes the mozilla problem where text fields in dialog boxes would not show insertion point)", 
   "The following revision comments are from branches/JETSPEED-2.1.3 revisions which were not individually checked-in to trunk", 
   "=== ---------------------------------------------------------------- ===", 
   "[ from branches/JETSPEED-2.1.3 r598982 ] | ate | 2007-11-28 05:32:42 -0700 (Wed, 28 Nov 2007) | 2 lines", 
   "Fix for JS2-816: Jetspeed common javascript doesn't support running the portal under ROOT context", 
   "See: https://issues.apache.org/jira/browse/JS2-816", 
   "=== ---------------------------------------------------------------- ===", 
   "[ from branches/JETSPEED-2.1.3 r595411 ] | smilek | 2007-11-15 13:06:54 -0700 (Thu, 15 Nov 2007) | 1 line", 
   "major improvements to page editor (UI, config options, flow, no action layouts); support for create-new-page-on-edit", 
   "=== ---------------------------------------------------------------- ===", 
   "[ from branches/JETSPEED-2.1.3 r588399 ] | smilek | 2007-10-25 18:00:25 -0600 (Thu, 25 Oct 2007) | 1 line", 
   "added a second approach to loading indicator (jetspeed.url.loadingIndicatorStep) which uses separate images - this allows for the loading indicator to show progress when the browser is too bogged down to render the animated gif used in the normal loading indicator", 
   "=== ---------------------------------------------------------------- ===", 
   "[ from branches/JETSPEED-2.1.3 r584888 ] | smilek | 2007-10-15 14:15:45 -0600 (Mon, 15 Oct 2007) | 1 line", 
   "added try/catch block in stopEvent function for IE", 
   "=== ---------------------------------------------------------------- ===", 
   "[ from branches/JETSPEED-2.1.3 r583999 ] | smilek | 2007-10-11 18:36:47 -0600 (Thu, 11 Oct 2007) | 1 line", 
   "continuation of desktop overhaul", 
   "=== ---------------------------------------------------------------- ===", 
   "[ from branches/JETSPEED-2.1.3 r578915 ] | smilek | 2007-09-24 13:13:21 -0600 (Mon, 24 Sep 2007) | 1 line", 
   "desktop overhaul; moved debug code to debug.js", 
   "=== ---------------------------------------------------------------- ==="
  ], 
  "revision_id": "605312"
 }, 
 {
  "author": "apetrelli", 
  "date": "2007-12-18T19:42:08.340663Z", 
  "msg": [
   "WW-2380", 
   "Added runtime dependency on tiles-jsp in the Tiles 2 plugin."
  ], 
  "revision_id": "605311"
 }
]