[
 {
  "author": "dos", 
  "date": "2007-12-20T01:44:00.528297Z", 
  "msg": [
   "updated scores for revision 605468 active rules added since last mass-check"
  ], 
  "revision_id": "605785"
 }, 
 {
  "author": "dfabulich", 
  "date": "2007-12-20T01:39:59.837370Z", 
  "msg": [
   "[SUREFIRE-414] Upgrading maven parent to 7.  surefire-testng has no tests; we're \"skipping\" them because Surefire 2.3 is very unhappy about running TestNG tests with mismatched classes."
  ], 
  "revision_id": "605784"
 }, 
 {
  "author": "erodriguez", 
  "date": "2007-12-20T01:34:52.399338Z", 
  "msg": [
   "Added support to kerberos-client for different encryption types (DIRSERVER-1095):", 
   "o  KdcControls object can now be used to customize desired encryption types."
  ], 
  "revision_id": "605783"
 }, 
 {
  "author": "psteitz", 
  "date": "2007-12-20T01:32:20.457331Z", 
  "msg": [
   "Ported changes from 1.4 release branch to fix an error in the", 
   "GenericKeyedObjectPool constructor that takes", 
   "a Config instance as a parameter. The minIdle setting in the Config", 
   "was being ignored by the constructor. Also added tests for all", 
   "GKOP constructors.", 
   "JIRA: POOL-116"
  ], 
  "revision_id": "605782"
 }, 
 {
  "author": "slaws", 
  "date": "2007-12-20T01:27:10.107875Z", 
  "msg": [
   "Changes to make the distributed store tutorial example work with recent domain changes. The domain changes make the domain responsible for managing the wiring of composites in the domain and pushing this down to nodes. Nodes are still reporting service endpoints to the domain but the next piece of work is to put in some static configuration options so endpoints can be determined at the domain level and the code in the node removed.  Currently the pushing of endpoints down to the node involves composite updates and starting stopping components. Most of this change is fixing the bindings that the tutorial uses to make the starting and stopping work more correctly."
  ], 
  "revision_id": "605781"
 }
]