[
 {
  "author": "damitha", 
  "date": "2007-12-31T04:54:37.323883Z", 
  "msg": [
   "updating the build file"
  ], 
  "revision_id": "607665"
 }, 
 {
  "author": "damitha", 
  "date": "2007-12-31T04:53:12.101466Z", 
  "msg": [
   "updating the build file"
  ], 
  "revision_id": "607664"
 }, 
 {
  "author": "damitha", 
  "date": "2007-12-31T04:36:38.549366Z", 
  "msg": [
   "added new files."
  ], 
  "revision_id": "607663"
 }, 
 {
  "author": "gdaniels", 
  "date": "2007-12-31T04:33:22.779887Z", 
  "msg": [
   "Reimplementing dynamic phases, part 1.  This is a slightly more architectural approach.", 
   "* A Deployable is something that fits into a DeployableChain in an ordered fashion.  Each Deployable has a name, and may be marked \"first\", \"last\", and/or may have a list of \"successor\" names (indicating other deployables).  Each Deployable also contains a \"target\" which is the real thing (i.e. a Phase or a Handler) that wants to be ordered.", 
   "* A DeployableChain represents an ordered list of Deployables, which are inserted with the deploy() method - some basic consistency checking happens then, but the actual complete order is not calculated until rebuild() is called, at which time all the existing constraints are walked and a complete chain is built.  After rebuild(), the getChain() API will return an ordered list of the targets.", 
   "* Some tests for the above.", 
   "* Hook up the dynamic phase mechanism for module.xml using the above code.  This enables multiple befores and afters (i.e. before=\"foo,bar\") and multiple deployments (in different modules, say) of a given new phase.", 
   "* Few small fixes in testDynamicPhase()", 
   "Next steps:", 
   "- More tests!", 
   "- Improve JavaDoc a bit.", 
   "- Explore revamping the PhaseRule stuff to use this technique as well (within a Phase), which will allow for more flexible handler deployment and clean-up/unify some code."
  ], 
  "revision_id": "607662"
 }, 
 {
  "author": "damitha", 
  "date": "2007-12-31T04:26:27.570696Z", 
  "msg": [
   "removing mysql related things"
  ], 
  "revision_id": "607661"
 }
]