[
 {
  "author": "sisbell", 
  "date": "2008-01-10T17:45:06.431297Z", 
  "msg": [
   "Reverted back the abstract compiler mojo."
  ], 
  "revision_id": "610850"
 }, 
 {
  "author": "elemings", 
  "date": "2008-01-10T17:44:11.285432Z", 
  "msg": [
   "2008-01-10  Eric Lemings <lemings@roguewave.com>", 
   "STDCXX-396", 
   "Experimental branch of trunk that adds support for the GNU", 
   "\"Autotools\" suite."
  ], 
  "revision_id": "610849"
 }, 
 {
  "author": "vhennebert", 
  "date": "2008-01-10T17:41:52.533914Z", 
  "msg": [
   "No need to check if the end of the cell is reached when creating the areas for a row"
  ], 
  "revision_id": "610848"
 }, 
 {
  "author": "sobryan", 
  "date": "2008-01-10T17:27:52.105641Z", 
  "msg": [
   "PORTLETBRIDGE-22: Update PortletBridge to latest draft (revision 11)", 
   "PORTLETBRIDGE-21: Wrong leading slash in BRIDGE_SERVICE_CLASSPATH /GenericFacesPortlet", 
   "These issues have been fixes under a patch submitted to", 
   "PORTLETBRIDGE-22 by Michael Freedman.  I had to remove the", 
   "BridgeRenderFilter for reasons documented in the bug and have made an", 
   "inquiry to the EG on how this needs to be resolved from a spec", 
   "standpoint.  Likely it'll be left up to an implementation detail for", 
   "the Apache community at which point I'll generate another bug.", 
   "Thanks Michael for all your work on this patch."
  ], 
  "revision_id": "610847"
 }, 
 {
  "author": "mamta", 
  "date": "2008-01-10T17:22:57.720025Z", 
  "msg": [
   "DERBY-3302 The user was running into null pointer exception at the time of database recovery", 
   "because Derby was trying to get the Collator object through database context. But the", 
   "Collator object is already available in the territory sensitive character classes and we", 
   "do not have to go to database context to get it. I changed the code to use that collator", 
   "object rather than look into database context. The reason for null pointer exception was", 
   "that database context was not loaded yet during database recovery."
  ], 
  "revision_id": "610846"
 }
]