[
 {
  "author": "jneeraj", 
  "date": "2008-01-11T21:07:00.988091Z", 
  "msg": [
   "Updated Apache License"
  ], 
  "revision_id": "611300"
 }, 
 {
  "author": "jneeraj", 
  "date": "2008-01-11T21:05:15.569936Z", 
  "msg": [
   "Updated Apache License"
  ], 
  "revision_id": "611299"
 }, 
 {
  "author": "mamta", 
  "date": "2008-01-11T20:55:08.694074Z", 
  "msg": [
   "Mergeing test changes from trunk revision(611295) into 10.3 codeline. The commit coments", 
   "in trunk were as follows", 
   "Adding a test case for DERBY-3302. There are two sub-test case classes involved here, col_rec1.java and col_rec2.java", 
   "The purpose of col_rec1 test and col_rec2 test is to create a territory based database and create some objects with collation sensitive character types. Then, make the database crash so that during the recovery, store engine has to do collation related operations. Those collation related operations are going to require that we use correct Collator object. DERBY-3302 demonstrated a npe during this operation because Derby was relying on database context to get the correct Collator object. But database context is not available at this point in the recovery. With the fix for DERBY-3302, the Collator object will now be obtained from collation sensitive datatypes itself rather than looking at database context which is not available at this point in recovery.", 
   "col_rec1 class will do the steps of create a territory based database and create some objects with collation sensitive character types. Then, make the database crash. col_rec2 class will do the part of rebooting the crashed db which will require store to go through recovery."
  ], 
  "revision_id": "611298"
 }, 
 {
  "author": "mamta", 
  "date": "2008-01-11T20:48:34.223111Z", 
  "msg": [
   "Merging changes 610846 from trunk into 10.3 codeline. This is for DERBY-3302. Commit comments", 
   "for trunk 610846 were as follows", 
   "DERBY-3302 The user was running into null pointer exception at the time of database recovery", 
   "because Derby was trying to get the Collator object through database context. But the", 
   "Collator object is already available in the territory sensitive character classes and we", 
   "do not have to go to database context to get it. I changed the code to use that collator", 
   "object rather than look into database context. The reason for null pointer exception was", 
   "that database context was not loaded yet during database recovery."
  ], 
  "revision_id": "611297"
 }, 
 {
  "author": "mikemccand", 
  "date": "2008-01-11T20:46:05.313876Z", 
  "msg": [
   "fix off-by-one error"
  ], 
  "revision_id": "611296"
 }
]