[
 {
  "author": "etnu", 
  "date": "2008-01-18T10:11:06.185652Z", 
  "msg": [
   "Introduced the first part of a js lib performance optimization tweak. This change allows the parent site to force which js libraries the gadget will load by passing a libs= parameter to the servlet. The purpose of this change is to allow the parent site to pre calculate the aggregate feature set that all gadgets being rendered on the current page will require and then pass that set along to every other gadget, which will ultimately result in significantly improved cache performance. The next phase of this improvement is inlining URL type JsLibrary instances so that they can have the same behavior as file/inline/resource based loaders."
  ], 
  "revision_id": "613120"
 }, 
 {
  "author": "sandakith", 
  "date": "2008-01-18T10:06:47.679300Z", 
  "msg": [
   "fix for the axis2 3325"
  ], 
  "revision_id": "613119"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2008-01-18T10:03:37.096977Z", 
  "msg": [
   "SLING-151 List imports and exports of unresolved (installed, that is) bundles", 
   "to provide some help in resolving why a bundle might not resolve. Specifically", 
   "each import is analzyed:", 
   "* If the import can be satisifed, print the potential provider", 
   "* If the import cannot be satisifed but is part of the bundle,", 
   "ignore the import (not actually correct, should look at", 
   "export list, but sounds enough)", 
   "* If an import is listed in the bootdelegation property and", 
   "cannot be resolved, both situations are marked."
  ], 
  "revision_id": "613118"
 }, 
 {
  "author": "jm", 
  "date": "2008-01-18T09:57:53.087439Z", 
  "msg": [
   "merged latest changes from trunk using: 'svn merge -r 602889:613114 https://svn.apache.org/repos/asf/spamassassin/trunk'"
  ], 
  "revision_id": "613117"
 }, 
 {
  "author": "dyre", 
  "date": "2008-01-18T09:52:32.472510Z", 
  "msg": [
   "DERBY-3221: &quot;java.sql.SQLException: The conglomerate (-5) requested does not exist.&quot; from Derby 10.3.1.4 embedded within Eclipse 3.3 and RAD 7.0", 
   "Patch file: derby-3221.v3.diff"
  ], 
  "revision_id": "613116"
 }
]