[
 {
  "author": "jdcasey", 
  "date": "2008-01-23T18:54:20.132608Z", 
  "msg": [
   "Commenting out debug pointcut because it causes class sizes to balloon."
  ], 
  "revision_id": "614620"
 }, 
 {
  "author": "jacopoc", 
  "date": "2008-01-23T18:53:44.230665Z", 
  "msg": [
   "Implemented support for the autocomplete attribute in form widgets.", 
   "The attribute autocomplete=\"on/off\" is supported by most browsers in input fields of type \"password\" and \"text\" and also in the \"form\" element and it controls the autocomplete features of the browser."
  ], 
  "revision_id": "614619"
 }, 
 {
  "author": "dandiep", 
  "date": "2008-01-23T18:49:24.634406Z", 
  "msg": [
   "I'll follow up with an email on outstanding issues, but:", 
   "- As all things, this is a work in progress. But its a significant step forward as it reenables a bunch of missing functionality. The only piece that I've not reenabled is the BasicAdapter stuff at the moment. I figure its better to commit though in the meantime.", 
   "- Simplify the steps needed to build Providers even more. DefaultProvider now comes configured for the default use case out of the box. \"Convention over configuration\". It uses the StructuredResolver/DefaultWorkspaceManager by default, but this can be overridden quite easily.", 
   "- Simplify the class hierarchy by making CollectionInfo not extend CollectionAdapter as you may just want to describe a collection sometimes and not load the whole thing.", 
   "- Simplify the WorkspaceManager/WorkspaceInfo classes. The Provider doesn't need to know about what methods are supported. The CollectionAdapter can just return the appropriate response if it isn't supported. See AbstractCollectionAdapter.extensionRequest or postMedia for example.", 
   "- Move some interfaces from impl to top level server package", 
   "- Support Transactional semantics needed for JCR adapter", 
   "- Readd ResponseContextException", 
   "- Readd AbstractCollectionAdapter", 
   "- Readd AbstractEntityCollectionAdapter", 
   "- Readd CustomerAdapterTest", 
   "- Use Junit4 annotations for the SimpleTest"
  ], 
  "revision_id": "614618"
 }, 
 {
  "author": "jdillon", 
  "date": "2008-01-23T18:44:53.323581Z", 
  "msg": [
   "Update module names"
  ], 
  "revision_id": "614617"
 }, 
 {
  "author": "arobinson74", 
  "date": "2008-01-23T18:32:33.653879Z", 
  "msg": [
   "TRINIDAD-916 - add beforeEncode and afterEncode hook methods (merge of 614610)"
  ], 
  "revision_id": "614616"
 }
]