[
 {
  "author": "djd", 
  "date": "2008-01-24T23:31:18.464917Z", 
  "msg": [
   "Minor cleanup of DatabaseMetaDataTest:", 
   "1) Remove double running of two fixtures", 
   "2) Use DatabaseMetaData fields for scope in getBestRowIdentifier rather than 0,1,2", 
   "3) For a number of DMD calls move the code that was testing the shape of the returned ResultSets into the useful methods that get the JDBC & ODBC versions of the ResultSet. This puts the shape checking in one logical position and removes some amount of duplicated code where the asserts for the shape were called after the JDBC/ODBC utility method in many places."
  ], 
  "revision_id": "615080"
 }, 
 {
  "author": "pauls", 
  "date": "2008-01-24T23:27:58.143473Z", 
  "msg": [
   "Make FilterImpl.toString() add escape characters where needed (FELIX-471)."
  ], 
  "revision_id": "615079"
 }, 
 {
  "author": "doll", 
  "date": "2008-01-24T23:24:19.705433Z", 
  "msg": [
   "Js doc changes that make the shindig js more compatible with jsdoc toolkit generation. No functional changes were introduced.", 
   "Note: I did change one doc that actually no longer matches with the coded api. (in flash.js) We need to change the code to reflect the doc asap. I did not make this change now to keep this set of changes small."
  ], 
  "revision_id": "615078"
 }, 
 {
  "author": "acmurthy", 
  "date": "2008-01-24T23:23:32.828473Z", 
  "msg": [
   "HADOOP-2402. Fix BlockCompressorStream to ensure it buffers data before sending it down to the compressor so that each write call doesn't compress. Contributed by Chris Douglas."
  ], 
  "revision_id": "615077"
 }, 
 {
  "author": "abrown", 
  "date": "2008-01-24T23:17:10.021510Z", 
  "msg": [
   "DERBY-3214: Account for loss of precision that can occur when very", 
   "large cost estimates are added to, and then subtracted from, relatively", 
   "small cumulative estimates during Optimizable \"pull\" processing.", 
   "Merging from trunk to 10.3 branch.  Following commands ran cleanly:", 
   "svn merge -r 603658:603659 https://svn.apache.org/repos/asf/db/derby/code/trunk", 
   "svn merge -r 604512:604513 https://svn.apache.org/repos/asf/db/derby/code/trunk", 
   "No other changes were required."
  ], 
  "revision_id": "615076"
 }
]