[
 {
  "author": "dreid", 
  "date": "2001-05-13T12:01:29.000000Z", 
  "msg": [
   "OK, this commit basically tries to address the assert vs check thing we've all", 
   "been talking about.  Essentially it's my opinion that in a production build we", 
   "shouldn't be using asserts, but they do have a use for developers and can really", 
   "help with reducing the time it takes to find and fix a problem.  So, this adds", 
   "a new configure option, --enable-assert-memory which adds a define to the build", 
   "that includes asserts.  My criteria for having an assert is that it has to provide", 
   "additional information over any checks that already exist.  for instance, look at", 
   "apr_sms_malloc where the asserts are there as otherwise we miss out on why we", 
   "return NULL.  I've tried to follow this but this is just the start.", 
   "I've added an extra error message that we return when we have the opportunity", 
   "and an invalid mem_sys is passed in, APR_EMEMSYS.", 
   "Comments?"
  ], 
  "revision_id": "61624"
 }, 
 {
  "author": "dreid", 
  "date": "2001-05-13T11:13:14.000000Z", 
  "msg": [
   "Add the check for calloc to configure.in."
  ], 
  "revision_id": "61623"
 }, 
 {
  "author": "dreid", 
  "date": "2001-05-13T11:11:48.000000Z", 
  "msg": [
   "The big name change for the memory code.  Names used follow the outline I", 
   "posted yesterday.  Please review at our leisure.", 
   "Also adds a calloc function that uses calloc if available or does malloc", 
   "/memset.", 
   "Test program updated to new names.", 
   "Shorter variable names as well.", 
   "The next step is the asserts & checks..."
  ], 
  "revision_id": "61622"
 }, 
 {
  "author": "dreid", 
  "date": "2001-05-13T11:03:59.000000Z", 
  "msg": [
   "I missed this previously.  Basically the latest BeOS beta has changed the version", 
   "number and moved a lot of defines around in the header files to make it", 
   "more compliant, but of course this broke my workarounds..."
  ], 
  "revision_id": "61621"
 }, 
 {
  "author": "dreid", 
  "date": "2001-05-13T10:53:01.000000Z", 
  "msg": [
   "Another small update of a test program that I did yesterday afternoon."
  ], 
  "revision_id": "61620"
 }
]