[
 {
  "author": "dinesh", 
  "date": "2008-02-01T11:16:07.332010Z", 
  "msg": [
   "fixed build break with guththila"
  ], 
  "revision_id": "617475"
 }, 
 {
  "author": "damitha", 
  "date": "2008-02-01T11:14:00.249528Z", 
  "msg": [], 
  "revision_id": "617474"
 }, 
 {
  "author": "jeremias", 
  "date": "2008-02-01T11:11:02.078563Z", 
  "msg": [
   "Implemented drawRenderedImage() which fixes painting of PNG images embedded inside SVG images."
  ], 
  "revision_id": "617473"
 }, 
 {
  "author": "etnu", 
  "date": "2008-02-01T11:05:01.607269Z", 
  "msg": [
   "Fixed features/views to actually use the current view data. requestNavigateTo is currently a NOOP. It should just use gadgets.rpc, but technically this feature should be core-views -- in other words, it should not be an explicit feature according to the gadgets API spec. I have petitioned for a spec change (the \"views\" javascript should not be a part of core), but if that doesn't happen then this will need to be moved to core, which means that IFPC / gadgets.rpc will always be delivered to every gadget. This is extraordinarily wasteful. One possible ugly solution would be to only serve views when we see an actual reference to \"gadgets.views\" in the content section, but this is hacky, and really there's no reason for views to be in the core spec anyway.", 
   "Takes data in the following form:", 
   "views.getParams() -- Assumes that any parameter named \"view-<name>\" is a key that belongs in this. When Cajoled this won't make sense, so we should probably add a check for whether or not we're rendering in an iframe or not first.", 
   "views.getCurrentView() -- Assumes that the current view is named in the \"view\" query string parameter, which is what GadgetRenderingServlet uses to discriminate between views.", 
   "May be initialized by calling gadgets.views.init and passing in all of the supported views for this container and whether or not they're the \"only visible\" gadget at render time.", 
   "Also fixed a possible NPE with GadgetSpecParser and removed a dead file."
  ], 
  "revision_id": "617472"
 }, 
 {
  "author": "bdelacretaz", 
  "date": "2008-02-01T11:04:16.127877Z", 
  "msg": [
   "sendError(): Avoid NPE if no Throwable"
  ], 
  "revision_id": "617471"
 }
]