[
 {
  "author": "dos", 
  "date": "2008-02-05T02:42:10.910815Z", 
  "msg": [
   "move rule update score generation stuff out of my sandbox and into masses/rule-update-score-gen"
  ], 
  "revision_id": "618520"
 }, 
 {
  "author": "rajith", 
  "date": "2008-02-05T02:37:13.980239Z", 
  "msg": [
   "Added code to connect the network error exceptions to the JMS Exception listener."
  ], 
  "revision_id": "618519"
 }, 
 {
  "author": "jimk", 
  "date": "2008-02-05T02:36:26.758058Z", 
  "msg": [
   "2008/02/04 HBase is now a subproject of Hadoop. The first HBase release as a subproject will be release 0.1.0 which will be equivalent to the version of HBase included in Hadoop 0.16.0. In order to accomplish this, the HBase portion of HBASE-288 (formerly HADOOP-1398) has been backed out. Once 0.1.0 is frozen (depending mostly on changes to infrastructure due to becoming a sub project instead of a contrib project), this patch will re-appear on HBase trunk."
  ], 
  "revision_id": "618518"
 }, 
 {
  "author": "stack", 
  "date": "2008-02-05T02:32:22.012660Z", 
  "msg": [
   "HBASE-403 Fix build after move of hbase in svn", 
   "A  lib/commons-httpclient-3.0.1.jar", 
   "M src/test/org/apache/hadoop/hbase/MiniHBaseCluster.java", 
   "If not null, run shutdown of hbase cluster.", 
   "A src/java/org/apache/hadoop/hbase/util/VersionInfo.java", 
   "A src/java/org/apache/hadoop/hbase/VersionAnnotation.java", 
   "A src/saveVersion.sh", 
   "Bring down the hadoop version publishing system.", 
   "M src/java/org/apache/hadoop/hbase/util/InfoServer.java", 
   "Print out problematic path.", 
   "M build.xml", 
   "Need to put the hadoop jar in front of hbase else", 
   "complaints that dfs webapps, etc., can't be found.", 
   "(Need to fix HttpStatusServer in hadoop)."
  ], 
  "revision_id": "618517"
 }, 
 {
  "author": "jkuhnert", 
  "date": "2008-02-05T02:27:03.378781Z", 
  "msg": [
   "Fixes TAPESTRY-2121.   The select component was overriding the cleanupAfterRender method but not handing the call off to the superclass - thus bypassing my bulletproof renderworker logic.   We may need to move this careful little dance in to the internal Component based interface API to avoid any future mistakes like this."
  ], 
  "revision_id": "618516"
 }
]