[
 {
  "author": "ppoddar", 
  "date": "2008-02-07T05:49:05.019541Z", 
  "msg": [
   "Change document to reflect the namespace change for slice properties from 'slice.*' to 'openjpa.slice.*'"
  ], 
  "revision_id": "619280"
 }, 
 {
  "author": "mamta", 
  "date": "2008-02-07T05:48:54.174210Z", 
  "msg": [
   "DERBY-3304", 
   "This is a followup commit for DERBY-3304 based on various comments. It does following", 
   "1)The existing method resetActivations in GenericLanguageConnectionContext has been renamed to better reflect it's", 
   "functionality. It will be now called endTransactionActivationHandling since it gets called for commit/rollback.", 
   "2)The javadoc comments for resetActivations(now called endTransactionActivationHandling) were not valid. Fixed that in", 
   "this commit.", 
   "3)Took out the redundant code about setting the holdability to false if we were in rollback. It was needed earlier", 
   "because the method that took care of activations at rollback time needed to check the holdability. That method", 
   "(BaseActivation.reset) does not check holdability anymore and hence we do not need to set the activations to false", 
   "holdability when we are dealing with rollback.", 
   "4)Lastly, JDBC api for Connection.commit does not ask for clearing of warnings and hence we should not have code to", 
   "clear the warnings at the time of commit. I removed the warning clearing code from resetActivations(now called", 
   "endTransactionActivationHandling) in GenericLanguageConnectionContext."
  ], 
  "revision_id": "619279"
 }, 
 {
  "author": "dinesh", 
  "date": "2008-02-07T05:45:34.655811Z", 
  "msg": [
   "version updated"
  ], 
  "revision_id": "619278"
 }, 
 {
  "author": "shankar", 
  "date": "2008-02-07T05:39:39.691480Z", 
  "msg": [
   "bug fix in rstr node building"
  ], 
  "revision_id": "619277"
 }, 
 {
  "author": "asankha", 
  "date": "2008-02-07T05:27:22.178151Z", 
  "msg": [
   "include patches into the classpath before other libs, when using wrapper"
  ], 
  "revision_id": "619276"
 }
]