[
 {
  "author": "wrowe", 
  "date": "2001-08-16T21:13:07.000000Z", 
  "msg": [
   "Slight of fingers - fix my typo of the last revision"
  ], 
  "revision_id": "62174"
 }, 
 {
  "author": "wrowe", 
  "date": "2001-08-16T21:04:41.000000Z", 
  "msg": [
   "Short term hack, this works only for httpd-2.0 builds.  I'll revert out", 
   "after pushing tag.", 
   "This reiterates the horrid situation - we STILL are missing an", 
   "apr_release.h and we can't take ourselves seriously as a library project", 
   "until we get around to fixing this issue."
  ], 
  "revision_id": "62173"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-08-16T06:49:46.000000Z", 
  "msg": [
   "Reorder the shared memory preferences to match what MM originally had.", 
   "This effectively backs out rbb's earlier commit which was valid then", 
   "because we weren't treating Linux as special.  Now, since older versions", 
   "of Linux are safe, we should go back to the original order.", 
   "We now safeguard MAP_ANON usage to only be used with >=2.4.0 Linux kernels.", 
   "On Linux versions less than that, we will not use MAP_ANON because Linux", 
   "lies and says it has it when it doesn't.  I am sure that we could fine tune", 
   "the >=2.4.0 to match the specific 2.3 version that this was fixed in.", 
   "(This may very well be a glibc issue as well...)", 
   "On Linux 2.2 (Mandrake 7.2 distro), we choose shmget.", 
   "On Linux 2.4 (Mandrake 8.0 distro), we choose mmap with MAP_ANON.", 
   "Please try out.  It works here.  If this needs a glibc check instead,", 
   "let me know and we can work something out."
  ], 
  "revision_id": "62172"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-08-16T06:29:48.000000Z", 
  "msg": [
   "Remove variable that is no longer needed since we no longer depend on MM."
  ], 
  "revision_id": "62171"
 }, 
 {
  "author": "trawick", 
  "date": "2001-08-15T21:02:54.000000Z", 
  "msg": [
   "fix some homophonic issues in comments, as well as some", 
   "mispelings found near \"its\" or \"it's\"", 
   "(helping our 4th grader with homework, couldn't help but", 
   "grep)"
  ], 
  "revision_id": "62170"
 }
]