[
 {
  "author": "arj", 
  "date": "2006-01-11T03:49:05.000000Z", 
  "msg": [
   "We now have basic web unit tests, courtesy of the integration of JWebUnit into build.xml and tests/etc/webtests.xml. Four jars were added to the 'lib' dir for testing. Web unit testing simulates a browser's experience and verifies that the following test cases run properly:", 
   "- Anonymous viewing (Main and About pages)", 
   "- Setting asserted name via cookies", 
   "- Creating user profiles", 
   "- Logging in to JSPWiki using a password", 
   "Four combinations are explicitly tested: custom and container authentication, each of these with both the XML and JDBC user database types. Note to developers: the Ant task \"webtests\" should be part of your test plan. Learn, love and embrace JWebUnit. It's easy to express test cases with it, and we will (no doubt) be creating more test cases as we go... see examples in package com.ecyrd.jspwiki.web."
  ], 
  "revision_id": "624975"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:48:00.000000Z", 
  "msg": [
   "UserCheckTag gains an extra status type: \"setPassword\" which identifies whether users are allowed to change their JSPWiki passwords. For custom auth configurations and container auth configurations with shared user databases, this will be true. For most container auth scenarios (i.e., where user data is not shared), this will be false."
  ], 
  "revision_id": "624974"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:47:20.000000Z", 
  "msg": [
   "UserDatabase interface receives one new method: isSharedWithContainer(), to permit JSPWiki to serve as a web container user registrar. Also, jspwiki.properties receives a new property: jspwiki.userdatabase.isSharedWithContainer, which defaults to false. Only JDBCUserDatabase uses it now."
  ], 
  "revision_id": "624973"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:46:21.000000Z", 
  "msg": [
   "Bug fix: UserDatabase contract now specifies that setting created/modified timestamps is now the responsibility of the implementation, and is no longer done by UserManager."
  ], 
  "revision_id": "624972"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:45:32.000000Z", 
  "msg": [
   "Rules for accessing UserPreferences in container-mananged environments have been relaxed significantly: users do not have to be logged in to edit preferences or their profiles. Instead, unauthenticated users attempting to create a profiles receive a polite error message directing them to log in first. If the container shares user data with JSPWiki, the profile will be allowed, and the user will as a result be registered with the container."
  ], 
  "revision_id": "624971"
 }
]