[
 {
  "author": "arj", 
  "date": "2006-01-11T04:06:21.000000Z", 
  "msg": [
   "We now have basic web unit tests, courtesy of the integration of JWebUnit into build.xml and tests/etc/webtests.xml. Four jars were added to the 'lib' dir for testing. Web unit testing simulates a browser's experience and verifies that the following test cases run properly:", 
   "- Anonymous viewing (Main and About pages)", 
   "- Setting asserted name via cookies", 
   "- Creating user profiles", 
   "- Logging in to JSPWiki using a password", 
   "Four combinations are explicitly tested: custom and container authentication, each of these with both the XML and JDBC user database types. Note to developers: the Ant task \"webtests\" should be part of your test plan. Learn, love and embrace JWebUnit. It's easy to express test cases with it, and we will (no doubt) be creating more test cases as we go... see examples in package com.ecyrd.jspwiki.web."
  ], 
  "revision_id": "624980"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:57:12.000000Z", 
  "msg": [
   "Incremented revision and changelog."
  ], 
  "revision_id": "624979"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:53:25.000000Z", 
  "msg": [
   "UserDatabase interface receives one new method: isSharedWithContainer(), to permit JSPWiki to serve as a web container user registrar. Also, jspwiki.properties receives a new property: jspwiki.userdatabase.isSharedWithContainer, which defaults to false. Only JDBCUserDatabase uses it now."
  ], 
  "revision_id": "624978"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:52:05.000000Z", 
  "msg": [
   "WikiPermission receives a new permission type, \"editProfile\" that is better aligned with the streamlined profile pages introduced in 2.3.48; \"registerUser\" is officially deprecated and will be completely eliminated in a future build. To register users, you MUST add the \"editProfile\" permission for each required Role, otherwise the profile tab will be blank. I am sorry about this -- but I promise this will absolutely be the last change we make to the policy grammar prior to official release. See the sample jspwiki.properties."
  ], 
  "revision_id": "624977"
 }, 
 {
  "author": "arj", 
  "date": "2006-01-11T03:49:35.000000Z", 
  "msg": [
   "JBoss login-config.xml JAAS sample snipped appended to jspwiki.jaas. Credit: Milt Taylor."
  ], 
  "revision_id": "624976"
 }
]