[
 {
  "author": "arj", 
  "date": "2006-02-21T08:45:17.000000Z", 
  "msg": [
   "Bug fix: Granting default permissions to wiki groups in the jspwiki.policy security policy file is now supported. To do this, AuthenticationManager injects 'GroupPrincipal' tokens into the wiki session's Subject at login time. GroupPrincipals are also dynamically injected into the  appropriate sessions when groups are created or changed -- this means  that users do not need to log out in order to see the effect of group membership changes on default policies. This is a rather clever bit of programming if I do say so myself."
  ], 
  "revision_id": "625060"
 }, 
 {
  "author": "arj", 
  "date": "2006-02-21T08:44:09.000000Z", 
  "msg": [
   "Enhancement/API change: to support dynamic GroupPrincipal injection, the core jspwiki package receives a new top-level class WikiEvent, a subclass auth.WikiSecurityEvent, and a listener class WikiEventListener. GroupManager and the Group interface gain a new method to register listeners (addWikiEventListener()), and a  corresponding method for removal (removeWikiEventListener()). DefaultGroupManager and DefaultGroup fire security events to these listeners whenever wiki groups are added, changed or deleted."
  ], 
  "revision_id": "625059"
 }, 
 {
  "author": "arj", 
  "date": "2006-02-21T08:42:41.000000Z", 
  "msg": [
   "Deprecation: the built-in Role.ALL enum has been eliminated. Use com.ecyrd.jspwiki.auth.GroupPrincipal in jspwiki.properties instead."
  ], 
  "revision_id": "625058"
 }, 
 {
  "author": "arj", 
  "date": "2006-02-21T08:41:03.000000Z", 
  "msg": [
   "Bug fix: added a \"local entity resolver\" to WebContainerAuthorizer to prevent the need to call out to the network for the webapp 2.3 DTD when parsing web.xml. Also, refactored the parsing logic to use the JDom SAX parser (and XPath) instead of JAXP. Added new directory etc/dtd; this is copied to tests/etc/WEB-INF at test-time, and also into the WAR. Credit: Marc Patteet"
  ], 
  "revision_id": "625057"
 }, 
 {
  "author": "arj", 
  "date": "2006-02-21T08:36:33.000000Z", 
  "msg": [
   "Enhancement: the JSPWiki security policy now supports permission grants to wiki group principals (GroupPrincipal). In addition, a new Permission class, auth.permissions.AllPermission, grants administrative rights to specific wikis (or all, with the wildcard). The combination of these two enhancements means that wiki groups can now possess administrative rights. See the security policy for a sample grant block."
  ], 
  "revision_id": "625056"
 }
]