[
 {
  "author": "arj", 
  "date": "2006-03-30T04:56:27.000000Z", 
  "msg": [
   "Enhancement: Added a new PagePermission target \"update\" that serves as a shorthand for \"edit the text on the page\" AND \"upload files\". The \"edit\" target, meanwhile, has been changed to mean ONLY \"edit the text on the page.\" The default policy file now states that anonymous and asserted users can edit all pages (but they cannot upload files). Authenticated users can, by default, modify all pages (i.e., edit AND upload)."
  ], 
  "revision_id": "625160"
 }, 
 {
  "author": "arj", 
  "date": "2006-03-30T04:56:04.000000Z", 
  "msg": [
   "Bugfix: Fixed PolicyLoader so that there are no import dependencies on private Sun classes for PolicyFile and Configuration (JAAS). Instead, we read the appropriate security provider properties from the JVM and instantiate the classes using Class.forName().newInstance. This is MUCH cleaner and portable, and it *should* enable JSPWiki to work on WebSphere, Resin and other containers that use non-Sun JDKs, JAAS configuration implementations or J2SE PolicyFile implementations. As fixes go, this is a good'un. If you have been having trouble making JSPWiki workon combinations other than Sun JDK + Tomcat, you should give this version a try."
  ], 
  "revision_id": "625159"
 }, 
 {
  "author": "arj", 
  "date": "2006-03-30T04:55:16.000000Z", 
  "msg": [
   "AuthenticationManager is now more verbose about logging exactly what's going on with the policy and JAAS loading operations. If JSPWiki starts up and detects that another program has already the java security policy or the JAAS configuration, we explicitly log a message that says \"something else has set it; leaving it alone...\". This should make multi-wiki troubleshooting easier."
  ], 
  "revision_id": "625158"
 }, 
 {
  "author": "arj", 
  "date": "2006-03-30T04:52:28.000000Z", 
  "msg": [
   "BugFix: Added a new PermissionCollection implementation that fixes a subtle corner-case bug with the security policy file. If only the JSPWiki AllPermission was granted to a particular group (i.e., the grant block did not specify any other permissions), the implied WikiPermissions and PagePermissions were NOT inferred as they should have been."
  ], 
  "revision_id": "625157"
 }, 
 {
  "author": "arj", 
  "date": "2006-03-30T04:49:50.000000Z", 
  "msg": [
   "Enhancement: Added a new PagePermission target \"update\" that serves as a shorthand for \"edit the text on the page\" AND \"upload files\". The \"edit\" target, meanwhile, has been changed to mean ONLY \"edit the text on the page.\" The default policy file now states that anonymous and asserted users can edit all pages (but they cannot upload files). Authenticated users can, by default, modify all pages (i.e., edit AND upload)."
  ], 
  "revision_id": "625156"
 }
]