[
 {
  "author": "arj", 
  "date": "2006-07-29T19:44:04.000000Z", 
  "msg": [
   "More use of checked exceptions. Authorizer.initialize() throws WikiSecurityException. AuthorizationManager gains a new public method: getAuthorizer(). The WikiEventSource \"marker interface\"  added to class declarations for AuthorizationManager AuthenticationManager, WikiEngine. EventSourceDelegate used in place of cut-and-paste code for these classes also."
  ], 
  "revision_id": "625475"
 }, 
 {
  "author": "arj", 
  "date": "2006-07-29T19:43:16.000000Z", 
  "msg": [
   "Group principal injection responsibilities moves to WikiSession from AuthenticationManager. Container role principals are now injected at login time by WebContainerLoginModule, rather than the AuthenticationManager. The WikiEventSource \"marker interface\"  added to class declarations for AuthorizationManager, AuthenticationManager, WikiEngine. EventSourceDelegate used in place of cut-and-paste code for these classes also."
  ], 
  "revision_id": "625474"
 }, 
 {
  "author": "arj", 
  "date": "2006-07-29T19:41:54.000000Z", 
  "msg": [
   "WikiSession.getUserPrincipal now defaults to the wiki principal, rather than the full name. This means that favorites auto-linking won't break. It also gains a method getRoles() that returns the roles and groups the user possesses. The method doPrivileged(WikiSession,PrivilegedAction) allows actions to be executed using the user's privileges. WikiSession's getSubject() method has been removed; it was a security risk. Group principal injection responsibilities moves to WikiSession from AuthenticationManager."
  ], 
  "revision_id": "625473"
 }, 
 {
  "author": "arj", 
  "date": "2006-07-29T19:40:24.000000Z", 
  "msg": [
   "WikiContext.getName() provides a \"safer\" shortcut than calling WikiContext.getPage().getName() because not all wiki contexts apply to pages. This change was made to: TableOfContents plugin; most of the top-level JSPs; TranslatorReader; PageNameTag. The new Command class is now fully integrated into WikiEngine.createContext() and the WikiContext constructors. Practically speaking, this means that the page names and redirect errors shown on pages will actually show something useful when non-pages are accessed (e.g., access denied for UserPreferences.jsp won't print the non-sensical \"you don't have access to 'Main'). WikiEngine delegates page-resolution responsibilities to CommandResolver. Minor changes to new Command/CommandResolver classes to make JSP page names \"friendlier\""
  ], 
  "revision_id": "625472"
 }, 
 {
  "author": "arj", 
  "date": "2006-07-29T19:39:16.000000Z", 
  "msg": [
   "TextUtil.password generator now uses SecureRandom instead of Random."
  ], 
  "revision_id": "625471"
 }
]