[
 {
  "author": "jerenkrantz", 
  "date": "2001-12-04T00:15:52.000000Z", 
  "msg": [
   "I am leaning towards Sander's code because it makes the pool code clean.", 
   "However, I'm going to be majorly backed up this week by finals, so let's", 
   "start a running commentary in STATUS so that when I have time next week,", 
   "I can keep everything straight without having to dig through the archives.", 
   "If you've reviewed the code and tested it, place your votes."
  ], 
  "revision_id": "62599"
 }, 
 {
  "author": "orlikowski", 
  "date": "2001-12-03T19:28:40.000000Z", 
  "msg": [
   "AIX wants this set when using xlc, paths to source files are known."
  ], 
  "revision_id": "62598"
 }, 
 {
  "author": "orlikowski", 
  "date": "2001-12-03T19:26:35.000000Z", 
  "msg": [
   "Add a proper check for xlc on AIX."
  ], 
  "revision_id": "62597"
 }, 
 {
  "author": "gregames", 
  "date": "2001-12-03T18:00:04.000000Z", 
  "msg": [
   "get binbuild working when apr, apr-util, and expat are built shared in", 
   "directories that are not well known to the loader.", 
   "How it works:", 
   "* libtool figures out the name of this system's library path environment", 
   "variable (i.e. LD_LIBRARY_PATH, LIBPATH, DYLD_LIBRARY_PATH) at apr", 
   "configure time (existing code)", 
   "* save this variable name in SHLIBPATH_VAR in APRVARS", 
   "* substitute this name when apachectl is created", 
   "* uncomment the lines containing this variable during binbuild", 
   "* install_bindist.sh updates the path to lib/ when the binary is", 
   "installed (existing code)", 
   "not done yet, but a good idea:", 
   "* create a file or directory containing all environment variable settings", 
   "for apachectl.  Others env vars need to be tweaked, at least on AIX and", 
   "OS/390, so keeping them separate should reduce headaches long term."
  ], 
  "revision_id": "62596"
 }, 
 {
  "author": "trawick", 
  "date": "2001-12-02T14:02:16.000000Z", 
  "msg": [
   "while on some platforms you can get away with the bug of", 
   "calling pthread_cond_timedwait() (and thus", 
   "apr_thread_cond_timedwait()) without holding the mutex,", 
   "you can't on AIX; the system recognizes the error and", 
   "returns EINVAL", 
   "so fix the testlock program to grab the mutex"
  ], 
  "revision_id": "62595"
 }
]