[
 {
  "author": "aaron", 
  "date": "2001-12-11T02:29:18.000000Z", 
  "msg": [
   "Kind of an obscure bug. VPATH on a platform that builds exports.c (like", 
   "AIX) would improperly build the INCLUDES macro. This sticks an extra", 
   "'/' in there so the compiler can find all the include files properly.", 
   "Without this patch, symptoms would include:", 
   "- AIX would build and run, and even work with \"GET /\" requests, but", 
   "would SEGV on anything more complicated (\"GET / HTTP/1.1\"...).", 
   "- Include failures when trying to build exports.lo (but it would", 
   "not halt the build and would be buried in the build output)."
  ], 
  "revision_id": "62619"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-12-11T01:42:10.000000Z", 
  "msg": [
   "If we tell libtool what our link dependencies are (by including them when", 
   "we build libapr.la), it will remember the dependencies for us.  So, if a", 
   "third-party (say httpd, flood, SVN, etc.) want to link against libapr.la,", 
   "they don't need to worry about the library dependencies that are currently", 
   "stored in EXTRA_LIBS et al.", 
   "This has been tested with libtool-1.4.  Further testing and integration", 
   "needs to be done.  But, this could simplify our build system a bit w.r.t.", 
   "library dependencies."
  ], 
  "revision_id": "62618"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-12-11T00:44:22.000000Z", 
  "msg": [
   "I'm happy.  Go, gadget, go...", 
   "(My only issue with it was that apr_pool_lock wasn't defined.  That's", 
   "an easy fix.)"
  ], 
  "revision_id": "62617"
 }, 
 {
  "author": "gstein", 
  "date": "2001-12-10T23:53:47.000000Z", 
  "msg": [
   "Checkpointing a script that apps can use to find an installed or", 
   "bundled copy of APR. If an app uses this from their ./configure, then", 
   "they will have a consistent mechanism for locating APR.", 
   "Note: this is incomplete work. Checkpointing into CVS. Justin is going", 
   "to help out.", 
   "Note #2: apr-util will also want a very similar script. TBD."
  ], 
  "revision_id": "62616"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-12-10T23:01:46.000000Z", 
  "msg": [
   "There is zero correlation between my placing this in STATUS and my", 
   "volunteering to do this."
  ], 
  "revision_id": "62615"
 }
]