[
 {
  "author": "jalkanen", 
  "date": "2007-04-10T06:39:52.000000Z", 
  "msg": [
   "1. Added a 'Section Headings Template'.", 
   "2. Reorganized the templates so that the html ones are at the top of the list,", 
   "and the plugin templates are at the bottom."
  ], 
  "revision_id": "626235"
 }, 
 {
  "author": "jalkanen", 
  "date": "2007-04-10T06:39:35.000000Z", 
  "msg": [
   "1. Added more comments regarding JSPWiki-specific changes to the config.", 
   "2. Disabled FCK's 'Save' button since some users may inadvertently use it, which", 
   "would result in loss of their edits.", 
   "3. Keystroke configuration updates from FCK 2.4.1", 
   "4. Disabled the BulletedList and NumberedList context menus since they contain", 
   "options that have no equivalent representation in jspwiki markup.", 
   "5. The Advanced tab in the 'Insert/Edit Link' popup is now enabled."
  ], 
  "revision_id": "626234"
 }, 
 {
  "author": "jalkanen", 
  "date": "2007-04-10T06:39:10.000000Z", 
  "msg": [
   "1. Handle defined & undefined wiki pages that have a CSS class value other than", 
   "the default ones.", 
   "2. Prevent NPE when a link tag doesn't have a title attribute.", 
   "3. Prevent a FCKeditor bug involving whitespace in a PRE tag from occuring."
  ], 
  "revision_id": "626233"
 }, 
 {
  "author": "jalkanen", 
  "date": "2007-04-10T06:38:48.000000Z", 
  "msg": [
   "1. Don't print out 'Failed to insert plugin' error message while in", 
   "m_wysiwygEditorMode.", 
   "2. Don't resolve interwiki links when in m_wysiwygEditorMode."
  ], 
  "revision_id": "626232"
 }, 
 {
  "author": "jalkanen", 
  "date": "2007-04-10T06:38:05.000000Z", 
  "msg": [
   "1. Line terminators are now removed from Text nodes instead of being replaced", 
   "by a space. This had caused unwanted space characters in certain instances.", 
   "2. Added support for all the AugmentedWikiLink attributes.", 
   "3. Block elements such as h1, h2, h3, h4, dl, form, and pre are now printed on", 
   "their own line to avoid breaking any preceding or subsequent wiki markup.", 
   "4. Only print blank lines to represent a <p> if it's not empty.", 
   "5. Sublist items should now be properly converted to wiki markup (without the", 
   "extraneous newline).", 
   "6. Headings are beautified with a space: !!!Heading => !!! Heading", 
   "6. Miscellaneous small fixes."
  ], 
  "revision_id": "626231"
 }
]