[
 {
  "author": "jeremias", 
  "date": "2008-02-16T12:28:48.088350Z", 
  "msg": [
   "Extracted most of the code in CodePointMapping (generated by XSLT) into a base class for easier maintenance and proper Javadocs.", 
   "Deprecated FOP's copy of Glyphs.java.", 
   "Took a different approach at handling mapping alternatives for single-byte fonts. The AFM now only lists the main character. Substitution is done through Glyphs.java later in CodePointMapping.", 
   "Fixed a problem in Type1FontLoader where the PFM overrides asc/desc/cap/x even though the AFM provides the values. It showed itself because the URW Symbol font has wrong values in the PFM.", 
   "Added a note to myself in Type1FontLoader to implement the \"Flags\" value. The whole thing still seems to work without that part.", 
   "Added a glyph name list to the CodePointMapping so we can work with the original list from the AFM. Otherwise, various mapping operations to and from resulted in unwanted mappings (because the mappings are not necessarily 1:1) and in the end the PDF received an incorrect Encoding map. Now there's no such problem anymore."
  ], 
  "revision_id": "628280"
 }, 
 {
  "author": "mrdon", 
  "date": "2008-02-16T12:27:07.020321Z", 
  "msg": [
   "Fixing edit where id wouldn't be set", 
   "WW-2186"
  ], 
  "revision_id": "628279"
 }, 
 {
  "author": "mrdon", 
  "date": "2008-02-16T12:13:18.173727Z", 
  "msg": [
   "Updating struts annotations dep to more recent snapshot", 
   "WW-2451"
  ], 
  "revision_id": "628278"
 }, 
 {
  "author": "mrdon", 
  "date": "2008-02-16T12:08:55.787123Z", 
  "msg": [
   "Fixing uri resolver not being set correctly for xslt result", 
   "WW-2334"
  ], 
  "revision_id": "628277"
 }, 
 {
  "author": "jeremias", 
  "date": "2008-02-16T12:06:59.119983Z", 
  "msg": [
   "Removed commented code in its own revision (I wanted to save the duplication detection code I used for building the alternatives list in SVN just in case I ever need it again)."
  ], 
  "revision_id": "628276"
 }
]