[
 {
  "author": "gdamour", 
  "date": "2008-02-23T01:02:57.426371Z", 
  "msg": [
   "1. Add SessionManagerListener to the clustering API. This allows clients", 
   "of local SessionManagers to receive callbacks when corresponding", 
   "remote SessionManagers join or leave the cluster.", 
   "2. Arbitrary WADI clustered services can now be registered: distributed", 
   "services are wrapped within ClusteredServiceHolder GBeans which are injected", 
   "to BasicWADISessionManager and registered with the underlying WADI", 
   "ServiceRegistry.", 
   "3. Add support for clustering of SFSBs.", 
   "The structure mirrors the one applied for the clustering of Jetty and", 
   "Tomcat, i.e. two modules and two configurations are added:", 
   "- geronimo-openejb-clustering-wadi: defines a ClusteredRPCContainer", 
   "implementation for SFSBs and infrastructure components maintaining a", 
   "bookkeeping of the connection addresses a clustered SFSB client can connect", 
   "to. The monitoring components, i.e. NetworkConnectorMonitor and", 
   "NetworkConnectTracker, works as follows:", 
   "o When an OpenEJB NetworkConnector service starts, NetworkConnectMonitor", 
   "registers the address of this NC with the clustered service", 
   "NetworkConnectorTracker and this for all the locally running clustered SFBS", 
   "deployments.", 
   "o When an OpenEJB NC services stops, NCM executes an unregisteration reverting", 
   "the effects of a NC service start.", 
   "o When a clustered SFSB deployments starts, NCM registers its  deployment id", 
   "with the clustered service NCT for all the locally running NCs addresses.", 
   "o When a clustered SFSB deployment stops, NCM executes an unregisters reverting", 
   "the effects of a deployement start.", 
   "o When a node hosting an EJB module having clustered SFSBs stops or fails, NCM", 
   "updates the local NCT so that all the connection addresses registered for", 
   "all the clustered SFSB deployments of this node are removed.", 
   "- geronimo-openejb-clustering-builder-wadi: defines a builder to handle the", 
   "new substitution group element 'clustering' added to geronimo-openejb-2.0.xsd.", 
   "The clustering builder works nearly the same than for Jetty and Tomcat except", 
   "for the following specificities:", 
   "o A (WADI) clustered NCT service is registered.", 
   "o The container id for the clustered SFSBs is set to the Geronimo provided", 
   "clustered SFSB container implementation.", 
   "- openejb-clustering-wadi: declares Geronimo provided clustered SFSB", 
   "container implementation.", 
   "- openejb-clustering-builder-wadi: declares clustering builder."
  ], 
  "revision_id": "630370"
 }, 
 {
  "author": "doll", 
  "date": "2008-02-23T00:53:16.529332Z", 
  "msg": [
   "Added an opensocial-0.6 feature. This simply depends on opensocial-0.7 and uses the shim file I created before (which has now changed dirs)."
  ], 
  "revision_id": "630369"
 }, 
 {
  "author": "pquerna", 
  "date": "2008-02-23T00:39:13.516583Z", 
  "msg": [
   "Create trunk."
  ], 
  "revision_id": "630368"
 }, 
 {
  "author": "pquerna", 
  "date": "2008-02-23T00:38:53.649478Z", 
  "msg": [
   "Create a root for Orthrus."
  ], 
  "revision_id": "630367"
 }, 
 {
  "author": "niq", 
  "date": "2008-02-23T00:34:47.652067Z", 
  "msg": [
   "Backport r628644", 
   "http_filters: Don't returm 100-continue on client error", 
   "PR 43711"
  ], 
  "revision_id": "630366"
 }
]