[
 {
  "author": "jm", 
  "date": "2004-01-26T22:20:21.613323Z", 
  "msg": [
   "added bogusmx DNSBL test"
  ], 
  "revision_id": "6304"
 }, 
 {
  "author": "felicity", 
  "date": "2004-01-26T22:09:05.663518Z", 
  "msg": [
   "- bug 2267-related: I found that M::SA::Conf::_parse() was sucking", 
   "up a lot of the time of a single message run.  I modified the", 
   "majority of configuration options to do string equality instead of", 
   "REs and got an improvement.  It probably still needs some tweaks,", 
   "but it's working for me. :)", 
   "- started removing backwards compatibility options -- for instance,", 
   "bayes_auto_learn is now the required version, auto_learn alone won't", 
   "work.", 
   "- the previous Conf code would set the default scores whenever a", 
   "rule was defined in the config files.  unfortunately, since we", 
   "typically define the rule, and then the score, this means we're", 
   "setting the scores to the default, then again when the real scores", 
   "are read in.  I moved the default score setting to the end of the", 
   "parsing routine, so all the real scores are set, then anything", 
   "that's left without a score gets the appropriate default.", 
   "- more documentation bits around the MsgContainer and MsgParser code", 
   "- got rid of some module code not required in PerMsgStatus", 
   "- added a quick n' dirty useless entity modification to the URL list", 
   "- added license jargon to MsgParser", 
   "- fixed dns.t to exit if it actually shouldn't test anything", 
   "- killed useless Data::Dumper from rule_tests.t"
  ], 
  "revision_id": "6303"
 }, 
 {
  "author": "ajack", 
  "date": "2004-01-26T19:21:07.690408Z", 
  "msg": [
   "Borrowed/hacked a build.xml for version, for Gump. Ruper next..."
  ], 
  "revision_id": "6302"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-01-26T06:50:21.457117Z", 
  "msg": [
   "added some ByteBuffer overloads and project POM for Maven builds"
  ], 
  "revision_id": "6301"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-01-26T06:01:00.982143Z", 
  "msg": [
   "Started with some minimal set of BER tools to help Wes out."
  ], 
  "revision_id": "6300"
 }
]