[
 {
  "author": "nicolas", 
  "date": "2008-02-25T16:05:05.902381Z", 
  "msg": [
   "limited support for Contextualizable and lookups in PlexusContainer"
  ], 
  "revision_id": "630905"
 }, 
 {
  "author": "ate", 
  "date": "2008-02-25T16:04:28.627037Z", 
  "msg": [
   "JS2-857: SVN restructuring to support separate lifecycle for other artifacts besides the portal itself, like j2-admin", 
   "See: https://issues.apache.org/jira/browse/JS2-857", 
   "- step 5: move j2-admin content under its new trunk folder"
  ], 
  "revision_id": "630904"
 }, 
 {
  "author": "djd", 
  "date": "2008-02-25T16:02:51.802044Z", 
  "msg": [
   "DERBY-3451 A new interface called DerbySQLException has been added to org.apache.derby.iapi.error.", 
   "The EmbedSQLException class has been modified to implement this interface.", 
   "The StandardException calls the isSimpleWrapper method on the DerbySQLException interface, thereby avoiding a need to reference EmbedSQLException.", 
   "A new static method getArgumentFerry() has been added to StandardExcepion. This performs the same task as the current getArgumentFerry() method in SQLExceptionFactory and SQLExceptionFactory40.", 
   "SQLExceptionFactory.getArgumentFerry() has been amended to call StandardException.getArgumentFerry().", 
   "SQLExceptionFactory40.getArgumentFerry() has been removed.", 
   "StandardException.getArgumentFerry() now handles the pre-JDBC3 and post-JDBC4 scenarios (in the pre-JDBC4 scenario, the passed argument is a DerbySQLException, which is returned immediately), so there is no need to override this functionality.", 
   "This change allows us to avoid having a dependency between StandardException and Util.", 
   "As the getArgumentFerry() method now checks for DerbySQLException rather than EmbedSQLException, it is able to avoid dependency on EmbedSQLException.", 
   "Patch contributed by Dibyendu Majumdar Email: dibyendu at mazumdar dot demon dot co dot uk (no ILCA on file but minor patch - reorganizing existing code, ALv2 flag checked on patch in jira attachement)"
  ], 
  "revision_id": "630903"
 }, 
 {
  "author": "ate", 
  "date": "2008-02-25T16:02:41.916964Z", 
  "msg": [
   "JS2-857: SVN restructuring to support separate lifecycle for other artifacts besides the portal itself, like j2-admin", 
   "See: https://issues.apache.org/jira/browse/JS2-857", 
   "- step 5: move j2-admin content under its new trunk folder"
  ], 
  "revision_id": "630902"
 }, 
 {
  "author": "jm", 
  "date": "2008-02-25T16:01:33.577349Z", 
  "msg": [
   "fix source href link title"
  ], 
  "revision_id": "630901"
 }
]