[
 {
  "author": "niallp", 
  "date": "2008-02-26T17:21:06.107472Z", 
  "msg": [
   "Set svn:eol-style and svn:keywords properties (no real changes, may cause alot of noise)"
  ], 
  "revision_id": "631305"
 }, 
 {
  "author": "niallp", 
  "date": "2008-02-26T17:17:41.301696Z", 
  "msg": [
   "Set svn:eol-style and svn:keywords properties (no real changes, may cause alot of noise)"
  ], 
  "revision_id": "631304"
 }, 
 {
  "author": "gnodet", 
  "date": "2008-02-26T17:17:14.301234Z", 
  "msg": [
   "Rename logger to LOGGER, avoid possible NPE when closing the jar and add an exception log"
  ], 
  "revision_id": "631303"
 }, 
 {
  "author": "mamta", 
  "date": "2008-02-26T17:15:59.549568Z", 
  "msg": [
   "Merging revision 631108 from trunk into 10.3 codeline. In addition, adding method", 
   "assertNoMoreResults in junit/JDBC.java since it is used by the test which is getting merged", 
   "through 631108.", 
   "The commit comments for 631108", 
   "were as follows", 
   "DERBY-3304", 
   "When a SQL exception is thrown, make sure that rollback caused by it closes all the resultsets", 
   "irrespective of whether they return rows or not. This cleanup was not happening for", 
   "CallableStatementResultSet. To fix this, in CallableStatementResultSet class, I have changed", 
   "the no-op cleanup() method to call close(). Without this, the locks held by the resultsets", 
   "created inside the Java procedure method were not getting released.", 
   "I have added a test case to make sure that this code change is tested. I have created a", 
   "Java procedure which creates a dynamic resultset, a local resultset and then does an", 
   "insert which will cause duplicate key exception. As part of rollback for exception, Derby", 
   "closes the dynamic resultset and local resultset along with the CallableStatementResultset.", 
   "And the test case is able to drop the tables which were used by the dynamic and local", 
   "resultset without running into locking issues."
  ], 
  "revision_id": "631302"
 }, 
 {
  "author": "mcculls", 
  "date": "2008-02-26T17:15:42.919538Z", 
  "msg": [
   "Use 1.4.0 bundleplugin, and enable jdk13 classifier build in UPNP basedriver"
  ], 
  "revision_id": "631301"
 }
]