[
 {
  "author": "mamta", 
  "date": "2008-02-28T17:21:33.052785Z", 
  "msg": [
   "Merging changes for DERBY-737 into 10.1 codeline. The revision being merged is 464551 and", 
   "the commit comments for 464551 are as follows", 
   "The changes have been very localized in", 
   "AlterTableConstantAction.java!updateIndex(). Currently, this method checks", 
   "if statistics already exist for an index. If yes, then it sets a flag", 
   "updateStatistics to true. Later, the code checks for this flag and drops", 
   "the existing statistics and creates new statistics for that index provided", 
   "the user table at this point is not empty. So, as we can see, if there is", 
   "an index with no preexisting statistics, the flag updateStatistics will be", 
   "set to false and hence no statistics related code is executed and hence", 
   "even though the user table is not empty at the time of compress, no", 
   "statistics get generated for such an index.", 
   "I am proposing to fix the problem by still using the flag to see if", 
   "an index has pre-existing statistics. If yes, then we should drop", 
   "those statistics. Next, whether the index has pre-existing statistics or", 
   "not, go ahead and create new statistics for the index provided the", 
   "user table is not currently empty."
  ], 
  "revision_id": "632065"
 }, 
 {
  "author": "rfeng", 
  "date": "2008-02-28T17:18:51.297532Z", 
  "msg": [
   "Add phase-based ordering for invokers/interceptors in an invocation chain"
  ], 
  "revision_id": "632064"
 }, 
 {
  "author": "rott", 
  "date": "2008-02-28T17:18:23.677097Z", 
  "msg": [
   "Restoring SoapMessageProviderTests.  The sample service was missing a .wsdl file, and a few other necessary changes due to using a new deployer since it was last running.", 
   "One test remains disabled, see JIRA AXIS2-3558"
  ], 
  "revision_id": "632063"
 }, 
 {
  "author": "dyre", 
  "date": "2008-02-28T17:17:53.732306Z", 
  "msg": [
   "Modified DerbyBugGuidelines so that it emphasizes that 'Existing Application impact' only should be checked if the solution will affect existing applications."
  ], 
  "revision_id": "632062"
 }, 
 {
  "author": "mbenson", 
  "date": "2008-02-28T17:15:55.971839Z", 
  "msg": [
   "remove text describing passing a null value for a char parameter"
  ], 
  "revision_id": "632061"
 }
]