[
 {
  "author": "rickhall", 
  "date": "2008-02-29T19:52:53.922460Z", 
  "msg": [
   "Refactored the IContent abstraction from the module loader layer to provide", 
   "more generic access to the content of the module, which then makes it possible", 
   "for IContentLoader implementations to interpret the content as they see fit;", 
   "previously, the content loader impl's bundle class path interpretation was", 
   "not self-contained and had to be handled externally. The main reason this", 
   "was necessary was to make it possible for the content loader to calculate", 
   "the class path of a bundle itself and to make it possible that the bundle's", 
   "class path could span multiple module's, which will be necessary for fragments", 
   "(FELIX-29). This patch refactors the bundle cache to implement the new", 
   "IContent mechanisms."
  ], 
  "revision_id": "632420"
 }, 
 {
  "author": "djd", 
  "date": "2008-02-29T19:34:33.111118Z", 
  "msg": [
   "DERBY-2109 Security Principals and Permission classes to support system level permissions in Derby through standard Java security policy.", 
   "Committed a sub-set of patch 12 related to the security code without enabling any functionality.", 
   "Note that the SystemPrivilegesPermissionTest is not added into the _Suite (as the complete patch does)", 
   "as I think it will fail under J2ME. It passes with classes but fails with jars but that is to be expected", 
   "as the Derby's permissions classes are not yet added into the jars, this will occur once they are used.", 
   "Patch contributed by: Martin Zaun Email: martin dot zaun at sun dot com"
  ], 
  "revision_id": "632419"
 }, 
 {
  "author": "vitek", 
  "date": "2008-02-29T19:31:32.702318Z", 
  "msg": [
   "2008-02-29  Travis Vitek  <vitek@roguewave.com>", 
   "STDCXX-597", 
   "* tests/strings/21.string.access.cpp (test_access): Avoid purify", 
   "UMR warning when testing for end of string match"
  ], 
  "revision_id": "632418"
 }, 
 {
  "author": "assaf", 
  "date": "2008-02-29T19:29:18.259089Z", 
  "msg": [
   "BUILDR-51"
  ], 
  "revision_id": "632417"
 }, 
 {
  "author": "assaf", 
  "date": "2008-02-29T19:28:02.437098Z", 
  "msg": [
   "BUILDR-52"
  ], 
  "revision_id": "632416"
 }
]