[
 {
  "author": "jerenkrantz", 
  "date": "2002-04-13T06:34:08.000000Z", 
  "msg": [
   "My comment has nothing to do with versioning but rather a tendency", 
   "to be conservative about things that could possibly fail - given an", 
   "unknown implementation.  Our implementation can't fail, but a theoretical", 
   "MD5 implementation could.  I've just been bit by too many locations in", 
   "httpd where no return code was ever thought possible and we had to", 
   "change the API to handle a return code when we did need it.", 
   "Note that our md5 implementation has no business being in APR - it", 
   "should be in apr-util with our \"crypto\" stuff there.  The overall goal", 
   "of providing random bytes on all platforms (i.e. APR_HAS_RANDOM is always", 
   "defined) would mean that we can kick md5 to its appropriate place - see", 
   "note about where the fix needs to be.  So, if you \"fix\" the API, it might", 
   "be goodness to move it to apr-util at the same time."
  ], 
  "revision_id": "63254"
 }, 
 {
  "author": "kfogel", 
  "date": "2002-04-13T06:12:33.000000Z", 
  "msg": [
   "* STATUS: Add an item about the apr_md5* api discussion.", 
   "I may not be up on all the proper conventions for noting this sort of", 
   "thing in the STATUS file; please educate me if necessary, thanks.  -kff"
  ], 
  "revision_id": "63253"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-04-12T01:19:44.000000Z", 
  "msg": [
   "Set precompiler for Solaris atomics when using GNU binutils.", 
   "(Fix whitespace issue a line earlier while I'm at it.)", 
   "PR:\t7876", 
   "Submitted by:\tMarvin Solomon <solomon@conceptshopping.com>", 
   "Reviewed by:\tJustin Erenkrantz"
  ], 
  "revision_id": "63252"
 }, 
 {
  "author": "trawick", 
  "date": "2002-04-11T22:55:41.000000Z", 
  "msg": [
   "allow the testlock program to continue on systems where read/write locks", 
   "aren't implemented (e.g., Darwin); there is still useful stuff to test"
  ], 
  "revision_id": "63251"
 }, 
 {
  "author": "bnicholes", 
  "date": "2002-04-11T20:49:29.000000Z", 
  "msg": [
   "Still working on the spawning process and wiring up the pipes.  Changed", 
   "apr_proc_create so that the parent side of the pipes are opened first."
  ], 
  "revision_id": "63250"
 }
]