[
 {
  "author": "mikem", 
  "date": "2008-03-04T17:38:48.662033Z", 
  "msg": [
   "DERBY-3330", 
   "committed on behalf of Anurag Shekhar", 
   "Committed modified versions of patch derby-3330v13.diff and", 
   "db2Compatibility-v2.diff.  The modifications are mostly changed and/or", 
   "added comments along with some code formatting changes to make the", 
   "new code match the surrounding code style.", 
   "This checkin adds the functionality to", 
   "create unique constraints on a key that contains one or more nullable", 
   "columns.  This constraint will all inserts of all keys that contain", 
   "one or more columns with the null value.  All keys that contain no columns", 
   "with null values are constrained to be unique in the table.", 
   "The underlying implementation for this new type of unique constraint uses", 
   "the existing btree non-unique index with a small modification to do", 
   "checking at insert time to provide the described unique behavior for null", 
   "and non-null keys.  The sorter has also been modified to provide this", 
   "support for creating the index."
  ], 
  "revision_id": "633560"
 }, 
 {
  "author": "jeremias", 
  "date": "2008-03-04T17:35:52.956454Z", 
  "msg": [
   "Update FOP poster for OpenExpo 2008 in Bern.", 
   "This fixes various warnings, updates the history and simplifies configuration (if you're on Windows, it will work out of the box because all fonts are available)."
  ], 
  "revision_id": "633559"
 }, 
 {
  "author": "mcooper", 
  "date": "2008-03-04T17:34:38.791676Z", 
  "msg": [
   "TRINIDAD-986", 
   "Thanks to Gary van Matre for his patch."
  ], 
  "revision_id": "633558"
 }, 
 {
  "author": "jeremias", 
  "date": "2008-03-04T17:30:40.428418Z", 
  "msg": [
   "Bugfix: If there's shrink available in an auto-height situation, the difference is now set to 0 in order to avoid unwanted effects. IOW, never shrink in an auto-height situation."
  ], 
  "revision_id": "633557"
 }, 
 {
  "author": "mcooper", 
  "date": "2008-03-04T17:29:45.995946Z", 
  "msg": [
   "TRINIDAD-986", 
   "Thanks to Gary van Matre for his patch."
  ], 
  "revision_id": "633556"
 }
]