[
 {
  "author": "lindner", 
  "date": "2008-03-06T15:43:50.468565Z", 
  "msg": [
   "Patch by Chris Chabot for SHINDIG-112", 
   "- Changed *RemoteContent* to do single requests, curl_multi was acting up on some of my systems and wasn't used in practice anyhow, so simplifying it to single requests resolved these issues.", 
   "- Refactored Gadget / GadgetView / GadgetSpec into a single class. Simple class structure fits better with PHP, and makes it easier to read too.", 
   "- Moved http processing options into the config array, this way they you can override then if desired, and saves code.", 
   "- Removed a few bits of unused code (Icons, NoOop feature).", 
   "- Removed abstract base classes for things that don't have to be replaced by site's own implementations (featurespec, userpref and localespec).", 
   "- Moved the caching of the feature loader a bit up in the chain, saves a good bit on processing time and has the same effect.", 
   "- Fixed a silly oversight where the cache key for url's was md5'd twice, thus increasing the change of a key collision.", 
   "- Removed a few more include's that are now handled by the __autoloader.", 
   "- Now using sha1 instead of md5 for keys (larger keys, theoretically less chance of key collisions).", 
   "- Fixed a bug in the proxy where httpMethod was ignored if fetchJson was called.", 
   "- Fixed a bug in the proxy where it didn't always look in the post variables for url/method/etc, and made this generally more consistent", 
   "- Implemented the missing sha1 checksum for the js libs query (?js=<version>) for href gadget content.", 
   "- Added a noHeaders option to the base http servlet class, so we can properly use its destructor without breaking the JS and Proxy servlets.", 
   "- Improved header handling in the proxy code, uses apache's get all headers where available and otherwise falls back on a _SERVER based work around, also blacklisted a few headers for the passthru and thus fixing a few bugs where the browser didn't understand the request so well.", 
   "- Fixed handling of postData in the proxy.", 
   "- Fixed setCachingHeaders in the proxy.", 
   "- Fixed the mixed naming of jsLibrary / JsLibrary which was causing the autoloader to fail"
  ], 
  "revision_id": "634310"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2008-03-06T15:42:21.007082Z", 
  "msg": [
   "SLING-228 finally remove the old SyntheticResource from the jcr/resource bundle"
  ], 
  "revision_id": "634309"
 }, 
 {
  "author": "vborja", 
  "date": "2008-03-06T15:34:14.908678Z", 
  "msg": [
   "Nailgun documentation fixes"
  ], 
  "revision_id": "634308"
 }, 
 {
  "author": "ablack", 
  "date": "2008-03-06T15:33:40.987820Z", 
  "msg": [
   "2008-03-04  Andrew Black  <ablack@roguewave.com>", 
   "* bin/buildntest: Change result file header tag to stdcxx-extended", 
   "to enable further processing by the nightly testing system,", 
   "document result file structure."
  ], 
  "revision_id": "634307"
 }, 
 {
  "author": "senaka", 
  "date": "2008-03-06T15:32:43.413276Z", 
  "msg": [
   "Fixing JIRA Issue AXIS2C-1045"
  ], 
  "revision_id": "634306"
 }
]