[
 {
  "author": "lu4242", 
  "date": "2008-03-09T04:50:33.321182Z", 
  "msg": [
   "component generation for tomahawk and tomahawk 1.2 modules"
  ], 
  "revision_id": "635170"
 }, 
 {
  "author": "amilas", 
  "date": "2008-03-09T04:47:20.999593Z", 
  "msg": [
   "this change do not make any effect to the axis2 excecution paths. Here I added some constants to identify the", 
   "AxisFault types. This is very important for an RM Implementation. Added resumeSendFault method to resume fault", 
   "flows"
  ], 
  "revision_id": "635169"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2008-03-09T04:45:21.921264Z", 
  "msg": [
   "Removed imports that break the build."
  ], 
  "revision_id": "635168"
 }, 
 {
  "author": "psmith", 
  "date": "2008-03-09T04:44:05.956307Z", 
  "msg": [
   "In an effort to get around LGPL issues, gutting the Web layer, and converting it", 
   "to provide basic JSON-style query services.  This will allow another module", 
   "built on top of this layer to be built using ExtJS, but done externally (probably", 
   "at my work at Aconex).  Should the LGPL issue ever get resolved (4 years and waiting I think),", 
   "it can be rolled back in here later.", 
   "Also added the beginnings of a high performance set of Appenders that are Pinpoint friendly.", 
   "The first one uses ActiveMQ as a JMS appender.  This will be easier to configure and install", 
   "than the JMSAppender for those that don't have much background in JMS, JNDI. A newer", 
   "AsyncAppender that is built using Java 5 concurrency principles will also be developed to wrap", 
   "Socket*Appenders to minimize ane performance problem of transmitting a smoking hot molten", 
   "stream of LoggingEvents (there can be a _lot_ in a busy server).", 
   "Left myself a note about Lucene's Normalization data usage.  Got bitten by that at Aconex, and nice", 
   "to learn from that.  If you don't use the normalization data, then you can save yourself a tonne", 
   "of heap memory by turning that off.", 
   "Some other general project tidy up, although elements of the project still look like my kitchen after", 
   "cooking dinner."
  ], 
  "revision_id": "635167"
 }, 
 {
  "author": "psmith", 
  "date": "2008-03-09T04:36:56.502414Z", 
  "msg": [
   "Copying current state of affairs before a major rework to use JSON.", 
   "Just in case I delete something useful, I'll be able to find it later on."
  ], 
  "revision_id": "635166"
 }
]