[
 {
  "author": "felixk", 
  "date": "2008-03-24T19:21:08.823171Z", 
  "msg": [
   "Copy wrapper for windows family os"
  ], 
  "revision_id": "640530"
 }, 
 {
  "author": "jmsnell", 
  "date": "2008-03-24T19:20:37.005436Z", 
  "msg": [
   "grrr...."
  ], 
  "revision_id": "640529"
 }, 
 {
  "author": "akarasulu", 
  "date": "2008-03-24T19:20:08.701487Z", 
  "msg": [
   "Adding new project module to contain tools used for dealing with xdbm based", 
   "partition stores.  XDBM means and partition based on two column datastructures", 
   "where keys are sorted.  XDBM partition and store implementations use a standard", 
   "scheme for a partition of the Directory Information Base (DIB).  This scheme", 
   "is documented in the developer documentation for the JDBM based partition impl.", 
   "This scheme is the one which has a master table, with system (required) and", 
   "user indices into the master table.", 
   "So this module is just a place to store utilities like the gui used to inspect", 
   "such store implementations, and their indices.  These tools operate on xdbm", 
   "constructs like Index, Table and MasterTable as opposed to implementation", 
   "specific constructs.  This is intentional so the utilities and tools can be", 
   "used across implementations.  Some other implementations may be based on AvlTree", 
   "(in memory) or other btree implementations on disk."
  ], 
  "revision_id": "640528"
 }, 
 {
  "author": "bentmann", 
  "date": "2008-03-24T19:14:17.706773Z", 
  "msg": [
   "o Added svn:eol-style=native"
  ], 
  "revision_id": "640527"
 }, 
 {
  "author": "bryanduxbury", 
  "date": "2008-03-24T19:13:56.644330Z", 
  "msg": [
   "HBASE-536 Remove MiniDFS startup from MiniHBaseCluster", 
   "-Changed MiniHBaseCluster to not start up a MiniDFS", 
   "-Changed HBaseClusterTestCase to do the work of starting up a MiniDFS.", 
   "-Added pre and post setup method to HBaseClusterTestCase so you can control what happen before MiniHBaseCluster is booted up", 
   "-Converted AbstractMergeTestCase to be a HBaseClusterTestCase", 
   "-Converted any test that used a raw MIniDFS or MiniHBaseCluster to use HBaseClusterTestCase instead", 
   "-Split TestTimestamp into two tests - one for clientside (now in o.a.h.h.client) and one for serverside (o.a.h.h.regionserver)", 
   "-Merged in Stack's changes to make bin/hbase have hadoop jars first on the classpath", 
   "-Updated PerformanceEvaluation (in --miniCluster mode) to start up a DFS first", 
   "-Fixed a bug in BaseScanner that would have allowed NPEs to be generated"
  ], 
  "revision_id": "640526"
 }
]