[
 {
  "author": "rdonkin", 
  "date": "2008-03-31T20:54:52.948341Z", 
  "msg": [
   "Test RENAME selected mailbox. Note that these tests will need amendment."
  ], 
  "revision_id": "643145"
 }, 
 {
  "author": "rfeng", 
  "date": "2008-03-31T20:52:38.105004Z", 
  "msg": [
   "Fix for TUSCANY-2148"
  ], 
  "revision_id": "643144"
 }, 
 {
  "author": "olamy", 
  "date": "2008-03-31T20:51:36.123989Z", 
  "msg": [
   "fix documentation with jetty standalone"
  ], 
  "revision_id": "643143"
 }, 
 {
  "author": "stack", 
  "date": "2008-03-31T20:47:47.836948Z", 
  "msg": [
   "HBASE-551 Master stuck splitting server logs in shutdown loop;", 
   "on eachiteration, edits are aggregated up into the millions", 
   "M src/java/org/apache/hadoop/hbase/HLog.java", 
   "(splitLog): If an exception processing a split, catch it.", 
   "In finally, close and delete the split. Don't try retrying.", 
   "While in some circumstance, we might recover, its also", 
   "likely that we just get same exception again. If so, and", 
   "multiple files, we'll just accumulate edits until the", 
   "kingdom comes."
  ], 
  "revision_id": "643142"
 }, 
 {
  "author": "ate", 
  "date": "2008-03-31T20:42:02.823302Z", 
  "msg": [
   "Many changes how to instatiate a Jetspeed Spring container: everything is now handled by the SpringComponentManager.", 
   "This new SpringComponentManager replaces all standalone Spring application context instantiations (like for test cases and utilities/tools).", 
   "Among things, it now ensures:", 
   "- the new Spring assembly filtering is enabled (if provided with a filter that is)", 
   "- proper (re)starting and stopping of the container", 
   "- providing the context with boot level properties (like ${applicationRoot}) without needing to (mis)use global scoped System.setProperty(<property>) calls", 
   "(well, that's now delegated to the extended and filtering Spring ApplicationContext implementations)", 
   "Note: this commit will break many testcases, all of which I already have fixed/updated locally and will commit (together with several other improvements) shortly."
  ], 
  "revision_id": "643141"
 }
]