[
 {
  "author": "rdonkin", 
  "date": "2008-03-31T20:25:17.362805Z", 
  "msg": [
   "Replaced exceptions with messages"
  ], 
  "revision_id": "643130"
 }, 
 {
  "author": "ate", 
  "date": "2008-03-31T20:25:06.080135Z", 
  "msg": [
   "Reloading the Spring container with different DatabasePageManager settings for things like constraints/permissions and alike didn't work as the DatabasePageManagerCache only would initialize once."
  ], 
  "revision_id": "643129"
 }, 
 {
  "author": "sebb", 
  "date": "2008-03-31T20:22:31.229181Z", 
  "msg": [
   "Add some missing svn:eol-style properties"
  ], 
  "revision_id": "643128"
 }, 
 {
  "author": "akarasulu", 
  "date": "2008-03-31T20:21:30.993606Z", 
  "msg": [
   "DIRSERVER-1083: demonstration where having matchingRules make it so you can search on the attribute"
  ], 
  "revision_id": "643127"
 }, 
 {
  "author": "ate", 
  "date": "2008-03-31T20:19:00.235637Z", 
  "msg": [
   "Adding a new base JetspeedTestCase to help with:", 
   "* Running testcases unforked, meaning their current working directory is most likely not their project directly in case of building multiple modules.", 
   "However maven (surefire) does provide the current project \"basedir\" as system property which can be used to offset project relative paths.", 
   "* Running setup/tearDown functionality on TestCase level (not Test level).", 
   "As JUnit TestSuite puts the found tests in a vector, ordering of tests is not garanteed the same as their definition order in the class itself.", 
   "The static createFixturedTestCase method allows for adding additional first/last tests which will be executed in proper order.", 
   "Note: putting this class in jetspeed-cm isn't the best of places in my view, but will do for now.", 
   "I'm planning to create a separate jetspeed-test-utils module for providing tests only features and move all other \"generic\" test support classes there too.", 
   "These test support features shouldn't pollute our production runtime environment."
  ], 
  "revision_id": "643126"
 }
]