[
 {
  "author": "mcooper", 
  "date": "2008-04-02T20:31:06.149441Z", 
  "msg": [
   "TRINIDAD-822", 
   "Thank you Andy Schwartz for your patch.", 
   "Add additional accessibility features to skinning.", 
   "- The AccessibilityProfile API provides access to accessibility preferences at runtime.", 
   "- getAccessibilityProfile() methods have been added to RenderingContext, RequestContext.", 
   "- trinidad-config.xml now supports an <accessibility-profile> configuration element. This is a whitespace-separated list of accessibility profile options. Currently the two available options are \"high-contrast\" and \"large-fonts\". Typically this will just be an EL binding (like accessibility-mode).", 
   "- Skins now support @accessibility-profile rule, which allows \"high-contrast\" and \"large-fonts\" as values.", 
   "Note that the AccessibilityProfile API currently exposes two properties:", 
   "1. Color contrast: This property indicates whether the user prefers high contrast vs. default contrast content.", 
   "2. Font size: This property indicates whether the user prefers \"large\" fonts vs. the default fonts.", 
   "Each of these properties are defined as enumerations, allowing for future expansion.", 
   "Also added an \"accdemo\" skin, and an accessibilityPofileDemo.jspx page for testing/demonstrating this new functionality."
  ], 
  "revision_id": "644040"
 }, 
 {
  "author": "scheu", 
  "date": "2008-04-02T20:30:08.997892Z", 
  "msg": [
   "AXIS2-3674", 
   "Contributor:Rich Scheuerle", 
   "Use @XmlSeeAlso information the JAXWS artifacts to gather additional package information", 
   "for constructing the JAXBContext.  This will allow users to more easily add derived classes."
  ], 
  "revision_id": "644039"
 }, 
 {
  "author": "frankbille", 
  "date": "2008-04-02T20:27:40.830802Z", 
  "msg": [
   "Changed version in pom files and adding changes to the changelog for release 1.3.3"
  ], 
  "revision_id": "644038"
 }, 
 {
  "author": "ccustine", 
  "date": "2008-04-02T20:26:41.813447Z", 
  "msg": [
   "SM-1171 BeanEndpoint can receive messages before it has fully started, causing exceptions"
  ], 
  "revision_id": "644037"
 }, 
 {
  "author": "bommel", 
  "date": "2008-04-02T20:25:47.845611Z", 
  "msg": [
   "readded files disable tests"
  ], 
  "revision_id": "644036"
 }
]