[
 {
  "author": "brett", 
  "date": "2008-04-03T15:19:17.615936Z", 
  "msg": [
   "starting release notes for 1.1"
  ], 
  "revision_id": "644355"
 }, 
 {
  "author": "jdcasey", 
  "date": "2008-04-03T15:18:18.602021Z", 
  "msg": [
   "Fixing MNG-3355 and MNG-2339.", 
   "This commit introduces three changes: user-level properties that are separated from the execution properties, where execution properties contain envars, sysprops, and user-level properties...user-level properties are useful for POM interpolation for 2339 and 3355.", 
   "Second, a ProjectBuilderConfiguration interface and default implementation, to stem the proliferation of method parameters to projectBuilder methods. This was a natural place to introduce it, as user-level properties had to be passed in separately from the execution properties, for interpolation.", 
   "Finally, interpolation has been switched to use the new plexus-interpolation project, which is based on the classes in plexus-utils."
  ], 
  "revision_id": "644354"
 }, 
 {
  "author": "ate", 
  "date": "2008-04-03T15:14:24.348912Z", 
  "msg": [
   "layout-portlets have been assimilated"
  ], 
  "revision_id": "644353"
 }, 
 {
  "author": "jdcasey", 
  "date": "2008-04-03T15:13:24.110235Z", 
  "msg": [
   "Adding plexus-interpolation to the POM and build.xml/.properties, to prepare for the fix to MNG-3355 and MNG-2339(a)...also adding a new embedder-driven integration-test project to eventually hold the error-reporting tests currently in the maven-embedder tests."
  ], 
  "revision_id": "644352"
 }, 
 {
  "author": "ruwan", 
  "date": "2008-04-03T15:11:59.759909Z", 
  "msg": [
   "HTTP status code was not propogated to the client from the server, when the server responds with text/html Internal Server Error (500) for instance. Fixing the above issue and using the ApplicationXMLFormatter and Builder pair Synapse can pass the 500 Internal Server Errors and 404 not found errors in HTML to the client side with this fix."
  ], 
  "revision_id": "644351"
 }
]