[
 {
  "author": "chrisd", 
  "date": "2008-04-03T21:51:07.155350Z", 
  "msg": [
   "Avoid calling access control hooks for internal requests with", 
   "configurations which match those of the initial request.  Revert to", 
   "the original behaviour (call access control hooks for internal requests", 
   "with URIs different from the initial request) if any access control hooks", 
   "or providers are not registered as permitting this optimization.", 
   "Introduce wrappers for access control hook and provider registration", 
   "which can accept additional mode and flag data.", 
   "The configuration walk optimizations were originally proposed a while", 
   "ago (see http://marc.info/?l=apache-httpd-dev&m=116536713506234&w=2);", 
   "they have been used since then in production systems and appear to be", 
   "stable and effective.  They permit certain combinations of modules", 
   "and clients to function efficiently, especially when a deeply recursive", 
   "series of internal requests, such as those generated by certain WebDAV", 
   "requests, are all subject to the identical authentication and authorization", 
   "directives.", 
   "The major change from the original proposal is a cleaner mechanism for", 
   "detecting modules which may expect the old behaviour.  This has been", 
   "tested successfully with Subversion's mod_authz_svn, which specifically", 
   "requires the old behaviour when performing path-based authorization based", 
   "against its own private access control configuration files."
  ], 
  "revision_id": "644525"
 }, 
 {
  "author": "jm", 
  "date": "2008-04-03T21:49:07.016376Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "644524"
 }, 
 {
  "author": "jacopoc", 
  "date": "2008-04-03T21:45:47.417367Z", 
  "msg": [
   "Enhanced the MRP algorithm to generate requirements also for products with qoh less than minimum stock that don't have any event associated to them."
  ], 
  "revision_id": "644523"
 }, 
 {
  "author": "maartenc", 
  "date": "2008-04-03T21:42:27.546850Z", 
  "msg": [
   "IMPROVEMENT: Load Ivy version number into some Ant property (IVY-790)"
  ], 
  "revision_id": "644522"
 }, 
 {
  "author": "dblevins", 
  "date": "2008-04-03T21:37:00.524100Z", 
  "msg": [
   "Ported thread pooling and host-based authorization code"
  ], 
  "revision_id": "644521"
 }
]