[
 {
  "author": "oysteing", 
  "date": "2008-04-04T16:19:19.619898Z", 
  "msg": [
   "DERBY-3354:  Select from large lob table with embedded gives OutOfMemoryError", 
   "Contributed by Anurag.", 
   "This patch introduces a new WeakHashMap in EmbedConnection. EmbedBlob and EmbedClob objects references are stored in this", 
   "map (objects as key and null as value). Adding entry to locater map is", 
   "differed till the first call of getLocater.", 
   "This ensures that there is entry of LOB objects in locater map if they are invoked in embedded mode.", 
   "As the keys of WeakHashMap doesn't prevents the objects from being", 
   "garbage collected, once the lob objects are unreferenced lob objects will", 
   "be garbage collected releasing the memory.", 
   "During commit/rollback or Connection.close, free is invoked on all the lob", 
   "objects from WeakHashMap and the map is cleared.", 
   "Modified files", 
   "java/engine/org/apache/derby/impl/jdbc/EmbedConnection.java", 
   "Added a new attribute lobRefrences of type WeakHashMap.", 
   "Added a new method addLOBReference to make an entry in new", 
   "hash map.", 
   "Modified clearLOBMapping to use lobRefrences to fetch and invoke free on lob objects instead of lobHashMap.", 
   "java/engine/org/apache/derby/impl/jdbc/EmbedBlob.java", 
   "java/engine/org/apache/derby/impl/jdbc/EmbedClob.java", 
   "Modified constructs to call connection.lobRefrences instead of conn.addLOBMapping.", 
   "Modified getLocater method to check if the locater value is non zero", 
   "before returning and if its zero calling conn.addLOBMapping to make", 
   "entry of lob objects and getting locater value.", 
   "Calling removeLOBMapping in free method.", 
   "Cleanup of temporary file is already being taken care by the finalizer of", 
   "LOBStreamControl so I haven't added any new cleanup code for", 
   "finalizer."
  ], 
  "revision_id": "644755"
 }, 
 {
  "author": "jstrachan", 
  "date": "2008-04-04T16:17:00.326726Z", 
  "msg": [
   "applied patch https://issues.apache.org/activemq/browse/CAMEL-419 with huge thanks - this is awesome! :)"
  ], 
  "revision_id": "644754"
 }, 
 {
  "author": "eae", 
  "date": "2008-04-04T16:16:56.337072Z", 
  "msg": [
   "UIMA-896 Update comments on how to fix problems with doublebyte http test."
  ], 
  "revision_id": "644753"
 }, 
 {
  "author": "mmartinec", 
  "date": "2008-04-04T16:13:28.183188Z", 
  "msg": [
   "VBounce: ensure a known-false return value; match \"Received:\" only at the beginning of a line, case-insensitively and do not require a space after a colon"
  ], 
  "revision_id": "644752"
 }, 
 {
  "author": "minfrin", 
  "date": "2008-04-04T16:11:31.337620Z", 
  "msg": [
   "mod_session_crypto: Add a session encoding implementation capable", 
   "of encrypting and decrypting sessions wherever they may be stored.", 
   "Introduces a level of privacy when sessions are stored on the", 
   "browser."
  ], 
  "revision_id": "644751"
 }
]