[
 {
  "author": "davsclaus", 
  "date": "2008-04-05T11:28:30.450506Z", 
  "msg": [
   "Added default values to javadoc - people should know that it tries 6 times with 1 second apart."
  ], 
  "revision_id": "645080"
 }, 
 {
  "author": "hboutemy", 
  "date": "2008-04-05T11:24:10.132488Z", 
  "msg": [
   "fixed tests when there are spaces in directory name"
  ], 
  "revision_id": "645079"
 }, 
 {
  "author": "hboutemy", 
  "date": "2008-04-05T11:16:31.313981Z", 
  "msg": [
   "fixed tests when there are spaces in directory name"
  ], 
  "revision_id": "645078"
 }, 
 {
  "author": "gdamour", 
  "date": "2008-04-05T11:13:30.278382Z", 
  "msg": [
   "*** Definition of annotations streamlining the definition of GBeanInfos.", 
   "* @GBean: optional annotation defining the name and j2eeType of a GBean.", 
   "If this annotation is not specified, then the default name is assumed to be", 
   "the class (simple) name and the default j2eeType is GBean.", 
   "* @Priority: optionalannotation defining the priority of a GBean.", 
   "* @ParamSpecial: annotation defining a GBean special attribute to be", 
   "injected.", 
   "* @ParamAttribute: annotation defining the GBean attribute to be injected.", 
   "* @ParamReference: annotation defining the GBean reference to be injected.", 
   "* @Persistent: annotation for setter methods turning the corresponding GBean", 
   "attributes into persistent attributes.", 
   "* @Reference: annotation for setter methods turning the corresponding GBean", 
   "attribute into a GBean reference.", 
   "Note that at most one constructor must be annotated with @ParamSpecial,", 
   "@ParamAttribute or @ParamReference.", 
   "*** Add a GBeanInfo factory strategy, GBeanInfoFactory, which allows us to", 
   "plug-in an annotation based GBeanInfo factory implementation.", 
   "*** Use annotation based GBeanInfo declaration for clustering related GBeans.", 
   "*** Use xbean-reflect to build GBean instances.", 
   "This fixes GERONIMO-3952 - Definition of GBeanInfo via annotations"
  ], 
  "revision_id": "645077"
 }, 
 {
  "author": "hboutemy", 
  "date": "2008-04-05T11:09:56.406872Z", 
  "msg": [
   "fixed tests when there are spaces in directory name"
  ], 
  "revision_id": "645076"
 }
]