[
 {
  "author": "trawick", 
  "date": "2003-06-07T12:04:43.000000Z", 
  "msg": [
   "When using a temporary file for flock- and fcntl-based mutexes,", 
   "don't let the file be deleted on close.  For flock-based mutexes,", 
   "this corrects a fatal problem, since the file would disappear", 
   "when a program was spawned and cleanup-for-exec was performed,", 
   "and a subsequent attempt to perform child process mutex", 
   "initialization would fail.  For fcntl-based mutexes, this was a", 
   "very minor issue that resulted in a failing unlink() when the", 
   "file was closed, since fcntl lock initialization always removes", 
   "the file immediately."
  ], 
  "revision_id": "64529"
 }, 
 {
  "author": "trawick", 
  "date": "2003-06-05T02:29:12.000000Z", 
  "msg": [
   "When writing to pipes with a timeout set, handle the situation", 
   "where the kernel says the pipe is writable but an attempt to", 
   "write <= PIPE_BUF bytes gets EAGAIN.  APR will now write whatever", 
   "data will fit.  APR applications that relied on the atomic nature", 
   "of relatively small pipe write requests may be affected.", 
   "PR:         20295", 
   "First patch and lots of testing from: Mark Street <mark@faime.demon.co.uk>"
  ], 
  "revision_id": "64528"
 }, 
 {
  "author": "trawick", 
  "date": "2003-06-05T02:14:08.000000Z", 
  "msg": [
   "add a testcase to catch the problem seen with PR 20295, where", 
   "apr_file_write_full() to pipe with timeout can return EAGAIN", 
   "PR:             20295 (not fixed just yet)"
  ], 
  "revision_id": "64527"
 }, 
 {
  "author": "trawick", 
  "date": "2003-06-02T15:52:28.000000Z", 
  "msg": [
   "Define _THREAD_SAFE for all compilations on AIX.  Previously", 
   "those of us who used the vendor compiler had it defined", 
   "implicitly and others did not.  The difference became obvious", 
   "with the recent thread safety fixes to apr_password_validate().", 
   "PR:    20420"
  ], 
  "revision_id": "64526"
 }, 
 {
  "author": "striker", 
  "date": "2003-06-02T12:50:52.000000Z", 
  "msg": [
   "Add a check to see if the sourcedir actually exists.  If it doesn't,", 
   "which is likely when installed by a package, don't try and expand", 
   "the path using realpath."
  ], 
  "revision_id": "64525"
 }
]