[
 {
  "author": "jdonnerstag", 
  "date": "2008-04-12T14:31:25.009076Z", 
  "msg": [
   "generics"
  ], 
  "revision_id": "647455"
 }, 
 {
  "author": "reinhard", 
  "date": "2008-04-12T14:23:27.951092Z", 
  "msg": [
   ". add a servlet context listener that installs the blocks - this makes sure that blocks are installed before Spring is initialized", 
   ". remove the old Spring based implementations (for now the support of Spring properties that point to the installation directory", 
   "of a block are not supported)"
  ], 
  "revision_id": "647454"
 }, 
 {
  "author": "reinhard", 
  "date": "2008-04-12T14:17:41.182406Z", 
  "msg": [
   ". revert the previous JNet integration", 
   ". install URLStreamHandlerFactories by using Spring AOP (intercept all servlet calls):", 
   "The URLHandlerFactoryCollector installs all protocols that are provided by SpringBeans", 
   "that are of the type \"URLStreamHandlerFactory\"", 
   ". very basic implementations of a blockcontext and a servlet protocol", 
   ". set a compile time dependency on the Spring configurator (for now the BlockDeployment stuff is there)", 
   ". this commit will break our samples: Since I others also want to look at this code, I don't want to", 
   "hold back this stuff anylonger. In order to make our samples work again, I will set the version", 
   "of the SSF and the Spring configurator to the recently released ones."
  ], 
  "revision_id": "647453"
 }, 
 {
  "author": "jleroux", 
  "date": "2008-04-12T13:59:06.489382Z", 
  "msg": [
   "A first step for \"POS: CVV2 code is not always deleted from the DB\" (https://issues.apache.org/jira/browse/OFBIZ-1716) - OFBIZ-1716", 
   "I think the same should be done for PAYMENT_DECLINED but I have more than a doubt, please have a look at https://issues.apache.org/jira/browse/OFBIZ-1716?focusedCommentId=12588237#action_12588237 *this could be a serious issue*", 
   "Thanks"
  ], 
  "revision_id": "647452"
 }, 
 {
  "author": "jleroux", 
  "date": "2008-04-12T13:53:49.933178Z", 
  "msg": [
   "A bunch of changes around \"New attributes to ofbiz-component.xml\" (https://issues.apache.org/jira/browse/OFBIZ-1714) - OFBIZ-1714", 
   "Better description of cryptic applications tabs (HR and SFA for now) using new tooltip/description attribute", 
   "CommonAccounting was useless : removed"
  ], 
  "revision_id": "647451"
 }
]