[
 {
  "author": "doll", 
  "date": "2008-04-18T12:29:54.816558Z", 
  "msg": [
   "Added a new CommonGuiceModule. This contains all the guice bindings that will be the same for the social and gadgets servers. This enables the servers to run by themseleves and to run together (because in guice you can't bind something more than once)", 
   "Note: This class belongs in the java/common package. However, I can not put it there right now because it depends on gadgets packages. This can not be fixed until all of the social gadgets dependencies are refactored. It will be fixed in the future though."
  ], 
  "revision_id": "649495"
 }, 
 {
  "author": "aadamchik", 
  "date": "2008-04-18T12:28:36.515188Z", 
  "msg": [
   "proper ignores"
  ], 
  "revision_id": "649494"
 }, 
 {
  "author": "thomasm", 
  "date": "2008-04-18T12:27:48.420497Z", 
  "msg": [
   "JCR-1388 Allow concurrent reads from the database data store"
  ], 
  "revision_id": "649493"
 }, 
 {
  "author": "ate", 
  "date": "2008-04-18T12:27:21.699206Z", 
  "msg": [
   "- merging and simplifying configurations for both XML and Database PageManager in the main assembly, filterable through new categories xmlPageManager and dbPageManager.", 
   "the alternate assembly files db-pagemanager.xml and interceptors.xml are now no longer needed", 
   "- also adding configuration for the new PageSerializer (previously called PageImporter).", 
   "- externalizing the (XML) PSML pages root folder to a new (overridable) jetspeed.properties definition:", 
   "psml.pages.path = ${applicationRoot}/WEB-INF/pages", 
   "- externalizing PageManager security configuration also to jetspeed.properties:", 
   "page.manager.permissions.security = false", 
   "page.manager.constraints.security = true", 
   "- adding new possible spring.filter.key: \"portal.dbPageManager\" which can be used to switch to use the DatabasePageManager instead of the CastorXMLPageManager", 
   "- updating and adjusting test case configurations to handle that the previously default pagemanager now needs to be filtered using xmlPageManager", 
   "Note: soon I'll reconfigure the test cases to make use of the spring-filter.properties file itself instead of defining the filter categories inline."
  ], 
  "revision_id": "649492"
 }, 
 {
  "author": "jcompagner", 
  "date": "2008-04-18T12:22:04.947989Z", 
  "msg": [
   "WICKET-1551"
  ], 
  "revision_id": "649491"
 }
]