[
 {
  "author": "", 
  "date": "2008-04-18T12:10:04.137408Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "649480"
 }, 
 {
  "author": "kpvdr", 
  "date": "2008-04-18T12:09:42.568608Z", 
  "msg": [
   "Fix to prevent possible Timer deadlocks by holding onto mutex while calling fire()"
  ], 
  "revision_id": "649479"
 }, 
 {
  "author": "lektran", 
  "date": "2008-04-18T12:09:09.433065Z", 
  "msg": [
   "Moved a couple of misplaced semaphore attributes"
  ], 
  "revision_id": "649478"
 }, 
 {
  "author": "jeremias", 
  "date": "2008-04-18T12:03:24.434645Z", 
  "msg": [
   "Bugfix: If the first event is not issued over an event producer, the fallback logging event listener was not installed."
  ], 
  "revision_id": "649477"
 }, 
 {
  "author": "ate", 
  "date": "2008-04-18T12:01:12.594335Z", 
  "msg": [
   "Many fixes and enhancements for how Jetspeed loads its properties configuration:", 
   "- allow defining jetspeed.properties outside applicationRoot", 
   "- derive new global property ${jetspeedPropertiesPath} from the jetspeed.properties file location (still defaults to /WEB-INF/conf)", 
   "- load all other configuration properties from this ${jetspeedPropertiesPath}", 
   "NB: moving jetspeed.properties thus requires moving the other properties as well to that same location!", 
   "- adjust assembly references to these property files using the new ${jetspeedPropertiesPath}", 
   "- fix proper \"override\" behavior by individually loading the property files and copy the key/values to the master (Commons) Configuration", 
   "instead of having Commons Configuration load and thereby incorrectly *append* multiple values for the same key (dropping the include=override.properties definition and usage in jetspeed.properties)", 
   "- allow overriding the spring.filter.key property through a separate properties file, spring-filter-key.properties:", 
   "- *only* property spring.filter.key will be loaded from this file (if it exists)", 
   "- this makes it easy for simple switching to another assembly configuration by just replacing/overwriting that properties file", 
   "- define proper constants for all these in JetspeedEngineConstants", 
   "- splitting off a new assembly configuration file, jetspeed-properties.xml containing only the PortalConfiguration and Spring PropertyPlaceHolderConfigurer", 
   "so these can more easily used by test cases"
  ], 
  "revision_id": "649476"
 }
]