[
 {
  "author": "jfclere", 
  "date": "2008-04-18T10:06:18.711138Z", 
  "msg": [
   "typo."
  ], 
  "revision_id": "649445"
 }, 
 {
  "author": "acumiskey", 
  "date": "2008-04-18T10:06:07.704017Z", 
  "msg": [
   "Merged revisions 649279,649283,649285,649393,649396,649420 via svnmerge from", 
   "https://svn.apache.org/repos/asf/xmlgraphics/fop/trunk", 
   "........", 
   "r649279 | jeremias | 2008-04-17 22:23:15 +0100 (Thu, 17 Apr 2008) | 1 line", 
   "clone() did not propagate the page's page index.", 
   "........", 
   "r649283 | jeremias | 2008-04-17 22:25:02 +0100 (Thu, 17 Apr 2008) | 1 line", 
   "Throw a useful exception when the user agent isn't set on the renderer. This has been a problem for more than one person setting up their own renderer using FOUserAgent.setRendererOverride().", 
   "........", 
   "r649285 | jeremias | 2008-04-17 22:27:46 +0100 (Thu, 17 Apr 2008) | 2 lines", 
   "Split PrintRenderer into PageableRenderer and PrintRenderer (extends PageableRenderer). This allows the use of FOP with JPS. A new example illustrates how this is done.", 
   "Removed the code that sets start/end/copies from system properties (now done through renderer options).", 
   "........", 
   "r649393 | jeremias | 2008-04-18 08:40:27 +0100 (Fri, 18 Apr 2008) | 1 line", 
   "Forgot to include in commit for revision 649285.", 
   "........", 
   "r649396 | jeremias | 2008-04-18 08:44:32 +0100 (Fri, 18 Apr 2008) | 1 line", 
   "Introduced PageProductionException and fixed exception throwing for the event related to this exception. It's a RuntimeException descendant as making it a checked exception would have made changes necessary to at least a dozen more classes. Our overall exception style is still not so good.", 
   "........", 
   "r649420 | jeremias | 2008-04-18 10:16:28 +0100 (Fri, 18 Apr 2008) | 1 line", 
   "Fixed build problem. FOPException is no longer thrown there.", 
   "........"
  ], 
  "revision_id": "649444"
 }, 
 {
  "author": "mkleint", 
  "date": "2008-04-18T10:05:32.891482Z", 
  "msg": [
   "MNG-468 add toolchains support to the javadoc plugin. It recoginizes the \"jdk\" toolchain now."
  ], 
  "revision_id": "649443"
 }, 
 {
  "author": "mkleint", 
  "date": "2008-04-18T10:02:08.916729Z", 
  "msg": [
   "MNG-468 add toolchains support to the compiler plugin. It recoginizes the \"jdk\" toolchain now. bumped the required version of maven to 2.0.6. Will only actually work in conjunction with maven-toolchains-plugin in 2.0.9+, but the plugin still works without toolchains in older versions (2.0.6+)", 
   "needed to excluded the plexus api jar, as it was causing class loading exceptions.."
  ], 
  "revision_id": "649442"
 }, 
 {
  "author": "mkleint", 
  "date": "2008-04-18T10:00:12.066577Z", 
  "msg": [
   "MNG-468 add toolchains support to the surefire plugin. It recoginizes the \"jdk\" toolchain now. bumped the required version of maven to 2.0.6. Will only actually work in conjunction with maven-toolchains-plugin in 2.0.9+, but the plugin still works without toolchains in older versions (2.0.6+)"
  ], 
  "revision_id": "649441"
 }
]