[
 {
  "author": "jsdelfino", 
  "date": "2008-04-23T02:31:18.047593Z", 
  "msg": [
   "Adding a sample to show how to use the Tuscany models to implement some domain management tasks. This is just the first three tasks, am working on more tasks to illustrate the various aspects of working with the models, validating, wiring etc."
  ], 
  "revision_id": "650730"
 }, 
 {
  "author": "damien", 
  "date": "2008-04-23T02:23:02.919986Z", 
  "msg": [
   "Fix for replication being reset when replication a local and a remote database."
  ], 
  "revision_id": "650729"
 }, 
 {
  "author": "bpendleton", 
  "date": "2008-04-23T02:20:43.316800Z", 
  "msg": [
   "DERBY-3613: SELECT DISTINCT with GROUP BY produces wrong results", 
   "Certain combinations of DISTINCT and GROUP BY in the same query were", 
   "producing incorrect results. Duplicate rows were appearing in the", 
   "results because the query was including all of the GROUP BY columns", 
   "in the evaluation of the DISTINCT clause, not just the columns that", 
   "were explicitly specified to be DISTINCT.", 
   "For example, in the query:", 
   "select distinct a, b from t group by a, b, c", 
   "Derby was including two separate rows in the result which had the same", 
   "value for columns a and b, but had different values for column c.", 
   "Internally, GroupByList.bindGroupByColumns() was generating the", 
   "extra column(s) from the group by list into the select's result", 
   "column list, but this processing should not be performed when the", 
   "query specifies distinct, because adding extra columns to the", 
   "set of distinct columns changes the results."
  ], 
  "revision_id": "650728"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2008-04-23T02:17:55.158883Z", 
  "msg": [
   "Shortened the name of the extension point for utility objects."
  ], 
  "revision_id": "650727"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2008-04-23T02:04:10.236509Z", 
  "msg": [
   "Added constructors to the default artifact processor extension points to make it easier to construct them."
  ], 
  "revision_id": "650726"
 }
]