[
 {
  "author": "luc", 
  "date": "2008-05-01T17:43:27.782046Z", 
  "msg": [
   "fixed an empty catch block found by PMD"
  ], 
  "revision_id": "652590"
 }, 
 {
  "author": "markt", 
  "date": "2008-05-01T17:41:59.473449Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=43656", 
   "Add a test case for additional, related bugs and fix those bugs.", 
   "Patch by Nils Eckert and test case provided by Konstantin Kolinko."
  ], 
  "revision_id": "652589"
 }, 
 {
  "author": "sebor", 
  "date": "2008-05-01T17:40:52.120718Z", 
  "msg": [
   "2008-05-01  Martin Sebor  <sebor@roguewave.com>", 
   "* download.html (Downloading stdcxx Releases): Added 4.2.1", 
   "and a placeholder dor 4.3.0."
  ], 
  "revision_id": "652588"
 }, 
 {
  "author": "jimk", 
  "date": "2008-05-01T17:37:24.829755Z", 
  "msg": [
   "HBASE-607 MultiRegionTable.makeMultiRegionTable is not deterministic enough for regression tests", 
   "M MultiRegionTable", 
   "Make deterministic by creating the regions directly and not rely on", 
   "the asychronous nature of cache flushes, compactions and splits. The", 
   "regions are small, but the point of this class is to generate a", 
   "table with multiple regions so we can test map / reduce, region", 
   "onlining / offlining, etc.", 
   "Removed PUNCTUATION from row keys. Not sure why it was there in the", 
   "first place, other than perhaps to verify that a row key can have", 
   "punctuation in it provided it is not the first character. This will", 
   "become moot when row keys change from Text to byte[] anyways.", 
   "Incorporate repeated code", 
   "{code}", 
   "region.close();", 
   "region.getLog().closeAndDelete();", 
   "{code}", 
   "into private method closeRegionAndDeleteLog", 
   "M TestSplit", 
   "extends HBaseClusterTestCase instead of MultiRegionTable. It didn't", 
   "use the output of MultiRegionTable, so all that work was just wasted", 
   "by this test.", 
   "M TestTableIndex, TestTableMapReduce", 
   "The only two tests that currently use MultiRegionTable. Minor", 
   "modifications needed because MultiRegionTable now handles starting", 
   "and stopping of the mini-DFS cluster. With the new MultiRegionTable", 
   "class, if these tests fail now it will be because something they are", 
   "testing has regressed and not because MultiRegionTable failed."
  ], 
  "revision_id": "652587"
 }, 
 {
  "author": "markt", 
  "date": "2008-05-01T17:30:53.107549Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=43683", 
   "Prevent 404 during reloading.", 
   "If servlet is no longer present after re-load, a 404 is returned which will be consistent with subsequent requests."
  ], 
  "revision_id": "652586"
 }
]