[
 {
  "author": "damrhei", 
  "date": "2008-05-21T13:21:18.274766Z", 
  "msg": [
   "Allow WsdlGenerator to set the WSDL file name for the root WSDL definition."
  ], 
  "revision_id": "658675"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2008-05-21T13:15:09.878869Z", 
  "msg": [
   "o Removed unused BinaryAttributeDialog class.", 
   "o Added a new dialog for editing SASL Realms: SaslRealmDialog", 
   "o Added listeners to the Authentication Page.", 
   "o Modified the Authentication Page to save the values to the configuration"
  ], 
  "revision_id": "658674"
 }, 
 {
  "author": "gmcdonald", 
  "date": "2008-05-21T13:10:02.955567Z", 
  "msg": [
   "Update pod docs to reflect naming convention, point to dispatcher plugins docs cfor more info"
  ], 
  "revision_id": "658673"
 }, 
 {
  "author": "mor", 
  "date": "2008-05-21T13:03:49.592276Z", 
  "msg": [
   "Patch applied for testing purchase order reciepts process from Jira Issue OFBIZ-1782(https://issues.apache.org/jira/browse/OFBIZ-1782), with a modification in condition under <iterate> section, comments. Thanks Sumit Pandit for your patch."
  ], 
  "revision_id": "658672"
 }, 
 {
  "author": "luc", 
  "date": "2008-05-21T12:58:15.313537Z", 
  "msg": [
   "Configured checkstyle to stop complaining about incomplete Javadoc in some very specific cases.", 
   "This problem has been discussed previously here:", 
   "http://markmail.org/message/pmbiyiqssjesq7tm", 
   "The solution implemented with this modification is to configure checkstyle", 
   "in such a way the errors can be filtered out using dedicated comments in the", 
   "source code:", 
   "// CHECKSTYLE: stop JavadocMethodCheck", 
   "// a bunch of functions known to trigger warnings", 
   "// that we explicitly REFUSE to fix", 
   "// CHECKSTYLE: resume JavadocMethodCheck", 
   "The checks are still performed normally in file parts not bracketed by", 
   "these comments. Hence the first few methods in o.a.c.m.stat.inference.TestUtils are", 
   "still checked for correct javadoc, and only for the last ones in the same files", 
   "are the checks relaxed."
  ], 
  "revision_id": "658671"
 }
]