[
 {
  "author": "jim", 
  "date": "2008-05-27T16:19:22.396901Z", 
  "msg": [
   "Merge r617822, r627097, r660207 from trunk:", 
   "* Do not retry a request in the case that we either failed to sent a part of the", 
   "request body or if the request is not idempotent.", 
   "PR: 44334", 
   "* As per niq's comment, better destinct the types of idempotence.", 
   "* Introduce a flag to decide whether we sent an body to the backend or not.", 
   "Submitted by: rpluem", 
   "Reviewed by: jim"
  ], 
  "revision_id": "660580"
 }, 
 {
  "author": "jim", 
  "date": "2008-05-27T16:15:40.582216Z", 
  "msg": [
   "promote"
  ], 
  "revision_id": "660579"
 }, 
 {
  "author": "jim", 
  "date": "2008-05-27T16:14:48.821387Z", 
  "msg": [
   "Cast votes..."
  ], 
  "revision_id": "660578"
 }, 
 {
  "author": "gates", 
  "date": "2008-05-27T16:11:41.263339Z", 
  "msg": [
   "PIG-143 Pi's FixSchemaChange patch, fixed usage of != where it should have been !(equalTo())."
  ], 
  "revision_id": "660577"
 }, 
 {
  "author": "jim", 
  "date": "2008-05-27T16:11:36.925629Z", 
  "msg": [
   "Mass 'ab' backports of:", 
   "==================", 
   "r390504,i r390511, r390519, r394765, r395228, r396300, r413861 | colm", 
   "Give users the ability to set the window size for apache bench runs. Useful", 
   "for benchmarking largefile downloads.", 
   "* Add siege-like behaviour to ApacheBench; output the results, as they have", 
   "accrued so far, when the user interrupts with ctrl-c. As the signal handler", 
   "is non-reentrant, we don't need volatiles, and the operations all look", 
   "signal-safe.", 
   "* Update the base version, since handling a signal differently is an external", 
   "API change of sorts.", 
   "* set the LastChangedRevision svn property, as ab.c has $Rev $ embedded, so", 
   "it really should be.", 
   "when compiling statistics, only interate accross requests which occured.", 
   "A keepalive response need not neccessarily have included any content-length", 
   "header, handle this case properly for 304 responses. PR39789", 
   "==================", 
   "r516175 | trawick", 
   "ab: Add -r option to continue after socket receive errors.", 
   "Submitted by: Filip Hanik <devlist hanik.com>", 
   "Reviewed by: trawick", 
   "==================", 
   "r541138 | sctemme", 
   "Explain that POST data should be sent as the correct MIME type.", 
   "Submitted by Vincent Bray noodlet at gmail dot com,", 
   "edited and reviewed by sctemme", 
   "==================", 
   "r655214 | fielding", 
   "Overhaul ab.c stats collection and reporting to avoid integer", 
   "truncation and time divisions within the test loop, retain", 
   "native time resolution until output, remove unused data,", 
   "avoid structure copies, consistently round milliseconds, and", 
   "generally avoid losing accuracy of calculation due to type casts.", 
   "Incidentally fixes output bug on gnuplot (seconds were being", 
   "output as microseconds).  It would make more sense to output", 
   "gnuplot stats as microseconds after the start of test, but", 
   "this change returns us to consistency with pre-apr versions of ab.", 
   "PR: 44878, 44931.", 
   "==================", 
   "r655637 | fielding", 
   "Don't stop sending a request if EAGAIN is returned, which will only", 
   "happen if both the write and subsequent wait are returning EAGAIN,", 
   "and count posted bytes correctly when the initial write of a request", 
   "is not complete.", 
   "PR 10038, 38861, 39679", 
   "Submitted by: Patrick McManus <mcmanus datapower.com> (in 2003)", 
   "Stefan Fleiter <stefan.fleiter web.de>  (in 2006)", 
   "and Davanum Srinivas (in 2006).  Committed patch", 
   "contains parts of all three, tweaked by Roy (2008).", 
   "==================", 
   "r655654 | fielding", 
   "Improve client performance by clearing connection pool instead", 
   "of destroying it.", 
   "PR 40054", 
   "Submitted by: Brad Roberts <braddr puremagic.com>"
  ], 
  "revision_id": "660576"
 }
]