[
 {
  "author": "mrisaliti", 
  "date": "2008-05-27T21:45:05.282707Z", 
  "msg": [
   "Converted EditProductQuickAdmin.bsh to groovy (Part of issue OFBIZ-1801)"
  ], 
  "revision_id": "660730"
 }, 
 {
  "author": "covener", 
  "date": "2008-05-27T21:44:26.262127Z", 
  "msg": [
   "backported to 2.2.x in r660728"
  ], 
  "revision_id": "660729"
 }, 
 {
  "author": "covener", 
  "date": "2008-05-27T21:43:39.056477Z", 
  "msg": [
   "Merge r659560, r660485 from trunk:", 
   "The response to the TRACE method is partially garbled on an EBCDIC platform.", 
   "Send the request line and trailing CRLF in ASCII.", 
   "Submitted by:           David Jones <oscaremma gmail.com>", 
   "Reviewed and tested by: gregames"
  ], 
  "revision_id": "660728"
 }, 
 {
  "author": "stack", 
  "date": "2008-05-27T21:42:14.521279Z", 
  "msg": [
   "HBASE-645 and HBASE-642 Splitting log in a hostile environment -- bad hdfs -- we drop write-ahead-log edits"
  ], 
  "revision_id": "660727"
 }, 
 {
  "author": "rpluem", 
  "date": "2008-05-27T21:40:48.039895Z", 
  "msg": [
   "*  mod_proxy_http.c", 
   "Ensure that the EOC bucket is inserted BEFORE an EOS bucket in bb as", 
   "some resource filters like mod_deflate pass everything up to the EOS", 
   "down the chain immediately and sent the remainder of the brigade later", 
   "(or even never). But in this case the ap_http_header_filter does not", 
   "get out of our way soon enough.", 
   "http_filters.c", 
   "Remove all data buckets that are in a brigade after an EOC bucket", 
   "was seen, as an EOC bucket tells us that no (further) resource", 
   "and protocol data should go out to the client. OTOH meta buckets", 
   "are still welcome as they might trigger needed actions down in", 
   "the chain (e.g. in network filters like SSL).", 
   "Remark 1: It is needed to dump ALL data buckets in the brigade", 
   "since an filter in between might have inserted data", 
   "buckets BEFORE the EOC bucket sent by the original", 
   "sender and we do NOT want this data to be sent.", 
   "Remark 2: Dumping all data buckets here does not necessarily mean", 
   "that no further data is send to the client as:", 
   "1. Network filters like SSL can still be triggered via", 
   "meta buckets to talk with the client e.g. for a", 
   "clean shutdown.", 
   "2. There could be still data that was buffered before", 
   "down in the chain that gets flushed by a FLUSH or an", 
   "EOS bucket.", 
   "PR: 37770"
  ], 
  "revision_id": "660726"
 }
]