[
 {
  "author": "mcslee", 
  "date": "2006-06-30T18:28:50.000000Z", 
  "msg": [
   "Thrift now works in PHP, hot stuff", 
   "Summary: End to end communication working in Thrift with PHP", 
   "Problem: It's a bit slower than pillar still. Need to find out why.", 
   "Reviewed By: aditya", 
   "Test Plan: Unit tests are in the test directory. Get lucas on the PHP case..."
  ], 
  "revision_id": "664720"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-06-26T23:56:08.000000Z", 
  "msg": [
   "Thrift: move /lib/cpp code into /lib/cpp/src", 
   "Summary: Clean separation of src and buildfiles etc. is key", 
   "Reviewed By: aditya"
  ], 
  "revision_id": "664719"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-06-26T23:52:22.000000Z", 
  "msg": [
   "Thrift: getting rid of U32s for map/list/set/string lengths and field ids etc.", 
   "Summary: U32s are on the out. Make way for the I32.", 
   "Reviewed By: aditya"
  ], 
  "revision_id": "664718"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-06-07T06:57:01.000000Z", 
  "msg": [
   "Adjust the Thrift compiler makefile to clean up after the obj/ folder that it builds into", 
   "Summary: I am super nitpicky, and after make clean I don't like seeing:", 
   "$ svn st", 
   "?   obj/", 
   "Problem: make clean didn't remove the generated obj/ dir", 
   "Solution: Kill it!", 
   "Reviewed By: aditya", 
   "Test Plan: Do make clean in compiler directory followed by svn st. You should see nothing!"
  ], 
  "revision_id": "664717"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-06-07T06:53:25.000000Z", 
  "msg": [
   "Thrift test code", 
   "Summary: Did I promise you this or what?! Interoperable test servers and clients in both C++ and Java that you can use to check that they all work, all perform well, and that they all actually talk to each other!", 
   "Problem: How we gon' test this Thrift bizniss?", 
   "Solution: Write some test scenarios in each language.", 
   "Reviewed By: aditya", 
   "Test Plan: This IS the test plan.", 
   "Notes: These tools are actually pretty easy to use, so long as you remember to type 'ant' in the java directory instead of 'make'."
  ], 
  "revision_id": "664716"
 }
]