[
 {
  "author": "mcslee", 
  "date": "2006-06-07T06:51:18.000000Z", 
  "msg": [
   "Java libraries for Thrift", 
   "Summary: The basic Thrift stack implemented in Java, still in need of a lot of work but fully functional.", 
   "Reviewed By: aditya", 
   "Test Plan: Unit tests are the NEXT checkin, I swear", 
   "Notes: Perf on the Java stuff actually isn't that bad, and it's far from optimized at the moment. Barely any tweaking has been done. Testing shows that a Java server with the C++ client has RPC performance within 2x of the pure C++ implementations. This is pretty sweet, since this cost will be eclipsed by the cost of whatever processing is being done on an actual server doing real work."
  ], 
  "revision_id": "664715"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-06-07T06:48:56.000000Z", 
  "msg": [
   "Update Thrift CPP libraries to work with new generated source, change underlying buffers to use uint8_t* instead of std::string", 
   "Summary: Major overhaul to the CPP libraries.", 
   "Reviewed By: aditya", 
   "Test Plan: Again, keep an eye out for the unit tests commit", 
   "Notes: Initial perf tests show that Thrift is not only more robust than Pillar, but its implementation is actually around 10-20% faster. We can do about 10 RPC function calls with small data payloads in under 2ms. THAT IS FAST. THAT IS THRIFTY."
  ], 
  "revision_id": "664714"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-06-07T06:46:24.000000Z", 
  "msg": [
   "Thrift compiler now compiles both native Java and C++ code", 
   "Summary: Compiles to both C++ and Java, plus a host of other cool options like command line control over which languages to output code in", 
   "Reviewed By: aditya", 
   "Test Plan: The unit test checkins are coming momentarily..."
  ], 
  "revision_id": "664713"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-05-30T09:24:40.000000Z", 
  "msg": [
   "Rev 2 of Thrift, the Pillar successor", 
   "Summary: End-to-end communications and serialization in C++ is working", 
   "Reviewed By: aditya", 
   "Test Plan: See the new top-level test/ folder. It vaguely resembles a unit test, though it could be more automated.", 
   "Revert Plan: Revertible", 
   "Notes: Still a LOT of optimization work to be done on the generated C++ code, which should be using dynamic memory in a number of places. Next major task is writing the PHP/Java/Python generators."
  ], 
  "revision_id": "664712"
 }, 
 {
  "author": "mcslee", 
  "date": "2006-05-24T21:45:31.000000Z", 
  "msg": [
   "Baseline commit for thrift, which is pillar v2", 
   "Reviewed By: aditya"
  ], 
  "revision_id": "664711"
 }
]