[
 {
  "author": "aditya", 
  "date": "2007-01-24T22:53:54.000000Z", 
  "msg": [
   "-- Change concept of protocol and transport factory", 
   "Summary:", 
   "- Transport factories now wrap around one transport", 
   "- Protocol factories now wrap around one transport (as opposed to a pair of input/output", 
   "transports)", 
   "- TServer now takes input/output transport and protocol factories", 
   "The motivation for this change is that you could concievably want to use a different protocol or", 
   "transport for input and output. An example is that incoming data is encoded using binary protocol", 
   "but outgoing data is encrypted XML (with encryption being done on the transport level).", 
   "This change should be mostly backwards compatible because the TServer classes have constructors", 
   "that take a transport factory and use that for both the input and transport factories. The only", 
   "change might be for anyone who is using the C++ client code directly i.e. instantiating", 
   "TBinaryProtocol() directly because the constructor now only accepts one transport.", 
   "Reviewed By: Slee", 
   "Test Plan: Everything compiles (for both thrift and search).", 
   "Notes:", 
   "I am going to make the same changes in all the supported languages after this..."
  ], 
  "revision_id": "664940"
 }, 
 {
  "author": "mcslee", 
  "date": "2007-01-24T22:53:07.000000Z", 
  "msg": [
   "Generate pargs an presult helpers in C++ to be more efficient in thrift", 
   "Summary: Copy construction is the pits. Avoid it at all costs.", 
   "Reviewed By: aditya"
  ], 
  "revision_id": "664939"
 }, 
 {
  "author": "mcslee", 
  "date": "2007-01-24T19:43:06.000000Z", 
  "msg": [
   "Fix C++ Thrift test code to work with new gen'd code interface", 
   "Reviewed By: tbr-aditya"
  ], 
  "revision_id": "664938"
 }, 
 {
  "author": "mcslee", 
  "date": "2007-01-24T19:41:57.000000Z", 
  "msg": [
   "Nonblockingserver constructor that uses binary protocol factory by default", 
   "Reviewed By: tbr-aditya"
  ], 
  "revision_id": "664937"
 }, 
 {
  "author": "aditya", 
  "date": "2007-01-24T02:24:35.000000Z", 
  "msg": [
   "-- thrift logfile fixes", 
   "Summary:", 
   "-- numChunks was broken and that was causing a lot of strange downstream behaviour", 
   "Reviewed By: tbr slee"
  ], 
  "revision_id": "664936"
 }
]