[
 {
  "author": "mcslee", 
  "date": "2007-06-22T19:43:12.000000Z", 
  "msg": [
   "Teensy insignificant thrift bug", 
   "Summary: Wasn't causing any issues because it's a noop with the binary protocol", 
   "Reviewed By: jwang", 
   "Test Plan: honky tonk, no diff in functionality"
  ], 
  "revision_id": "665140"
 }, 
 {
  "author": "mcslee", 
  "date": "2007-06-22T01:03:55.000000Z", 
  "msg": [
   "Idiotic typos in Python code", 
   "Summary: No clue how this slid in", 
   "Reviewed By: abosworth", 
   "Test Plan: I am stupid. TestClient.py"
  ], 
  "revision_id": "665139"
 }, 
 {
  "author": "mcslee", 
  "date": "2007-06-20T21:51:57.000000Z", 
  "msg": [
   "Thrift TBinaryProtocol change", 
   "Summary: New Thrift TBinaryProtocol with a version identifier", 
   "Reviewed By: aditya, eugene", 
   "Test Plan: Modify your services to have strictRead_ and strictWrite_ both set to FALSE. Then redeploy your services and test running clients against them. Once you have clients and servers running stably on this new code, you should redploy versions with strictWrite_ set to TRUE. Once that's all good, we can set strictRead_ to TRUE as well, and eventually deprecate the old protocol code entirely."
  ], 
  "revision_id": "665138"
 }, 
 {
  "author": "dweatherford", 
  "date": "2007-06-19T23:10:19.000000Z", 
  "msg": [
   "[thrift] Add optional callback inside of serve()", 
   "Summary: If enabled, the callback function will be run after the listening socket is opened and the event loop initialized, just prior to calling event_loop()", 
   "This is handy if you want to defer some of your initialization until after the socket is open -- allowing clients to connect, but not processing requests until the initialization is complete. I use this in the Synapse tablet server to minimize the communications interruption that happens during a tablet split (replaying commit logs after opening the listening socket).", 
   "Review: mcslee", 
   "Test Plan: compiled it into Synapse's tablet server", 
   "Revert: ok"
  ], 
  "revision_id": "665137"
 }, 
 {
  "author": "mcslee", 
  "date": "2007-06-15T01:45:56.000000Z", 
  "msg": [
   "Whitespace fixes on test code", 
   "Reviewed By: thrift", 
   "Test Plan: Whitespace"
  ], 
  "revision_id": "665136"
 }
]