[
 {
  "author": "dreiss", 
  "date": "2008-02-18T02:11:48.000000Z", 
  "msg": [
   "Implement testAsync for python tests"
  ], 
  "revision_id": "665485"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-18T02:11:44.000000Z", 
  "msg": [
   "Add testAsync to ThriftTest.thrift which verifies async void works properly.", 
   "Summary:", 
   "- testAsync takes a number of seconds to sleep. The test client makes sure", 
   "that the RPC returns in less than 0.2 seconds even though it asks the server", 
   "to sleep for 3 seconds.", 
   "- Implemented this test for C++ and Java.", 
   "Test Plan:", 
   "- ran cpp TestServer and TestClient and verified functionality", 
   "- tested cpp and java test server/client against each other - tests passed"
  ], 
  "revision_id": "665484"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-18T02:11:39.000000Z", 
  "msg": [
   "Change test scripts for Java to point to libthrift.jar in source tree.", 
   "Summary:", 
   "- They used to point at /usr/local/lib/libthrift.jar even though the build.xml pointed", 
   "at a relative path in the source tree"
  ], 
  "revision_id": "665483"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-18T01:49:37.000000Z", 
  "msg": [
   "Thrift: Add a full-featured JSON protocol for C++.", 
   "Summary:", 
   "This change adds a new and exciting protocol to Thrift.  It uses", 
   "RFC-compliant JSON as the wire protocol and is fully human readable.", 
   "(once a little whitespace has been inserted.)  Unlike the existing", 
   "JSON protocol for Java, which is intended to allow Thrift data to be", 
   "transferred to scripting languages, this protocol is lossless and fully", 
   "read-write.  It was written by Chad Walters of Powerset and reviewed", 
   "by David Reiss.", 
   "Tested by running make check."
  ], 
  "revision_id": "665482"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-15T01:38:18.000000Z", 
  "msg": [
   "Thrift: Distinguish between string and binary types in C++ and Java.", 
   "Summary:", 
   "The upcoming TJSONProtocol handles string and binary types quite differently.", 
   "This change makes that distinction in all parts of the C++ binding.", 
   "Java already distinguished between string and binary, but this change", 
   "also updates the Java skip method to skip over strings as binary", 
   "so we don't get encoding errors when skipping binary data.", 
   "Reviewed By: mcslee", 
   "Test Plan: make check", 
   "Revert Plan: ok", 
   "Other Notes:", 
   "I just pulled this out of Chad Walters' JSON patch.", 
   "The only other change was adding readBinary (or was it writeBinary)", 
   "to TDenseProtocol.  Maybe inheriting from TBinaryProtocol wasn't a good idea."
  ], 
  "revision_id": "665481"
 }
]