[
 {
  "author": "eletuchy", 
  "date": "2008-02-26T12:11:29.000000Z", 
  "msg": [
   "[thrift] don't do a reverse DNS lookup for every erlang thrift request", 
   "Reviewed By: cpiro", 
   "Test Plan: ran a server ... verified its debug messages no longer included", 
   "hostnames", 
   "Notes: methinks this binding is not long for this world", 
   "Revert Plan: sure ... if you don't like your dns server"
  ], 
  "revision_id": "665505"
 }, 
 {
  "author": "eletuchy", 
  "date": "2008-02-26T11:44:00.000000Z", 
  "msg": [
   "[thrift] better error handling and timeouts in tSocket code", 
   "Summary: default socket send timeout to 5seconds, not infinity.", 
   "close the socket in case of an error.", 
   "Reviewed By: cpiro", 
   "Test Plan: ran a client for slow services", 
   "and sanity checked other client code to make sure", 
   "Revert Plan: sure"
  ], 
  "revision_id": "665504"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-26T06:40:25.000000Z", 
  "msg": [
   "Tighten integration with Ruby exceptions by tying in Exception#message", 
   "For Thrift exceptions that contain only a single string field, integrate", 
   "these even more tightly with Ruby exceptions by aliasing Ruby's", 
   "Exception#message field with the Thrift field.", 
   "Ruby exception objects created by Thrift will now display properly in", 
   "Ruby backtraces, etc. without any special handling by client code."
  ], 
  "revision_id": "665503"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-26T06:40:22.000000Z", 
  "msg": [
   "Move Ruby fielded object creation from generated constructor to ThriftStruct", 
   "Rather than the generated code needing to handle simple fielded", 
   "creation of objects, the ThriftStruct module constructor is extended to", 
   "handle hash arguments. Statements such as", 
   "o = ThriftObject.new :field1 => value1, :field2 => value2, ...", 
   "are supported as before, and the string form,", 
   "o = ThriftObject.new \"field1\" => value1, \"field2\" => value2, ...", 
   "disabled by the previous patch now also works.", 
   "Placing this code in the module is also just a cleaner solution."
  ], 
  "revision_id": "665502"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-02-26T06:40:16.000000Z", 
  "msg": [
   "Ruby exception constructor bugfix", 
   "The Ruby exception constructor is modified to accept 0 arguments, which is", 
   "how Thrift library code creates exception objects. Without this fix, Thrift", 
   "Ruby clients that receive exception objects crash.", 
   "The call to super (resolving to ThriftStruct#initialize) is retained, but", 
   "is called with the default value (an empty hash) instead of passing the", 
   "message along."
  ], 
  "revision_id": "665501"
 }
]