[
 {
  "author": "dkulp", 
  "date": "2008-06-11T15:44:24.847370Z", 
  "msg": [
   "Merged revisions 666253 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r666253 | bharath | 2008-06-10 14:18:39 -0400 (Tue, 10 Jun 2008) | 1 line", 
   "Removed the fix made for CXF-1639. (Now we add Strings as keys to the WSDLDefinition Map). From the code it looks like we are never putting literal Strings as keys in maps on client or server side. So the leak could be because of something else. We need to profile again and see whether the issue is still there and if so why. Leaving the issue open till then.", 
   "........"
  ], 
  "revision_id": "666715"
 }, 
 {
  "author": "andreas", 
  "date": "2008-06-11T15:42:59.322889Z", 
  "msg": [
   "Removing obsolete configuration option for usecase policy file."
  ], 
  "revision_id": "666714"
 }, 
 {
  "author": "andreas", 
  "date": "2008-06-11T15:41:31.825409Z", 
  "msg": [
   "Unify handling of fallback URIs, use URIs containing publication IDs for usecase policy file resolving (fixes bug 44604)."
  ], 
  "revision_id": "666713"
 }, 
 {
  "author": "kmarsden", 
  "date": "2008-06-11T15:41:19.131825Z", 
  "msg": [
   "DERBY-3704   If an IOException is encountered during establishment of the connection, Network Server should print the root exception to the console instead of a generic message", 
   "DERBY-3701 java.lang.Exception: DRDA_UnableToAccept.S:Unable to accept connections and client hang if tracing is turned on but traceDirectory does not exist"
  ], 
  "revision_id": "666712"
 }, 
 {
  "author": "dkulp", 
  "date": "2008-06-11T15:40:51.320648Z", 
  "msg": [
   "Merged revisions 666250 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r666250 | bharath | 2008-06-10 14:13:44 -0400 (Tue, 10 Jun 2008) | 1 line", 
   "Removed the fix made for CXF-1639. From the code it looks like we are never putting literal Strings as keys in maps on client or server side. So the leak could be because of something else. We need to profile again and see whether the issue is still there and if so why. Leaving the issue open till then.", 
   "........"
  ], 
  "revision_id": "666711"
 }
]