[
 {
  "author": "doll", 
  "date": "2008-06-12T01:07:28.942673Z", 
  "msg": [
   "A new trial implementation of the json restful wire format. This new code lives solely in the dataservice package. It includes 3 handlers for people, data and activities which currently support gets, posts and deletes. Pagination, partial updates and so forth should all be working.", 
   "The next steps for this format are to", 
   "- write more tests. (Hopefully re-using some of the abdera end to end tests that we have)", 
   "- implement batching", 
   "- fix any other non-compliant things", 
   "If you use the samplecontainer with useRestful=true and path=/social/jsonrest you will see the new code in action. Both of the checked in sample gadgets work.", 
   "More patches and code coming tomorrow..."
  ], 
  "revision_id": "666940"
 }, 
 {
  "author": "dkulp", 
  "date": "2008-06-12T01:05:40.975674Z", 
  "msg": [
   "Merged revisions 666938 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r666938 | dkulp | 2008-06-11 20:55:29 -0400 (Wed, 11 Jun 2008) | 2 lines", 
   "Add some cleanup things so tests will pass.", 
   "........"
  ], 
  "revision_id": "666939"
 }, 
 {
  "author": "dkulp", 
  "date": "2008-06-12T00:55:29.228960Z", 
  "msg": [
   "Add some cleanup things so tests will pass."
  ], 
  "revision_id": "666938"
 }, 
 {
  "author": "doll", 
  "date": "2008-06-12T00:54:52.891612Z", 
  "msg": [
   "Improved the BeanJsonConverter so that it handles converting json to a Map. Includes test.", 
   "Note: There is a todo in the code for fetching the generic types from the Map class (which is why I didn't write this code the first time). Right now the converter assumes the Map is just String to String which definitely won't work in all cases. The simple workaround is to just make a pojo class with a Map inside so that the code can fetch the generics."
  ], 
  "revision_id": "666937"
 }, 
 {
  "author": "yonik", 
  "date": "2008-06-12T00:53:45.286219Z", 
  "msg": [
   "use cloned params passed to submit to avoid concurrent modification exception"
  ], 
  "revision_id": "666936"
 }
]