[
 {
  "author": "mcombellack", 
  "date": "2008-07-03T14:38:27.061401Z", 
  "msg": [
   "TUSCANY-2454 - Added more tests to check that references to Nested Composites can be Serialized and Deserialized"
  ], 
  "revision_id": "673690"
 }, 
 {
  "author": "clement", 
  "date": "2008-07-03T14:33:21.398046Z", 
  "msg": [
   "Fix the issue Felix-613", 
   "The extender pattern handler may not call the callback when a managed bundle is leaving. This issue is now solved, the handler always call the method regardless the instance state. Indeed, the instance must release all references on the leaving bundles."
  ], 
  "revision_id": "673689"
 }, 
 {
  "author": "aidan", 
  "date": "2008-07-03T14:33:10.953080Z", 
  "msg": [
   "QPID-962 Exception handling was... unpleasing... Fix up of patch from rhs", 
   "AMQConnection.java: Refactor listener and stack exceptions in a list. Add get lastException, which can now be any Exception. Don't set connected, let the delegate decide.", 
   "AMQConnectionDelegate_8_0.java, AMQConnectionDelete_0_10.java: set _connected to true if we suceed", 
   "AMQProtocolHandler.java: attainState can now throw any sort of Exception", 
   "AMQStateManager.java: attainState can now throw any Exception", 
   "ConnectionTest.java: check that exception cause is not null", 
   "AMQConnectionFailureException.java: Add ability to store a Collection of Exceptions in case there are multiple possible causes of the failure. Which there shouldn't be, but it can happen."
  ], 
  "revision_id": "673688"
 }, 
 {
  "author": "mcombellack", 
  "date": "2008-07-03T14:31:53.178639Z", 
  "msg": [
   "TUSCANY-2454 - Updated Deserialization code of CallableReferenceImpl and CallbackReferenceImpl to correctly handle references to nested Composites"
  ], 
  "revision_id": "673687"
 }, 
 {
  "author": "clement", 
  "date": "2008-07-03T14:26:08.049510Z", 
  "msg": [
   "Fix the issue Felix-621.", 
   "When the instance creation failed, the instance is deleted. This allows deleting both the instance and attached handlers."
  ], 
  "revision_id": "673686"
 }
]