[
 {
  "author": "", 
  "date": "2008-07-18T18:59:10.201033Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "678000"
 }, 
 {
  "author": "davsclaus", 
  "date": "2008-07-18T18:58:03.073440Z", 
  "msg": [
   "CAMEL-736: Better end-user error message for invalid configuration with duplicated http protocol as this component does not require you to duplicate it!"
  ], 
  "revision_id": "677999"
 }, 
 {
  "author": "mamta", 
  "date": "2008-07-18T18:53:22.672026Z", 
  "msg": [
   "DERBY-269", 
   "This patch will provide a manual way of updating the statistics of all or just one index on a table", 
   "using the new stored procedure SYSCS_UTIL.SYSCS_UPDATE_STATISTICS. The signature of the new procedure", 
   "is as follows", 
   "SYSCS_UTIL.SYSCS_UPDATE_STATISTICS(schemaname, tablename, indexname)", 
   "If the user provides null for indexname then statistics will be updated for all the indexes on", 
   "schemaname.tablename otherwise statistics will be updated only for schemaname.tablename.indexname.", 
   "We implement this functionality by intercepting the stored procedure call and converting it to an", 
   "internal to Derby only ALTER TABLE syntax. This allows us to use lot of basic code needed for", 
   "schema/table name validation, privilege checking etc. Other than this, the actual code for implementing", 
   "the functionality was obtained from exisiting unused class execute/UpdateStatisticsConstantAction.java", 
   "I have removed that class from the codeline since the code inside it has now been moved into", 
   "AlterTableConstantAction.java"
  ], 
  "revision_id": "677998"
 }, 
 {
  "author": "nick", 
  "date": "2008-07-18T18:51:01.052978Z", 
  "msg": [
   "Put in an overloaded method to keep binary compatibilty"
  ], 
  "revision_id": "677997"
 }, 
 {
  "author": "dkulp", 
  "date": "2008-07-18T18:46:40.733716Z", 
  "msg": [
   "Minor updates to the perf thing to be what I was testing with the chunking stuff"
  ], 
  "revision_id": "677996"
 }
]