[
 {
  "author": "ryan", 
  "date": "2008-07-19T20:00:05.288926Z", 
  "msg": [
   "fix white space in NamedList"
  ], 
  "revision_id": "678210"
 }, 
 {
  "author": "sisbell", 
  "date": "2008-07-19T19:51:06.799812Z", 
  "msg": [
   "License headers, javadocs, additional exception handling."
  ], 
  "revision_id": "678209"
 }, 
 {
  "author": "jimk", 
  "date": "2008-07-19T19:18:15.474728Z", 
  "msg": [
   "HBASE-679 Regionserver addresses are still not right in the new tables page", 
   "Passed all regression tests and PerformanceEvaluation running with multiple region servers. table.jsp now displays the correct information", 
   "HRegionInfo:", 
   "- removed getTableNameFromRegionName and parseMetaRegionRow we have the information in the meta table, just use it.", 
   "HServerInfo:", 
   "- I had originally made some changes here but removed them. The only remaining changes are javadoc", 
   "MetaScanner:", 
   "- build region name using ZEROES instead of NINES. When you scan you need a row name that sorts before the first row rather than after the last row.", 
   "- scan using COLUMN_FAMILY_ARRAY instead of COL_REGIONINFO_ARRAY. This way you also get the server name and start code", 
   "- change api for MetaScannerVisitor so that processRow only gets the RowResult. If you have the RowResult you have everything you need.", 
   "HConnectionManager:", 
   "- change listTables' MetaScannerVisitor to conform to new processRow api", 
   "HTable:", 
   "- change getStartKeys' MetaScannerVisitor to conform to new processRow api", 
   "- getRegionsInfo: use new processRow api, and get the server address out of the RowResult, rather than relying on the one that is cached in HConnectionManager", 
   "ScannerCallable:", 
   "- make constructor public, add javadoc", 
   "HMaster", 
   "- change createTable to get the HRegionInfo out of the RowResult and compare table name from HRegionInfo with that in the HRegionInfo of the table being created, instead of parsing the table name out of the row", 
   "TestHTable", 
   "- modify test's MetaScannerVisitor to conform to the new processRow api", 
   "TestHRegionInfo", 
   "- remove testParse as parse method no longer exists", 
   "table.jsp", 
   "- change catch of IOException to catch Exception and print stack trace. At least you'll be able to see why the server crashes if it does."
  ], 
  "revision_id": "678208"
 }, 
 {
  "author": "hboutemy", 
  "date": "2008-07-19T19:14:19.082440Z", 
  "msg": [
   "avoid code duplication for table rows ending with an optional column"
  ], 
  "revision_id": "678207"
 }, 
 {
  "author": "bibryam", 
  "date": "2008-07-19T19:00:54.543704Z", 
  "msg": [
   "Add an error check to Quick Ship Entire Order service."
  ], 
  "revision_id": "678206"
 }
]