[
 {
  "author": "dennisl", 
  "date": "2008-08-01T00:02:07.805683Z", 
  "msg": [
   "[maven-release-plugin] prepare release maven-idea-plugin-2.2"
  ], 
  "revision_id": "681560"
 }, 
 {
  "author": "dennisl", 
  "date": "2008-07-31T23:59:12.918893Z", 
  "msg": [
   "o Add scm element."
  ], 
  "revision_id": "681559"
 }, 
 {
  "author": "bago", 
  "date": "2008-07-31T23:54:39.269164Z", 
  "msg": [
   "Forgot to put resources for tests"
  ], 
  "revision_id": "681558"
 }, 
 {
  "author": "taylor", 
  "date": "2008-07-31T23:51:46.483169Z", 
  "msg": [
   "Im working on http://issues.apache.org/jira/browse/JS2-869", 
   "but I've found that the new build is really quite a learning curve, so I tried to write some unit tests to put the build through its paces, and make use of the filtering aspects of th spring assembly.", 
   "Thus we have a new abstract test for using filters with the goal of just pointing your test cases at the assembly dirs and letting the filters sort out what actually gets loaded.", 
   "see AbstractFilteredSpringTestCase.java for more details. Also see the TestSerializer.java, which is disabled because of cyclical dependencies, but if you enable this test you can see the filtering in action.", 
   "Also wrote a TestSnapshot to test loading seed data, which can be useful. For now I am turning off the \"null value\" support as its broken. I will make a second pass on the preferences serialization to handle read only and multivalues", 
   "The seed data now appears to be loading correctly, with exception of user info and prefs. I am now writing the new service (not yet checked in) to implement principal preferences, which will be stored in a separate table from portlet preferences.", 
   "Will then hook in seed data's <user-info> into the new principal preferences", 
   "Im also seeing some failures in retrieving portlet preferences in the actual portal. I need to get some better test cases in place to test both portal and principal preferences and wrap this up with a commit of both"
  ], 
  "revision_id": "681557"
 }, 
 {
  "author": "bago", 
  "date": "2008-07-31T23:49:21.802993Z", 
  "msg": [
   "Moved phoenix-deployment tests domain package to core-library tests.", 
   "Also moved some more Mock files to core-library and user-library."
  ], 
  "revision_id": "681556"
 }
]