[
 {
  "author": "bago", 
  "date": "2008-08-13T11:00:58.533118Z", 
  "msg": [
   "First attempt at creating a delegating socket-server.", 
   "- changed some visibility from AbstractJamesHandler to allow my extension.", 
   "- Introduced ProtocolHandler and ProtocolHandlerHelper interfaces.", 
   "- created a DelegatingJamesHandler that expose a ProtocolHandlerHelper service to the managed \"ProtocolHandler\" (received in the constructor).", 
   "- created a DelegatingSMTPServer that is identical to SMTPServer but manages a pool of DelegatingJamesHandler (containing SMTPProtocolHandlers) instead  of SMTPHandlers.", 
   "- created an SMTPProtocolHandler by cloning the current SMTPHandler.", 
   "The main advantage is that SMTPProtocolHandler has no knowledge of cornerstone/excalibur because they are incapsulated in the DelegatingJamesHandler .", 
   "The used interfaces are meant to make it really simple the porting of our current services to this structure. We can then refactor the interface to expose better names for methods/services.", 
   "We could also move the ProtocolHandler/ProtocolHandlerHelper to a lower layer.", 
   "This code is *untested*, ATM."
  ], 
  "revision_id": "685510"
 }, 
 {
  "author": "gkossakowski", 
  "date": "2008-08-13T10:56:48.662310Z", 
  "msg": [
   "Implemented exists() method so it tries to return more meaningful value.", 
   "Also, use exists() method in getInputStream, if it does not exist then SourceNotFound exception should be thrown."
  ], 
  "revision_id": "685509"
 }, 
 {
  "author": "bago", 
  "date": "2008-08-13T10:47:11.312479Z", 
  "msg": [
   "Remove empty package"
  ], 
  "revision_id": "685508"
 }, 
 {
  "author": "dimuthu", 
  "date": "2008-08-13T10:44:37.840460Z", 
  "msg": [
   "generating policy for stub for wsdl2c"
  ], 
  "revision_id": "685507"
 }, 
 {
  "author": "rhs", 
  "date": "2008-08-13T10:39:10.920688Z", 
  "msg": [
   "removed dead code from message Echo utility, and added a message Sink utility"
  ], 
  "revision_id": "685506"
 }
]