[
 {
  "author": "lu4242", 
  "date": "2008-08-15T02:13:27.103764Z", 
  "msg": [
   "add parent pom project for allow async releases of exval, and apply checkstyle rules to all project (apache code conventions). In the future compile errors occur if convertions are violated (bracket style, license on all java files, lines longer than 120 characters, use org.apache.* style imports...)."
  ], 
  "revision_id": "686110"
 }, 
 {
  "author": "ffang", 
  "date": "2008-08-15T02:08:58.729135Z", 
  "msg": [
   "rollback cxf version to 2.1.2-SNAPSHOT since 2.1.3-SNAPSHOT is not in the apache repo yet"
  ], 
  "revision_id": "686109"
 }, 
 {
  "author": "johnh", 
  "date": "2008-08-15T01:57:48.291838Z", 
  "msg": [
   "Caja-based HTML and CSS parser implementations.", 
   "Uses Caja's parse trees for HTML and CSS to satisfy the GadgetHtmlParser and GadgetCssParser", 
   "interfaces.", 
   "These classes stand alone for the moment ie. don't affect existing functionality.", 
   "This CL resolves SHINDIG-502"
  ], 
  "revision_id": "686108"
 }, 
 {
  "author": "omalley", 
  "date": "2008-08-15T01:54:04.600828Z", 
  "msg": [
   "HADOOP-3946. Fix TestMapRed after hadoop-3664. (tomwhite via omalley)", 
   "Recommitting now that I've identified the problem as being environmental."
  ], 
  "revision_id": "686107"
 }, 
 {
  "author": "johnh", 
  "date": "2008-08-15T01:48:26.626088Z", 
  "msg": [
   "Initial implementation of the classes involved in manipulating mutable gadget HTML and CSS.", 
   "Each class can be created from a Parsed equivalent of itself, or freshly created in-memory.", 
   "The HTML representation is a sort of DOM-lite, while CSS manipulation consists of ordered-string", 
   "(selector) manipulation and String/String Map manipulation for declarations. Tests are provided", 
   "for each creation mechanism and all APIs.", 
   "This implementation will likely change notably as I and others attempt to put it to real use in", 
   "rewriters. Hopefully modifying it will be reasonably easy due to its being abstracted away", 
   "from parsing logic.", 
   "This commit resolves SHINDIG-524, and does not affect any existing functionality yet."
  ], 
  "revision_id": "686106"
 }
]