[
 {
  "author": "lu4242", 
  "date": "2008-08-16T21:42:29.626960Z", 
  "msg": [
   "update myfaces core version to 1.1.6"
  ], 
  "revision_id": "686565"
 }, 
 {
  "author": "jan", 
  "date": "2008-08-16T21:11:56.956468Z", 
  "msg": [
   "fix merge issue"
  ], 
  "revision_id": "686564"
 }, 
 {
  "author": "dbertoni", 
  "date": "2008-08-16T21:11:38.537588Z", 
  "msg": [
   "Changes for Jira issue XALANC-616.  More cleanup.  Quiet some HP compiler warnings and fix GCC issue by adding XToken copy constructor."
  ], 
  "revision_id": "686563"
 }, 
 {
  "author": "sebor", 
  "date": "2008-08-16T21:03:35.491715Z", 
  "msg": [
   "2008-08-16  Martin Sebor  <sebor@roguewave.com>", 
   "* etc/config/xlC_version.sh: Added comments with info about recent", 
   "versions and patches and rearranged in decreasing chronological", 
   "order."
  ], 
  "revision_id": "686562"
 }, 
 {
  "author": "vhennebert", 
  "date": "2008-08-16T21:02:24.979457Z", 
  "msg": [
   "Major (complete) refactoring of the prototype, to cover needs that appeared while thinking about tables. That should allow to implement them more easily.", 
   "- Knuth elements are no longer iterated over in one go. It's now the parent layout manager that drives the iteration, so that it can perform whatever is needed at each penalty, before going on to the next elements. The behaviour is now closer to an Iterator interface.", 
   "- the Breaker class has been reduced into a KnuthIterator, that iterates over a list of Knuth elements and updates a collection of Layouts accordingly and selects the best complete layouts. The rest of the breaking machinery has been moved into the layoutmgr package", 
   "- line breaking has been completely decoupled from page breaking. A LineLayout now references its related block layout, instead of being composed of two layouts, one for line- and one for pagse breaking. The enclosing block layout has no reference to the line layout, but this may be changed later on if that proves to be necessary.", 
   "As a consequence the architecture can be greatly simplified: LegalBreakHandler no longer needs to be inherited by classes returning the right layout depending on the kind of breaking performed. ActiveLayouts no longer stores layouts by line-level class plus block-level class, only by \"layout class\". The two sorts of layouts are never mixed anymore.", 
   "The notion of layout class is now handled by the layout itself and may be customized to meet specific needs.", 
   "- LegalBreakHandler doesn't take care of the creation of new layouts anymore; instead, this is now handled by the NonLeafLayoutManager.partCompleted event. This call is recursively passed through the hierarchy of Layout Managers until an ancestor can handle it (e.g., PageLM will create a layout for a new page).", 
   "- the dimension of the part (line, page, table cell...) is now directly stored in the Layout object", 
   "- new option to label edges with their corresponding demerits"
  ], 
  "revision_id": "686561"
 }
]