[
 {
  "author": "johnh", 
  "date": "2008-08-20T01:16:32.952357Z", 
  "msg": [
   "Renaming parsed node creation helpers, and making them public static for reuse. Adding \"script\" as another type of", 
   "element that's not supported in short-form."
  ], 
  "revision_id": "687215"
 }, 
 {
  "author": "etnu", 
  "date": "2008-08-20T01:14:33.643572Z", 
  "msg": [
   "Refactored HttpRequest into a more useful construct in order to facilitate ongoing work for SHINDIG-523 and SHINDIG-517.", 
   "This isn't really much of a change, it just touches a lot of files since it replaces most usage of java.net.URI.", 
   "Some interfaces at the edge of this code may need to be modified slightly, especially if they looked at HttpRequest.getUri directly. We're now using org.apache.shindig.common.uri.Uri instead of java.net.URI. If existing code still wants a java.net.URI, some new utility methods have been added to Uri to facilitate converstion.", 
   "Much more work remains to be done in the rendering and network request pipeline. The next step will be updating HttpResponse objects along the same lines as HttpRequest (with some notable significant differences, since responses must be immutable).  Additional cleanup to remove remaining use of java.net.URI would also be good, though not critical."
  ], 
  "revision_id": "687214"
 }, 
 {
  "author": "kmenard", 
  "date": "2008-08-20T01:14:18.106368Z", 
  "msg": [
   "Fixed TAPESTRY-2592: BeanEditor should provide a \"BeanEditContext\" into the environment. (or PropertyEditContext should include the bean class).", 
   "Patch from Robert Zeigler, slightly modified to match existing code formatting."
  ], 
  "revision_id": "687213"
 }, 
 {
  "author": "nadiramra", 
  "date": "2008-08-20T01:09:11.998525Z", 
  "msg": [
   "Simplify, remove redundant/unused code."
  ], 
  "revision_id": "687212"
 }, 
 {
  "author": "jsdelfino", 
  "date": "2008-08-20T00:43:40.300982Z", 
  "msg": [
   "Minor code cleanup. Moved different SCDL variations to different composite files. Added one more variation that shows how to use the SCA ComponentContext interface."
  ], 
  "revision_id": "687211"
 }
]