[
 {
  "author": "ritchiem", 
  "date": "2008-08-22T16:15:02.116343Z", 
  "msg": [
   "QPID-1119 : M2x commit : Addition of a System property to AMQProtocolHandler.java to allow the syncWait default to be changed. To perform this a new SlowMessageStore has been added to the systest package. This allows all MessageStore methods to have a pre and/or post delay applied. This delay can be configured dynamically if you have a handle to the Store or via the XML configuration. The SlowMessageStore can also be used to wrap any existing MessageStore (Testing only carried out with the default MemoryMessageStore)", 
   "To make testing easier on M2x VMTestCase has been modified to allow the test to simply configure logging levels and systemProperties. These are then reverted after the test has completed.", 
   "These changes will naturally need more work to before they are merged to trunk which uses totally different methods for ClientProperties and for running tests.", 
   "systests/pom.xml didn't have amqj.logging.level as a systemProperty hence setting it did nothing for the tests."
  ], 
  "revision_id": "688110"
 }, 
 {
  "author": "dwoods", 
  "date": "2008-08-22T16:13:38.132520Z", 
  "msg": [
   "GERONIMO-4181 Upgrade to Derby 10.4.1.3"
  ], 
  "revision_id": "688109"
 }, 
 {
  "author": "pkriens", 
  "date": "2008-08-22T16:07:48.265007Z", 
  "msg": [
   "Test commit"
  ], 
  "revision_id": "688108"
 }, 
 {
  "author": "xavier", 
  "date": "2008-08-22T15:57:54.236085Z", 
  "msg": [
   "FIX: Inconsistency with \"multi-project\" tutorial (IVY-667)"
  ], 
  "revision_id": "688107"
 }, 
 {
  "author": "chirino", 
  "date": "2008-08-22T15:53:42.616411Z", 
  "msg": [
   "Update the PageFile public interface so that all read/update operations have be done via a Transaction object.  Updated the", 
   "HashIndex to support doing index operations in the context of the Transaction.  The idea is that multiple page and index updates", 
   "can be performed in a single Unit of Work controled by the Transaction object.  Should make recovering higher level complex", 
   "operations easier to recover."
  ], 
  "revision_id": "688106"
 }
]