[
 {
  "author": "damien", 
  "date": "2008-08-22T19:38:23.730768Z", 
  "msg": [], 
  "revision_id": "688180"
 }, 
 {
  "author": "sjur", 
  "date": "2008-08-22T19:28:06.079480Z", 
  "msg": [
   "Renamed back - the new name would not be picked up by the present xsl stylesheet in the repository. I'll redo the renaming when I'm ready to commit all the changes, to avoid a situation where pdf generation is broken."
  ], 
  "revision_id": "688179"
 }, 
 {
  "author": "etnu", 
  "date": "2008-08-22T19:25:53.930446Z", 
  "msg": [
   "Began migrating SecurityToken passing to HttpRequest, as well as including request context information (Gadget + container) in all requests. The objective here is to unify the parameters passed through HttpFetchers so that uniform logging, monitoring, and policy enforcement can be achieved.", 
   "The \"gadget\" and \"container\" fields are duplicated in secure contexts (that is, contexts where a SecurityToken is present), but since we can't guarantee their integrity anyway we should treat them as different.", 
   "Still missing:", 
   "- Rewriters only pass gadget url, not container. This makes it impossible to support per-container defualt rewriting rules at present.", 
   "- No context is passed for manifest (gadget spec / message bundle) retrieval. This is probably not important as these files are generally shared between containers anyway. For privilaged gadget access, a custom GadgetSpecFactory can still be implemented.", 
   "- It's not possible to test that the token, gadget url, and container are passed in these requests at present. Significant test refactoring will be necessary to achieve that.", 
   "Next step:", 
   "- Remove security token passing for signed fetch / oauth. We may just punt on this one as Brian Eaton's work to unify signed fetch and oauth fetch is forthcoming."
  ], 
  "revision_id": "688178"
 }, 
 {
  "author": "chabotc", 
  "date": "2008-08-22T19:24:29.879518Z", 
  "msg": [
   "SHINDIG-531 by Artemy Tregubenko: Support arbitrary module id in BasicSecurityToken"
  ], 
  "revision_id": "688177"
 }, 
 {
  "author": "chabotc", 
  "date": "2008-08-22T19:22:04.708795Z", 
  "msg": [
   "SHINDIG-526 by Ruchi Kothari : HAS_APP filter is not working with new canonical json db structure"
  ], 
  "revision_id": "688176"
 }
]