[
 {
  "author": "ningjiang", 
  "date": "2008-09-05T07:31:37.527968Z", 
  "msg": [
   "Merged revisions 690841 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/branches/2.1.x-fixes", 
   "................", 
   "r690841 | ningjiang | 2008-09-01 11:22:08 +0800 (Mon, 01 Sep 2008) | 9 lines", 
   "Merged revisions 690638 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r690638 | ningjiang | 2008-08-31 12:49:48 +0800 (Sun, 31 Aug 2008) | 1 line", 
   "CXF-1773 applied patch with thanks to Christian", 
   "........", 
   "................"
  ], 
  "revision_id": "692365"
 }, 
 {
  "author": "olamy", 
  "date": "2008-09-05T07:29:36.844528Z", 
  "msg": [
   "go back to 1.2-SNAPSHOT"
  ], 
  "revision_id": "692364"
 }, 
 {
  "author": "ate", 
  "date": "2008-09-05T07:26:09.324173Z", 
  "msg": [
   "Fixing the associations acess methods"
  ], 
  "revision_id": "692363"
 }, 
 {
  "author": "olamy", 
  "date": "2008-09-05T07:24:59.922375Z", 
  "msg": [
   "remove release tag"
  ], 
  "revision_id": "692362"
 }, 
 {
  "author": "johnh", 
  "date": "2008-09-05T07:23:49.980136Z", 
  "msg": [
   "Step #1 in migrating ParseTreeDefaultContentRewriter to its constituent parts: three separate rewriters, all of which operate on a parse tree:", 
   "1. JsTagConcatCR: consolidates adjacent <script src> tags.", 
   "2. StyleLinkCR: rewrites image links in <style> blocks using a provided LinkRewriter.", 
   "3. LinkingTagCR: rewrites content links in various tags using a provided LinkRewriter.", 
   "With this change, each of these becomes independently configurable, and in fact usable multiple times in a given rewriting chain if desired. Each is constructed using either ContentRewriterFeature.Factory, LinkRewriter, or both. The former generates a ContentRewriterFeature for a given GadgetSpec using provided defaults. The Factory itself would be generated once, when configuring the ContentRewriter instances that apply to a given Shindig installation in its ContentRewriterRegistry.", 
   "All relevant code copied from what was previously in separate methods in ParseTreeHtmlRewriter, with bits of semantics (notably regarding when the rewriters actually apply) from [ParseTree]DefaultContentRewriter. Note that each Rewriter independently makes its own decision as to whether or not it applies for a given request.", 
   "As with ParseTreeDefaultContentRewriter, these changes presently do *not* affect the default installation of Shindig, as they are not configured as default Rewriters yet (soon).", 
   "These Rewriters are not yet complete due to missing implementations for the HttpResponse ContentRewriter interface, pending implementation of an approach for sharing a ParseTree to avoid multiple re-parsing (ContentRewriter interface change or HttpResponse[Builder] helpers). Lastly, there are some commonalities between these Rewriters which should soon be factored into helper base classes."
  ], 
  "revision_id": "692361"
 }
]