[
 {
  "author": "sjur", 
  "date": "2008-09-05T12:44:24.416613Z", 
  "msg": [
   "Whitespace only."
  ], 
  "revision_id": "692425"
 }, 
 {
  "author": "sjur", 
  "date": "2008-09-05T12:39:02.165830Z", 
  "msg": [
   "Bringing this contract in line with the skins-based pdf generation by adding the font-family attribute, and at the same time adding support for user-specification of the font family.", 
   "Also, the framework for controlling header placement according to double/single-sided is in place (copied from skins), although the actual toggling does not work, because the needed variable isn't available."
  ], 
  "revision_id": "692424"
 }, 
 {
  "author": "woonsan", 
  "date": "2008-09-05T12:36:36.751723Z", 
  "msg": [
   "Flattening the Principal API.", 
   "Implemented associations-retrieving and principal-updating in the role manager and group manager."
  ], 
  "revision_id": "692423"
 }, 
 {
  "author": "gnodet", 
  "date": "2008-09-05T12:35:41.440790Z", 
  "msg": [
   "SM-1548: SMX-EIP AbstractAggregator timeout exchange has bad correlationId"
  ], 
  "revision_id": "692422"
 }, 
 {
  "author": "ieb", 
  "date": "2008-09-05T12:27:41.514640Z", 
  "msg": [
   "Creating a space for Sample Implementations of the SPI in social-api", 
   "and other API's in Gadgets.", 
   "This will generate a jar containing the sample implementations, and ensure that", 
   "we have an insight into any changes that we might make to the SPI coming up to", 
   "the 1.0 release and beyond.", 
   "It also might be a place to put alternative implementations of things like the Cache", 
   "implementation inside gadgets, to avoid an excessive number of dependencies in the main", 
   "build. It would be good to have ehcache, Apache JCS and Memcached implementation, but", 
   "this has been resisted at the moment mainly due to the dependencies that they might", 
   "pull.", 
   "Samples will not be in the main build but will be activated by a profile.", 
   "If anyone thinks that this is not appropriate or the right way to do this, please shout."
  ], 
  "revision_id": "692421"
 }
]