[
 {
  "author": "johnh", 
  "date": "2008-09-05T21:48:21.205958Z", 
  "msg": [
   "Changing HttpResponse ContentRewriter API to take a MutableContent, and implementing HttpResponse rewriting by the new rewriter corps. I've used MutableContent for the moment simply because it is available and allows me to port over text/css content rewriting without augmenting the Parse Tree APIs to accommodate CSS content in symbolic/parsed form, which in turn would require plumbing changes to inject a CssParser in various places. Per discussion on shindig-dev@, this parameter may change to a generic parse tree once that occurs or some other CSS (and JS) content manipulation strategy is devised. At that time, the Gadget rewriting API will probably involve passing in Context and a new intermediary representation rather than just Gadget.", 
   "* Renamed MutableHtmlContent to MutableContent. It might not represent HTML.", 
   "* Implemented Rewriters' HttpResponse rewriting methods.", 
   "* Updated plumbing to use these new methods.", 
   "Next up, cleaning AbstractHttpCache and continuing the API discussion."
  ], 
  "revision_id": "692560"
 }, 
 {
  "author": "rickhall", 
  "date": "2008-09-05T21:38:05.450476Z", 
  "msg": [
   "Fixed a performance regression that was caused by uncached access to the", 
   "bundle manifest headers. (FELIX-711)"
  ], 
  "revision_id": "692559"
 }, 
 {
  "author": "ogusakov", 
  "date": "2008-09-05T21:33:47.472818Z", 
  "msg": [
   "fixin linux build"
  ], 
  "revision_id": "692558"
 }, 
 {
  "author": "johnh", 
  "date": "2008-09-05T21:28:17.138944Z", 
  "msg": [
   "Returning safe default values from AnonymousSecurityToken rather than throwing UnsupportedOperationException. This prevents Shindig run in Full mode (which has UrlAuthHandler and AnonymousAuthHandler configured) not to barf when direct-rendering a gadget (/gadgets/ifr?url=foo.xml) without a security token."
  ], 
  "revision_id": "692557"
 }, 
 {
  "author": "aconway", 
  "date": "2008-09-05T21:21:28.086970Z", 
  "msg": [
   "Fixes to distributed test scripts."
  ], 
  "revision_id": "692556"
 }
]