[
 {
  "author": "johnh", 
  "date": "2008-09-09T00:26:28.283954Z", 
  "msg": [
   "Improving TtlCache in preparation for using it throughout code where necessary to help clean up various APIs (eg. AbstractHttpCache, SHINDIG-579).", 
   "* TtlCache implements the Cache interface, with default behaviors for getElement and addElement. Because why not.", 
   "* New method getElementWithExpiration returns whether or not the returned element has expired along with the element itself. Callers can choose what to do with the results at that point."
  ], 
  "revision_id": "693325"
 }, 
 {
  "author": "taylor", 
  "date": "2008-09-09T00:23:09.659928Z", 
  "msg": [
   "missing license"
  ], 
  "revision_id": "693324"
 }, 
 {
  "author": "taylor", 
  "date": "2008-09-09T00:21:59.845519Z", 
  "msg": [
   "missing license"
  ], 
  "revision_id": "693323"
 }, 
 {
  "author": "baerrach", 
  "date": "2008-09-09T00:14:40.086564Z", 
  "msg": [
   "Removed unused argument \"mavenRepo\" from getLines() private method."
  ], 
  "revision_id": "693322"
 }, 
 {
  "author": "dblevins", 
  "date": "2008-09-09T00:09:25.722081Z", 
  "msg": [
   "OPENEJB-903: Multicast discovery and grouping", 
   "OPENEJB-911: Graceful shutdown of client/server connections", 
   "OPENEJB-857: Client connection KeepAlive (had to rewrite this for OPENEJB-911)", 
   "Added a ClusterMetaData which is similar to what the ServerMetaData was aiming to be. The issue with the ServerMetaData is that it's tracked on a per-ejb-proxy basis and any updates to the list of servers in the cluster are only reflected in the proxy immediately used. All other proxies will still hold onto the outdated list.  Second, not all request types could be clustered and have failover, essentially only ejb requests could failover, jndi and authentication could not.  Now the ClusterMetaData version associated with the ServerMetaData is sent to the server *before* the main request and then the server can send back a new list regardless of which type of request it is.", 
   "Additionally code has been added to guarantee that the ServerMetaData the client used to connet with the server or cluster is the used in an EJB proxies created via the IntraVM server when the are replaced for Remote Server proxies at serialization.  Previously they were sent back with \"foo://localhost:4201\" as the server address which was not good."
  ], 
  "revision_id": "693321"
 }
]