[
 {
  "author": "tomwhite", 
  "date": "2008-09-19T10:19:22.554046Z", 
  "msg": [
   "HADOOP-4070. Provide a mechanism in Hive for registering UDFs from the query language."
  ], 
  "revision_id": "697035"
 }, 
 {
  "author": "jdillon", 
  "date": "2008-09-19T10:17:42.747845Z", 
  "msg": [
   "Enable gshell-remote in the build again, got it to compile and configured some spring stuff, but still needs work before it will function"
  ], 
  "revision_id": "697034"
 }, 
 {
  "author": "thorsten", 
  "date": "2008-09-19T10:17:25.983798Z", 
  "msg": [
   "Implementation of hook processing.", 
   "There is a small downsides in the current implementation: the xpath injection are NOT working well when the injection point is within the main stream of the events.", 
   "It is possible to inject e.g. to /html/head but injecting to /html/body/... will not inject the new events in the principal stream to the location that one w", 
   "ould await. The main reason is that the generation of the result document is now as well based on StAX and not any more in DOM.", 
   "However to have the same behavior as we have currently in the DispatcherTransformer I do not see any other possibility then using DOM again.", 
   "Like with the xml properties I will make the usage configurable since I reckon in 90% of all cases the StAX based calculation is used. For the rest I am stil", 
   "l investigating but it seems that DOM is the only possibility because every other possibility that me occur is imitating DOM."
  ], 
  "revision_id": "697033"
 }, 
 {
  "author": "bodewig", 
  "date": "2008-09-19T10:17:12.386683Z", 
  "msg": [
   "remove memoization which measurably (sp?) hurts performance more than it helps"
  ], 
  "revision_id": "697032"
 }, 
 {
  "author": "coheigea", 
  "date": "2008-09-19T10:16:09.876706Z", 
  "msg": [
   "[WSS-141] - A fix for the UsernameTokenProcessor leaking information about usernames", 
   "- It just logs the error message now, instead of throwing an exception with it", 
   "- the exception just returns a generic access denied error", 
   "- Added a test, and fixed some of the other Username Token tests."
  ], 
  "revision_id": "697031"
 }
]