[
 {
  "author": "rickhall", 
  "date": "2008-09-24T22:05:26.685331Z", 
  "msg": [
   "Modified the resolver so that it correctly discards exported packages from", 
   "resolved bundles that also import the same package and they were wired to", 
   "a provider other than themself. (FELIX-736)"
  ], 
  "revision_id": "698755"
 }, 
 {
  "author": "", 
  "date": "2008-09-24T21:55:26.267343Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "698754"
 }, 
 {
  "author": "ate", 
  "date": "2008-09-24T21:48:23.287167Z", 
  "msg": [
   "Fixed bug where removePrincipal(String) didn't delegate to removePrincipal(JetspeedPrincipal) which handles the needed association (specifically isA) functionality."
  ], 
  "revision_id": "698753"
 }, 
 {
  "author": "jbohn", 
  "date": "2008-09-24T21:45:45.719841Z", 
  "msg": [
   "remove a few recently included relativePath entries that should not be needed in the pom parent references"
  ], 
  "revision_id": "698752"
 }, 
 {
  "author": "evan", 
  "date": "2008-09-24T21:45:11.520115Z", 
  "msg": [
   "Changed HandlerProvider base class so that:", 
   "-.Doesn't require creating instances of PersonHandler, ActivityHandler and AppDataHandler - instead it just references the classes directly, and", 
   "- Has a base class that doesn't require installing the default handlers", 
   "This supports", 
   "- Using RequestScoped versions of Handlers as you don't have to create an instance of the objects at startup (when there isn't a request scope) and", 
   "- More easy additions or changes to supported HandlerProviders", 
   "Client code changes you need because of this CL:", 
   "- If you don't use SocialApiGuiceModule, you need to call bind(HandlerProvider.class).toInstance(HandlerProvider.defaultHandlers()) in your Guice module", 
   "- If you extend HandlerProvider, you need to call super(true) and then addHandler() to add new handlers (see change in SampleContainerProviderHandler.java)"
  ], 
  "revision_id": "698751"
 }
]