[
 {
  "author": "maartenc", 
  "date": "2008-09-24T21:29:55.813228Z", 
  "msg": [
   "FIX: build.xml: checkstyle + checkstyle-report dont work together (IVY-919)"
  ], 
  "revision_id": "698745"
 }, 
 {
  "author": "rgardler", 
  "date": "2008-09-24T21:28:55.189034Z", 
  "msg": [
   "only show each link once Thanks to Pablo Barrera (ISSUE FOR-1114)"
  ], 
  "revision_id": "698744"
 }, 
 {
  "author": "breed", 
  "date": "2008-09-24T21:27:50.393167Z", 
  "msg": [
   "ZOOKEEPER-117 threading issues in Leader election"
  ], 
  "revision_id": "698743"
 }, 
 {
  "author": "lu4242", 
  "date": "2008-09-24T21:25:46.552314Z", 
  "msg": [
   "TOMAHAWK-1338 JSCookMenu t:navigationMenuItem ActionListener no work without define itemValue"
  ], 
  "revision_id": "698742"
 }, 
 {
  "author": "ate", 
  "date": "2008-09-24T21:22:18.449962Z", 
  "msg": [
   "Complete implementation and proper handling of default supported JetspeedPrincipal association types.", 
   "This includes isMemberOf, IsChildOf, IsA, IsPartOf, BelongsTo associations and their behaviors.", 
   "Also providing default configuration/support for the following associations:", 
   "- groupIsAGroup", 
   "- groupIsPartOfGroup", 
   "- roleIsARole", 
   "- roleIsPartOfRole", 
   "So, yes: *both* isA and IsPartOf can now be used at the same time for hierarical groups and/or roles!", 
   "And finally, the default configuration for the UserSubjectPrincipalsResolver actually evaluates all of the above properly:", 
   "- the children groups of isPartOf another group are collected (from side)", 
   "- the parent group which is the generalization of isA another group is collected (to side)", 
   "- the roles from groupIsMemberOfRole associations are collected", 
   "- the children roles of isPartOf another role are collected (from side)", 
   "- the parent role which is the generalization of isA another role is collected (to side)", 
   "- and all collected groups and roles are evaluated themselves as well (recursively)", 
   "One note: currently the j2-admin nor the JetspeedSerializer support defining isA or isPartOf associations for roles and groups.", 
   "The above has been verified and tested by manually creating these associations in the database."
  ], 
  "revision_id": "698741"
 }
]