[
 {
  "author": "reinhard", 
  "date": "2008-09-26T15:48:46.746270Z", 
  "msg": [
   "revert again :-(", 
   "(doing multi-module builds is a really tedious task. sigh)"
  ], 
  "revision_id": "699375"
 }, 
 {
  "author": "dag", 
  "date": "2008-09-26T15:46:07.199459Z", 
  "msg": [
   "DERBY-3137 SQL roles: add catalog support", 
   "Patch DERBY-3137-setRoleNoCNF-3, which changes the behavior of", 
   "SET ROLE ? and CURRENT_ROLE to comply with the latest SQL standard:", 
   "- changes the behavior of SET ROLE ? to interpret the dynamic argument", 
   "as a delimited SQL identifier. Up till now, it was interpreted as an", 
   "identifer in internal (case normal form), but this seems wrong", 
   "according to SQL 2003, section 18.3, GR3. A Java null value is no", 
   "longer accepted as an argument. An empty string or a null value will", 
   "give identifer parse error (\"XCXA0\").", 
   "NONE no longer has a special meaning when used in a dynamic (\"SET ROLE ?\")", 
   "statement, cf. the addendum ISO/IEC 9075-2:2003/Cor.2:2007 section 18.3.", 
   "Also, section 18.3, GR2 calls for whitespace to be removed from the", 
   "string before interpreting it as an identifier. This is now also", 
   "performed.", 
   "- similarly changes the builtin function CURRENT_ROLE to now return a", 
   "delimited identifer if the role is set, making it \"symmetrical\" with", 
   "SET ROLE, that is, the output of CURRENT_ROLE can be used as input", 
   "to \"SET ROLE ?\". When the role is not set, CURRENT_ROLE returns", 
   "NULL (which can not be used as input to \"SET ROLE ?\", however)."
  ], 
  "revision_id": "699374"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2008-09-26T15:44:22.226414Z", 
  "msg": [
   "SLING-678 support enabling the debugger with a framework property", 
   "and have better control over the debugger window (used for SLING-676)"
  ], 
  "revision_id": "699373"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2008-09-26T15:42:12.363040Z", 
  "msg": [
   "SLING-676 Move JavaScriptEngineFactory to an internal package (for", 
   "SLING-634) and ensure proper cleanup when stopping the bundle. In", 
   "addition the factory is now a proper OSGi service because it needs", 
   "more control of its own lifecycle and for SLING-634 needs to be", 
   "able to get the host object providers."
  ], 
  "revision_id": "699372"
 }, 
 {
  "author": "asmuts", 
  "date": "2008-09-26T15:40:10.531995Z", 
  "msg": [
   "Adding temp build for 1.3.2.3-RC.  This build allows users to inject custom socket factories."
  ], 
  "revision_id": "699371"
 }
]