[
 {
  "author": "mamta", 
  "date": "2008-10-17T16:12:56.973312Z", 
  "msg": [
   "DERBY-3872", 
   "Merging 705037 from trunk into 10.3 release where this bug was introduced. Copying the commit comments from 705037 here for reference.", 
   "The NPE in this jira entry was caused by the missing overwrite of accept() method in IndexToBaseRowNode.", 
   "Because of the missing code, the additional layer of VirtualColumn node over ResultColumn was not", 
   "happening for the where clause in HAVING. Once the accept method was added to IndexToBaseRowNode, the", 
   "VirtualColumn on top of the ResultColumn got the correct resultset number associated with it and at the", 
   "code generation time, we start referencing the correct resultset rather than the one associated with", 
   "the JOIN clause. Thanks a ton to Army and Bryan on this jira entry for their help.", 
   "I have added a test case for this in lang/GroupByTest.java"
  ], 
  "revision_id": "705660"
 }, 
 {
  "author": "aidan", 
  "date": "2008-10-17T16:12:35.320509Z", 
  "msg": [
   "QPID-1320: Remove unusued variables, check that right number of messages have been recieved in the right place as per ritchiem's review comments."
  ], 
  "revision_id": "705659"
 }, 
 {
  "author": "aidan", 
  "date": "2008-10-17T16:10:46.624161Z", 
  "msg": [
   "QPID-1373: Remove message for unack'd map when acking individual messages. Add test."
  ], 
  "revision_id": "705658"
 }, 
 {
  "author": "aidan", 
  "date": "2008-10-17T16:09:51.296169Z", 
  "msg": [
   "QPID-1315:", 
   "BasicBytesFlowControl doesn't wait long enough to determine if the 3rd message is going to be delivered accidently. It also ack'd every message, which was not it's intent, so use acknowledgeThis() instead.", 
   "Refactor common code out of processQueue and flushSubscription into attemptDelivery.", 
   "Make sure sendLock is held when closing the consumer."
  ], 
  "revision_id": "705657"
 }, 
 {
  "author": "reinhard", 
  "date": "2008-10-17T16:08:54.084989Z", 
  "msg": [
   "COCOON3-5 Add an HTML to XHTML converter based on NekoHtml."
  ], 
  "revision_id": "705656"
 }
]