[
 {
  "author": "hboutemy", 
  "date": "2008-10-18T15:43:26.170633Z", 
  "msg": [
   "o unpdated parent pom to last released version", 
   "o updated plexus-utils to 1.5.5"
  ], 
  "revision_id": "705890"
 }, 
 {
  "author": "mturk", 
  "date": "2008-10-18T15:08:22.031292Z", 
  "msg": [
   "Check if backend send AJP13_SEND_HEADERS more then once. Mark that as protocol error"
  ], 
  "revision_id": "705889"
 }, 
 {
  "author": "mturk", 
  "date": "2008-10-18T14:40:10.690605Z", 
  "msg": [
   "Can we have socket error, and errno==0?. Well OS is unknown and strange territory"
  ], 
  "revision_id": "705888"
 }, 
 {
  "author": "bpendleton", 
  "date": "2008-10-18T14:29:39.901857Z", 
  "msg": [
   "DERBY-3043: Schema does not exist error when table uses check constraint", 
   "In Derby, the CREATE SCHEMA statement is optional. When a table is created,", 
   "if the schema which contains it does not yet exist, the schema is", 
   "automatically created as well. If the CREATE TABLE statement contained a", 
   "CHECK constraint, the statement was being rejected with the error", 
   "Schema 'XXX' does not exist", 
   "This error occurred during compilation and bind processing for the check", 
   "constraint, when the criteria used in the constraint were bound to the", 
   "table definition. At that point in query processing, the schema name for", 
   "the table had not yet been filled in, so the bind processing was searching", 
   "the DataDictionary for a schema which did not yet exist (the schema will", 
   "exist after the statement is executed, but we're still compiling the", 
   "statement at this point).", 
   "This change modifies the bind processing for the CHECK constraint so that", 
   "the FromBaseTable object used to bind the constraint has the schema name", 
   "fully filled in, ensuring that the bind processing will be able to", 
   "manipulate the table without encountering no-such-schema errors."
  ], 
  "revision_id": "705887"
 }, 
 {
  "author": "olegk", 
  "date": "2008-10-18T14:29:36.741778Z", 
  "msg": [
   "[HTTPCLIENT-804: ChunkedInputStream no longer accepts truncated chunks as valid input"
  ], 
  "revision_id": "705886"
 }
]