[
 {
  "author": "bjreed", 
  "date": "2008-10-22T18:58:03.053742Z", 
  "msg": [
   "GERONIMODEVTOOLS-524 added a menu item to the Geronimo Server and a dialog for creating a custom server assembly"
  ], 
  "revision_id": "707160"
 }, 
 {
  "author": "stack", 
  "date": "2008-10-22T18:57:39.895054Z", 
  "msg": [
   "HBASE-946 Row with 55k deletes timesout scanner lease"
  ], 
  "revision_id": "707159"
 }, 
 {
  "author": "olga", 
  "date": "2008-10-22T18:37:13.426902Z", 
  "msg": [
   "PIG-504: illustrate cleanup; PIG-469: describe cleanup"
  ], 
  "revision_id": "707158"
 }, 
 {
  "author": "gcrawford", 
  "date": "2008-10-22T18:33:51.396297Z", 
  "msg": [
   "TRINIDAD-1261 remove UIXCookie as the values are no longer used", 
   "Removed UIXCookie.", 
   "UIXCookie is supposed to supports the following state:", 
   "* The accessibility mode chosen by the user", 
   "* The TimeZone of the user", 
   "The info on the cookie for the tz and accessibility mode are never used.", 
   "TimeZone", 
   "* Server: UIXCookie.setTimeZone, the only way to assign", 
   "the UIXCookie tz, is never called on the server.", 
   "* Client: There is a script written to the client in", 
   "HeadRenderer, which on the client writes tz info", 
   "into the uixcookie. However this value is never used", 
   "on either the client or server. It used to be used on", 
   "the server in RequestContextImpl.getTimeZone, but that", 
   "code has been commented out long ago.", 
   "* Conclusion: We're needlessly writing out a cookie script", 
   "when the value set on the client is never used.", 
   "Accessibility Mode", 
   "* Server: UIXCookie.setAccessibilityMode, the only way to", 
   "assign the UIXCookie accessibility mode, is never called", 
   "* Client: I see no references on the client to the", 
   "accessibility mode cookie value.", 
   "* Conclusion: I don't see how the mode could be set on", 
   "the cookie. Andy Schwartz, who has worked extensively on", 
   "accessibility issues, thinks this is old code that is no", 
   "longer in use."
  ], 
  "revision_id": "707157"
 }, 
 {
  "author": "assaf", 
  "date": "2008-10-22T18:33:13.425819Z", 
  "msg": [
   "Passing --trace message to buildr when running compile task helps in debugging."
  ], 
  "revision_id": "707156"
 }
]