[
 {
  "author": "gdamour", 
  "date": "2008-11-08T00:25:37.261257Z", 
  "msg": [
   "Improvide error message and save dependency tree listing so that it is easier to refer back to it following a dependency change as per David J's advice.", 
   "(GERONIMO-4400) Improve error message of DependencyChangeMojo"
  ], 
  "revision_id": "712320"
 }, 
 {
  "author": "chabotc", 
  "date": "2008-11-08T00:23:20.432248Z", 
  "msg": [
   "SHINDIG-685 by Arne Roomann-Kurrik - Add support for changing the view in the sample container"
  ], 
  "revision_id": "712319"
 }, 
 {
  "author": "mharwood", 
  "date": "2008-11-08T00:20:32.725890Z", 
  "msg": [
   "Added new web application demo for contrib's XmlQueryParser.", 
   "This change involves:", 
   "* Adding Tomcat's Servlet jar into the lib directory and appropriate entry in NOTICE.txt following the lead from Solr's packaging", 
   "* Adding new \"demo\" directory to XmlQueryParser src directory", 
   "* Changing XMLQueryParser's build file to create a demo War file", 
   "* Changing the main build to include the demo War file (and any other future contrib/*/war files) in the binary distributions", 
   "The packaged source distribution has NOT been changed currently to add a lib directory with the servlet.jar so building from a cut-down src distro as opposed to the full subversion /trunk directory will not currently build the war file (the xml query parser build file detects the absence of servlet.jar). Not sure if this is a problem currently.", 
   "TODO:", 
   "Now that the servlet jar is available in Subversion I would recommend that the other existing WAR file,\"luceneweb.war\", is changed to move much of the java code which is currently embedded in JSP files into servlet .java files. This would ensure that the build system will check that the code in this application compiles cleanly with the latest Lucene APIs - otherwise any issue will only become apparent when a user tries to run a JSP."
  ], 
  "revision_id": "712318"
 }, 
 {
  "author": "hlship", 
  "date": "2008-11-08T00:13:34.876754Z", 
  "msg": [
   "TAP5-301: When @Property generated accessor methods will overwrite user generated accessors then either warn the user or do not generate them"
  ], 
  "revision_id": "712317"
 }, 
 {
  "author": "damitha", 
  "date": "2008-11-08T00:06:39.806414Z", 
  "msg": [
   "Working on Savan errors"
  ], 
  "revision_id": "712316"
 }
]