[
 {
  "author": "gpetracek", 
  "date": "2008-11-09T15:16:51.723280Z", 
  "msg": [
   "added javadoc"
  ], 
  "revision_id": "712505"
 }, 
 {
  "author": "gpetracek", 
  "date": "2008-11-09T15:16:03.205137Z", 
  "msg": [
   "added javadoc"
  ], 
  "revision_id": "712504"
 }, 
 {
  "author": "jm", 
  "date": "2008-11-09T14:38:33.894768Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "712503"
 }, 
 {
  "author": "metskem", 
  "date": "2008-11-09T14:23:06.465571Z", 
  "msg": [
   "3.0.0-svn-3  JSPWIKI-415: Favorites not displayed properly, also added 2 JUnit tests"
  ], 
  "revision_id": "712502"
 }, 
 {
  "author": "veithen", 
  "date": "2008-11-09T14:11:56.076346Z", 
  "msg": [
   "Solved a problem with AbstractTransportListener#startListeningForService.", 
   "Problem description: When a runtime exception is thrown by the implementation of the startListeningForService (either explicitly or e.g. a NPE), it is not caught by AbstractTransportListener, but in AxisConfiguration#notifyObservers. The exception then gets logged at DEBUG level without a full stack trace. Also the service will not be disabled for the transport and not be marked as faulty.", 
   "In addition, the transports built on AbstractTransportListener behave quite differently when a problem occurs in startListeningForService:", 
   "* JMSListener marks the service as faulty and disables it for the transport.", 
   "* AbstractPollingTransportListener and AbstractDatagramTransportListener only disable the service for the transport, but will not mark it as faulty.", 
   "* FIXTransportListener only logs the error.", 
   "Changes:", 
   "* Intercept exceptions thrown by startListeningForService (including runtime exceptions) in AbstractTransportListener and take appropriate action, i.e. disable the service for the transport and mark it as faulty.", 
   "* Allow startListeningForService to throw AxisFaults, so that implementations can simply throw this exception and don't need to care themselves about disabling the service or marking it as faulty."
  ], 
  "revision_id": "712501"
 }
]