[
 {
  "author": "bentmann", 
  "date": "2008-11-14T11:51:21.222240Z", 
  "msg": [
   "[MNG-3839] XML parsing of POM does not reliably coalesce text data", 
   "o Added IT"
  ], 
  "revision_id": "713980"
 }, 
 {
  "author": "jlaskowski", 
  "date": "2008-11-14T11:37:26.609507Z", 
  "msg": [
   "Update current openejb version and disable generating unique timestamps as it has been discouraged by infra and many projects (Geronimo included). Thanks Joe Bohn!"
  ], 
  "revision_id": "713979"
 }, 
 {
  "author": "elecharny", 
  "date": "2008-11-14T11:25:15.707902Z", 
  "msg": [
   "Fixed the code accordingly to the last MINA API modification (there is no more close() method for IoSession, it has been replaced by a close(boolean) method)"
  ], 
  "revision_id": "713978"
 }, 
 {
  "author": "clement", 
  "date": "2008-11-14T11:08:05.060042Z", 
  "msg": [
   "Commit a missing file (core.xsd in the manipulator)."
  ], 
  "revision_id": "713977"
 }, 
 {
  "author": "clement", 
  "date": "2008-11-14T11:05:57.362965Z", 
  "msg": [
   "Fix issue Felix-815.", 
   "Properties becomes optional by default.", 
   "Unvalued properties are not published with the service reference until they receive a value.", 
   "Setter methods are not called until properties receive a value", 
   "Injected values in fields follow standard Java initialization (null for object and arrays, 0 for numeric types, false for boolean).", 
   "Mandatory properties can be set with the 'mandatory' attribute (supported in XML and in the annotations).", 
   "The core.xsd XML Schema is also modified to add the new attribute.", 
   "This improvement allows removing default value in properties (such as in the architecture handlers).", 
   "Provides test about this new improvement", 
   "Fix issue Felix-816", 
   "The comparator attribute is now supported for any binding policy.", 
   "Provides test about using custom comparator with any binding policy", 
   "Fix issue Felix-817", 
   "Solve an issue in the ServiceExporter when a service in unregistered twice (throws an IllegalStateException since a recent modification of the Felix framework).", 
   "Fix issue Felix-818", 
   "Implement the ServiceReferenceImpl compareTo method (method added in OSGi R4.1). This method reuse the same implementation as the Felix framework ServiceReferenceImpl method.", 
   "Remove junit4osgi embedded tests"
  ], 
  "revision_id": "713976"
 }
]