[
 {
  "author": "pquerna", 
  "date": "2008-12-05T03:34:52.793949Z", 
  "msg": [
   "Import the core parts of the DTrace patch.  This is a modified and updated", 
   "version of what was submited by Theo before:", 
   "<http://mail-archives.apache.org/mod_mbox/httpd-dev/200805.mbox/%3C6AFBCFE8-4CCA-4A02-8A43-F9170689695D@omniti.com%3E>", 
   "Note, this does not hook it up into the build system at this time, because", 
   "the original patch was a little too creative there.", 
   "Submitted By: Theo Schlossnagle <jesus omniti.com>"
  ], 
  "revision_id": "723565"
 }, 
 {
  "author": "lresende", 
  "date": "2008-12-05T03:30:17.974498Z", 
  "msg": [
   "Removing JCR support and other clean up preparing to add sample to 1.4 release"
  ], 
  "revision_id": "723564"
 }, 
 {
  "author": "etnu", 
  "date": "2008-12-05T03:01:23.294280Z", 
  "msg": [
   "Two changes to substantially reduce garbage generation:", 
   "1. Fixed a bug in the serialization of message bundles to JSON. The serialization here was effectively never cached in spite of Louis Ryan's prevous patch to do so (his patch actually made the problem worse without realizing it), which turned out to be producing around 30% of garbage in the entire system. As has been noted before, the org.json library really doesn't scale well and we should probably replace it entirely. The biggest problem is with serialization efficiency.", 
   "2. Pre-allocated the buffer used for injecting javascript features into the rendered output. This would likely have no impact on containers that always force the full set of libraries, but on other containers the savings could be substantial.", 
   "Note that this removes the no longer necessary AbstractMessageBundle. Now that custom cache implementations can be provided, it's not a needed class. Custom (non HttpFetcher) based lookup can be achieved by overriding fetch* methods."
  ], 
  "revision_id": "723563"
 }, 
 {
  "author": "dreiss", 
  "date": "2008-12-05T02:54:09.184918Z", 
  "msg": [
   "THRIFT-203. cpp: Make library headers compile under g++ -pedantic", 
   "It turns out that trailing commas in enum definitions are", 
   "not actually valid C++."
  ], 
  "revision_id": "723562"
 }, 
 {
  "author": "sobryan", 
  "date": "2008-12-05T02:14:24.368369Z", 
  "msg": [
   "* Updated Master POM Version", 
   "* Fixed Portlet Logo reference on the Bridge 2.0 site"
  ], 
  "revision_id": "723561"
 }
]