[
 {
  "author": "ramkumar", 
  "date": "2008-12-09T07:26:36.353113Z", 
  "msg": [
   "Fixes for TUSCANY-2730"
  ], 
  "revision_id": "724630"
 }, 
 {
  "author": "wtam", 
  "date": "2008-12-09T07:18:06.091231Z", 
  "msg": [
   "Merged revisions 724619 via svnmerge from", 
   "https://svn.apache.org/repos/asf/activemq/camel/trunk", 
   "........", 
   "r724619 | wtam | 2008-12-09 01:29:43 -0500 (Tue, 09 Dec 2008) | 1 line", 
   "Applied patch from Martin Krasser with thanks! [CAMEL-1037] Messages in Resequencer between 2 JMS queues get stuck", 
   "........"
  ], 
  "revision_id": "724629"
 }, 
 {
  "author": "baerrach", 
  "date": "2008-12-09T07:13:27.487876Z", 
  "msg": [
   "[MECLIPSE-509] Unavailable cache is incorrectly updated to mark sources/javadoc as not available when downloads option is not specified", 
   "- Updating of the unavailable cache is now only done if downloading was true.", 
   "[MECLIPSE-508] If base artifact does not exist then the unavailable cache was incorrectly updated", 
   "- If the base artifact can not be resolved then checking for sources and javadocs is skipped for that artifact.", 
   "[MECLIPSE-377] eclipse:eclipse -DdownloadSources=true shouldn't attempt download more than once in a multi-project", 
   "- marker files are now created if sources/javadocs could not be downloaded.  the marker file is has the same path as the sources/javadocs but with an additional suffix of \"-not-available\"", 
   "- resolveArtifactWithClassifier refactored into multiple parts", 
   "- createArtifactWithClassifier( String groupId, String artifactId, String version, String depClassifier, String inClassifier, ArtifactFactory artifactFactory )", 
   "- resolveArtifact( ArtifactResolver artifactResolver, Artifact artifact, List remoteRepos, ArtifactRepository localRepository, Log log )", 
   "- added getNotAvailableMarkerFile(ArtifactRepository localRepository, Artifact artifact)", 
   "- components.xml", 
   "- added comments to indicate it is only used for eclipse-plugin packaging.", 
   "- cleaned up phases as the default mappings are already included in the phase overlay, no need to respecify them.", 
   "- Added ITs for marker file creation on missing sources/javadocs"
  ], 
  "revision_id": "724628"
 }, 
 {
  "author": "davsclaus", 
  "date": "2008-12-09T07:04:39.940482Z", 
  "msg": [
   "CAMEL-1155, CAMEL-1160: Using ObjectHelper.notNull for testing. Fixed attributes that should be required. Fixed Spelling."
  ], 
  "revision_id": "724627"
 }, 
 {
  "author": "hossman", 
  "date": "2008-12-09T07:00:07.551569Z", 
  "msg": [
   "ASCIIFoldingFilterFactory generated by stub-analysis-factory-maker.pl"
  ], 
  "revision_id": "724626"
 }
]