[
 {
  "author": "bimargulies", 
  "date": "2008-12-14T21:42:52.174789Z", 
  "msg": [
   "Merged revisions 725681 via svnmerge from", 
   "https://svn.apache.org/repos/asf/webservices/commons/branches/modules/XmlSchema/1_4_X_BRANCH", 
   "........", 
   "r725681 | bimargulies | 2008-12-11 08:21:43 -0500 (Thu, 11 Dec 2008) | 2 lines", 
   "Fix a javadoc warning, and make site fixes that should have been in the tag. Oh well, better luck next time.", 
   "........"
  ], 
  "revision_id": "726540"
 }, 
 {
  "author": "jukka", 
  "date": "2008-12-14T21:42:06.312175Z", 
  "msg": [
   "TIKA-184: Avoid the <resource/> entry on ${basedir}", 
   "Use the copy-resources goal of maven-resources-plugin to copy the", 
   "META-INF files. This way Eclipse does not get confused."
  ], 
  "revision_id": "726539"
 }, 
 {
  "author": "tabish", 
  "date": "2008-12-14T21:37:35.727380Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQCPP-216", 
   "Add attributes to ActiveMQBlobMessage.", 
   "Also fix some typos in the API docs."
  ], 
  "revision_id": "726538"
 }, 
 {
  "author": "veithen", 
  "date": "2008-12-14T21:32:13.137652Z", 
  "msg": [
   "Improved the DOM related tests so that test cases that only refer to the JAXP and DOM APIs are executed twice: once against a standard DOM implementation (Xerces) and once against DOOM. This allows us to cross-check the validity of these tests, i.e. to check whether we are testing the right thing.", 
   "Corrected two test cases that failed with the standard DOM implementation, i.e. where we were testing the wrong thing:", 
   "1) ElementImplTest#testGetElementsbyTagNameNS: The test incorrectly assumed that the second argument to getElementsByTagNameNS is a qualified name (it is the local name).", 
   "2) TextImplTest#testSplitText: The test didn't take into account that the new node (with the remaining text) is inserted as the next sibling only if the original node had a parent (which was not the case)."
  ], 
  "revision_id": "726537"
 }, 
 {
  "author": "jcompagner", 
  "date": "2008-12-14T21:31:26.988742Z", 
  "msg": [
   "fix for session id stripper if there are no arguments in the url (?xx=yy)"
  ], 
  "revision_id": "726536"
 }
]