[
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:03:28.000000Z", 
  "msg": [
   "- the cache has been removed from this file as the Runtime is now", 
   "the central place to store assembled templates. this loader simply", 
   "retrieves a FileInputstream that is sent back to the Runtime, and", 
   "it knows how to check the source for modification, just looking", 
   "at the modification time for the file.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72709"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:01:52.000000Z", 
  "msg": [
   "- New Template Loading Mechanism", 
   "First these classes could probably use new names. What these loaders", 
   "actually do now is locate an InputStream that is passed back to", 
   "the Runtime, and the Runtime assembles the Template and caches it", 
   "there. There is now a central cache for templates in the Runtime.", 
   "This means that loader implementors only need be concerned with", 
   "1. How to get the InputStream that the particular loader deals with.", 
   "2. How to check the source of the stream for modification.", 
   "The resultant template that is created by the Velocity Runtime will", 
   "be cached in the Runtime. So the loaders can be very simple.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72708"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T01:57:28.000000Z", 
  "msg": [
   "- made the parse directive work with the new loader mechanism. now", 
   "template that are to be parsed may come from any source. the template", 
   "to be #parsed will be searched for in all the sources. so that a template", 
   "that is loaded from disc can #parse a template that is pulled a database,", 
   "and that template can #parse a template that is pulled from your toaster!", 
   ":-)", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72707"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T01:55:43.000000Z", 
  "msg": [
   "- made the include work with the new include.path property. you can", 
   "now set multiple include paths. i would like to have a caching property", 
   "set for each path so that you selectively cache templates based on", 
   "where they are located.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72706"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T01:54:36.000000Z", 
  "msg": [
   "- minor cleanup.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72705"
 }
]