[
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:18:20.000000Z", 
  "msg": [
   "- hope this is the last of it!", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72714"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:17:04.000000Z", 
  "msg": [
   "- default properties for texen."
  ], 
  "revision_id": "72713"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:16:13.000000Z", 
  "msg": [
   "- final updates that i missed.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72712"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:15:29.000000Z", 
  "msg": [
   "- a lot of changes in the runtime.", 
   "o Central template cache is now here.", 
   "o List of possible template loaders (input stream sources, really) are", 
   "initialized from the properties files. The Runtime will search all", 
   "these sources to try and find the requested template. So application", 
   "code will not have to change at all (in fact the VelocityServlet didn't", 
   "change at all while I changed the loading mechanism) in order to", 
   "draw templates from a different source. You can for example move", 
   "some of your templates to into a database and use (a non-existent)", 
   "DBTemplateLoader in conjuction with the FileTemplate loader and", 
   "your app code will not change the call to Runtime.getTemplate(X)", 
   "will have the Runtime search all the available sources and return", 
   "the template. So it is possible to use multiple template sources", 
   "at the same time.", 
   "o remove a lot of the properties that were specifically related", 
   "the the file template loader.", 
   "o a new property external.init was added to indicate the Runtime", 
   "that properties will be set from an external system that will", 
   "initialize the Runtime when it is ready :-) This is for Turbine.", 
   "This code should probably be factored out into some smaller", 
   "pieces now, it's gettting pretty big :-)", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72711"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2000-11-16T02:04:06.000000Z", 
  "msg": [
   "- some of the fields of the class have been moved into the Template", 
   "class in an attempt to make the Template a little more self-managing.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "72710"
 }
]