[
 {
  "author": "mikemccand", 
  "date": "2008-12-17T19:16:10.615878Z", 
  "msg": [
   "add comments from Doug describing how BooleanScorers work"
  ], 
  "revision_id": "727475"
 }, 
 {
  "author": "linsun", 
  "date": "2008-12-17T19:13:47.330939Z", 
  "msg": [
   "GERONIMO-4471 improve heuristic exception handling in rollback when txmanager.commit is called"
  ], 
  "revision_id": "727474"
 }, 
 {
  "author": "veithen", 
  "date": "2008-12-17T19:10:32.672315Z", 
  "msg": [
   "Refactored part of the SOAP tests so that they can be applied to both LLOM and DOM. To this end:", 
   "1) A new abstract class OMImplementation has been introduced in the API. This class defines methods to get instances of OMFactory and SOAPFactory for a given object model implementation. Implementations of this class are provided for LLOM and DOM. These implementations take into account the different lifecycle of OM factories in LLOM (stateless factories) and DOM (one factory per document). This class is similar to the existing OMAbstractFactory and DOOMAbstractFactory classes, however in OMImplementation the getXxxFactory methods are not static so that polymorphism can be used to write code that is completely agnostic of the underlying implementation.", 
   "2) The relevant tests in org.apache.axiom.soap have been renamed from xxxTest to xxxTestBase and now require an OMImplementation instance as input.", 
   "3) Subclasses (injecting the right OMImplementation instance) of these classes have been created in org.apache.axiom.soap.impl.dom and org.apache.axiom.soap.impl.llom, so that (a subset of) the abstract tests in org.apache.axiom.soap are applied to both OM implementations."
  ], 
  "revision_id": "727473"
 }, 
 {
  "author": "musachy", 
  "date": "2008-12-17T19:06:53.547409Z", 
  "msg": [
   "Add convention to plugins modules and assembly"
  ], 
  "revision_id": "727472"
 }, 
 {
  "author": "dwoods", 
  "date": "2008-12-17T19:04:49.673284Z", 
  "msg": [
   "GERONIMO-4472 Incorrect Dojo link path in OpenEJB portlet.  Thanks Ivan for the patch."
  ], 
  "revision_id": "727471"
 }
]