[
 {
  "author": "antonio", 
  "date": "2008-12-30T19:44:06.339635Z", 
  "msg": [
   "Fix onchange callback for suggestion widget."
  ], 
  "revision_id": "730220"
 }, 
 {
  "author": "hlship", 
  "date": "2008-12-30T19:43:44.883665Z", 
  "msg": [
   "TAP5-428: It should be possible to use tapestry-spring in an environment where the Spring ApplicationContext is created externally (as was the case in Tapestry 5.0)"
  ], 
  "revision_id": "730219"
 }, 
 {
  "author": "janstey", 
  "date": "2008-12-30T19:36:03.307055Z", 
  "msg": [
   "CAMEL-1041 - Added ability to customize aggregation strategy for the Splitter in Spring DSL"
  ], 
  "revision_id": "730218"
 }, 
 {
  "author": "arkurth", 
  "date": "2008-12-30T19:26:51.379932Z", 
  "msg": [
   "Updated several modules to support Windows Vista. Vista.pm has been written as a modularized OS. The other state modules have been modified to call the generic OS subroutines if they have been implemented instead of checking for OS type and then proceeding. Existing OS's should not have been affected.", 
   "DataStructure.pm: Added get_reservation_remote_ip subroutine.  This queries the database whenever called so the data is current.", 
   "Vista.pm: Added and updated many subroutines.", 
   "xCAT.pm: Added check for Vista. xCAT skips the post-load tasks if the OS is Vista. These tasks are now handled by Vista.pm's post_load subroutine, which is called by new.pm. Modified reload checking loop to always attempt to connect via ssh while waiting for the READY flag. The if statement was commented out. It had only been checking after the 2nd attempt. This was causing Vista's reload to take longer because ssh was up but the loop wasn't catching the READY flag.", 
   "new.pm: Added check to see if OS module implements a post_load subroutine and calls it. Code was added to the reserve_computer subroutine to call Vista's set_password or add_users subroutines depending on whether or not it's an imaging request.", 
   "reclaim.pm: Added check to see if OS module implements get_current_image_name and sanitize subroutines. It calls these if they're implemented instead of calling the old subroutines to delete users and close RDP. A check was added to make sure the image loaded on a node matches what's set in the computer table for the computer's current image. If they differ, a reload is performed. This currently only applies to Vista. Added insert_reload_and_exit subroutine. There is some duplicated code in process. This subroutine will eventually replace the duplicated code.", 
   "reserved.pm: Added check to see if OS module implements a grant_access subroutine. It calls this instead of calling the old subroutine to open RDP.", 
   "utils.pm: Added check for image name = vista in get_request_info so it wouldn't complain about an unsupported OS."
  ], 
  "revision_id": "730217"
 }, 
 {
  "author": "hlship", 
  "date": "2008-12-30T19:22:22.549103Z", 
  "msg": [
   "TAP5-428: It should be possible to use tapestry-spring in an environment where the Spring ApplicationContext is created externally (as was the case in Tapestry 5.0)"
  ], 
  "revision_id": "730216"
 }
]