[
 {
  "author": "bentmann", 
  "date": "2009-01-13T15:12:06.007906Z", 
  "msg": [
   "o Deleted empty directory"
  ], 
  "revision_id": "734150"
 }, 
 {
  "author": "linsun", 
  "date": "2009-01-13T15:11:10.096875Z", 
  "msg": [
   "remove my old key and add my new key"
  ], 
  "revision_id": "734149"
 }, 
 {
  "author": "kristwaa", 
  "date": "2009-01-13T14:54:09.837200Z", 
  "msg": [
   "DERBY-3907 (partial): Save useful length information for Clobs in store.", 
   "Added StringDataValue.getStreamWithDescriptor().", 
   "It it intended to be used when getting a stream from a StringDataValue to be", 
   "used with a Clob object, or with streaming of string data values in general.", 
   "The DVD is responsible for returning a correct descriptor for the raw stream.", 
   "The descriptor is in turn used by other classes to correctly configure", 
   "themselves with respect to data offsets, buffering, repositioning and so on.", 
   "Changes:", 
   "o CharacterStreamDescriptor", 
   "Added a toString method and more verbose assert-messages.", 
   "o StringDataValue", 
   "Added method 'CharacterStreamDescriptor getStreamWithDescriptor()'.", 
   "o SQLChar", 
   "Made setStream non-final so it can be overridden in SQLClob.", 
   "Added default implementation of getStreamWithDescriptor that always returns", 
   "null. This means that all non-Clob string data types will be handled as", 
   "strings instead of streams in situations where a stream is requested through", 
   "getStreamWithDescriptor.  This might be changed.", 
   "Made throwStreamingIOException protected to access it from SQLClob.", 
   "o SQLClob", 
   "Implemented getStreamWithDescriptor, handling the old 2-byte format only.", 
   "Overrid setStream to discard the stream descriptor when a new stream is set", 
   "for the DVD.", 
   "Patch file: derby-3907-4a-add_getStreamWithDescriptor.diff"
  ], 
  "revision_id": "734148"
 }, 
 {
  "author": "coheigea", 
  "date": "2009-01-13T14:53:40.564246Z", 
  "msg": [
   "Updated (and made explicit) xml-apis and xercesImpl versions in trunk/endorsed", 
   "- I checked that the tests are all good using ant and JDK 1.4.2", 
   "- There's some problem though with using maven + surefire, with not passing the java.endorsed.dirs property through"
  ], 
  "revision_id": "734147"
 }, 
 {
  "author": "rhillegas", 
  "date": "2009-01-13T14:52:09.986350Z", 
  "msg": [
   "DERBY-3988: Fix jar building targets to pull in JDBC4 datasources when the deprecated jdk16 variable is not set."
  ], 
  "revision_id": "734146"
 }
]