[
 {
  "author": "kristwaa", 
  "date": "2009-01-15T08:48:43.045300Z", 
  "msg": [
   "DERBY-3907: Save useful length information for Clobs in store.", 
   "These changes make Derby start using the stream descriptor object to", 
   "correctly handle streams from store. This is done to be able to use", 
   "several header formats, where a varying number of bytes are used.", 
   "Description of changes:", 
   "o EmbedClob", 
   "Changed constructor to take a StringDataValue instead of a", 
   "DataValueDescriptor. Updated call to the StoreStreamClob constructor.", 
   "o EmbedResultSet", 
   "Started using the getStreamWithDescriptor method and updated invocations of", 
   "the UTF8Reader constructor.", 
   "o StoreStreamClob", 
   "Added a CharacterStreamDescriptor (CSD), and made the constructor take one", 
   "as an argument. Adapted the class to use a CSD.", 
   "o UTF8Reader", 
   "Updated some comments.", 
   "Fixed bug where the header length wasn't added to the byte length of the", 
   "stream, and updated the class appropriately (adjusted utfCount, fixed the", 
   "reset routine). Made sure the header bytes are skipped (either by skipping", 
   "them in the constructor or by adjusting the position to on the next", 
   "reposition).", 
   "o ResultSetStreamTest", 
   "Added a test for maxFieldSize, where truncation have to happen.", 
   "o Various tests", 
   "Adjusted tests to run with the new implementation.", 
   "Patch file: derby-3907-5a-use_getStreamWithDescriptor.diff"
  ], 
  "revision_id": "734630"
 }, 
 {
  "author": "kristwaa", 
  "date": "2009-01-15T08:30:55.219887Z", 
  "msg": [
   "Fxied incorrect @param tag."
  ], 
  "revision_id": "734629"
 }, 
 {
  "author": "zshao", 
  "date": "2009-01-15T08:24:02.299828Z", 
  "msg": [
   "Added more files to svn:ignore."
  ], 
  "revision_id": "734628"
 }, 
 {
  "author": "zshao", 
  "date": "2009-01-15T08:15:14.701881Z", 
  "msg": [
   "HIVE-126. Don't fetch information on Partitions from HDFS instead of MetaStore. (Johan Oskarsson via zshao). Code was committed in 728771."
  ], 
  "revision_id": "734627"
 }, 
 {
  "author": "hansbak", 
  "date": "2009-01-15T08:04:41.986348Z", 
  "msg": [
   "sort bom first by sequenceId then by product number"
  ], 
  "revision_id": "734626"
 }
]