[
 {
  "author": "dkulp", 
  "date": "2009-01-26T20:31:45.574231Z", 
  "msg": [
   "Merged revisions 737817 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r737817 | dkulp | 2009-01-26 15:24:28 -0500 (Mon, 26 Jan 2009) | 2 lines", 
   "Find longest matching path for rest based stuff", 
   "........"
  ], 
  "revision_id": "737825"
 }, 
 {
  "author": "rahul", 
  "date": "2009-01-26T20:31:22.136452Z", 
  "msg": [
   "A first cut at a complete rewrite of the Commons SCXML IO package. JDK 1.6 (or, more specifically, JAXP 1.4) finally makes XML-related IO in Java somewhat usable. This rewrite is aimed to address couple of higher order points:", 
   "* Eliminate IO package external dependencies. This rewrite has no dependencies beyond the JDK (formerly, Commons Digester and thereby, Commons BeanUtils, were necessary to use the IO package). This also significantly reduces the need for reflection necessary while parsing.", 
   "* Using a pull parser instead of callback based parsing. The new parser uses the StAX API developed in JSR-173 and part of JAXP 1.4. The streaming API should be easier both on performance and memory. Some quick tests indicate that based on the SCXML document chosen, the new parser is between 10 and 25 times faster.", 
   "This commit also:", 
   "* Updates the rest of the library to use the new implementations (multiple related changes in other source files)", 
   "* Adds some missing properties (with necessary getters and setters) to the SCXML class", 
   "* Adds a basic XMLReporter implementation", 
   "* Removes the SAX ErrorReporter dependency from the utility methods for test cases", 
   "* Improves a couple of error messages", 
   "* Makes a few stylistic improvements in some test cases", 
   "The soon to be obsolete classes in the IO package (SCXMLParser and SCXMLSerializer) haven't been removed yet, though they aren't referenced by any other library or test code. Some more tests and tweaks will go into the new implementations before that happens.", 
   "Finally, odds and ends:", 
   "* There is a bug in the JAXP 1.4 XMLOutputFactory API that makes it impossible to load a custom factory without more magic. The SCXMLWriter class can't allow for this facility until the bug is addressed.", 
   "* There seems to be no portable way to pretty print using the JAXP 1.4 XMLStreamWriter. As a result, a second pass transform (javax.xml.transform) is performed if pretty printing is needed. The default is to not pretty print.", 
   "* A package scoped Constants class is probably called for (some redundancy there ATM).", 
   "* Some TODOs in code."
  ], 
  "revision_id": "737824"
 }, 
 {
  "author": "", 
  "date": "2009-01-26T20:28:38.310776Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "737823"
 }, 
 {
  "author": "", 
  "date": "2009-01-26T20:26:28.773293Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "737822"
 }, 
 {
  "author": "", 
  "date": "2009-01-26T20:26:05.513996Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "737821"
 }
]