[
 {
  "author": "dogacan", 
  "date": "2009-01-28T11:33:20.866271Z", 
  "msg": [
   "NUTCH-571 - parse-mp3 plugin doesn't always index album of mp3. Patch", 
   "by Joseph Chen."
  ], 
  "revision_id": "738455"
 }, 
 {
  "author": "davidb", 
  "date": "2009-01-28T11:22:25.535557Z", 
  "msg": [
   "Refactored system tests so that they actually take the files from the (multi|single) bundle distribution directory and exercise these."
  ], 
  "revision_id": "738454"
 }, 
 {
  "author": "jeremias", 
  "date": "2009-01-28T11:10:51.843517Z", 
  "msg": [
   "Moved MonochromeBitmapConverter from PCL to utility package for later reuse in AFP.", 
   "Moved BitmapImageUtil to a subpackage under util.", 
   "Added support for creating (hard) page segments for images when working in bi-level mode. Include Image Object (IOB) is a newer feature and not supported everywhere. Since page segments cannot be scaled, they have to be generated for each distinctive target size.", 
   "Bugfix: Reduced maximum chunk sizes for GraphicsData and ImageObject to conform to interchange set 1.", 
   "Bugfix: Removed PresentationSpaceResetMixingTriplet which is not allowed in interchange set 1.", 
   "Bugfix: Removed invalid byte in IDE Structure Parameter.", 
   "Added support for creating FS10 images for bi-level bitmaps for better interoperability.", 
   "Disabled optional and unnecessary name in ImageSegment. This name is never referenced.", 
   "Refactored environment groups a bit to avoid duplicate data structures due to subclassing.", 
   "Added explicit MappingOptionTriplet for image scaling."
  ], 
  "revision_id": "738453"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-01-28T11:03:20.722739Z", 
  "msg": [
   "Add geolocation screens to Facility ContactMechs, FacilityLocation and FixedAsset + miscellaneous enhancements, also in data.", 
   "I have began to refactor toward putting as much as possible geolocation artifacts in framework/common with the idea of creating an applications/common component where all shared (transversal) features/artifacts would be. More explanations on dev ML soon...", 
   "There is also an unused taxAuthorityVATReport request/view-map in accounting controller (part of another task I slowly work on)"
  ], 
  "revision_id": "738452"
 }, 
 {
  "author": "deweese", 
  "date": "2009-01-28T11:03:08.586711Z", 
  "msg": [
   "Fix and NPE when setting an 'unknown' animated attribute"
  ], 
  "revision_id": "738451"
 }
]