[
 {
  "author": "fmeschbe", 
  "date": "2009-01-28T09:13:50.307841Z", 
  "msg": [
   "SLING-844 Try to set the cause of the ScriptException"
  ], 
  "revision_id": "738410"
 }, 
 {
  "author": "vajda", 
  "date": "2009-01-28T09:09:00.098202Z", 
  "msg": [
   "reworded paragraphs about mailing lists"
  ], 
  "revision_id": "738409"
 }, 
 {
  "author": "kristwaa", 
  "date": "2009-01-28T09:03:41.185733Z", 
  "msg": [
   "DERBY-3907: Save useful length information for Clobs in store.", 
   "Enabled the new header format for Clobs.", 
   "Description:", 
   "o ClobStreamHeaderGenerator", 
   "Enabled the callback mechanism to inform the DVD about whether the database", 
   "is accessed in soft upgrade mode or not.", 
   "o SQLChar", 
   "Added method writeClobUTF, which writes a Clob to the on-disk format.", 
   "Added method readExternalClobFromArray.", 
   "o SQLClob", 
   "Added a variable to tell if the database is accessed in soft upgrade mode", 
   "or not. It is used to reduce object creation (header generators) and to", 
   "avoid consulting the data dictionary as much. It requires that the DVDs are", 
   "reused, and I'm sure this can be further optimized.", 
   "Implemented getLength, which returns the length of the Clob in one of", 
   "three ways:", 
   "1) Delegate to SQLChar if the Clob has been materialized.", 
   "2) Read length from stream header if present.", 
   "3) Decode the whole stream.", 
   "Updated getStreamWithDescriptor to deal with both header formats.", 
   "Made restoreToNull nullify the character stream descriptor.", 
   "Implemented writeExternal.", 
   "Implemented getStreamHeaderGenerator, which will return one of two shared", 
   "generator instances it is known if the database is accessed in soft upgrade", 
   "mode or not. If unknown, a new generator instance is created, which will", 
   "determine the mode when the header is asked for.", 
   "Implemented investigateHeader, which decodes a stream header.", 
   "Implemented readExternal.", 
   "Implemented readExternalFromArray.", 
   "Implemented utility method rewindStream, which resets the stream and skips", 
   "the number of characters specified.", 
   "Added a utility class for holding header information (currently only length).", 
   "o StreamHeaderHolder", 
   "Deleted the class, it is no longer used.", 
   "NOTE: Databases created with this revision (or later) containing Clobs, cannot", 
   "be accessed by earlier trunk revisions.", 
   "Patch file: derby-3907-7a3-use_new_header_format.diff"
  ], 
  "revision_id": "738408"
 }, 
 {
  "author": "sabob", 
  "date": "2009-01-28T09:02:49.039475Z", 
  "msg": [
   "updated release date"
  ], 
  "revision_id": "738407"
 }, 
 {
  "author": "zshao", 
  "date": "2009-01-28T08:55:17.296625Z", 
  "msg": [
   "HIVE-255. Propagate user name to Hive metastore. (Prasad Chakka via zshao)"
  ], 
  "revision_id": "738406"
 }
]