[
 {
  "author": "janstey", 
  "date": "2009-01-30T17:22:29.675602Z", 
  "msg": [
   "CAMEL-1299 - Add property language for extracting exchange properties"
  ], 
  "revision_id": "739340"
 }, 
 {
  "author": "hibou", 
  "date": "2009-01-30T17:22:09.324195Z", 
  "msg": [
   "First step towards the build of an updatesite by Hudson for both Ivy and IvyDE"
  ], 
  "revision_id": "739339"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-01-30T17:21:21.931402Z", 
  "msg": [
   "VCL-56", 
   "Changed 'use English;' to 'use English qw( -no_match_vars );' in vcld. Documentation for the English module states this improves performance.", 
   "VCL-71", 
   "Reworked REAPER and HUNTSMAN in vcld. HUNTSMAN was killing all child processes under some circumstances. If kill is issued without -9, any VCL process would attempt to kill all of the child processes of the parent vcld process. I removed this capability all together for safety. Kill or kill -9 now only kills the specified process. REAPER was modified to correctly handle the exit status of the process which was reaped. It had not been setting $? correctly if wait() reaped a process. I also changed the wait() command to waitpid() per recommendations in the Perl books.", 
   "VCL-72", 
   "Added die_handler and warning_handler subroutines. These catch die and warning signals which weren't caught at all before. A die signal could happen if any part of the code attempted to call an undefined subroutine. When this occurred, the process would exit without sending a notification via notify(). The die_handler subroutine causes a critical message to be sent. The warning_handler subroutine causes warning messages to be logged via notify() when a notify signal occurs.", 
   "Made some other minor spelling corrections to vcld."
  ], 
  "revision_id": "739338"
 }, 
 {
  "author": "slaws", 
  "date": "2009-01-30T17:17:55.862509Z", 
  "msg": [
   "Comment out the change to generate eclipse project files as to make this work you need to make the distribution a jar project which it isn't really. As per mail list exchange we will just \"open\" the target file using the Eclipse menus."
  ], 
  "revision_id": "739337"
 }, 
 {
  "author": "angela", 
  "date": "2009-01-30T17:06:36.719115Z", 
  "msg": [
   "- JCR-1958: Enhanced JCR remoting (work in progress)"
  ], 
  "revision_id": "739336"
 }
]