[
 {
  "author": "luc", 
  "date": "2009-02-01T21:13:55.325323Z", 
  "msg": [
   "added a PolynomialsUtils class providing factory methods for", 
   "Chebyshev, Hermite, Laguerre and Legendre polynomials", 
   "the code was extracted from mantissa and modified"
  ], 
  "revision_id": "739840"
 }, 
 {
  "author": "bmbouter", 
  "date": "2009-02-01T21:12:28.956876Z", 
  "msg": [
   "VCL-29", 
   "This patch reworks how the module discovers the private IP address of VMs that it provisions to ESX and ESX 3i hosts.  Specifically, it implements the following new work flow:", 
   "1)  Create the VM on the hypervisor, but DO NOT specify any mac addresses", 
   "2)  Power on the VM", 
   "3)  Ask the hypervisor, what the MAC address is of the eth0 (private) interface of the vm just provisioned", 
   "4)  Watch the arp table of the management module for the dhcp address handed back to the VM when it's eth0 does the required dhcp request.", 
   "5)  Delete the old entry from /etc/hosts for the VM", 
   "6)  Add the new entry to /etc/hosts so that VCL can resolve this VM's hostname for account setup, etc...", 
   "This simplifies the setup significantly by removing the following three manual, per-vm steps:", 
   "1)  Manual setting of eth0 mac address in database", 
   "2)  Manual configuration of that same eth0 mac in the the management module's dhcpd.conf", 
   "3)  Manual addition of IP/hostname pair to /etc/hosts file", 
   "The documentation (esx.README) has been simplified and updated as a result"
  ], 
  "revision_id": "739839"
 }, 
 {
  "author": "wrowe", 
  "date": "2009-02-01T21:10:47.520115Z", 
  "msg": [
   "The binary win32 installer copies pcre.dll"
  ], 
  "revision_id": "739838"
 }, 
 {
  "author": "bentmann", 
  "date": "2009-02-01T21:10:29.714204Z", 
  "msg": [
   "o Decoupled ITs from production plugins/deps"
  ], 
  "revision_id": "739837"
 }, 
 {
  "author": "luc", 
  "date": "2009-02-01T21:06:55.718860Z", 
  "msg": [
   "fixed an error introduced by a recent change in PolynomialsFunction", 
   "(the coefficients array is automatically reduced if high degree coefficients are null)"
  ], 
  "revision_id": "739836"
 }
]