[
 {
  "author": "hairong", 
  "date": "2009-02-02T19:09:09.301723Z", 
  "msg": [
   "Merge -r 740076:740077 to move the change of HADOOP-5009 from main t0 branch 0.20."
  ], 
  "revision_id": "740080"
 }, 
 {
  "author": "srowen", 
  "date": "2009-02-02T19:07:57.461577Z", 
  "msg": [], 
  "revision_id": "740079"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-02-02T19:05:02.198442Z", 
  "msg": [
   "VCL-75", 
   "Added check throughout utils.pm where $? is used. If an external command is executed and $? gets set to -1, the exit status is assumed to be 0. This is encountered with Perl 5.8.0 because a bug in SIGCHLD signal handling causes $? to be incorrectly set to -1.", 
   "VCL-20", 
   "Added conditions in utils.pm::run_ssh_command and utils.pm::run_scp_command to attempt the command a 4th time using port 24 if the command failed 3 times. The code assumes port 22 is used but some managment nodes use port 24. This is a temporary fix until a better solution is designed.", 
   "VCL-56", 
   "Added 'use English qw( -no_match_vars );' to xCAT.pm. This allows the friendly $PID variable to be used.", 
   "Other - xCAT.pm", 
   "Changed a few WARNING notify() messages in xCAT.pm to OK messages. Warnings were not necessary. Added a CRITICAL notify() message to xCAT.pm if rinstall fails on the first attempt. This allows an administrator to watch the 2nd attempt and have a chance to troubleshoot. Also added an NCSU-specific fix to legacy code in xCAT.pm. One of NCSU's management nodes is configured differently for Linux images.", 
   "Other - new.pm", 
   "Changed 1 CRITICAL notify() message to WARNING. This reduces redundant messages being sent when a reservation fails."
  ], 
  "revision_id": "740078"
 }, 
 {
  "author": "hairong", 
  "date": "2009-02-02T19:03:12.518554Z", 
  "msg": [
   "HADOOP-5034. NameNode should send both replication and deletion requests to DataNode in one reply to a heartbeat. Contributed by Hairong Kuang."
  ], 
  "revision_id": "740077"
 }, 
 {
  "author": "janstey", 
  "date": "2009-02-02T18:54:58.351376Z", 
  "msg": [
   "CAMEL-1173 - Add some snippets for wiki entry"
  ], 
  "revision_id": "740076"
 }
]