[
 {
  "author": "jeremias", 
  "date": "2009-02-05T15:01:36.597328Z", 
  "msg": [
   "Merge from Trunk revisions 740276 - 741103.", 
   "Hooked in the new AFP resource level defaults into the IF-size of the image handlers."
  ], 
  "revision_id": "741120"
 }, 
 {
  "author": "jacopoc", 
  "date": "2009-02-05T15:01:34.915650Z", 
  "msg": [
   "Fix to avoid the test to fail after recent change to \"system\" seed data.", 
   "By the way: is it correct to have a test rely on demo data like this one?"
  ], 
  "revision_id": "741119"
 }, 
 {
  "author": "mamta", 
  "date": "2009-02-05T14:58:09.922406Z", 
  "msg": [
   "The change here is getting committed for DERBY-4048", 
   "DERBY-269 provided a new stored procedure SYSCS_UTIL.SYSCS_UPDATE_STATISTICS to update the statistics. The code to do the work was added in AlterTableConstantAction and the name of new method in that class is updateStatistics(Activation activation). This code was copied from an existing unused class execute/UpdateStatisticsConstantAction.java(that unused class has been removed from Derby code).", 
   "The copied code in AlterTableConstantAction:updateStatistics gets compile transaction to do the work of updating the statistics. Instead, we should be using execute transaction because we are not in the compile phase. The rest of the code in AlterTableConstantAction uses execute transaction.", 
   "I ran into this issue of getTransactionExecute vs getTransactionCompile while working on DERBY-3788 (provide a zero-admin way of updating the statistics). While trying to run the statistics inline during the compile phase of a SELECT query, I ran into exception that statistics can't be updated because we are in read-only mode. But if I change the AlterTableConstantAction to use getTransactionExecute, then I do not run into the read-only mode exception."
  ], 
  "revision_id": "741118"
 }, 
 {
  "author": "nbubna", 
  "date": "2009-02-05T14:56:53.505077Z", 
  "msg": [
   "call this 2.0-dev and bump to jdk 1.5"
  ], 
  "revision_id": "741117"
 }, 
 {
  "author": "cziegeler", 
  "date": "2009-02-05T14:54:21.700077Z", 
  "msg": [
   "FELIX-918 : Add utility method for making relative redirects absolute."
  ], 
  "revision_id": "741116"
 }
]