[
 {
  "author": "bayard", 
  "date": "2009-02-06T06:10:54.450601Z", 
  "msg": [
   "Changing the Files parameter of '*' from a return null to throwing UnsupportedOperationException."
  ], 
  "revision_id": "741425"
 }, 
 {
  "author": "jonesde", 
  "date": "2009-02-06T06:04:58.313896Z", 
  "msg": [
   "Cleanup and pretty-up a bunch of log statements; moved some less helpful ones to verbose, combined some, and generally tried to make logs in various places more user friendly"
  ], 
  "revision_id": "741424"
 }, 
 {
  "author": "jonesde", 
  "date": "2009-02-06T06:03:06.190431Z", 
  "msg": [
   "Some playing with simple-method cleanup, inventory quantities service now doesn't have to distinguish between serialized and non-serialized, and using some new UEL stuff instead of calculate op"
  ], 
  "revision_id": "741423"
 }, 
 {
  "author": "jfaath", 
  "date": "2009-02-06T05:58:32.350057Z", 
  "msg": [
   "The following changes were made:", 
   "-UddiEntityPublisher no longer has persistent KeyGen collection", 
   "-Logic in UddiEntityPublisher changed to dynamically find a publisher's key generators", 
   "-Detached the publisher reference from UddiEntity class, now this class simply contains the non-nullable authorizedName", 
   "-Publisher keys no longer are required to be prefixed by the root partition, they can provide their own domain key", 
   "-Authentication split into two phases: authenticate and identify", 
   "-Authenticators adjusted to account for new phases", 
   "-JUDDIAuthenticator is new default Authenticator, authenticates based on Publisher entity", 
   "-Install process adjusted to account for above changes", 
   "-Tests and test files adjusted to account for above changes"
  ], 
  "revision_id": "741422"
 }, 
 {
  "author": "bayard", 
  "date": "2009-02-06T05:55:47.931746Z", 
  "msg": [
   "Removing the Ant build. Given that it's generated from Maven1, and we no longer have that, I don't see any reason to spend time trying to keep it synced with the Maven2 pom.xml."
  ], 
  "revision_id": "741421"
 }
]