[
 {
  "author": "wsmoak", 
  "date": "2009-02-13T17:42:38.479401Z", 
  "msg": [
   "[CONTINUUM-2073] Add the derbytools jar as described in the Tomcat install docs.  Use a separate resources directory for pom-it.xml tests."
  ], 
  "revision_id": "744190"
 }, 
 {
  "author": "sobryan", 
  "date": "2009-02-13T17:41:49.867577Z", 
  "msg": [
   "TRINIDAD-1376: NullPointerException because RequestContext released after action request.", 
   "TRINIDAD-1377: ActionRequest not properly detected.", 
   "TRINIDAD-1351: On a redirect the URL is not being properly encoded for portals.", 
   "TRINIDAD-1383: Update to support latest changes in portlet-bridge.", 
   "This patch fixes the above Portal related bugs for Trinidad.  Here is what was done:", 
   "* The portlet bridge api was added to the Trinidad API project which now uses the bridge's @ExcludeFromManagedRequestScope annotaton on the RequestStateMap", 
   "* Added a new RequestStateMap utility that has a request map which spans one action request and the following render request.  Most of the configurator state was enhanced to use this map.", 
   "* Fixed a problem in ExternalContextUtils where it was incorrectly identifying action requests in a portal environment if the RenderRequest was a subclass of the ServletRequest object", 
   "* Fixed an encoding issue before the redirect in the CoreRenderkit", 
   "Thanks to Felix, Robert, and Nathan for finding these issues, submitting patches, and helping to test the final fixes."
  ], 
  "revision_id": "744189"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2009-02-13T17:34:26.010915Z", 
  "msg": [
   "o update to latest build api and correcting packages"
  ], 
  "revision_id": "744188"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-02-13T17:28:35.504139Z", 
  "msg": [
   "QPID-1663 Disable WsDmAdapterTest until we can resolve problems"
  ], 
  "revision_id": "744187"
 }, 
 {
  "author": "lhazlewood", 
  "date": "2009-02-13T17:28:10.570193Z", 
  "msg": [
   "Added a quick fix to extract out the ivy base repository url in case that needs to be overridden (e.g. when using a company internal repository proxy)"
  ], 
  "revision_id": "744186"
 }
]