[
 {
  "author": "enolan", 
  "date": "2009-02-16T12:24:36.342228Z", 
  "msg": [
   "Log: Logging Pojo in Servicemix-bean should add capability to switch off checking for maximum message display size", 
   "https://issues.apache.org/activemq/browse/SMX4-197"
  ], 
  "revision_id": "744905"
 }, 
 {
  "author": "nilgun", 
  "date": "2009-02-16T12:12:51.106505Z", 
  "msg": [
   "update transformation"
  ], 
  "revision_id": "744904"
 }, 
 {
  "author": "nilgun", 
  "date": "2009-02-16T12:10:24.654430Z", 
  "msg": [
   "some modifications to generate the man pages in other languages"
  ], 
  "revision_id": "744903"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-02-16T12:04:55.437136Z", 
  "msg": [
   "As suggested in dev ML:", 
   "Currently the 'historic\" promotions (PPIP_ORST_HIST,  PPIP_ORST_YEAR, PPIP_ORST_LAST_YEAR) do not include taxes in their calculation", 
   "which uses remainingSubTotal. But, for B2C, in countries which are used to (or must) show prices with taxes (most of countries using", 
   "VAT I guess), the price the client effectively pay is taxes included (the final client will never get back taxes paid, contrary to", 
   "B2B case). So I propose to introduce a new field in ProductStore, namely includeTaxInRemainingSubTotal. If this field is set to Yes,", 
   "then in the calculation of remainingSubTotal (done in service resetGrandTotal), the taxes will be included.", 
   "Actually my question is : in order to minize the number of fields and keep them consistent maybe we could simply use", 
   "showPricesWithVatTax. It could be argued though that we really need to create the new field includeTaxInRemainingSubTotal in order", 
   "to be able to deal with B2B case. But maybe it's no really needed because we set the field showPricesWithVatTax to Yes for the same", 
   "basic reason that bring us to include taxes in remainingSubTotal calculation."
  ], 
  "revision_id": "744902"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-02-16T12:02:51.463176Z", 
  "msg": [
   "Better French labels"
  ], 
  "revision_id": "744901"
 }
]