[
 {
  "author": "antelder", 
  "date": "2009-02-17T12:05:34.310878Z", 
  "msg": [
   "Start to bring up the binding.jsonrpc model (based on code from scacontrib folder)"
  ], 
  "revision_id": "744985"
 }, 
 {
  "author": "kahatlen", 
  "date": "2009-02-17T12:05:13.205132Z", 
  "msg": [
   "DERBY-4027: An attempt was made to access an out of range slot on a page", 
   "When a new value is inserted into an index backing a nullable unique", 
   "constraint, a check is performed to verify that the adjacent slots do", 
   "not contain the same value as the one being inserted. This extra check", 
   "is needed because the index backing such a constraint is not unique", 
   "(it allows multiple NULL values).", 
   "If the spot on which the new value is inserted is at the beginning or", 
   "the end of the index page, the last value of the previous page or the", 
   "first value of the next page is checked. Currently, the code attempts", 
   "to read that value right after the slot pointer has been moved to that", 
   "page. This was the cause of the bug, as that page may be empty, and", 
   "any pointer to a slot on an empty page is pointing to a non-existent", 
   "slot, hence the out-of-range-slot error.", 
   "This patch fixes the bug by checking again after moving to another", 
   "page that we are attempting to read a valid row. If not, we skip to", 
   "the next (or previous, depending on the direction of the traversal)", 
   "index page in the chain and look for a duplicate there."
  ], 
  "revision_id": "744984"
 }, 
 {
  "author": "gtully", 
  "date": "2009-02-17T12:04:57.099068Z", 
  "msg": [
   "resolve AMQ-2111, only the network subscription that causes the initial subscription needs to be tracked as this is the one that will be propagated via an advisory to the rest of the network. The existing update was making a mod to a possibly inflight advisory message"
  ], 
  "revision_id": "744983"
 }, 
 {
  "author": "antelder", 
  "date": "2009-02-17T12:04:32.850227Z", 
  "msg": [
   "Start to bring up the implementation.web model (based on code in 1.x)"
  ], 
  "revision_id": "744982"
 }, 
 {
  "author": "andyj", 
  "date": "2009-02-17T12:03:11.215541Z", 
  "msg": [
   "See if Apache SVN can be bothered to reply. Oh, think this change was about newOrderXXX/setOrderXXX but it was some time ago"
  ], 
  "revision_id": "744981"
 }
]