[
 {
  "author": "veithen", 
  "date": "2009-03-03T21:55:51.269816Z", 
  "msg": [
   "- Added a getMetaFactory() method to OMAbstractFactory that returns the default OMMetaFactory instance as specified by the \"org.apache.axiom.om.OMMetaFactory\" system property (defaults to LLOM).", 
   "- Changed getOMFactory, getSOAP11Factory and getSOAP12Factory to use getMetaFactory and to delegate to the OMMetaFactory instance.", 
   "- Changed the OSGi support to inject only the OMMetaFactory component.", 
   "In addition to simplifying the code and providing a way to get the default OMMetaFactory, these changes have two implications:", 
   "- The system properties \"om.factory\", \"soap11.factory\" and \"soap12.factory\" are no longer supported. Added appropriate documentation for this in the Maven site. Note that we could easily add code that ensures backward compatibility if this is really needed.", 
   "- They solve the issue that OMFactory and SOAPFactory objects may be stateful: OMAbstractFactory now delegates to the default OMMetaFactory instance which can decide to return a new factory instance every time. This was not possible with the old implementation."
  ], 
  "revision_id": "749780"
 }, 
 {
  "author": "gcrawford", 
  "date": "2009-03-03T21:55:37.068625Z", 
  "msg": [
   "TRINIDAD-1407 DateTimeConverter doesn't convert correctly as per the expectedDataType", 
   "check for an expectedType of null as well as Object"
  ], 
  "revision_id": "749779"
 }, 
 {
  "author": "gcrawford", 
  "date": "2009-03-03T21:55:13.730198Z", 
  "msg": [
   "TRINIDAD-1407 DateTimeConverter doesn't convert correctly as per the expectedDataType", 
   "check for an expectedType of null as well as Object"
  ], 
  "revision_id": "749778"
 }, 
 {
  "author": "gcrawford", 
  "date": "2009-03-03T21:54:49.741777Z", 
  "msg": [
   "TRINIDAD-1407 DateTimeConverter doesn't convert correctly as per the expectedDataType", 
   "check for an expectedType of null as well as Object"
  ], 
  "revision_id": "749777"
 }, 
 {
  "author": "rickhall", 
  "date": "2009-03-03T21:54:08.468560Z", 
  "msg": [
   "Felix implementation of the framework factory for META-INF/services."
  ], 
  "revision_id": "749776"
 }
]