[
 {
  "author": "gnodet", 
  "date": "2009-03-10T12:50:11.762764Z", 
  "msg": [
   "SMXCOMP-474: Regression introduced in servicemix-jms default consumer which does not rollback the transactions by default when an exchange with an ERROR status comes back"
  ], 
  "revision_id": "752095"
 }, 
 {
  "author": "bentmann", 
  "date": "2009-03-10T12:40:02.423146Z", 
  "msg": [
   "o Fixed resolution of system-scope plugin dependencies"
  ], 
  "revision_id": "752094"
 }, 
 {
  "author": "eglynn", 
  "date": "2009-03-10T12:39:18.592108Z", 
  "msg": [
   "Fix for singlebundle.ListenerHookServiceListenerTest failure caused by inadvertant multiple loading of the DSW bundle."
  ], 
  "revision_id": "752093"
 }, 
 {
  "author": "aconway", 
  "date": "2009-03-10T12:34:49.589546Z", 
  "msg": [
   "Add missing #includes to build with gcc 4.4."
  ], 
  "revision_id": "752092"
 }, 
 {
  "author": "ate", 
  "date": "2009-03-10T12:28:03.258267Z", 
  "msg": [
   "PLUTO-537: Cleaning up Pluto packages", 
   "See: https://issues.apache.org/jira/browse/PLUTO-537", 
   "- move PortletRegistryService, PortletContextService and PortalAdministrationService to new o.a.p.container.driver.PortalDriverServices (these are not used/needed by the container)", 
   "- remove usage of PortletInfoService from ResourceBundleFactory and move \"injecting\" window specific PortletInfo to PortletConfigImpl internal (same as DefaultPortletInfoService impl)", 
   "As a PortletConfigImpl is portal specific anyway, overriding/implementing an alternative \"window\" PortletInfo is easily customizable.", 
   "The great benefit of removing this usage of the PortletInfoService is that now the PortletContainerInvocationService is no longer needed (and thus no ThreadLocals either)", 
   "The usage of the PortletContainerInvocationService for this purpose was dubious in the first place (only called on first access to the PortletConfig.getResourceBundle(locale)).", 
   "Coming up: removal of PortletContainerinvocationService and PortletInfoService"
  ], 
  "revision_id": "752091"
 }
]