[
 {
  "author": "jvanzyl", 
  "date": "2001-08-30T13:29:47.000000Z", 
  "msg": [
   "- work around the $generator.templatePath reference in templates where", 
   "texen is being run from a JAR file.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "75249"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-08-30T13:28:53.000000Z", 
  "msg": [
   "- grabbing a properties file in the same way that torque does by", 
   "using $generator.templatePath and making sure templates using this", 
   "method work from a JAR file.", 
   "these are hacks for now because i didn't have the foresight to see", 
   "that torque would eventually be used completely from a JAR. we have", 
   "to deprecate the use of $generator.templatePath but these hacks work", 
   "around them being in templates for now. i want torque to work in JAR", 
   "files but i don't want to change the templates."
  ], 
  "revision_id": "75248"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-08-29T17:00:53.000000Z", 
  "msg": [
   "- will fix the velocity tests, the test.jar for the texen-classpath", 
   "test was pointing to a temporary jar and not to the one in the test", 
   "directory.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "75247"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-08-29T16:41:53.000000Z", 
  "msg": [
   "- making changes to allow taking values from a properties file that", 
   "lives on the classpath. all in an attempt to make torque work", 
   "from a JAR."
  ], 
  "revision_id": "75246"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2001-08-29T16:37:08.000000Z", 
  "msg": [
   "- pull in a properties file, we will now allow a properties file to", 
   "be specified somewhere in the template path or classpath. we will", 
   "preserve the original behaviour because people might be pulling", 
   "properties files from anywhere, but we will move toward having the", 
   "props used for generation somewhere in the template path or class", 
   "path. this will help with generation being performed with everything", 
   "in a JAR.", 
   "the way the db.props files are set up in torque makes working from", 
   "a JAR not possible right now, but i will fix this today."
  ], 
  "revision_id": "75245"
 }
]