[
 {
  "author": "markt", 
  "date": "2009-03-13T18:41:33.889788Z", 
  "msg": [
   "Fix DBCP-284. Use getter rather than access field directly."
  ], 
  "revision_id": "753340"
 }, 
 {
  "author": "jfthomps", 
  "date": "2009-03-13T18:40:59.844197Z", 
  "msg": [
   "VCL-90", 
   "utils.php:", 
   "-modified isAvailable to have an additional optional argument named forimaging that, when set, will only allocate a single computer for images that have subimages instead of allocating the whole cluster", 
   "-modified getUserRequests:", 
   "-added forcheckout as a returned index", 
   "-fixed bug in query for subreservations where $id was set to user's numeric id", 
   "-only restrict primary query to include 'forcheckout = 1' when $type = 'normal'", 
   "-added array to track fetched requests so that don't duplicate requests for cluster reservations", 
   "requests.php:", 
   "-modified viewRequests: added check to keep requests with forcheckout and forimaging both set to 0 from being displayed (may never happen anyway)", 
   "-modified viewRequestInfo, editRequest, confirmEditRequest, confirmDeleteRequest, and submitDeleteRequest to set $reservation in a way that works with cluster reservations", 
   "-modified editRequest to not print option to save/update image if request is an imaging reservation", 
   "images.php:", 
   "-modified submitCreateImage to call isAvailable with new forimgaging argument"
  ], 
  "revision_id": "753339"
 }, 
 {
  "author": "dkulp", 
  "date": "2009-03-13T18:35:12.474467Z", 
  "msg": [
   "[CXF-2112] Fix from Alessio Soldano applied"
  ], 
  "revision_id": "753338"
 }, 
 {
  "author": "bryanduxbury", 
  "date": "2009-03-13T18:28:40.042305Z", 
  "msg": [
   "THRIFT-368. java: setFieldValue should allow nulls for all field types", 
   "After this patch, setFieldValue will treat a set with a null as an unset."
  ], 
  "revision_id": "753337"
 }, 
 {
  "author": "nbubna", 
  "date": "2009-03-13T18:27:05.847129Z", 
  "msg": [
   "VELOCITY-704 document changes (merge from trunk)"
  ], 
  "revision_id": "753336"
 }
]