[
 {
  "author": "akarasulu", 
  "date": "2009-03-25T03:29:22.528081Z", 
  "msg": [
   "fixing breakage after moving several interfaces into core-service-api"
  ], 
  "revision_id": "758135"
 }, 
 {
  "author": "ate", 
  "date": "2009-03-25T03:24:47.229873Z", 
  "msg": [
   "One big *initial* commit for primarily JS2-938: Create flyweight PortletWindow instances for each request, the handle to access and store all portlet interaction data and drop the PortletEntityImpl usage", 
   "See: http://issues.apache.org/jira/browse/JS2-938", 
   "WARNING: this commit (together with the shortly following second commit, see further below)", 
   "will *NOT* bring the trunk back in runnable status yet", 
   "but at least it will be compilable again.", 
   "I have done zero testing yet and for one the Spring assembly definitely isn't completely updated yet.", 
   "And, as an initial commit, there WILL be coding errors and oversights for sure, so all please help out reviewing and fixing as much as possible.", 
   "This big bang commit delivers the following changes:", 
   "- all Window cache handling has been removed, just as the WindowAccessor usage", 
   "- For Thread managment and synchronization, now only two thread locals are used:", 
   "- one to keep reference to the main (portal) request RequestContext", 
   "- one for each render job thread PortletWindow", 
   "- All PortletWindow related state, including the attributes are now stored and managed only through the PortletWindow", 
   "- The CommonWorkerContext and all related conditional parallel rendering logic has now been removed (as being no longer needed)", 
   "- PortletWindow now also implements *pluto* PortletEntity but that is a candidate for removal also IMO (I've added a String getEntityId() method on PortletWindow just in case)", 
   "- PortletEntityImpl and its Broker are still there but nowhere used anymore except in the JetspeedSerializer and through the Ajax API (needs separate cleaning up)", 
   "And, also, some further wiring of the Pluto container, specifically the PortletRequest/Response*Context implementations for JS2-871", 
   "See: http://issues.apache.org/jira/browse/JS2-871", 
   "Finally, a second commit will follow shortly (which also will bring the current trunk back to compilable status),", 
   "concerning JS2-939: Portlet URL/Navigation State JSR-286 Portlet API 2.0 Support, and specifically the public render parameter handling.", 
   "I've split off that part of my commit to allow easier review by Randy so that those changes don't get \"lost\" in this big bang commit..."
  ], 
  "revision_id": "758134"
 }, 
 {
  "author": "simoneg", 
  "date": "2009-03-25T02:55:31.789121Z", 
  "msg": [
   "LABS-313 : when possible use java parameter names as producer parameter name."
  ], 
  "revision_id": "758133"
 }, 
 {
  "author": "eyang", 
  "date": "2009-03-25T02:42:20.363410Z", 
  "msg": [
   "CHUKWA-36.  Fixed rpm target for packaging ivy downloaded libraries."
  ], 
  "revision_id": "758132"
 }, 
 {
  "author": "sebb", 
  "date": "2009-03-25T02:27:59.921743Z", 
  "msg": [
   "Add rudimentary JUnit scripting engine and tests"
  ], 
  "revision_id": "758131"
 }
]