[
 {
  "author": "gawor", 
  "date": "2009-03-25T04:27:37.715319Z", 
  "msg": [
   "regenerated axis2 jars with fixes for AXIS2-4279"
  ], 
  "revision_id": "758140"
 }, 
 {
  "author": "zshao", 
  "date": "2009-03-25T04:24:36.606713Z", 
  "msg": [
   "HIVE-349. Fix TestCliDriver when there are test cases with no tasks. (Suresh Antony via zshao)"
  ], 
  "revision_id": "758139"
 }, 
 {
  "author": "mrglavas", 
  "date": "2009-03-25T04:15:15.516851Z", 
  "msg": [
   "JIRA Issue #1351:", 
   "http://issues.apache.org/jira/browse/XERCESJ-1351", 
   "Significant improvements to the Type Alternatives Implementation by Hiranya Jayathilaka.", 
   "In particular the XPath 2.0 parser is now generated with JavaCC. The evaluator has been", 
   "fixed so that it doesn't use PSVI input (instead just the base infoset). I made a few", 
   "minor tweaks to get the patch to compile on Java 1.3. There was some code relying on", 
   "auto-unboxing of a Double which slipped in. Also decided not to commit the change to", 
   "XSAttributeChecker which unconditionally uses the map for XML Schema 1.1. I guess this", 
   "might have been added while debugging but isn't the right thing to be doing."
  ], 
  "revision_id": "758138"
 }, 
 {
  "author": "koji", 
  "date": "2009-03-25T03:34:34.978432Z", 
  "msg": [
   "SOLR-822: avoid ClassCastException when CharStreamAware*TokenizerFactory is used without CharFilter"
  ], 
  "revision_id": "758137"
 }, 
 {
  "author": "ate", 
  "date": "2009-03-25T03:30:49.248559Z", 
  "msg": [
   "Second part of the big bang commit for JS2-938: Create flyweight PortletWindow instances for each request, the handle to access and store all portlet interaction data and drop the PortletEntityImpl usage", 
   "specifically concerning JS2-939: Portlet URL/Navigation State JSR-286 Portlet API 2.0 Support", 
   "This second commit is split off the first commit to provide an easier to review and separate set of changes for Randy on JS2-939", 
   "See: http://issues.apache.org/jira/browse/JS2-939", 
   "and: http://issues.apache.org/jira/browse/JS2-938"
  ], 
  "revision_id": "758136"
 }
]