[
 {
  "author": "kristwaa", 
  "date": "2009-03-27T14:40:47.283764Z", 
  "msg": [
   "DERBY-4122: ClassCastException in SQLClob when running in soft upgrade mode (10.4.2.0 -> 10.5.1.0).", 
   "Fixed typo/error in the test, where two different selects were performed", 
   "against the same table. The test was introduced in DERBY-1895.", 
   "Patch file: derby-4122-2a-bc4btest.diff"
  ], 
  "revision_id": "759155"
 }, 
 {
  "author": "ate", 
  "date": "2009-03-27T14:38:23.370418Z", 
  "msg": [
   "Restoring old PortletRequestResponseUnwrapper, but now renamed to ContainerRequestResponseUnwrapper.", 
   "This turned out to be required after all as for cross-context dispatching (on Tomcat) the original request is required", 
   "to maintain access to the ContainerRequest session during a Portlet invocation (note: with Tomcat server connector emptySessionPath=\"true\")."
  ], 
  "revision_id": "759154"
 }, 
 {
  "author": "kristwaa", 
  "date": "2009-03-27T14:36:19.070967Z", 
  "msg": [
   "DERBY-4122: ClassCastException in SQLClob when running in soft upgrade mode (10.4.2.0 -> 10.5.1.0).", 
   "Fixes incorrect positioning of the stream after investigating the stream header (this doesn't fix the ClassCastException). The positioning bug is also only", 
   "seen when processing streams with a pre 10.5 header, which may happen both in", 
   "soft upgrade and hard upgraded mode. It will not happen in a newly created", 
   "10.5 database.", 
   "Patch file: derby-4122-1a-incorrect_stream_positioning.diff"
  ], 
  "revision_id": "759153"
 }, 
 {
  "author": "gbrown", 
  "date": "2009-03-27T14:35:14.852322Z", 
  "msg": [
   "Add DISCLAIMER; add BUILD instructions for source distribution; update RELEASE-NOTES and README for binary distribution."
  ], 
  "revision_id": "759152"
 }, 
 {
  "author": "lehmi", 
  "date": "2009-03-27T14:28:58.750515Z", 
  "msg": [
   "PDFBOX-441: split up the WeakHashMap in a static and a nonstatic part to decrease synchronized calls the to maps"
  ], 
  "revision_id": "759151"
 }
]