[
 {
  "author": "jukka", 
  "date": "2009-04-03T13:48:07.111060Z", 
  "msg": [
   "JCRRMI-14: Integration tests for JCR-RMI", 
   "Add TCK initialization code from jackrabbit-core."
  ], 
  "revision_id": "761675"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-03T13:46:43.196758Z", 
  "msg": [
   "QPID-1784 : Fixed compile error"
  ], 
  "revision_id": "761674"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-03T13:38:11.030218Z", 
  "msg": [
   "QPID-1764 : Add a BaseTransactionLog that takes care of handling persistent message references so that the underlying TransactionLog need not worry about that.", 
   "Updated MemoryMS to use this even to ensure that the code is exercised.", 
   "To ensure that the new BaseTransactionLog was correctly used when used by a TransactionLog. The configure() method now returns an Object(TransactionLog) that is the newly configured TL. Existing tests and code where the original TL reference was used have", 
   "been changed to use the output of the configure() call.", 
   "NOTE: the return type should be changed to TransactionLog but until we have completely split the TransactionLog and RoutingTable implementations then this is not possible.", 
   "The implementation also includes a number of items from the Flow To Disk review:", 
   "- The old get* Methods have been removed from the TransactionLog interface.", 
   "- Rollback should now rollback enqueues. (No test provided)", 
   "- StoreContext now has enqueue/dequeue methods that track the messageId/Queue pairing", 
   "- The linked list per message has been reduced to a link list per message that is enqueued on multiple queues. Messages that exist on only one queue have no additional overhead.", 
   "- Optimisation also included to:", 
   "Include message delete in 'dequeue transaction' where the message was only ever enqueued on a single queue.", 
   "All other message deletes are peformed as part of an asynchrounous commit.", 
   "The asynchrounous commit is setup via the StoreContext, which has had some work done to move it towards becomming a Qpid Transaction Object where all operations are performed against rather than going via the TransactionLog.", 
   "Merged from r760951 on trunk"
  ], 
  "revision_id": "761673"
 }, 
 {
  "author": "jukka", 
  "date": "2009-04-03T13:38:10.914594Z", 
  "msg": [
   "JCRRMI-14: Integration tests for JCR-RMI", 
   "Setting up JCR API conformance tests for JCR-RMI."
  ], 
  "revision_id": "761672"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-03T13:33:42.614303Z", 
  "msg": [
   "QPID-1784 Update to FlowableBaseQueueEntryList to ensure that the inhaler and purger threads will stop when the inMemory values are within the correct range."
  ], 
  "revision_id": "761671"
 }
]