[
 {
  "author": "davsclaus", 
  "date": "2009-04-06T15:51:08.775530Z", 
  "msg": [
   "Transacted routes with Spring DSL seems to not work with JDBC resources. Added a unit test to demonstrate this."
  ], 
  "revision_id": "762400"
 }, 
 {
  "author": "mor", 
  "date": "2009-04-06T15:49:17.744872Z", 
  "msg": [
   "For creating picklist, grouping can be done with two new methods Warehouse Area and Number of order items", 
   "in addition to the default option i.e. Shipping Method.", 
   "Patch from Arun Patidar, reviewed by Pranay Pandey and applied from OFBIZ-2223 (https://issues.apache.org/jira/browse/OFBIZ-2223)"
  ], 
  "revision_id": "762399"
 }, 
 {
  "author": "jukka", 
  "date": "2009-04-06T15:47:59.224363Z", 
  "msg": [
   "JCRRMI-1: Copy the JCR-RMI component to the new JCR Commons subproject", 
   "Only deploy the main jcr-rmi component. The reactor and the test project don't need to be on a Maven repository."
  ], 
  "revision_id": "762398"
 }, 
 {
  "author": "dkulp", 
  "date": "2009-04-06T15:46:01.404822Z", 
  "msg": [
   "Merged revisions 762395 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/branches/2.1.x-fixes", 
   "................", 
   "r762395 | dkulp | 2009-04-06 11:44:58 -0400 (Mon, 06 Apr 2009) | 9 lines", 
   "Merged revisions 762393 via svnmerge from", 
   "https://svn.apache.org/repos/asf/cxf/trunk", 
   "........", 
   "r762393 | dkulp | 2009-04-06 11:41:28 -0400 (Mon, 06 Apr 2009) | 2 lines", 
   "In some cases, some of the message properties were not being set.", 
   "........", 
   "................"
  ], 
  "revision_id": "762397"
 }, 
 {
  "author": "markt", 
  "date": "2009-04-06T15:45:37.756680Z", 
  "msg": [
   "Fix POOL-107.", 
   "Narrow synchronisation to where it is needed and ensure that calculations related to pool limits take account of objects we are in the process of making, particularly via the Evictor thread creating minIdle objects.", 
   "This patch removes a possibility for deadlock (DBCP-44) but introduces the edge case that where (idle==0 && (active + 1)==maxActive && minIdle>0) a pool may appear to be exhausted to a client if the evictor thread is in the process of creating the last object when the client calls borrowObject(). This is really only an issue if the pool is configured with WHEN_EXHAUSTED_FAIL.", 
   "The patch also aligns synchronisation strategies between GOP and GKOP. This means less synchronisation in GKOP."
  ], 
  "revision_id": "762396"
 }
]