[
 {
  "author": "akosut", 
  "date": "1996-03-21T04:20:52.000000Z", 
  "msg": [
   "Rewrote the filename extenstion checking code so the order is irrelevant.", 
   "i.e. foo.html.en.gz and foo.en.gz.html will give the same headers. The old", 
   "code would ignore the en and gz in the latter example.", 
   "Another benefit is that you can, for example, do \"AddLanguage en html\"", 
   "and all HTML files will be tagged as English as well as content-type", 
   "text/html (asuming this is so defined in mime.types or an AddType)."
  ], 
  "revision_id": "76404"
 }, 
 {
  "author": "akosut", 
  "date": "1996-03-21T03:50:16.000000Z", 
  "msg": [
   "Added some more MD5 support to Apache:", 
   "* A new module, mod_digest, which supports digest authentication, as per", 
   "draft-ietf-http-digest-aa-02. Could use some work in terms of being a bit", 
   "more secure in terms of nonce-generating and so forth, and it needs a", 
   "support/ utility to generate htdigest file entries. Use it the same way", 
   "as in NCSA httpd 1.5; AuthType Digest, and use AuthDigestFile to point", 
   "at the file.", 
   "* A new server or per-directory directive, ContentDigest. Set it to On,", 
   "and Apache will generate a Content-MD5 header with each file sent. This", 
   "may or may not be useful, and there has been some discussion on http-wg", 
   "about removing this from the spec (it is currently vaugely defined in", 
   "the 1.1 draft), but it doesn't hurt anything.", 
   "Reviewed by: Everyone. At least, no one objected during the two weeks given."
  ], 
  "revision_id": "76403"
 }, 
 {
  "author": "akosut", 
  "date": "1996-03-21T03:17:44.000000Z", 
  "msg": [
   "Moved Jim's CGI scripts from cgi-bin to cgi-src where they belong,", 
   "and added entries in the Makefile there for them. Also added util.h,", 
   "which I forgot when I updated cgi-src a month ago. Oops."
  ], 
  "revision_id": "76402"
 }, 
 {
  "author": "akosut", 
  "date": "1996-03-20T02:55:18.000000Z", 
  "msg": [
   "Made it so XBITHACK behavior only occurs for files of type text/html, as", 
   "any other file type doesn't really make sense."
  ], 
  "revision_id": "76401"
 }, 
 {
  "author": "jim", 
  "date": "1996-03-19T22:55:12.000000Z", 
  "msg": [
   "sample random-image selector"
  ], 
  "revision_id": "76400"
 }
]