[
 {
  "author": "mjc", 
  "date": "1996-03-25T11:35:11.000000Z", 
  "msg": [
   "Reviewed by: Ben Laurie", 
   "Status module to give instantaneous statistics about Apache children for", 
   "autonomous monitoring or human reading.  Documentation is needed to help", 
   "users set this up and configure it, provisionally this is available at", 
   "http://www.apache.org/docs/1.1/mod_status.html"
  ], 
  "revision_id": "76409"
 }, 
 {
  "author": "mjc", 
  "date": "1996-03-25T10:54:30.000000Z", 
  "msg": [
   "Reviewed by: Ben Laurie", 
   "Changes to core Apache to allow a module to obtain information from the", 
   "scoreboard (in file or memory).  Addition of an extra server BUSY state", 
   "to distinguish between a \"read request\" and a \"write response\".  A", 
   "define allows the addition of full instrumentation into the scoreboard"
  ], 
  "revision_id": "76408"
 }, 
 {
  "author": "akosut", 
  "date": "1996-03-23T05:16:53.000000Z", 
  "msg": [
   "Fixed the revised find_ct() in mod_mime so that it reads from left to", 
   "right, not right to left. This means that, for example, foo.txt.html", 
   "will be tagged as text/html, as it is done in previous versions of", 
   "Apache, not text/plain."
  ], 
  "revision_id": "76407"
 }, 
 {
  "author": "akosut", 
  "date": "1996-03-22T05:42:50.000000Z", 
  "msg": [
   "Added CHANGES entries for a bunch of the things I've commited. Note that I", 
   "still think these should be created automatically. Not only do people forget,", 
   "some of them are just plain wrong, because, for example, Jim's change", 
   "(which I removed the entry for) to translate_userdir() was undone and", 
   "fixed by me and Ben, respectively, but reading the CHANGES file, no", 
   "one would know that."
  ], 
  "revision_id": "76406"
 }, 
 {
  "author": "akosut", 
  "date": "1996-03-22T01:05:24.000000Z", 
  "msg": [
   "Fix several of the -Wall warnings, mostly the ones that were my fault.", 
   "Sorry about that."
  ], 
  "revision_id": "76405"
 }
]