[
 {
  "author": "ritchiem", 
  "date": "2009-04-10T22:12:13.896223Z", 
  "msg": [
   "QPID-1804 : Provide testing for Flow to Disk when using ack modes Client, Transacted and No-Ack"
  ], 
  "revision_id": "764080"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-10T22:10:31.431404Z", 
  "msg": [
   "QPID-1791 : Replaced the get call before the dequeueAndDelete with a remove. So the remove call after the delete is now nolonger requried.", 
   "Added manual test to assist identifing the problem"
  ], 
  "revision_id": "764079"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-10T22:09:50.186851Z", 
  "msg": [
   "QPID-1794 : Moved processing of single message removals to just before the transaction commit rather than before the dequeue. As previously the list of dequeues was being traversed for every dequeue in that transaction batch with nothing to do. So removing this loop should increase performance in large batch cases."
  ], 
  "revision_id": "764078"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-04-10T22:09:23.813762Z", 
  "msg": [
   "I finally reverted almost all Ashish Nagar's patch from https://issues.apache.org/jira/browse/OFBIZ-2260 - OFBIZ-2260 that I commited after a review but no tests in r762149.", 
   "This because these URLs in FTL file were not calling services, hence, as explained David, did not need any changes", 
   "I kept only changes I found by chances (because I got conflicts in them) in", 
   "specialpurpose\\ecommerce\\webapp\\ecommerce\\order\\orderitems.ftl", 
   "specialpurpose\\ecommerce\\webapp\\ecommerce\\order\\orderheader.ftl", 
   "applications/order/webapp/ordermgr/order/ordershippinginfo.ftl", 
   "I also added one secured URLs - createShipment2 - in this last file and there are more to do just below : quickDropShipOrder, createShipment. I think we need more than good will and chance here. We need to define a strategy to spot the URLs calling services in ftl files. This does not sound like impossible to automatize and I firmly think we should do that before freezing R9.04"
  ], 
  "revision_id": "764077"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-10T22:09:15.707413Z", 
  "msg": [
   "QPID-1803 : Fixed potential NPE in FileUtils.delete"
  ], 
  "revision_id": "764076"
 }
]