[
 {
  "author": "bryanduxbury", 
  "date": "2009-04-13T17:48:23.965639Z", 
  "msg": [
   "THRIFT-445. rb: client and processor do not inherit from the proper namespace scope", 
   "This patch adds namespace support to a client and processor extended from an included thrift def with its own namespace."
  ], 
  "revision_id": "764540"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-04-13T17:28:36.975804Z", 
  "msg": [
   "753253\tritchiem\tQPID-1730 : Logging update highlighted that we were printing the queue before we had fully initialised it.", 
   "753220\tritchiem\tQPID-1730 : Improve the logging so we can see what is going one during persistent recovery as we do not have a working persistent module.", 
   "753219\tritchiem\tQPID-1730 : Update the order in which we initialise. We now load the config file from disk then recover from the persistent strore. This approach applies the vhost configuration and then applies the persistent state from the store to those objects rather than recreating them. The new inner classes on VirtualHost are to be removed once we have fully extracted the RoutingTable from the legacy MessageStores as this is the root of the problem. The Store needs to be open to create new durable objects but the current stores must recover their state before new entries are added. So now the persistent state is being loaded on to a broker in a consistent state after it has configured a) its default exchanges and b) loaded the queue config from the config file. Eventually we will only have one location for queue config and all will be right in the world.", 
   "merged the above three changes from trunk that allow the broker to create it's model before the MessageStore is initialised."
  ], 
  "revision_id": "764539"
 }, 
 {
  "author": "grobmeier", 
  "date": "2009-04-13T17:24:58.993739Z", 
  "msg": [
   "COMPRESS-69: corrected class level java doc"
  ], 
  "revision_id": "764538"
 }, 
 {
  "author": "grobmeier", 
  "date": "2009-04-13T17:22:30.310688Z", 
  "msg": [
   "COMPRESS-69: corrected class level java doc"
  ], 
  "revision_id": "764537"
 }, 
 {
  "author": "grobmeier", 
  "date": "2009-04-13T17:18:11.033189Z", 
  "msg": [
   "COMPRESS-69: reenabled testcase"
  ], 
  "revision_id": "764536"
 }
]