[
 {
  "author": "gbrown", 
  "date": "2009-04-16T14:12:04.530270Z", 
  "msg": [
   "Update 'millon record challenge' demo to use CSVSerializer.StreamIterator."
  ], 
  "revision_id": "765645"
 }, 
 {
  "author": "sebb", 
  "date": "2009-04-16T14:11:51.612535Z", 
  "msg": [
   "Ensure final String array cannot be changed accidentally or maliciously"
  ], 
  "revision_id": "765644"
 }, 
 {
  "author": "ate", 
  "date": "2009-04-16T14:09:37.249751Z", 
  "msg": [
   "Completing JS2-938: Create flyweight PortletWindow instances for each request, the handle to access and store all portlet interaction data and drop the PortletEntityImpl usage", 
   "See: http://issues.apache.org/jira/browse/JS2-938", 
   "The task remaining was providing a new solution for the previously used PortletWindowCache, specifically with respect to caching PortletDefinitions", 
   "This now is implemented by leveraging the OJB cache itself (backed by a ehcache) as a shared/global (readonly) cache, both for PortletApplication and PortletDefinition instances.", 
   "As instances retrieved through this cache are shared, they should only be used for readonly purposes, like as for the PortletWindow.", 
   "To distinguise between the readonly and writing use-cases, I've added additional registry methods for retrieving a PortletApplication or PortletDefinition with a extra boolean parameter fromCache.", 
   "This way, current API usages will still (like before) retrieve fresh instances directly from the database, but with these new methods the much more optimal cache based retrieval is now possible.", 
   "For common usages, like the flyweight PortletWindows but also simple read checks I've already updated the current API usages where applicable.", 
   "Possibly other usages might be reviewed if they also could leverage the more optimal cache based retrieval methods."
  ], 
  "revision_id": "765643"
 }, 
 {
  "author": "sebb", 
  "date": "2009-04-16T14:09:18.408328Z", 
  "msg": [
   "Document update"
  ], 
  "revision_id": "765642"
 }, 
 {
  "author": "coheigea", 
  "date": "2009-04-16T14:06:37.454928Z", 
  "msg": [
   "Removed 1.5.7 tag."
  ], 
  "revision_id": "765641"
 }
]