[
 {
  "author": "schultz", 
  "date": "2009-04-22T16:49:19.555159Z", 
  "msg": [
   "Added myself to developers list."
  ], 
  "revision_id": "767585"
 }, 
 {
  "author": "mamta", 
  "date": "2009-04-22T16:26:42.214074Z", 
  "msg": [
   "DERBY-3926", 
   "I have worked on writing a junit test which is currently going to fail because we are returning the data in incorrect order. I thought it would be useful to have the test for people to quickly run the test if they wanted to. This junit test will not be part of any suite currently since the bug is not fixed yet. Putting it in the suite is going to make it fail everytime because the test is asserting that the data be returned in the correct order. It was painful to convert the setup script provided for this jira into a junit test. The script is huge. I was able to use Army's test converter DERBY-2151(it was extremely helpful because it atleast converted half of the script into junit test. My understanding is that the converter works on the older canon based master file. I think it takes sql delimited by ; from the canon file and assumes that next line is the output of that sql. So, the converter skipped every other sql from my setup script. I ended up hand putting every other line which was skipped by the converter. )"
  ], 
  "revision_id": "767584"
 }, 
 {
  "author": "jbonofre", 
  "date": "2009-04-22T16:21:14.145200Z", 
  "msg": [
   "Modify ExecMarshaler to support empty in message.", 
   "Add new unit tests for InOnly and InOut exchanges."
  ], 
  "revision_id": "767583"
 }, 
 {
  "author": "woonsan", 
  "date": "2009-04-22T16:19:50.976806Z", 
  "msg": [
   "JS2-974: This problem is mainly fixed by the commit for PLUTO-554.", 
   "In this commit, I added head contribution stuffs in JSP decorators. (See JS2-961)"
  ], 
  "revision_id": "767582"
 }, 
 {
  "author": "jdcasey", 
  "date": "2009-04-22T16:14:21.313548Z", 
  "msg": [
   "rolling back  -r 767324:767321 to keep things simple. This generics conversion work has been moved to 2.2.x branch."
  ], 
  "revision_id": "767581"
 }
]