[
 {
  "author": "phred", 
  "date": "2009-04-25T21:02:09.518232Z", 
  "msg": [
   "perldoc -tT lib/Apache/Bootstrap.pm"
  ], 
  "revision_id": "768600"
 }, 
 {
  "author": "jukka", 
  "date": "2009-04-25T21:01:21.926463Z", 
  "msg": [
   "TIKA-216: Zip bomb prevention", 
   "Add a two-level test file that expands to some 256MB of \"blah blah...\""
  ], 
  "revision_id": "768599"
 }, 
 {
  "author": "vdichev", 
  "date": "2009-04-25T20:36:26.666396Z", 
  "msg": [
   "ESME-56 RESTful API to add user to an access pool."
  ], 
  "revision_id": "768598"
 }, 
 {
  "author": "bpendleton", 
  "date": "2009-04-25T20:21:03.020866Z", 
  "msg": [
   "DERBY-2487: Enhance Derby with XPLAIN functionality.", 
   "This feature was contributed by Felix Beyer (beyer dot felix at gmx dot net).", 
   "This feature introduces an alternate handling of runtime statistics", 
   "information. Derby can now be configured so that it will capture the", 
   "statistics in a machine-readable form and will store them into a set of", 
   "simply-structured tables in a schema which is specified by the user. We", 
   "call this behavior \"XPLAIN style\", and we call the tables which are", 
   "used the \"XPLAIN tables\".", 
   "Having captured statistics about statement execution, you can then", 
   "analyze the statement behavior by querying these tables. For example, you", 
   "can determine how much time was taken, what resources were used, what", 
   "query plan was chosen, and so on.", 
   "This is the initial commit of this new functionality. Subsequent changes", 
   "will provide documentation, additional tests, fully-tested upgrade support.", 
   "As the community gains more experience with this feature, we will find more", 
   "enhancements to make, but the initial commit provides a working feature", 
   "with an initial set of basic regression tests.", 
   "Many thanks to the community for reviewing the changes through several", 
   "iterations of development."
  ], 
  "revision_id": "768597"
 }, 
 {
  "author": "rpluem", 
  "date": "2009-04-25T20:15:49.507251Z", 
  "msg": [
   "* Add SSLStrictSNIVHostCheck to allow / disallow non SNI clients to connect to", 
   "name based virtual hosts."
  ], 
  "revision_id": "768596"
 }
]