[
 {
  "author": "jim", 
  "date": "2009-04-27T15:02:40.346717Z", 
  "msg": [
   "Fold in initial template for methods to be able to", 
   "reset (initialize) and \"age\" their data, useful when", 
   "adding new workers, or when workers come back into", 
   "the fold....", 
   "Logic and code to come in a bit :)"
  ], 
  "revision_id": "769020"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-04-27T15:01:51.008083Z", 
  "msg": [
   "rename getDefaultToken -> getInitialToken", 
   "patch by jbellis; reviewed by Jun Rao for CASSANDRA-65"
  ], 
  "revision_id": "769019"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-04-27T15:01:42.987396Z", 
  "msg": [
   "add test for ReplicaPlacementStrategy covering both Random and OrderPreserving partitioners", 
   "patch by jbellis; reviewed by Jun Rao for CASSANDRA-65"
  ], 
  "revision_id": "769018"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-04-27T15:01:36.100148Z", 
  "msg": [
   "r/m StorageService.token in favor of explicitly passing a Partitioner object.  this allows testing of components independent of the static SS.", 
   "patch by jbellis; reviewed by Jun Rao for CASSANDRA-65"
  ], 
  "revision_id": "769017"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-04-27T15:01:29.052722Z", 
  "msg": [
   "replace BigInteger tokens with BigIntegerToken and StringToken in RandomPartitioner and OrderPreservingPartitioner, respectively.  (OrderPreservingHashPartitioner is no more.)", 
   "Doing order preserving partitioning based on the raw string has a number of compelling advantages:", 
   "- there is no key length that all tokens must be padded to (which can be expensive if there is a range of key lengths) and which cannot be increased after deployment", 
   "- it allows user-defined collations [sorting] rather than being limited to sorting by code point value (which is useless in the unicode world, and not always what you want even for ascii keys)", 
   "- it will work with all UTF-16 characters, not just the UCS-2 subset (this is a limitation of using as a base 2**16, i.e., assuming for your order preserving hash that all characters are two bytes).", 
   "patch by jbellis; reviewed by Jun Rao for CASSANDRA-65"
  ], 
  "revision_id": "769016"
 }
]