[
 {
  "author": "fielding", 
  "date": "1996-11-08T02:51:34.000000Z", 
  "msg": [
   "More tweaks to the ordering of conditional request headers.", 
   "If If-None-Match is included and fails, then If-Modified-Since", 
   "should not be checked.  Likewise for If-Match and If-Unmodified-Since.", 
   "This allows the more exact check to be preferred over the less exact check."
  ], 
  "revision_id": "76969"
 }, 
 {
  "author": "fielding", 
  "date": "1996-11-06T11:23:08.000000Z", 
  "msg": [
   "Its a good thing to handle error condition from time system call. Doh!"
  ], 
  "revision_id": "76968"
 }, 
 {
  "author": "fielding", 
  "date": "1996-11-06T10:30:38.000000Z", 
  "msg": [
   "Replaced existing code for If-Modified-Since, If-Unmodified-Since,", 
   "If-Match, and If-None-Match in order to correct the order of preference", 
   "regarding ETags and to make use of the parseHTTPdate routine.  Also", 
   "modified the comparison for last-modification time so that it changes", 
   "Last-Modified only if it is greater than the current time, rather than", 
   "the request_time. We also now check to be sure that the incoming", 
   "If-Modified-Since value is not greater than the request_time, which was", 
   "the last non-compliant bit for HTTP/1.1.", 
   "Finally, I updated the Makefile dependency list, since it was woefully", 
   "out-of-date and hard to read in its prior form."
  ], 
  "revision_id": "76967"
 }, 
 {
  "author": "chuck", 
  "date": "1996-11-04T20:43:20.000000Z", 
  "msg": [
   "Updated to use BAD_DATE with new date utilities; fixed last -Wall warning"
  ], 
  "revision_id": "76966"
 }, 
 {
  "author": "brian", 
  "date": "1996-11-04T18:10:02.000000Z", 
  "msg": [
   "Reviewed by:\tBrian Behlendorf", 
   "Submitted by:\tjohnh@isi.edu", 
   "Added a SendBufferSize directive to the core, which allows one to adjust", 
   "the TCP buffer sizes to optimize for high-bandwidth, high-latency transfers", 
   "of large files."
  ], 
  "revision_id": "76965"
 }
]