[
 {
  "author": "seelmann", 
  "date": "2009-05-04T18:27:40.352736Z", 
  "msg": [
   "Activated two tests, DIRSERVER-1231 is fixed"
  ], 
  "revision_id": "771385"
 }, 
 {
  "author": "nbubna", 
  "date": "2009-05-04T18:12:15.646543Z", 
  "msg": [
   "add default props for StringResourceLoader, so turning it on only requires resource.loader = file, string (or something like that).  might be worth doing for all provided loaders, but i'm using this one a lot lately"
  ], 
  "revision_id": "771384"
 }, 
 {
  "author": "namit", 
  "date": "2009-05-04T18:11:41.065873Z", 
  "msg": [
   "HIVE-440. Fixed bug in Reducer and Join to print out number of rows processed.", 
   "(Zheng Shao via namit)"
  ], 
  "revision_id": "771383"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-05-04T18:05:48.614817Z", 
  "msg": [
   "VCL-23", 
   "In all files being committed:", 
   "-Moved $Id: line so it appears just below the #! line at the beginning of the file for consistency.", 
   "-Updated POD sections at the end of the file to change NCSU information to ASF.", 
   "Changes in following files streamline the task of copying configuration files for the OS from the management node to a computer. If a class has a $SOURCE_CONFIGURATION_DIRECTORY variable set, it will be automatically copied to the node during the image capture process. Top-most class directories are copied first so subclasses can essentially override any files from above.", 
   "Module.pm:", 
   "-Added get_package_hierarchy() subroutine. It returns an array containing Perl package names of all of the packages which make up a module's inheritance hierarchy.", 
   "-Improved POD sections throughout file for better code documentation.", 
   "OS.pm:", 
   "-Added get_source_configuration_directories() subroutine. This calls Module.pm::get_package_hierarchy().", 
   "Windows_mod.pm:", 
   "-Fixed a few heredoc sections where double quotes should have been used instead of single. This caused a bug where backslashes were being duplicated in registry file sections being merged.", 
   "-Added firewall_enable_sessmgr() subroutine. This is helpful for Win2k3 image capture. Sysprep hangs because it wants sessmgr.exe allowed through the firewall.", 
   "-Updated copy_capture_configuration_files() to handle multiple paths. It now calls OS.pm::get_source_configuration_directories().", 
   "-Fixed prepare_drivers() so it works with Win2k3. The DevicePath string is a REG_SZ in Win2k3 instead of a REG_EXPAND_SZ.", 
   "Version_5.pm:", 
   "-Removed $SOURCE_CONFIGURATION_DIRECTORY variable because it wasn't being used.", 
   "XP_mod.pm:", 
   "-Removed call to copy_capture_configuration_files() because Windows_mod.pm now handles it for all inherited classes."
  ], 
  "revision_id": "771382"
 }, 
 {
  "author": "jdcryans", 
  "date": "2009-05-04T18:05:15.367215Z", 
  "msg": [
   "HBASE-1279  Fix the way hostnames and IPs are handled"
  ], 
  "revision_id": "771381"
 }
]