[
 {
  "author": "ruwan", 
  "date": "2009-05-11T18:38:20.450723Z", 
  "msg": [
   "applying patch for SYNAPSE-546, thanks Amila for the improvement"
  ], 
  "revision_id": "773650"
 }, 
 {
  "author": "taylor", 
  "date": "2009-05-11T18:37:38.577862Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/JS2-993", 
   "patch to 2.2 build docs for tomcat 6 from Niels van Kampenout"
  ], 
  "revision_id": "773649"
 }, 
 {
  "author": "taylor", 
  "date": "2009-05-11T18:36:06.715329Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/JS2-993", 
   "patch to m2 archetype from Niels van Kampenout"
  ], 
  "revision_id": "773648"
 }, 
 {
  "author": "sobryan", 
  "date": "2009-05-11T18:32:44.981980Z", 
  "msg": [
   "TRINIDAD-1471: Portlet 2.0 Support for Trinidad", 
   "* Extending ExternalContextUtils to support the RequestType Enumeration like in commons-utils as well as add support for Portlet 2.0 request types. I decided to add this code to the Trinidad specific API as opposed to using commons so that the upgrade will be easier. We should look into a project to start consuming commons.", 
   "* Updated pluto profile in demo to build a Pluto compatible war. This will now correctly build a Pluto compatible demo war for either Pluto 1.x or Pluto 2.x depending on the setting of the -Dportlet=2.0 flag. By default it will build a war compatible with Pluto 1.x. Invoking Portlet 2.0 will add a snapshot dependency as Pluto 2.0 is not yet released. Because this is governed by a property, this should not effect the ability to release Trinidad", 
   "* Added a pluto-embedded profile that will allow you to run the Trinidad Demo, in jetty, using Pluto 1.x.. This does not currently work with the -Dportlet=2.0 flag because the pluto-embedded plugin has some issues.", 
   "* Changed api and impl packages to compile against Portlet 2.0 objects instead of Portlet 1.0", 
   "* Updated Configurators to support both Portlet 1.0 and Portlet 2.0 so that either container can be used and capabilities are modified accordingly", 
   "* Legacy wrappers for Portlet 1.0 Request/Response objects were removed. Porltet 1.0 Request/Response wrapping is now handled using Java Proxy objects. Portlet 2.0 request/response wrapping uses and created new Portlet 2.0 wrapper objects where appropriate", 
   "* Updated XmlHttpConfigurator to be a proper Configurator and took out several hacks, also added support for ResourceRequest/Response to support AJAX in Portlet 2.0 containers"
  ], 
  "revision_id": "773647"
 }, 
 {
  "author": "jvanzyl", 
  "date": "2009-05-11T18:32:32.142202Z", 
  "msg": [
   "o prepare to bring the project dependency downloading in directly after calculating the build plan"
  ], 
  "revision_id": "773646"
 }
]