[
 {
  "author": "jim", 
  "date": "1997-01-25T22:16:08.000000Z", 
  "msg": [
   "Explain . status"
  ], 
  "revision_id": "77494"
 }, 
 {
  "author": "fielding", 
  "date": "1997-01-25T20:28:19.000000Z", 
  "msg": [
   "Fixed condition where, if a child fails to fork, the scoreboard would", 
   "continue to say SERVER_STARTING forever. Eventually, the main process", 
   "would refuse to start new children because count_idle_servers() will", 
   "count those SERVER_STARTING entries and will always report that there", 
   "are enough idle servers.", 
   "Submitted by: Phillip Vandry <vandry@staple.mlink.net>", 
   "Reviewed by: Roy Fielding, Marc Slemko, Chuck Murcko, Randy Terbush"
  ], 
  "revision_id": "77493"
 }, 
 {
  "author": "fielding", 
  "date": "1997-01-25T20:12:49.000000Z", 
  "msg": [
   "<adrian@virginia.edu> notified us of a problem with children for the httpd", 
   "dump core on SIGSEGV regularly, HPUX, version: 10.10, Apache 1.2b4.", 
   "Ben mentioned that the symptoms looked like a stack corruption.", 
   "I think this is being caused when an initial call to select or accept", 
   "fails (for any reason) and the code attempts to reuse the same parameters", 
   "even though they were modified by the call.  In any case, we should be", 
   "reinitializing the parameters before each call even if this isn't the", 
   "cause of the problem.  Also removes potential infinite loop in call to accept.", 
   "Reviewed by: Marc Slemko, Chuck Murcko, Randy Terbush"
  ], 
  "revision_id": "77492"
 }, 
 {
  "author": "randy", 
  "date": "1997-01-25T15:44:39.000000Z", 
  "msg": [
   "The below patch makes the error message a bit more standard and doesn't", 
   "print it if the reason for stat failing was EACCES.  Should go in before", 
   "the beta goes out.", 
   "Reviewed by: Randy Terbush", 
   "Submitted by: Marc Slemko"
  ], 
  "revision_id": "77491"
 }, 
 {
  "author": "randy", 
  "date": "1997-01-25T15:37:24.000000Z", 
  "msg": [
   "Allow * to terminate the end of a directory match in mod_dir.", 
   "Allows /~* to match for both /~joe and /~joe/. [David Bronder]", 
   "Reviewed by:\tAlexei Kosut, Marc Slemko, Randy Terbush", 
   "Submitted by: David Bronder <David-Bronder@uiowa.edu>"
  ], 
  "revision_id": "77490"
 }
]