[
 {
  "author": "jm", 
  "date": "2009-05-16T05:44:04.690880Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "775415"
 }, 
 {
  "author": "lu4242", 
  "date": "2009-05-16T05:13:51.947891Z", 
  "msg": [
   "MYFACES-2160 The action in tr:commandButton is not fired if you use the trinidad jsf library (in 1.1.5 it works)."
  ], 
  "revision_id": "775414"
 }, 
 {
  "author": "rwatler", 
  "date": "2009-05-16T04:37:42.703123Z", 
  "msg": [
   "JS2-1014 - Unit tests fail in Portals Components using JDK6", 
   "---------------------------------------------------------------", 
   "This problem turned out to be related to test order and not JDK6 per se. OJB internals are", 
   "based on static state and running multiple tests w/o forking lead to connections and their", 
   "pools to be reused from test to test. When a test ran first that did not allocate all connections", 
   "possible, subsequent tests attempted to get new connections from connection pools that", 
   "belonged to prior tests which were by now closed. These DB connection attempts failed.", 
   "Fix involves static tracking of OBJ specific connection manager implementation instances and", 
   "resetting their internal state on startup. This code does nothing on the initial invocation,", 
   "(for the first test and production instances), but serves to clear the statically held OJB", 
   "state between test cases.", 
   "- added management class that statically tracks all instances of OJB ConnectionManagerImpl.", 
   "- added management instance bean that triggers reset of connections and connection factories in the", 
   "ConnectionManagerImpl when the Spring context is initialized."
  ], 
  "revision_id": "775413"
 }, 
 {
  "author": "wsmoak", 
  "date": "2009-05-16T04:00:46.688120Z", 
  "msg": [
   "[MRM-1164] Improve the Selenium tests", 
   "*  added tests for archiva user roles", 
   "* added tests for upload artifact", 
   "* modified scripts from Search and Browse", 
   "Submitted by: Marecor Baclay"
  ], 
  "revision_id": "775412"
 }, 
 {
  "author": "bayard", 
  "date": "2009-05-16T03:46:27.912293Z", 
  "msg": [
   "Fixing javadoc, unused import"
  ], 
  "revision_id": "775411"
 }
]