[
 {
  "author": "jvanzyl", 
  "date": "2009-05-20T13:23:56.706952Z", 
  "msg": [
   "o have the build plan take into consideration multiple tasks, so the calculation of the build plan can take in any number lifecycle phases, or individual goals and you will get the fully fleshed out configurations", 
   "o one thing that's apparent is that it is not possible to only collect the metadata about the plugins that will execute. if the plugin.xml files were actually available in the repository outside of the plugin's JAR then the calculation could be made without having to crack open the JAR. i can't have a real plan per se when i have to grab the plugin JAR anywhere to open it and get the metadata. ideally someone should be able to see the build plan and optimize it and if plugins were removed they those will never have a requirement of being downloaded. Deploying the plugin metadata along side the plugin as an attached artifact or indexing the information and made available for querying would be very useful.", 
   "o now that the build plan is calculated and the project dependencies downloading has been decoupled from the plugin manager i can make a proper analysis of all he dependencies for all the project and start making optimized requests for downloading"
  ], 
  "revision_id": "776690"
 }, 
 {
  "author": "joern", 
  "date": "2009-05-20T13:20:33.646456Z", 
  "msg": [
   "UIMA-712"
  ], 
  "revision_id": "776689"
 }, 
 {
  "author": "reschke", 
  "date": "2009-05-20T13:12:30.429344Z", 
  "msg": [
   "JCR-73: JavaDoc fixes (JavaDoc uses HTML, not XHTML, also misplaced <code> tags around JavaDoc link tags)"
  ], 
  "revision_id": "776688"
 }, 
 {
  "author": "stefan", 
  "date": "2009-05-20T13:08:09.817140Z", 
  "msg": [
   "JCR-1609:  new Property Types (WIP...)", 
   "JCR-2061: References and Dereferencing of Property Values (WIP...)"
  ], 
  "revision_id": "776687"
 }, 
 {
  "author": "davisp", 
  "date": "2009-05-20T13:07:30.969804Z", 
  "msg": [
   "Blocking 776685 from trunk."
  ], 
  "revision_id": "776686"
 }
]