[
 {
  "author": "dgaudet", 
  "date": "1997-03-20T23:30:46.000000Z", 
  "msg": [
   "Add documentation for DNS issues (reliability and security), and try", 
   "to explain the virtual host matching process.", 
   "Try to continue gracefully by disabling the vhost if a DNS lookup", 
   "fails while parsing the configuration file.", 
   "Reviewed by:\tRoy, Jim", 
   "Submitted by:", 
   "Obtained from:"
  ], 
  "revision_id": "77744"
 }, 
 {
  "author": "fielding", 
  "date": "1997-03-20T18:40:16.000000Z", 
  "msg": [
   "In the proxy, if the cache filesystem was full, garbage_coll() was", 
   "never called, and thus the filesystem would remain full indefinitely.", 
   "We now also remove incomplete cache files left if the origin server", 
   "didn't send a Content-Length header and either the client has aborted", 
   "transfer or bwrite() to client has failed.", 
   "Submitted by: Petr Lampa", 
   "Reviewed by: Chuck Murcko, Roy Fielding"
  ], 
  "revision_id": "77743"
 }, 
 {
  "author": "fielding", 
  "date": "1997-03-20T18:03:35.000000Z", 
  "msg": [
   "Updated mod_rewrite to version 3.0.1, which: fixes compile error on", 
   "AIX; improves the redirection stuff to enable the users to generally", 
   "redirect to http, https, gopher and ftp; added TIME variable for", 
   "RewriteCond which expands to YYYYMMDDHHMMSS strings and added the", 
   "special patterns >STRING, <STRING and =STRING to RewriteCond, which", 
   "can be used in conjunction with %{TIME} or other variables to create", 
   "time-dependent rewriting rules.", 
   "Submitted by: Ralf S. Engelschall", 
   "Reviewed by: Jim Jagielski, Dean Gaudet, Roy Fielding"
  ], 
  "revision_id": "77742"
 }, 
 {
  "author": "fielding", 
  "date": "1997-03-20T17:10:11.000000Z", 
  "msg": [
   "Fixed the handling of module and script-added header fields.", 
   "Improved the interface for sending header fields and reduced", 
   "the duplication of code between sending okay responses and errors.", 
   "We now always send both headers_out and err_headers_out, and", 
   "ensure that the server-reserved fields are not being overridden,", 
   "while not overriding those that are not reserved.", 
   "Fixed the determination of whether or not we should make the", 
   "connection persistent for all of the cases where some other part", 
   "of the server has already indicated that we should not.  Also", 
   "improved the ordering of the test so that chunked encoding will", 
   "be set whenever it is desired instead of only when KeepAlive", 
   "is enabled. Added persistent connection capability for most error", 
   "responses (those that do not indicate a bad input stream) when", 
   "accessed by an HTTP/1.1 client.", 
   "Added missing timeouts for sending header fields, error responses,", 
   "and the last chunk of chunked encoding, each of which could have", 
   "resulted in a process being stuck in write forever.", 
   "Reviewed by: Randy Terbush, Dean Gaudet"
  ], 
  "revision_id": "77741"
 }, 
 {
  "author": "fielding", 
  "date": "1997-03-20T12:20:47.000000Z", 
  "msg": [
   "Now generated by Configure"
  ], 
  "revision_id": "77740"
 }
]