[
 {
  "author": "ajaquith", 
  "date": "2009-05-23T13:40:58.788878Z", 
  "msg": [
   "Version/changelog bump for 3.0.0-build 120"
  ], 
  "revision_id": "777925"
 }, 
 {
  "author": "ajaquith", 
  "date": "2009-05-23T13:39:55.263287Z", 
  "msg": [
   "Major refactoring of the IteratorTag and its subclasses. The new versions are much, much simpler, have zero redundant code and are easily extensible. As part of this refactoring, direct manipulation of WikiContext state via request attribute WikiTagBase.ATTR_CONTEXT is now officially discouraged; use WikiContextFactory.saveContext() and WikiContextFactory.findContext() instead. Added Javadocs."
  ], 
  "revision_id": "777924"
 }, 
 {
  "author": "ajaquith", 
  "date": "2009-05-23T13:37:22.713942Z", 
  "msg": [
   "Major refactoring of attachment handling. AttachmentServlet has been removed in favor of AttachmentActionBean. The Stripes DynamicMappingFilter was added to ensure that /attach URLs are mapped correctly. Upload URLs are slightly different, but download URLs remain the same (and in fact are now path-aware, so they support spaces and subpages). AttachmentServlet will be removed from the code entirely once AttachmentActionBean is better road-tested."
  ], 
  "revision_id": "777923"
 }, 
 {
  "author": "rajith", 
  "date": "2009-05-23T13:35:38.233183Z", 
  "msg": [
   "The default value for message cache is set to false.", 
   "Added the functionality to support variable message sizes using -Drandom_msg_size=true.", 
   "This will create an array of payloads from 1 byte to x bytes where x is configured by -Dmsg_size=x (default is 1024).", 
   "The Random number generator works of the same seed so different test runs can be compared properly."
  ], 
  "revision_id": "777922"
 }, 
 {
  "author": "ajaquith", 
  "date": "2009-05-23T13:33:11.858495Z", 
  "msg": [
   "WikiPath gains a helpful method, getName(), which returns just the portion of the path after the last slash. It works just like File.getName(). Reformatted the class also, with JavaDocs now fully reflecting rename of WikiName-->WikiPath."
  ], 
  "revision_id": "777921"
 }
]