[
 {
  "author": "tcunning", 
  "date": "2009-05-29T05:53:54.353512Z", 
  "msg": [
   "Fix problems with enum/schema validation in notification."
  ], 
  "revision_id": "779850"
 }, 
 {
  "author": "mikem", 
  "date": "2009-05-29T05:53:08.149132Z", 
  "msg": [
   "DERBY-4182", 
   "backporting svn 778926 from trunk to 10.5 branch.", 
   "Before this fix abort of inserts that included clob or blob chains would", 
   "destroy the links of the allocated pages of the chains. This would leave", 
   "allocated pages that could never be reclaimed either by subsequent post", 
   "commit processing or inplace compress. Only offline compress could reclaim", 
   "the space. This fix changes insert abort processing to automatically put", 
   "all pieces of long columns except for the head page on the free list as part", 
   "of the abort.", 
   "Note this does not fix existing tables that have had this problem happen in", 
   "the past, only stops it from happening. One must run an offline compress to", 
   "reclaim this space to fix any instances of this bug prior to this fix."
  ], 
  "revision_id": "779849"
 }, 
 {
  "author": "wrowe", 
  "date": "2009-05-29T05:49:07.938681Z", 
  "msg": [
   "Add a low numbered port daemon, mod ftp lowportd, which exists for the server", 
   "generation and will serve properly formed requests as bound sockets through", 
   "a unix domain pipe.  We trust sys/un.h to deteremine availability.", 
   "This likely needs a bit of refactoring to accomodate msg_accrights if a few", 
   "platforms still use this mechanism, however I'm too tired to bother at the", 
   "moment and still steamed at deleting this source when at 90% completion.", 
   "So it hits subversion in its working form for linux.", 
   "Mostly derived from code at mod_cgid, look there if something 'interesting'", 
   "is discovered, since the two code bases likely share any issues."
  ], 
  "revision_id": "779848"
 }, 
 {
  "author": "ctan", 
  "date": "2009-05-29T05:46:57.713471Z", 
  "msg": [
   "update continuum site"
  ], 
  "revision_id": "779847"
 }, 
 {
  "author": "kocolosk", 
  "date": "2009-05-29T05:31:01.592932Z", 
  "msg": [
   "make sure process is still alive before calculating memory footprint"
  ], 
  "revision_id": "779846"
 }
]