[
 {
  "author": "ashish", 
  "date": "2009-05-29T10:02:35.072161Z", 
  "msg": [
   "For now we are enabling link to checkout using Google Checkout.", 
   "For using this feature you may need to create Merchant Account in the Google Checkout area.", 
   "We can disable this links if anyone think otherwise but the idea of keeping these links on ecommerce is that the End User knows that this feature also exists in OFBiz and could use it accordingly."
  ], 
  "revision_id": "779910"
 }, 
 {
  "author": "gnodet", 
  "date": "2009-05-29T09:51:56.168030Z", 
  "msg": [
   "Disable the remote debugging in tests"
  ], 
  "revision_id": "779909"
 }, 
 {
  "author": "monteith", 
  "date": "2009-05-29T09:48:36.865387Z", 
  "msg": [
   "Add  local variable table support."
  ], 
  "revision_id": "779908"
 }, 
 {
  "author": "ashish", 
  "date": "2009-05-29T09:43:39.651198Z", 
  "msg": [
   "Here comes the first pass to create order in OFBiz from the notification message coming from the google checkout server.", 
   "For more details please have a look on the jira issue: OFBIZ-2545 (Create Order and Party information using google notification)", 
   "This is collaborative effort from Andrew Zeneski, Vivek Mishra, Arun Patidar, Anurag Singh Sengar & Me.", 
   "Thanks guys for giving a good head start to this feature.", 
   "More exciting features are coming soon in this area, so please stay tuned.", 
   "Thanks !"
  ], 
  "revision_id": "779907"
 }, 
 {
  "author": "antelder", 
  "date": "2009-05-29T09:42:53.846778Z", 
  "msg": [
   "Start adding support for non-webapp contributions. The idea being to enable using regular SCA contribution jas/zips/folders as well as webapps and have them all in the same sca domain and wiring between each other. None of the domain works yet as we need to make more progress on the dynamic doamin discussion. Eventually the non-webapp contributions would use the tomcat host config facilities so support hot deployment, and there'd be some domain management panels in the tuscany webapp to view and modify the domain. Could potentially have multiple domains within a tomcat instance though lets leave that for now as it adds some complications. Would also be good to get the SCAClient API able to talk to the tomcat domain so JSE clients can call sca services in tomcat"
  ], 
  "revision_id": "779906"
 }
]