[
 {
  "author": "karthick", 
  "date": "2009-06-04T20:43:07.652151Z", 
  "msg": [
   "Fix the QNames in the test case's expected response."
  ], 
  "revision_id": "781850"
 }, 
 {
  "author": "tabish", 
  "date": "2009-06-04T20:38:39.961139Z", 
  "msg": [
   "Updates to fix permissions problems on the files in the config dir."
  ], 
  "revision_id": "781849"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-06-04T20:22:40.674344Z", 
  "msg": [
   "VCL-144", 
   "Changed name of image_creation_failed() sub in image.pm to reservation_failed(). There is a sub named reservation_failed() in State.pm. Having a sub with the same name in image.pm will cause any calls to this sub for imaging reservations to use the one in image.pm because of inheritance. Also changed name of image_creation_successful() to reservation_successful() for consistency.", 
   "VCL-144", 
   "There were calls in xCAT.pm to image_creation_failed(). This is a state module function and provisioning modules don't have access to call state module functions so the call would have failed. I changed these calls to return 0. This will return control to the state module, which will then call reservation_failed();", 
   "VCL-23", 
   "Changed behavior in xCAT.pm::capture() when the OS module returns from pre_capture(). It now waits up to 2 minutes for the computer to shut down instead of shutting the computer down immediately. This will fix a problem where the OS initiates a shutdown then returns immediately, then xCAT.pm forces a power off while the OS is shutting down.", 
   "VCL-23", 
   "Added check for the existence of the TransardAFSDaemon service before attempting to stop it in clean_hard_drive(). This prevents an error from appearing in the log file if the service isn't installed."
  ], 
  "revision_id": "781848"
 }, 
 {
  "author": "luc", 
  "date": "2009-06-04T20:18:50.946258Z", 
  "msg": [
   "removed a print"
  ], 
  "revision_id": "781847"
 }, 
 {
  "author": "jm", 
  "date": "2009-06-04T20:15:55.530691Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "781846"
 }
]