[
 {
  "author": "scantor", 
  "date": "2009-06-09T17:48:57.942759Z", 
  "msg": [
   "Ignore VS runtime files."
  ], 
  "revision_id": "783080"
 }, 
 {
  "author": "tabish", 
  "date": "2009-06-09T17:48:54.365743Z", 
  "msg": [
   "https://issues.apache.org/activemq/browse/AMQCPP-245"
  ], 
  "revision_id": "783079"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-06-09T17:46:47.627358Z", 
  "msg": [
   "apply rows atomically, rather than one-column-at-a-time.  this avoids exposing the bug in time-sorted", 
   "columns discussed in #223.", 
   "patch by jbellis; reviewed by Jun Rao for CASSANDRA-208"
  ], 
  "revision_id": "783078"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-06-09T17:46:42.775951Z", 
  "msg": [
   "split sstable into data, index, and bloom filter files.  this allows us to avoid saving up index chunks", 
   "in memory until the sstable data is completely written, while still allowing fast scanning of the index", 
   "on startup.  it also simplifies the sstable/sequencefile code considerably.", 
   "patch by jbellis; reviewed by Jun Rao for  CASSANDRA-208"
  ], 
  "revision_id": "783077"
 }, 
 {
  "author": "mikem", 
  "date": "2009-06-09T17:29:03.657689Z", 
  "msg": [
   "DERBY-4182", 
   "backporting svn #778926 from trunk to 10.1 branch.", 
   "The test is junit based and did not backport cleanly. I hand tested", 
   "the fix and am just backporting the code changes to 10.2 and 10.1.", 
   "Before this fix abort of inserts that included clob or blob chains would", 
   "destroy the links of the allocated pages of the chains. This would leave", 
   "allocated pages that could never be reclaimed either by subsequent post", 
   "commit processing or inplace compress. Only offline compress could reclaim", 
   "the space. This fix changes insert abort processing to automatically put", 
   "all pieces of long columns except for the head page on the free list as part", 
   "of the abort.", 
   "Note this does not fix existing tables that have had this problem happen in", 
   "the past, only stops it from happening. One must run an offline compress to", 
   "reclaim this space to fix any instances of this bug prior to this fix."
  ], 
  "revision_id": "783076"
 }
]