[
 {
  "author": "rgrabowski", 
  "date": "2009-06-28T07:09:39.156000Z", 
  "msg": [
   "Merged back into /trunk/cs/V3/src in r789059"
  ], 
  "revision_id": "789060"
 }, 
 {
  "author": "rgrabowski", 
  "date": "2009-06-28T07:03:34.367655Z", 
  "msg": [
   "Merge from /branches/MappedStatementRefactor r788266:r789049", 
   "Refactored large MappedStatement class into partial classes:", 
   "MappedStatement.ExecuteInsert.cs", 
   "MappedStatement.ExecuteQueryForDataTable.cs", 
   "MappedStatement.ExecuteQueryForList.cs", 
   "MappedStatement.ExecuteQueryForMap.cs", 
   "MappedStatement.ExecuteQueryForObject.cs", 
   "MappedStatement.ExecuteUpdate.cs", 
   "All Execute methods call through to a single generic Execute method in MappedStatement.cs that ensures the RequestScope is created and events are raised in a consistent manner.", 
   "Enabled calls to ExecuteQueryForDataTable to be cached.", 
   "Documented that some calls to CachingStatement (i.e. those taking delegate and explicit result objects) are never cached.", 
   "Call Trim() before setting the CommandText of a stored procedure call to ensure the store procedure name is not prefixed with whitespace.", 
   "Update SqlClient.Text project from .NET 3.0 to .NET 3.5.", 
   "Expose ConfigurationSetting object in BaseTest to allow StatementNamespaceTest to run only when UseStatementNamespaces=true.", 
   "Refactored ThreadTest.", 
   "Added PostStatementEventArgs.CacheHit property that is set when the ResultObject comes from cache."
  ], 
  "revision_id": "789059"
 }, 
 {
  "author": "hansbak", 
  "date": "2009-06-28T06:49:25.717495Z", 
  "msg": [
   "moved calendar forms to own file, removed not used companyevents portlet, can update and cancel calendar events within the portlet calendar, removed sysinfo warnings from log"
  ], 
  "revision_id": "789058"
 }, 
 {
  "author": "gerdogdu", 
  "date": "2009-06-28T06:43:45.875596Z", 
  "msg": [
   "Do our injections more managable. See AbstractInjectable#inject"
  ], 
  "revision_id": "789057"
 }, 
 {
  "author": "gerdogdu", 
  "date": "2009-06-28T06:42:23.164793Z", 
  "msg": [
   "Removing method based resource injection. Specification does not support those kind of injection.", 
   "See section 3.5 and Section 5 for injection semantic. Java EE resource are injected by producer field", 
   "resource kind. We have to changed our resolution into bean based."
  ], 
  "revision_id": "789056"
 }
]