[
 {
  "author": "martins", 
  "date": "2009-07-01T12:47:12.502167Z", 
  "msg": [
   "Fix JIRA #14 - \"Change the properties names to start with \"wink\" instead of \"symphony\"", 
   "https://issues.apache.org/jira/browse/WINK-14"
  ], 
  "revision_id": "790145"
 }, 
 {
  "author": "davsclaus", 
  "date": "2009-07-01T12:46:34.140301Z", 
  "msg": [
   "CAMEL-1689: preserveMessageQos=true now allows you to use JMXxxx headers for QoS. And it will fallback to endpoint QoS if not provided in header. Fixed so inOnly messages also uses the same CamelJmsTemplate as inOut does so its same codepath. Improved debug logging to log when sending to queue and the actual message just before send so its most accurate."
  ], 
  "revision_id": "790144"
 }, 
 {
  "author": "pamarcelot", 
  "date": "2009-07-01T12:41:05.591770Z", 
  "msg": [
   "Fixed the build on Mac OS X. Added the needed information on Mac OS X JVM."
  ], 
  "revision_id": "790143"
 }, 
 {
  "author": "adelmelle", 
  "date": "2009-07-01T12:36:17.826938Z", 
  "msg": [
   "Some cleanups and attempts at improving code-readability and -extensibility:", 
   "* added inner holder class to BreakingAlgorithm to contain everything related to the fitness classes. Improves readability of both the code and the trace messages.", 
   "* extracted blocks of code in BreakingAlgorithm.findBreakingPoints() into protected methods. Following the already existing handleBox(), added handleGlueAt() and handlePenaltyAt() to provide extension points to subclasses. Extraction of the code-blocks related to the node-recovery mechanism.", 
   "* extracted blocks of code in BreakingAlgorithm.considerLegalBreak() into protected methods: deactivateNode(), activateNode() and forceNode()", 
   "* factored the functionality to obtain the index of the first box into KnuthSequence... just seemed to make sense; may be useful elsewhere.", 
   "* some (but not all :() javadoc fixups", 
   "* minor changes to LineLayoutManager and PageBreakingAlgorithm to take into account above changes"
  ], 
  "revision_id": "790142"
 }, 
 {
  "author": "markt", 
  "date": "2009-07-01T12:31:37.138637Z", 
  "msg": [
   "Withdraw patch based in bz comment"
  ], 
  "revision_id": "790141"
 }
]