[
 {
  "author": "djspiewak", 
  "date": "2009-07-15T06:52:23.184363Z", 
  "msg": [
   "Actually, I want italic instead of bold"
  ], 
  "revision_id": "794155"
 }, 
 {
  "author": "djspiewak", 
  "date": "2009-07-15T06:52:12.755286Z", 
  "msg": [
   "Added quick start guide"
  ], 
  "revision_id": "794154"
 }, 
 {
  "author": "djspiewak", 
  "date": "2009-07-15T06:52:03.810684Z", 
  "msg": [
   "Reorganized documentation for the ADHD; stubbed Quick Start"
  ], 
  "revision_id": "794153"
 }, 
 {
  "author": "noble", 
  "date": "2009-07-15T06:44:41.081250Z", 
  "msg": [
   "SOLR-920 changes did not go into CHANGES.txt"
  ], 
  "revision_id": "794152"
 }, 
 {
  "author": "hiranya", 
  "date": "2009-07-15T06:26:57.353201Z", 
  "msg": [
   "Adding the new multi XML configuration builder which initializes the Synapse configuration by processing a specified file hierarchy. The associated configuration serializer is also included. The following changes were made in the existing code to accomodate the new configuration builder.", 
   "* All Synapse deployment artifacts (proxy services, sequences, endpoints etc) now has a data member called 'fileName' which is by default initialized to null. This field can be used to store the name of the file where the corresponding artifact was defined. Getter/setter methods required to access the field are also provided.", 
   "* define* methods in the SynapseXMLConfigurationFactory now return the objects they create and add to the Synapse configuration. This enables custom configuration builders to manipulate Synapse configuration elements at configuration build time.", 
   "* The SynapseConfigurationBuilder checks whether the specified synapse xml is a file or a directory and calls the appropriate configuration builder.", 
   "Note that this addition does not alter the existing functionality and th configuration model at all. synapse.xml based configuration model is still supported and is the default method of configuring synapse."
  ], 
  "revision_id": "794151"
 }
]