[
 {
  "author": "geechorama", 
  "date": "2009-07-21T14:33:17.071858Z", 
  "msg": [
   "THRIFT-59. Fix memory leak by releasing allocated objects after assigning to container."
  ], 
  "revision_id": "796320"
 }, 
 {
  "author": "fguillaume", 
  "date": "2009-07-21T14:32:47.300720Z", 
  "msg": [
   "Removed branch with wrong name"
  ], 
  "revision_id": "796319"
 }, 
 {
  "author": "norman", 
  "date": "2009-07-21T14:32:12.179643Z", 
  "msg": [
   "display attachments in the MessageView and allow to download these"
  ], 
  "revision_id": "796318"
 }, 
 {
  "author": "tabish", 
  "date": "2009-07-21T14:28:11.290275Z", 
  "msg": [
   "Refactored the Synchronizbale interface a bit to make the param a long long and to add a new wait method that takes a long long and an int value for nanoseconds.  Added a start on a PriorityQueue implementation.  Added a new Timer class that mimics the Java Timer class and added the TimerTask interface that goes along with it.  Performed some other API documentation cleanup."
  ], 
  "revision_id": "796317"
 }, 
 {
  "author": "mamta", 
  "date": "2009-07-21T14:27:24.810979Z", 
  "msg": [
   "DERBY-4304", 
   "When running in insane mode, the stack trace of the exception was not getting printed in the console log file logs/serverConsoleOutput.log The reason for this is that the code was", 
   "doing following", 
   "consolePropertyMessage(\"DRDA_UnexpectedException.S\",", 
   "exception.getMessage());", 
   "consoleExceptionPrintTrace(exception);", 
   "That is, the stack trace printing was happening after the call to consolePropertyMessage. The call to consolePropertyMessage results into a call to consolePropertyMessageWork which may throw an exception back depending on the type of the error it is handling. If this method does throw an exception, then consoleExceptionPrintTrace does not get a chance to dump the stack trace into the logs/serverConsoleOutput. (Probably in sane mode, there is some other additional place where we do the stack trace printing and that is why we saw the stack trace despite consolePropertyMessage throwing an exception.) To fix the problem, I have switched the order of the 2 calls above and that makes sure that we do print the stack trace for debugging purpose."
  ], 
  "revision_id": "796316"
 }
]