[
 {
  "author": "kocolosk", 
  "date": "2009-07-22T17:34:14.172910Z", 
  "msg": [
   "various bugfixes and improvements for view compaction", 
   "View compaction was broken after the switch to signature-based index", 
   "files, but we don't have tests for it yet so we didn't notice.  I also", 
   "committed a few changes that should make compaction faster and more", 
   "robust:", 
   "* commit the header immediately after compaction finishes.  We used", 
   "to wait 1 seconds, but if the server restarted in that second the", 
   "index would be reset.", 
   "* unlink from old index file at the end. Prevents process crashes", 
   "that could couch_view (and with the delayed commit would sometimes", 
   "cause index resets).", 
   "* don't wait for running view updates to finish before replacing old", 
   "view index file.  If an update is running, restart it and point it to", 
   "the new view group.  This alleviates the situation where the view", 
   "compaction goes into a busy wait, printing \"still behind main file\"", 
   "1000s of times to the log, and generally makes compaction finish more", 
   "quickly.", 
   "* better logging"
  ], 
  "revision_id": "796805"
 }, 
 {
  "author": "gsingers", 
  "date": "2009-07-22T17:28:58.383397Z", 
  "msg": [
   "MAHOUT-147: improvements to Wikipedia capabilities"
  ], 
  "revision_id": "796804"
 }, 
 {
  "author": "djspiewak", 
  "date": "2009-07-22T17:23:36.763135Z", 
  "msg": [
   "Removed extraneous slash (it was bugging me)"
  ], 
  "revision_id": "796803"
 }, 
 {
  "author": "tvolkert", 
  "date": "2009-07-22T17:21:59.795886Z", 
  "msg": [
   "PIVOT-183 & PIVOT-184 :: make table view editors disable editor components for read-only cells, and make store() be a no-op for disabled components"
  ], 
  "revision_id": "796802"
 }, 
 {
  "author": "bentmann", 
  "date": "2009-07-22T17:15:50.395534Z", 
  "msg": [
   "[MNG-4201] Custom packaging break in trunk (rev 784628)", 
   "o Restored compat with 2.x, both in terms of lifecycle configuration and API for implementors of custom mappings"
  ], 
  "revision_id": "796801"
 }
]