[
 {
  "author": "ritchiem", 
  "date": "2009-08-03T13:21:43.266936Z", 
  "msg": [
   "QPID-2001 : Corrected MSLSubject, extracting the Store from the vhost fails to retrieve the right value during startup. So better to explicitly specify the vhost and message store."
  ], 
  "revision_id": "800360"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-03T13:20:20.755051Z", 
  "msg": [
   "QPID-2002 : Addition of ConnectionLoggingTest"
  ], 
  "revision_id": "800359"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-03T13:19:45.918511Z", 
  "msg": [
   "QPID-2001 : Update based on feedback from Marnie to be mindful of the impact of message creation.", 
   "Messages that do not need a message formatter now nolonger use the message formater."
  ], 
  "revision_id": "800358"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-03T13:19:13.659581Z", 
  "msg": [
   "QPID-2001 : Added missing MessageStoreLogSubject and corresponding test"
  ], 
  "revision_id": "800357"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-03T13:18:25.683749Z", 
  "msg": [
   "QPID-2011 : Updated AlertingTest to use new LogMonitoring class and corrected failures in test.", 
   "Failures corrected by:", 
   "- Ensuring message count is as expected after first publication", 
   "- Validating that the max count alert level is correctly changed (when InVM)", 
   "- Validate that the log file does not contain alerts after restart", 
   "- Validate that alerting occurs after extra messages have been published", 
   "- Modified QPID_WORK (using QTC.setSystemProperty so it is only set for that test run) to ensure each test has a clean store.", 
   "Additions to QpidTestCase:", 
   "- Ability to enable persistence on a given virtualhost. Currently it tries to set the JBoss BerkelyDB store failing back to Qpid's DerbyDB store.", 
   "- Ability to set properties in the configuration file, this involves re-writting the config files so that both inVM and external java brokers will correctly function with the desired configuration."
  ], 
  "revision_id": "800356"
 }
]