[
 {
  "author": "ritchiem", 
  "date": "2009-08-06T09:43:12.458612Z", 
  "msg": [
   "QPID-2002 : Completion of BrokerLoggingTest, the shutdown tests have been excluded due to QPID-2031. An update to the LogMessages.vm templates and ApplicationRegistry was requried. This is because BrokerMessages is loaded before the ApplicationRegistry is initialised. As a result the NullApplicationRegistry is created which should not be used. The AR is loaded to discover the current Locale. There were a couple of options here. Either always use the Default Locale and have the AR loading set that or add the ability to check if the AR has been configured. I chose the latter as knowing if an AR exists may be useful for our testing framework."
  ], 
  "revision_id": "801575"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-06T09:41:33.528225Z", 
  "msg": [
   "QPID-1223 : Non QTC and some QTC tests are still not correctly cleaning up the VM state after their test run. Updated all tests to use the default AR,getInstance() before creation of a TransportConnection (which now uses AR.DEFAULT_INSTANCE rather than '1'). On shutdown updated to ensure AR.remove() is called and not just AR.close()"
  ], 
  "revision_id": "801574"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-06T09:40:25.126945Z", 
  "msg": [
   "QPID-2002 : Updates to Test ARs to correctly remove the CurrentActor on close. Update to CFAR to ensure that an Actor is set during shutdown. Update to TestLogActor's log Name and corrected CurrentActorTest's testname."
  ], 
  "revision_id": "801573"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-06T09:39:28.620013Z", 
  "msg": [
   "QPID-2002: MessageStore Logging , DerbyMS Does not have Queue Recovery logging just yet as its approach to recovery does not provide the requried details."
  ], 
  "revision_id": "801572"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-08-06T09:38:14.231045Z", 
  "msg": [
   "QPID-2002 : Javadoc'd CurrentActor"
  ], 
  "revision_id": "801571"
 }
]