[
 {
  "author": "maartenc", 
  "date": "2009-08-06T21:29:53.858452Z", 
  "msg": [
   "FIX: Credentials were not set properly for URLs that require authentication when using HttpClient."
  ], 
  "revision_id": "801820"
 }, 
 {
  "author": "dkulp", 
  "date": "2009-08-06T21:21:49.255534Z", 
  "msg": [
   "Add a BUNCH of events from the factories and create a listener interface", 
   "to get the events.", 
   "Start defining some useful annotations. @SchemaValidation now works.", 
   "@WSDLDocumentation is started (lots more work needed).", 
   "May convert some of the other annotation processing to new framework", 
   "once I start nailing it down some more."
  ], 
  "revision_id": "801819"
 }, 
 {
  "author": "rickhall", 
  "date": "2009-08-06T21:07:10.306435Z", 
  "msg": [
   "Tried to improve naming further using \"requirement/capability\"", 
   "instead of \"require/provide\". (FELIX-1151)"
  ], 
  "revision_id": "801818"
 }, 
 {
  "author": "mikem", 
  "date": "2009-08-06T20:57:14.265023Z", 
  "msg": [
   "DERBY-4331 : Join returns results in wrong order", 
   "backporting fix (#801481) from trunk to 10.5 branch.", 
   "Fixes a number of sort avoidance bugs that were introduced by the fix", 
   "for DERBY-3926.  This check in backs out the equi-join part of the DERBY-3926.", 
   "The changes for this were isolated and were the only changes to", 
   "FromBaseTable.java.  Backing out only this part of the 3926 checkin fixes new", 
   "problems identified in DERBY-4331, and continues to fix the problem queries in", 
   "DERBY-3926.  Knowledge of equijoin is no longer used as a factor for", 
   "sort avoidance.", 
   "Also included is an update to the wisconsin tests.  A number of diffs", 
   "resulted from different join order to maintain a sort avoidance plan.  2", 
   "queries identified in DERBY-4339 no longer use sort avoidance.", 
   "The new test cases were reported as part of 4331 were added to the", 
   "OrderByAndSortAvoidance test."
  ], 
  "revision_id": "801817"
 }, 
 {
  "author": "markt", 
  "date": "2009-08-06T20:41:29.660430Z", 
  "msg": [
   "Propose TLD back-port"
  ], 
  "revision_id": "801816"
 }
]