[
 {
  "author": "markrmiller", 
  "date": "2009-08-12T01:24:39.560225Z", 
  "msg": [
   "fixes for LUCENE-1771 back compat breaks"
  ], 
  "revision_id": "803340"
 }, 
 {
  "author": "markrmiller", 
  "date": "2009-08-12T01:22:30.671229Z", 
  "msg": [
   "LUCENE-1771: QueryWight back to Weight, but as abstract class rather than interface - explain now takes a Searcher and passes the sub reader that contains the doc if a top level reader is a multi reader."
  ], 
  "revision_id": "803339"
 }, 
 {
  "author": "twilliams", 
  "date": "2009-08-12T00:58:37.688831Z", 
  "msg": [
   "Add initial Lucene translation structure."
  ], 
  "revision_id": "803338"
 }, 
 {
  "author": "szetszwo", 
  "date": "2009-08-12T00:53:21.146235Z", 
  "msg": [
   "HDFS-534. Include avro in ivy."
  ], 
  "revision_id": "803337"
 }, 
 {
  "author": "bpendleton", 
  "date": "2009-08-12T00:48:11.825205Z", 
  "msg": [
   "DERBY-4282: Strange behavior with \"where current of\" in CheckConstraintTest", 
   "This patch was contributed by Eranda Sooriyabandara (070468D at gmail dot com)", 
   "This patch addresses an issue involving the binding of check constraints", 
   "in queries which use the \"where current of\" construction to refer to the", 
   "current row of an open cursor. The update statement was failing with a", 
   "\"column not found\" error, complaining about the column referred to by the", 
   "check constraint.", 
   "The problem arises in the processing of ResultColumnList.expandToAll, which", 
   "is used to construct ResultColumn instances for the columns in the table;", 
   "these result column instances are then used when the check constraint", 
   "is bound. ResultColumnList.java was constructing the ResultColumn instances", 
   "as unnamed, which caused an internal name \"SQLCOL1\" to be generated, which", 
   "later then caused the check constraint binding to fail.", 
   "The solution is simply to ensure that the ResultColumn references that are", 
   "built by expandToAll are named according to the column names.", 
   "The patch also adds several new test cases."
  ], 
  "revision_id": "803336"
 }
]