[
 {
  "author": "digy", 
  "date": "2009-08-12T20:19:48.719251Z", 
  "msg": [
   "LUCENENET-188 Index/TestIndexInput/TestRead fails - (invalid UTF8 sequence)."
  ], 
  "revision_id": "803695"
 }, 
 {
  "author": "mikem", 
  "date": "2009-08-12T20:16:48.245211Z", 
  "msg": [
   "DERBY-4037", 
   "updated test to wait longer if expected background tasks have not cleaned up", 
   "expected pages yet.  Fast machines should see no slowdown in the test.  Slower", 
   "machines will wait up to 100 seconds before reporting failure after checking", 
   "iteratively for result every 1 second.  Also enhanced printout to identify", 
   "which test is failing between the 2 possibilities.", 
   "/mikem"
  ], 
  "revision_id": "803694"
 }, 
 {
  "author": "adrianc", 
  "date": "2009-08-12T20:09:32.519599Z", 
  "msg": [
   "Initial implementation of the ExecutionContext.", 
   "I created two new folders in framework: api and context. The api folder will be used to contain interfaces for commonly used framework artifacts. The implementations will remain in the existing components. The context folder contains the implementation of ExecutionContext.", 
   "I was able to solve the cross-dependency issue by having each component in the compiler chain extend the ExecutionContext interface and add its own artifacts. The final version of the interface is in the service component. I know this is unusual, but it is only temporary. When the api folder is built out, the ExecutionContext interfaces will be consolidated into one - and that will be kept in the api folder.", 
   "Right now the ExecutionContext doesn't do anything except contain commonly used objects, and it keeps track of the thread's execution path. The idea is to have this one object passed around instead of the current half-dozen or so objects. The execution path will be used for the forthcoming security redesign.", 
   "If you want to see it in action, change the executionContext.verbose property in api.properties to true, and uncomment the blocks of screen widget code in the Example component: line 40 in ExampleScreens.xml, and line 25 in ExampleForms.xml. The console log will show the ExecutionContext pushing and popping artifacts, and the Find Example screen will display the execution path for the screen."
  ], 
  "revision_id": "803693"
 }, 
 {
  "author": "rhs", 
  "date": "2009-08-12T20:08:48.335056Z", 
  "msg": [
   "made width default pay attention to the COLUMNS environment variable"
  ], 
  "revision_id": "803692"
 }, 
 {
  "author": "olegk", 
  "date": "2009-08-12T20:08:14.632803Z", 
  "msg": [
   "Updates for HttpClient 4.0 release"
  ], 
  "revision_id": "803691"
 }
]