[
 {
  "author": "coar", 
  "date": "1998-03-17T13:08:55.000000Z", 
  "msg": [
   "Make sure that include/hide.h is included always.  Dependencies", 
   "from \"make depend\" are now stable regardless of the rule's setting."
  ], 
  "revision_id": "80574"
 }, 
 {
  "author": "rse", 
  "date": "1998-03-17T12:53:31.000000Z", 
  "msg": [
   "Backout my recent changes, because we now have src/support/ab.[c1] which", 
   "already contains these changes together with a lot of other cleanups. Better", 
   "to leave the original zb.c as original as it can be...  (BTW: This zb.c is", 
   "already not really original, because there were already two commits from Dean", 
   "in the past)"
  ], 
  "revision_id": "80573"
 }, 
 {
  "author": "rse", 
  "date": "1998-03-17T12:46:42.000000Z", 
  "msg": [
   "Include of the new \"ApacheBench\" support program:", 
   "o base is ZeusBench 1.0 from Adam Twiss, Zeus Technology Ltd.", 
   "o includes enhancements by Dean from November 1997 for keepalive, SunOS4,", 
   "etc. pp. which were already committed to src/test/zb.c", 
   "o cleanups and enhancements by Ralf from March 1998: command line", 
   "parsing, new options, URL-like target specification, manual page,", 
   "Apache-style code indentation, etc.", 
   "o !!IMPORTANT!! personal license agreement from March 1998 with Adam Twiss", 
   "from Zeus Technology (see message", 
   "<199803171224.NAA24547@en1.engelschall.com> in apache-core mailing list", 
   "for reference) to include this version into the Apache distribution the", 
   "way it currently is. So, don't change copyright messages or other", 
   "license stuff there, please. The program itself can now be enhanced or", 
   "changed in any way."
  ], 
  "revision_id": "80572"
 }, 
 {
  "author": "coar", 
  "date": "1998-03-17T11:33:41.000000Z", 
  "msg": [
   "The majority feeling seems to be that Rule HIDE should default", 
   "to \"yes\"; make it so.  People who are debugging can turn it", 
   "off for ease of name-typing, but the default as distributed", 
   "should try to play well with others."
  ], 
  "revision_id": "80571"
 }, 
 {
  "author": "rse", 
  "date": "1998-03-17T09:59:30.000000Z", 
  "msg": [
   "update for our lazy guys ;-)"
  ], 
  "revision_id": "80570"
 }
]