[
 {
  "author": "xuhaihong", 
  "date": "2009-08-19T08:33:05.536837Z", 
  "msg": [
   "GERONIMO-4793 Remove those duplicated jars in the lib folder of the console applications"
  ], 
  "revision_id": "805700"
 }, 
 {
  "author": "gnodet", 
  "date": "2009-08-19T08:32:30.762042Z", 
  "msg": [
   "Fix the ScpTest to wait longer until the file is ok"
  ], 
  "revision_id": "805699"
 }, 
 {
  "author": "ltheussl", 
  "date": "2009-08-19T08:32:03.186229Z", 
  "msg": [
   "Add confluence test resources, actual tests TBD"
  ], 
  "revision_id": "805698"
 }, 
 {
  "author": "norman", 
  "date": "2009-08-19T08:31:47.486156Z", 
  "msg": [
   "Add support for creating new folders.."
  ], 
  "revision_id": "805697"
 }, 
 {
  "author": "kahatlen", 
  "date": "2009-08-19T08:28:45.446458Z", 
  "msg": [
   "DERBY-4081: BTreeController.comparePreviousRecord() may fail to release latch on left-most leaf", 
   "When a new value is inserted into a nullable unique index, the rows", 
   "immediately to the left and the right of the insertion point are", 
   "checked for duplicates. comparePreviousRecord() checks the rows to the", 
   "left of the insertion point. If the row immediately to the left is", 
   "marked as deleted, it will have to go further to the left until it", 
   "finds a row that is not deleted.", 
   "Now this check may cross page boundaries, and if it does so, and all", 
   "the rows to the left of the insertion point are deleted,", 
   "comparePreviousRecord() will return NO_MATCH before the latch", 
   "left-most leaf in the index has been released.", 
   "This means that the left-most leaf is still latched when", 
   "comparePreviousRecord() returns, which it is not supposed to be unless", 
   "the new value was actually inserted into the left-most leaf. The", 
   "unexpected extra latch may cause deadlocks or livelocks.", 
   "This patch adds a test that runs into a livelock because of the bug,", 
   "and it fixes the bug by releasing the latch on the left-most leaf", 
   "before returning NO_MATCH from comparePreviousRecord()."
  ], 
  "revision_id": "805696"
 }
]