[
 {
  "author": "markrmiller", 
  "date": "2009-08-21T17:04:42.095212Z", 
  "msg": [
   "pull QueryUtil check back out"
  ], 
  "revision_id": "806645"
 }, 
 {
  "author": "cwiklik", 
  "date": "2009-08-21T17:01:41.971599Z", 
  "msg": [
   "UIMA-1358 Commiting Burn's changes"
  ], 
  "revision_id": "806644"
 }, 
 {
  "author": "ashish", 
  "date": "2009-08-21T17:00:55.634872Z", 
  "msg": [
   "First pass on Orbital Gateway: http://download.chasepaymentech.com/", 
   "Following things are covered in this implementation:", 
   "1) Services written for ccAuth, ccAuthCapture, ccAuthRelease, ccAuthRefund, ccCapture.", 
   "2) Instead of property files we have kept commonly used values in the entity - for this created new entity - PaymentGatewayOrbital.", 
   "3) The initialisation of \"Configurator\"(which is a class that is being used for the initialisation of configuration settings - like user credentials and many more things). For now configurator takes only file by name \"linehandler.properties\". So I have created new files by this name.", 
   "4) Also added demo data in ecommerce files so it can be used if someone want to use it for gateway purpose.", 
   "5) For now we have excluded the compilation of this gateway - I will provide an end user document for this soon so anybody would be able to configure it easily.", 
   "This is collaborative effort from me and following guys.", 
   "Scott Gray: Discussed so many things with me in the b/w this implementation. There were some security settings issue with jdk installation - Scott helped me in that area.", 
   "Anil  Patel & Tim Ruppert: Initial implementation plan discussed with Anil and there were so many things that I had discussed with Anil & Tim in b/w. Thanks Tim for encouraging us to put this gateway on OFBiz trunk so it could be used by larger audience.", 
   "Mridul & Sumit: I have asked these guys to see the results / outcome of implementation and asked them to provide their comments/ thoughts.", 
   "Thanks a lot guys for your help - it was simply awesome.", 
   "Suggestions and comments are most welcome - I will wait for them.", 
   "Thank you!"
  ], 
  "revision_id": "806643"
 }, 
 {
  "author": "rdonkin", 
  "date": "2009-08-21T17:00:12.277357Z", 
  "msg": [
   "Added transition content split between more general instructions about updating apache documentation when a new key is generated, and detailed instructions of the process required to set up a keyring with two secret keys. I only run Linux so Windows specific instructions await a volunteer."
  ], 
  "revision_id": "806642"
 }, 
 {
  "author": "jonathan", 
  "date": "2009-08-21T16:58:31.084724Z", 
  "msg": [
   "Added documentation for AMQP 0-10 URL format."
  ], 
  "revision_id": "806641"
 }
]