[
 {
  "author": "sergeyb", 
  "date": "2009-08-24T16:22:56.634764Z", 
  "msg": [
   "JAXRS : updating ResourceUtils to collect all the available resource classes"
  ], 
  "revision_id": "807295"
 }, 
 {
  "author": "schor", 
  "date": "2009-08-24T16:22:49.683469Z", 
  "msg": [
   "no Jira - add .settings to svnignore"
  ], 
  "revision_id": "807294"
 }, 
 {
  "author": "eae", 
  "date": "2009-08-24T16:10:28.451991Z", 
  "msg": [
   "UIMA-1225"
  ], 
  "revision_id": "807293"
 }, 
 {
  "author": "rajith", 
  "date": "2009-08-24T16:02:08.808500Z", 
  "msg": [
   "This is related to QPID-2074", 
   "I added a flag to disable flow control when max prefetch is zero. This will also prevent unnessacery suspend/resume actions (and hence extra threads being spawned) when the non meaningful thresholds (for the above case) are passed.", 
   "I also think that adjusting the count and puting the message into the queue should be an atomic operation. This means notifying the listener will also need to be squeezed insde the same sync block. Another point to note is that this is redundent in the 0-10 codepath as we have protocol level flow control. Since  a more complete overhaul is needed in this area, for the time being I have only done the bare minimum.", 
   "I also added a timeout for all sync receives in the DurableSubscriptionTest. This will prevent the whole test suite from hanging if messages don't arrive as expected."
  ], 
  "revision_id": "807292"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-08-24T16:00:26.205112Z", 
  "msg": [
   "VCL-195", 
   "Updated Version_6.pm::install_kms_client_product_key() sub to not include the trademark strings in the hash of product names. The product name retrieved from the registry is matched up against the keys in this hash to determine the correct product key to use. The trademark string is ignored when finding a product name.", 
   "Fixed bug in firewall_enable_ssh() and firewall_enable_ssh_private() subs. The SSH command to delete existing port exceptions and then enable the correct exception was hanging under Windows 2008. These commands are now wrapped in a cygstart call which fixes the problem."
  ], 
  "revision_id": "807291"
 }
]