[
 {
  "author": "kahatlen", 
  "date": "2009-09-03T10:13:17.516221Z", 
  "msg": [
   "DERBY-4284: All Columns become Nullable when Using left join", 
   "Only the columns from the right side of a left outer join, or", 
   "from the left side of a right outer join, should be changed to", 
   "nullable. This is done correctly in JoinNode.buildRCL(), but in", 
   "addition SelectNode.bindResultColumns() makes all result columns", 
   "nullable if the from list contains an outer join.", 
   "This patch fixes the bug by removing the code in SelectNode that", 
   "makes all columns nullable. This also made it possible to remove", 
   "a method in FromList that became unused after the fix. Also, some", 
   "test canons needed to be updated because IJ may change the", 
   "formatting/spacing slightly depending on whether the result", 
   "columns are nullable or not.", 
   "The fix also exposed another manifestation of DERBY-2916, where", 
   "some nodes saw the wrong nullability because they looked at the", 
   "columns before JoinNode.buildRCL() had done its job. This was", 
   "addressed by adding a workaround to JoinNode.getMatchingColumn().", 
   "Also, changes that had been made to wisconsin.out as part of", 
   "DERBY-2916 earlier in order to make the Wisconsin test run", 
   "cleanly despite the bug, could now be reverted because of the", 
   "workaround."
  ], 
  "revision_id": "810860"
 }, 
 {
  "author": "pquerna", 
  "date": "2009-09-03T10:10:39.659746Z", 
  "msg": [
   "test staging system"
  ], 
  "revision_id": "810859"
 }, 
 {
  "author": "hindessm", 
  "date": "2009-09-03T10:07:02.868428Z", 
  "msg": [
   "Set java version system properties correctly if -Djava6=true property", 
   "is set on the ant build command line."
  ], 
  "revision_id": "810858"
 }, 
 {
  "author": "jacopoc", 
  "date": "2009-09-03T09:55:14.486580Z", 
  "msg": [
   "Fix for issue happening after that Xalan jars have been added to the classpath: namespaces were added to each and every element.", 
   "Thanks to Ashish Vijaywargiya for the bug report and tests."
  ], 
  "revision_id": "810857"
 }, 
 {
  "author": "smartini", 
  "date": "2009-09-03T09:55:13.892371Z", 
  "msg": [
   "add some missing override, in some cases on methods of inner classes (not shown in eclipse warnings)"
  ], 
  "revision_id": "810856"
 }
]