[
 {
  "author": "antelder", 
  "date": "2009-09-10T13:59:32.657409Z", 
  "msg": [
   "Remove empty directories"
  ], 
  "revision_id": "813445"
 }, 
 {
  "author": "ashish", 
  "date": "2009-09-10T13:58:33.740128Z", 
  "msg": [
   "Initial pass on new call \"GetOrders\" (More to come in a day or so) - http://developer.ebay.com/DevZone/XML/docs/Reference/eBay/GetOrders.html. OOTB we have \"GetSellersTransactions\" call implemented but we have observed something strange in its functionality.", 
   "Here are few reason for this implementation:", 
   "-- In \"GetSellersTransactions\" itemId(ProductId in ebay) is provided in the OrderHeader.externalId field which doesn't seems correct.", 
   "-- Suppose we have Single Order created in eBay if some one wins the auction and in that order we have 3 order items.", 
   "Then \"GetSellersTransaction\" call creates three orders in OFBiz for all those three items that are associated with Single Ebay order.", 
   "In short \"GetSellersTransaction\" request treat three item as three transactions.", 
   "-- \"GetOrders\" call will return the list of orders on the basis of search criteria and then we will create(Import) the Order in OFBiz from the resultant list of orders.", 
   "-- Current implementation for \"GetSellersTransactions\" will remain as it is in trunk - as we don't know if someone might be using it in their custom projects.", 
   "Also did miscellaneous cleanup.", 
   "Thanks Jacopo for providing your notes for this implementation & also discussing issues in b/w development - as always your notes were awesome."
  ], 
  "revision_id": "813444"
 }, 
 {
  "author": "lhein", 
  "date": "2009-09-10T13:56:19.363888Z", 
  "msg": [
   "applied patch provided by Willem Jiang (see SMX4-356)"
  ], 
  "revision_id": "813443"
 }, 
 {
  "author": "antelder", 
  "date": "2009-09-10T13:56:17.717111Z", 
  "msg": [
   "Package renames to match module name and simplify"
  ], 
  "revision_id": "813442"
 }, 
 {
  "author": "werpu", 
  "date": "2009-09-10T13:55:53.931099Z", 
  "msg": [
   "http://issues.apache.org/jira/browse/EXTSCRIPT-1", 
   "added missing faces-config for the factories...", 
   "the basic examples are now working with myfaces 2.0, yiehaa"
  ], 
  "revision_id": "813441"
 }
]