[
 {
  "author": "ashish", 
  "date": "2009-09-14T10:18:43.230582Z", 
  "msg": [
   "Another pass on eBay Order Imports using GetOrders request.", 
   "Following things are done in this patch:", 
   "-- Moved commonly used methods to EbayHelper.java file.", 
   "-- Created two main methods \"readGetOrdersResponse\" & \"createShoppingCart\" to read xml data coming from Ebay and then create order in OFBiz respectively.", 
   "-- Also provided sample response XML data that is being generated from Ebay.", 
   "-- Changed the UI in which first it was searching orders and then from the orders list we were importing orders.", 
   "Now we have only one screen available in which search criteria for order is provided & on the basis of that search criteria order gets imported in OFBiz.", 
   "-- Previous work for importing Orders(Not exactly order - it was transaction) is working fine OOTB.", 
   "Here are few things that I am thinking to do in this area soon:", 
   "-- Improve error handling code - code cleanup.", 
   "-- Provide scheduled service UI(or prepare demo data for scheduling job) in which the orders will be imported automatically in the system instead of searching and then importing done by end user. - Thinking the best way to handle it.", 
   "Thanks Rishi & Sumit for discussing few things/ issues in b/w the development of this pass."
  ], 
  "revision_id": "814560"
 }, 
 {
  "author": "antelder", 
  "date": "2009-09-14T10:18:31.020393Z", 
  "msg": [
   "Start bringing up host-jms-asf, just for now, i want to get rid of this module later by having it the default in the runtime module"
  ], 
  "revision_id": "814559"
 }, 
 {
  "author": "antelder", 
  "date": "2009-09-14T10:16:53.297948Z", 
  "msg": [
   "Add manifest for jms binidng runtime"
  ], 
  "revision_id": "814558"
 }, 
 {
  "author": "antelder", 
  "date": "2009-09-14T10:15:42.717233Z", 
  "msg": [
   "Remove unnecessary dependency from bpel model module"
  ], 
  "revision_id": "814557"
 }, 
 {
  "author": "vsiveton", 
  "date": "2009-09-14T10:12:19.172607Z", 
  "msg": [
   "o validate locale and charset options", 
   "o added more unit tests"
  ], 
  "revision_id": "814556"
 }
]