[
 {
  "author": "markt", 
  "date": "2009-09-15T15:38:21.034012Z", 
  "msg": [
   "Port fix for BZ42728 - http://svn.apache.org/viewvc?view=rev&revision=808985"
  ], 
  "revision_id": "815370"
 }, 
 {
  "author": "faywang", 
  "date": "2009-09-15T15:38:12.841343Z", 
  "msg": [
   "OPENJPA-1151: fix test case error for MySQL. DB object in MySQL is case-sensitive."
  ], 
  "revision_id": "815369"
 }, 
 {
  "author": "woonsan", 
  "date": "2009-09-15T15:34:19.539980Z", 
  "msg": [
   "APA-15: Adding reverse proxied url replacement option and auto-resizing option.", 
   "If the IFrame portlet has preferences to map the local base path to the remote base url, then the external url src will be replaced by the local path.", 
   "For example, if the following pairs are set by the preferences,", 
   "\"PROXYREMOTEURL\" = \"http://portals.apache.org/\"", 
   "\"PROXYLOCALPATH\" = \"/jetspeed/webcontent/portals/\"", 
   "then, the IFrame portlet will replace \"http://portals.apache.org/\"\" of the src attribute by \"/jetspeed/webcontent/portals/\".", 
   "If a portal web site administrator configures a reverse web proxy provider, this feature can help that case.", 
   "Also, the portlet can have \"AUTORESIZE\" preference. If this preference is set to true, then the portlet will try to resize the height of the iframe based on the content height.", 
   "This \"AUTORESIZE\" preference option will not work if the iframe src url is in a different domain url and it can make script errors.", 
   "So, if you want to use \"AUTORESIZE\" option with external domain urls, then you might consider reverse proxied url option mentioned above."
  ], 
  "revision_id": "815368"
 }, 
 {
  "author": "bodewig", 
  "date": "2009-09-15T15:28:35.921374Z", 
  "msg": [
   "make sure slf4j sees a Gump built Ant in the org.apache.ant groupId"
  ], 
  "revision_id": "815367"
 }, 
 {
  "author": "faywang", 
  "date": "2009-09-15T15:28:10.116458Z", 
  "msg": [
   "OPENJPA-1151: fix this test case error for MySQL. DB object in MySQL is case-sensitive."
  ], 
  "revision_id": "815366"
 }
]