[
 {
  "author": "ritchiem", 
  "date": "2009-09-28T15:33:18.926079Z", 
  "msg": [
   "QPID-1871 : Updated RollbackOrderTest to include an onMessage test. Fixed deadlock issue with 0-10 rollback method and onMessage usage. Moved 0-10 rollback strategy to the abstract AMQSession and updated 0-8 to use that approach.", 
   "0-8 Still excluded from test runs as the race condition is not that the dispatcher would hold a message and reject after the TxRollback. The problem is the Java Broker sends a message out after the FlowOk message so the Dispatcher then sits on it, see QPID-2116. This exact problem was hidden due to the way the Dispatcher is stopped. This problem has not been addressed. The request to stop the dispatcher can only actually stop the dispatcher whilst it is in the middle of processing a message. The stop needs to interrupt the _queue.take() and hold the dispatcher AFTER the processing of any message that it needs to do: see QPID-2117."
  ], 
  "revision_id": "819590"
 }, 
 {
  "author": "woonsan", 
  "date": "2009-09-28T15:32:23.365355Z", 
  "msg": [
   "JS2-1071: Adding site base url argument, reflecting on api changes."
  ], 
  "revision_id": "819589"
 }, 
 {
  "author": "woonsan", 
  "date": "2009-09-28T15:31:18.109097Z", 
  "msg": [
   "APA-17: Uses post method on form-based authentication."
  ], 
  "revision_id": "819588"
 }, 
 {
  "author": "schor", 
  "date": "2009-09-28T15:29:43.379248Z", 
  "msg": [
   "UIMA-1546 renaming improvement of assembly generation - rename target/bin to target/assembly-bin"
  ], 
  "revision_id": "819587"
 }, 
 {
  "author": "schor", 
  "date": "2009-09-28T15:28:08.265399Z", 
  "msg": [
   "UIMA-1546 remove unnecessary LIC/NOT/DIS files from top level of sandbox distr, and also slight renaming improvement of assembly generation - rename target/bin and target/src to target/assembly-bin and target/assembly-src.  Add to License used for bin assembly the license for open office XML schemas (used in Tika)"
  ], 
  "revision_id": "819586"
 }
]