[
 {
  "author": "stoddard", 
  "date": "1998-09-10T17:36:15.000000Z", 
  "msg": [
   "Remove NT 64 thread limit.", 
   "Submitted by: Ken Parzygnat, Bill Stoddard", 
   "Reviewed by: Bill Stoddard"
  ], 
  "revision_id": "82029"
 }, 
 {
  "author": "rse", 
  "date": "1998-09-10T09:23:59.000000Z", 
  "msg": [
   "Fix possible buffer overflow situation in suexec.c.", 
   "PS: The PR#2790 provides a few more fixes for problematic", 
   "things in suexec.c. Because we have to be very carefully here, other", 
   "should review them, too. That's why I commit only some of the fixes from", 
   "this patch.", 
   "The other problem we _really_ have to fix is the docroot-check at line", 
   "428. But here the patch from the PR submitter seems to introduce a new", 
   "problem: It accesses cwd[dlen] which can be out of memory bounds. Here", 
   "memory bounds have to checked first.", 
   "So, I would appreciate when someothers look at PR#2790, please.  At least", 
   "the docroot-check _has_ to be fixed by us! But correctly, i.e. without", 
   "introducing new problems, of course ;_)", 
   "Submitted by: Jeff Stewart <jws@purdue.edu>", 
   "Reviewed by: Ralf S. Engelschall", 
   "PR: 2790"
  ], 
  "revision_id": "82028"
 }, 
 {
  "author": "rse", 
  "date": "1998-09-10T08:58:42.000000Z", 
  "msg": [
   "Add some more LIBS for the SCO5 platform which are needed for the already", 
   "used -lprot. It's actually a bug in SCO5, of course.", 
   "The background is this feedback from R.Record after I replied to him:", 
   "``Third, i still find the addition of \"-lx -ltinfo -lm\" to be necessary on", 
   "OpenServer. It's no doubt a bug or at least incorrectly documented, but any", 
   "time -lprot is used you also need -lx and -ltinfo to get nap(), cur_term(),", 
   "setup_term() and others. I've informed our development system guys and this", 
   "may be fixed in a later release but for now these libs are necessary. FYI,", 
   "libx is the SCO Xenix enhancements which have been carried forward since time", 
   "immemorial while libtinfo is the terminfo library. It looks like libprot is", 
   "supposed to setup its own curses stuff but isn't built correctly''", 
   "BTW, the following he also mentioned:", 
   "``First, a kernel bug in OpenServer 5.0.0 and 5.0.2 made it necessary to build", 
   "Apache with USE_FCNTL_SERIALIZED_ACCEPT.  That bug was fixed in 5.0.4 and a", 
   "patch made available for 5.0.0/5.0.2 systems. Further, i have created an", 
   "installation script which detects what release you are installing on and", 
   "whether you need to apply the \"Network Maintenance Supplement\".  Therefore, i", 
   "can now build Apache without the USE_FCNTL_SERIALIZED_ACCEPT which gets me", 
   "much better performance.  So, as long as you get Apache for OpenServer from", 
   "_me_ (that is, the SCO Skunkware CD-ROM or web site), you're ok. If you build", 
   "it yourself, you'd better know whether you need to apply the appropriate", 
   "support supplement.''", 
   "But I still think it's not really good to remove the", 
   "USE_FCNTL_SERIALIZED_ACCEPT. The only correct solution would be to dispatch", 
   "for 5.0.0 and 5.0.2 and avoid it only for >= 5.0.4.", 
   "Submitted by: Ronald Record <rr@sco.com>", 
   "PR: 2533"
  ], 
  "revision_id": "82027"
 }, 
 {
  "author": "rse", 
  "date": "1998-09-10T07:40:45.000000Z", 
  "msg": [
   "Rename some references in the docs from the old \"OSF1\" term to the official", 
   "term \"Digital UNIX\".", 
   "Submitted by: Robert Urban <urban@rto.dec.com>"
  ], 
  "revision_id": "82026"
 }, 
 {
  "author": "rse", 
  "date": "1998-09-10T07:40:43.000000Z", 
  "msg": [
   "Rename some references in the docs from the old \"OSF1\" term to the official", 
   "term \"Digital UNIX\".", 
   "Submitted by: Robert Urban <urban@rto.dec.com>"
  ], 
  "revision_id": "82025"
 }
]