[
 {
  "author": "mmartinec", 
  "date": "2009-09-30T16:01:28.748435Z", 
  "msg": [
   "Deal with BuiltinFunctions::RequireGlobFunction,", 
   "removing it from xt/60_perlcritic.t exceptions"
  ], 
  "revision_id": "820325"
 }, 
 {
  "author": "jdcasey", 
  "date": "2009-09-30T16:00:24.816724Z", 
  "msg": [
   "[MRESOURCES-105] This was half-fixed in the new plexus-interpolation version (1.13), so I tidied it up a bit to be consistent with the remote-resources plugin (1.1)."
  ], 
  "revision_id": "820324"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-09-30T15:59:27.117083Z", 
  "msg": [
   "QPID-2121 : Update to QTC to allow the setting of System Properties for just the Test run or the External Broker or both.", 
   "renamed _setProperties as it was confusing. Now two maps are used _propertiesSetForTestOnly and _propertiesSetForBroker calls to setSystemProperty puts the value in to both maps so test VM and the external VM will have a system property defined to have that value. If a test is configured to run against an external broker then two new methods help control how each vm is setup. setTestClientSystemProperty is used to set a value in the TestVM that is not copied to any external VM. setBrokerOnlySystemProperty can now be used to set a System property value in the external broker VM only.", 
   "As before all values are reverted at the end of the test run."
  ], 
  "revision_id": "820323"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-09-30T15:58:47.622161Z", 
  "msg": [
   "Correct order of log4j entries so our parser doesn't print an error"
  ], 
  "revision_id": "820322"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-09-30T15:58:16.435978Z", 
  "msg": [
   "QPID-2118 : Corrected 010Exclude for runtime selector exception. Tidied up SelectorTest so that it uses more of QTC functionality and stops creating random queue names. The init() methods could be totally removed with a bit more work. Updated test() to be testOnMessage() to better identify what test was supposed to be using onMessage() previously they all were! JMSMessageID test should now pass again on CPP profile."
  ], 
  "revision_id": "820321"
 }
]