[
 {
  "author": "seelmann", 
  "date": "2009-10-05T15:04:27.780512Z", 
  "msg": [
   "Fix for DIRSTUDIO-554 (Add option to save tabular entry editor automatically or manually)"
  ], 
  "revision_id": "821825"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-10-05T15:04:15.731802Z", 
  "msg": [
   "QPID-1816 : Add Acknowledge tests and QuickAcking manual test helper.", 
   "Updated AcknowldegeAfterFailoverTest to correctly cover the failure cases. Sending messages on a dirty transaction and Receiveing messagges on a dirty session."
  ], 
  "revision_id": "821824"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-10-05T15:03:16.197931Z", 
  "msg": [
   "Fix for dirty sessions, start to test that sessions are dirty when required."
  ], 
  "revision_id": "821823"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-10-05T15:02:24.283834Z", 
  "msg": [
   "QPID-1816 : Updated AcknowledgeTests to cover all ack modes and the synchronous receive and asynchronous onMessage approaches. Also added tests that failover between acking. Currently these tests are setup to repoulate the broker between failover. However, in a clustered environment that would not be requried. Investigation is need on how best to setup failover tests in general so that clustered and non-clustered environments can be easily tested."
  ], 
  "revision_id": "821822"
 }, 
 {
  "author": "ritchiem", 
  "date": "2009-10-05T15:01:17.686337Z", 
  "msg": [
   "Updated testing harness: QpidTestCase and FailoverBaseCase.", 
   "Updates to QpidTestCase:", 
   "to allow the sending of messages that are tagged from an offset value.", 
   "to correctly commit the sent messages if the sent number does not fit within the batch window.", 
   "update to createMessage to add an INDEX int property.", 
   "update to rename ssl connectionfactory default.ssl to align with other factories. updated test-provider accordingly.", 
   "added a getTestQueue method that creates an AMQQueue using getTestQueueName to further simplify tests.", 
   "Updates to FailoverBaseCase", 
   "removed setFailingPort, failBroker now takes the port to fail, this allows both brokers to be failed more easily.", 
   "Update to ensure that all subclasses get a failover connection url, through the getConnection(), some were not. Fixed by overriding getConnectionFactory() call.", 
   "Fixed second broker work directory to write to defined QPID_WORK rather than java.io.tmpdir. If QPID_WORK is not set then tests will fall back to java.io.tmpdir", 
   "getFailingPort now returns the correct value if you are running InVM (2)or externally(test.alt.port)", 
   "Updated tests that used failBroker to use failBroker(getFailingPort()) so tests will work InVM and externally."
  ], 
  "revision_id": "821821"
 }
]