[
 {
  "author": "curtisr7", 
  "date": "2009-10-05T19:26:11.075077Z", 
  "msg": [
   "OPENJPA250: Fix compile error."
  ], 
  "revision_id": "821980"
 }, 
 {
  "author": "chammers", 
  "date": "2009-10-05T19:25:19.257569Z", 
  "msg": [
   "Sorry, trying again"
  ], 
  "revision_id": "821979"
 }, 
 {
  "author": "johnh", 
  "date": "2009-10-05T19:24:36.701784Z", 
  "msg": [
   "This patch implements validation of the v= param used by the gadget rendering", 
   "and JS servlets to version and thus aggressively cache their content.", 
   "The patch introduces two new validation methods to UrlGenerator, one for", 
   "IframeUrls and one for JsUrls. Each is sufficiently generic that other", 
   "configuration mismatches could be validated in them as well. This does bloat", 
   "UrlGenerator a bit, which gives stronger reason to split it into separate URL", 
   "generation interfaces (gadget, js) sooner than later.", 
   "DefaultUrlGenerator is updated with JS validation using the jsChecksum already", 
   "available to it. The Iframe validation method is implemented with existing", 
   "semantics: trust v= if it exists. Subclasses may improve on this by doing", 
   "something like @Injecting a request-scoped Gadget object (directly or otherwise)", 
   "and validating the spec checksum directly.", 
   "JsServlet/GadgetRenderingServlet updated to avoid caching altogether in the case", 
   "of invalid/stale URLs.", 
   "Existing tests updated; it would be nice, at least during refactoring, to", 
   "improve tests to cover v= cases thoroughly."
  ], 
  "revision_id": "821978"
 }, 
 {
  "author": "chammers", 
  "date": "2009-10-05T19:23:24.632771Z", 
  "msg": [
   "initial copy of trunk to my branch"
  ], 
  "revision_id": "821977"
 }, 
 {
  "author": "fuankg", 
  "date": "2009-10-05T19:21:38.984686Z", 
  "msg": [
   "removed CodeWarrior IDE project file and its prebuild batch", 
   "file since they are not maintained nor used anymore, and thus", 
   "unusable in the current shape.", 
   "If in future someone wants to pick it up and update / fix it", 
   "then it can still be checked out from previous revisions."
  ], 
  "revision_id": "821976"
 }
]