[
 {
  "author": "fielding", 
  "date": "1998-10-06T19:06:09.000000Z", 
  "msg": [
   "Added a complete implementation of the Expect header field as", 
   "specified in rev-05 of HTTP/1.1.  Used that implementation as a means", 
   "of disabling the 100 Continue response when we already know the final", 
   "status, which is mighty useful for PUT responses that result in 302 or 401.", 
   "Moved two ugly protocol condition checks that were in http_request.c", 
   "over to where they belong in http_protocol.c.  They were put there", 
   "originally because ap_read_request formerly could not return an", 
   "error response, but I added that capability in 1.3.2.", 
   "Added removal of extra trailing whitespace from the getline results as part", 
   "of the protocol processing, which is extra nice because it works", 
   "between continuation lines, is almost no cost in the normal case", 
   "of no extra whitespace, and saves memory."
  ], 
  "revision_id": "82229"
 }, 
 {
  "author": "pcs", 
  "date": "1998-10-06T15:41:44.000000Z", 
  "msg": [
   "WIN32: Add new options to let Apache signal itself to shutdown or", 
   "restart. The option is -k, used like this:", 
   "-k shutdown", 
   "-k restart", 
   "This lets people signal Apache on Win95 systems (where previously Apache", 
   "was controlled by doing a ^C to stop it running).", 
   "Reviewed by:\tKen, Lars, Jim, Martin (all concept only)"
  ], 
  "revision_id": "82228"
 }, 
 {
  "author": "martin", 
  "date": "1998-10-06T15:40:44.000000Z", 
  "msg": [
   "In preparation for the 1.3.3 version"
  ], 
  "revision_id": "82227"
 }, 
 {
  "author": "pcs", 
  "date": "1998-10-06T15:36:02.000000Z", 
  "msg": [
   "Avoid warning about PID file being overwritten on each start of Apache.", 
   "This had two causes: first, if \"-i\", \"-u\" or \"-S\" was given (none of which", 
   "start a daemon) the PID file was being updated with the new PID. Secondly,", 
   "doing \"net stop apache\" or stopping Apache from the SCM did not remove the", 
   "PID file because reporting a STOPPED status to the SCM seems to stop the", 
   "process, so move the reporting of the STOPPED service to the very last", 
   "thing we do.", 
   "PR:     3053, 3084"
  ], 
  "revision_id": "82226"
 }, 
 {
  "author": "jim", 
  "date": "1998-10-05T23:04:28.000000Z", 
  "msg": [
   "Remove some out-of-date comments"
  ], 
  "revision_id": "82225"
 }
]