[
 {
  "author": "jleroux", 
  "date": "2009-10-09T09:24:54.305317Z", 
  "msg": [
   "New feature : in the POS adds the possibility to create a client profile (for now : name, email, phone#, card id for promo), email is also used to create an user login with card id as pwd (login/pwd couple follows changes).", 
   "The card id is stored in the Person.memberId field. It's used as a promo code. So if the same id is defined as a promocode, any promotion using this promo code will be added to the cart when you select a client from the Client Profile screen. Else a message will pop when selecting the client.", 
   "The idea is to generate promo codes and to use them as card id when creating the physical card.", 
   "The Client Profile screen (from Promo button in promo panel) allow you to search for all client (all fields empty) or to focus on a client (at least one field files). For now the search use a stric equals but I plan to allow also contains (ie %like%)", 
   "You may edit the client profile and as explained above select a client to apply promotions related to his/her card id.", 
   "I plan to add a status bar at bottom of the POS screen to see promocodes used (you may still enter arbitrary promo code with the Promo Code button) or even maybe rather the related promotions (but I doubt there will enough place).", 
   "The promo code is used as long as the cart is open.", 
   "There are also some generics enhancement in PosTransaction not all related to this new feature."
  ], 
  "revision_id": "823475"
 }, 
 {
  "author": "tellison", 
  "date": "2009-10-09T09:23:37.526505Z", 
  "msg": [
   "Remove unused const."
  ], 
  "revision_id": "823474"
 }, 
 {
  "author": "bdelacretaz", 
  "date": "2009-10-09T09:20:56.398963Z", 
  "msg": [
   "SLING-1141 - remove old jcrinstall codebase"
  ], 
  "revision_id": "823473"
 }, 
 {
  "author": "bommel", 
  "date": "2009-10-09T09:15:15.697306Z", 
  "msg": [
   "not include all modules in site build"
  ], 
  "revision_id": "823472"
 }, 
 {
  "author": "bommel", 
  "date": "2009-10-09T09:14:32.549271Z", 
  "msg": [
   "checkstyle"
  ], 
  "revision_id": "823471"
 }
]