[
 {
  "author": "davisp", 
  "date": "2009-10-13T23:13:16.617166Z", 
  "msg": [
   "Add more information to the view info objects.", 
   "View info is available at the URL:", 
   "http://127.0.0.1:5984/db_name/_design/ddocid/_info", 
   "New fields include:", 
   "updater_running [true|false] : Whether the view is being built", 
   "waiting_commit [true|false] : Whether this view is a head of db commits", 
   "waiting_clients [integer] : How many clients are waiting on this view", 
   "update_seq [integer] : The update sequence that has been indexed", 
   "purge_seq [integer] : The purge sequence that has been processed", 
   "Other fields for reference:", 
   "signature [string] : The md5 signature of the design document's functions", 
   "language [string] : The language of the design document", 
   "disk_size [integer] : Number of bytes the view file occupies on disk", 
   "compact_running [boolean] : Whether the view is currently being compacted"
  ], 
  "revision_id": "824970"
 }, 
 {
  "author": "ccustine", 
  "date": "2009-10-13T23:09:24.853077Z", 
  "msg": [
   "SMXCOMP-647 - Use dynamic ports for tests", 
   "- servicemix-wsn2005"
  ], 
  "revision_id": "824969"
 }, 
 {
  "author": "davisp", 
  "date": "2009-10-13T23:05:15.587195Z", 
  "msg": [
   "Fix partial view updating regression."
  ], 
  "revision_id": "824968"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-10-13T22:58:19.811780Z", 
  "msg": [
   "I put a modified file in, this fix it"
  ], 
  "revision_id": "824967"
 }, 
 {
  "author": "bpendleton", 
  "date": "2009-10-13T22:58:19.185858Z", 
  "msg": [
   "DERBY-3002: Add partial support for ROLLUP variant of GROUP BY clause", 
   "This change adds an initial implementation of support for the ROLLUP", 
   "style of GROUP BY. Specifying ROLLUP causes Derby to perform multiple", 
   "nested levels of grouping in a single pass over the input data, returning", 
   "the results in a single result set.", 
   "Most of the changes were made to GroupedAggregateResultSet, which is", 
   "enhanced to be able to perform multiple levels of grouping in a single", 
   "pass over the (sorted) input data. There are also changes to the SQL grammar", 
   "to allow the new syntax to be specified, and changes to GroupByNode to", 
   "pass the rollup specification through to the execution engine.", 
   "Several tests were added to the OLAPTest test suite."
  ], 
  "revision_id": "824966"
 }
]