[
 {
  "author": "kocolosk", 
  "date": "2009-10-26T19:51:32.077701Z", 
  "msg": [
   "_changes response might have completed already"
  ], 
  "revision_id": "829920"
 }, 
 {
  "author": "kocolosk", 
  "date": "2009-10-26T19:50:04.986333Z", 
  "msg": [
   "asking for a missing rev with ?rev or ?open_revs was a 500 response"
  ], 
  "revision_id": "829919"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-10-26T19:35:25.526447Z", 
  "msg": [
   "Added disclaimer to install_perl_libs.pl notifying user of the licenses the Perl modules which the script downloads and installs are distributed under. The user has to enter YES in order for the script to run.", 
   "Added to Management Node Perl Modules section in README:", 
   "-blurb about the types of licenses the dependency modules are distributed under", 
   "-the license type and URL for each Perl module dependency", 
   "Added URI and Scalar-List-Utils to list of Perl module dependencies. These needed to be added after uninstalling and reinstalling Perl while testing install_perl_libs.pl. Updated the versions of some of the Perl modules. Added perl-DBD-MySQL to Management Node Backend section in README. I noticed I had to install this separately when testing the changes to install_perl_libs.pl."
  ], 
  "revision_id": "829918"
 }, 
 {
  "author": "jm", 
  "date": "2009-10-26T19:31:13.992018Z", 
  "msg": [
   "auto-generated test rules"
  ], 
  "revision_id": "829917"
 }, 
 {
  "author": "kaosko", 
  "date": "2009-10-26T19:29:40.170232Z", 
  "msg": [
   "SHIRO-96: Re-enable the in-container integration tests that were commented out because they didn't reliably succeed (in-memory accounts in memory realms may be garbage collected, see SHIRO-49). Since the account info in SoftHashMap is now added to strong references queue by default, the caching will work predictably enough for these tests to succeed reliably. The tests would still fail if 9180 port is reserved on the machine. It would be better if the embedded Jetty would select any available port automatically, but I'll deal with that as a separate enhancement if that becomes an issue."
  ], 
  "revision_id": "829916"
 }
]