[
 {
  "author": "lofwyr", 
  "date": "2009-11-04T12:06:41.088670Z", 
  "msg": [
   "TOBAGO-606: Layout Manager", 
   "- converting more types to Measure when using ValueExpression/ValueBinding"
  ], 
  "revision_id": "832715"
 }, 
 {
  "author": "srowen", 
  "date": "2009-11-04T12:06:37.401309Z", 
  "msg": [
   "MAHOUT-190 1"
  ], 
  "revision_id": "832714"
 }, 
 {
  "author": "ashish", 
  "date": "2009-11-04T12:05:09.105745Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3149 - Improve Category association in eBay.", 
   "Recently multi store support for Ebay has been implemented. For the multi store support we need ProductStore > ProdCatalog > ProductCategory association. For EBay we define specific categories of type EBAY_CATEGORY, only those products that are associated to an EBay category are eligible for eBay export. In the current implementation there is no proper prodCatalogCategoryTypeId which can be used to associate eBay category to ProdCatalog, one way to associate an eBay category to ProdCatalog is as a PCCT_BROWSE_ROOT category, thus we have two categories associated to the catalog as BROWSE_ROOT, the other one is for online store. Technically, this is wrong, a catalog should be associated with only one browse root category. Due to this wrong association the eBay category doesn't show up on the advance search page of EBAY webapp, instead online store's browse root category is shown which may also contain those products which are not meant to be exported to eBay. So this category associations need to be fixed, and following is how this can be resolved:", 
   "1. Create a new ProdCatalogCatagoryType PCCT_EBAY_ROOT", 
   "2. Define a worker method in CatalogWorker to derive the top level (root) ebay category", 
   "3. Now in the advance search form, first look for top level ebay category associated to the selected catalog", 
   "* If found, derive sub category list of the top level ebay category and display, else display the top level ebay category itself", 
   "* If not found, derive the top level browse root category (PCCT_BROWSE_ROOT) and display the sub category list for it", 
   "Thanks Parimal Gain for the contribution.", 
   "Special thanks to Mridul Pathak (Zone of Sharp Mind :-)) for discussing implementation plans & providing wonderful notes."
  ], 
  "revision_id": "832713"
 }, 
 {
  "author": "lofwyr", 
  "date": "2009-11-04T12:01:27.670907Z", 
  "msg": [
   "TOBAGO-606: Repair Measure type for (deprecated) cellspacing"
  ], 
  "revision_id": "832712"
 }, 
 {
  "author": "lofwyr", 
  "date": "2009-11-04T11:56:16.124012Z", 
  "msg": [
   "TOBAGO-812: Refactor Style Handling of components: Don't put style in the component attributes"
  ], 
  "revision_id": "832711"
 }
]