[
 {
  "author": "lofwyr", 
  "date": "2009-11-10T14:37:42.651268Z", 
  "msg": [
   "TOBAGO-765: test for \"reload\""
  ], 
  "revision_id": "834480"
 }, 
 {
  "author": "ashish", 
  "date": "2009-11-10T14:32:53.424202Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3173 - Better supportability for products of type MARKETING_PKG_AUTO in order processing and fulfillment process.", 
   "Following points are covered in this patch:", 
   "1) Show associated products for product of type \"MARKETING_PKG_AUTO\" on order items section of show cart page in order manager application.", 
   "2) Marketing packages should only shown backordered when ATP of product which compose Marketing packages product are less than quantity added in cart.", 
   "3) Pick sheets should show Products of type Marketing Packages along with the products which compose Marketing Packages.", 
   "4) Show link of production run created on order items section of Order detail page while placing order for product of type MARKETING_PKG_AUTO.", 
   "5) Product of type Marketing Packages should be shown on Verify Pick Screen along with Products they are composed of.", 
   "Thanks Divesh for the contribution - this is very nice addition to the trunk.", 
   "I would be more then happy to see comments / concern from - Jacopo? Scott? Anil? or others?"
  ], 
  "revision_id": "834479"
 }, 
 {
  "author": "hadrian", 
  "date": "2009-11-10T14:26:23.176003Z", 
  "msg": [
   "Fix typo in misleading test name"
  ], 
  "revision_id": "834478"
 }, 
 {
  "author": "markt", 
  "date": "2009-11-10T14:26:01.326021Z", 
  "msg": [
   "Use a connector attribute rather than a system property to control renegotiation", 
   "Fix some trivial Eclispe warnings in the test", 
   "Don't try and invalidate the session in the client - an attacker probably won't do this", 
   "Add a test that checks the connector attribute can be used to enable renegotiation"
  ], 
  "revision_id": "834477"
 }, 
 {
  "author": "dims", 
  "date": "2009-11-10T14:25:04.684511Z", 
  "msg": [
   "add missing transports - fix for test failure"
  ], 
  "revision_id": "834476"
 }
]