[
 {
  "author": "rgoers", 
  "date": "2009-11-12T03:56:36.234278Z", 
  "msg": [
   "Apply patch for VFS-263"
  ], 
  "revision_id": "835215"
 }, 
 {
  "author": "rgoers", 
  "date": "2009-11-12T03:56:02.136279Z", 
  "msg": [
   "Apply patch for VFS-263"
  ], 
  "revision_id": "835214"
 }, 
 {
  "author": "jbellis", 
  "date": "2009-11-12T03:37:15.879019Z", 
  "msg": [
   "avoid making local node part of the token ring until bootstrap completes; fix other buglets", 
   "patch by jbellis; reviewed by Jaakko Laine for CASSANDRA-536"
  ], 
  "revision_id": "835213"
 }, 
 {
  "author": "jessewilson", 
  "date": "2009-11-12T03:25:52.663249Z", 
  "msg": [
   "Cleanup and bugfix BufferedReader.", 
   "This change includes the following functional changes:", 
   "- changing read to not clear the mark upon reading EOF. The previous behaviour was incorrect.", 
   "- changing read(char[], int, int) to use the 'read directly from the source stream' shortcut when the mark has exceeded its limit. Previously we took the shortcut only when the mark was unset.", 
   "And these nonfunctional changes:", 
   "- rewrote read(char[], int, int). The new revision contains only one call to 'System.arrayCopy' and the related bookkeeping. Previously there was one call before the loop, and another call in the loop.", 
   "- renamed markpos to mark", 
   "- renamed marklimit to markLimit", 
   "- renamed count to end (it isn't a count, it's a position)", 
   "- renamed fillbuf() to fillBuf()", 
   "- simplified conditions that used >= when > was impossible", 
   "- reducing the number of field reads where convenient", 
   "This tidy up is intended to prepare BufferedReader for some further bugfixing. We've seen some bugs reported against readLine() and I found it quite frustrating to work on the code when the names were wrong (ie. count) or of a foreign style (such as fillbuf()). I also attempted to document what the heck was going on in the more sophiticated methods."
  ], 
  "revision_id": "835212"
 }, 
 {
  "author": "davisp", 
  "date": "2009-11-12T03:25:31.075776Z", 
  "msg": [
   "Backporting build system fixes for distcheck.", 
   "This is a backport of revisions 833951 through 833957.", 
   "For validation I've run make check, make distcheck, make cover, the query server specs for JavaScript and Erlang, and the Futon tests. If things break, blame Noah Slater."
  ], 
  "revision_id": "835211"
 }
]