[
 {
  "author": "ashish", 
  "date": "2009-11-12T13:13:34.202135Z", 
  "msg": [
   "Applied patch from jira issue - OFBIZ-2999 - Fix layout of profile pages.", 
   "Layout of profile pages (new pages) is not displayed properly.", 
   "Thanks Deepak for the contribution."
  ], 
  "revision_id": "835375"
 }, 
 {
  "author": "hege", 
  "date": "2009-11-12T13:00:04.922737Z", 
  "msg": [
   "reorganize"
  ], 
  "revision_id": "835374"
 }, 
 {
  "author": "dejanb", 
  "date": "2009-11-12T12:56:29.378255Z", 
  "msg": [
   "http://issues.apache.org/activemq/browse/AMQ-2042 - fix for kaha persistence store"
  ], 
  "revision_id": "835373"
 }, 
 {
  "author": "ashish", 
  "date": "2009-11-12T12:54:22.878937Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3186 - Layered Navigation of Categories.", 
   "Layered navigation in an Ecommerce application allows the user to filter the product listing based on categories, features and price ranges. The user can apply multiple filters to the given product listing. He can narrow or expand his search and try different filter combinations so as to find the desired product.", 
   "I have implemented Layered Navigation in OFBiz ecommerce with following filters:", 
   "1. Sub Categories: This filter is shown whenever there are sub-categories present under the top-level category or current selected category. Count of products within the category is shown against each category, works with multilevel deep category hierarchy. Selecting a sub category will show products within that category and filters will be updated accordingly for the new product list.", 
   "2. Features: Feature filters are grouped by Feature Types. Count of products that has the feature associated as standard, selectable or distinguishing is shown against that feature. Current Implementation has feature filters for ProductFeatureType=\"COLOR\".", 
   "3. List Price Range: This filter will always show. When applied filters product based on List Price Range. Current implementation is done by listing static price ranges at code level.", 
   "The above implementation is completely based on the OOTB Product Search functionality with few additional methods in ProductSearchSession to derive count against different type of filters.", 
   "This is collaborative contribution from Mridul Pathak, Jacopo Cappellato & Scott Gray.", 
   "Thanks Guys for such a nice contribution - I am sure community will love seeing the existence of \"Layered Navigation\" in OFBiz trunk."
  ], 
  "revision_id": "835372"
 }, 
 {
  "author": "hindessm", 
  "date": "2009-11-12T12:52:13.947601Z", 
  "msg": [
   "Trivial spelling fix - for testing."
  ], 
  "revision_id": "835371"
 }
]