[
 {
  "author": "gstein", 
  "date": "2001-05-25T10:17:47.000000Z", 
  "msg": [
   "D'oh! I had both build_dirs and proj_dirs doing the same thing. Combine", 
   "them, and use \"target_dirs\" instead since the dirs are directly related to", 
   "the build targets."
  ], 
  "revision_id": "839405"
 }, 
 {
  "author": "kfogel", 
  "date": "2001-05-24T17:11:23.000000Z", 
  "msg": [
   "Expand conflict discussion.", 
   "(Note to those who may wonder why the heck I'm working on this when", 
   "there are so many important coding tasks that need attention: this is", 
   "actually part of some other, non-Subversion work I'm doing, but since", 
   "it's relevant to Subversion, I thought I'd check it in here.)"
  ], 
  "revision_id": "839404"
 }, 
 {
  "author": "kfogel", 
  "date": "2001-05-24T16:15:57.000000Z", 
  "msg": [
   "Changed section on building from a working copy, now that Greg's got", 
   "the new build system in place."
  ], 
  "revision_id": "839403"
 }, 
 {
  "author": "gstein", 
  "date": "2001-05-24T13:40:17.000000Z", 
  "msg": [
   "Switch over to the new non-recursive build system.", 
   "* .cvsignore: toss some old items, add tests.log", 
   "* autogen.sh: remove the automake stuff. use apr/build/buildcheck.sh for a", 
   "bit of safety. handle setting up libtool ourselves (rather than using", 
   "automake to do it). run gen-make.py to create build-outputs.mk.", 
   "* build.conf: add the libexpat and path-test projects", 
   "* configure.in: sinclude() a number of files, rather than using aclocal.m4.", 
   "stop using AM_ automake macros; use standard AC_ equivalents.", 
   "SVN_INCLUDES now refers to the top-level directory, too. SUBST items for", 
   "INSTALL and MKDIR. SUBST two new items for conditional FS handling:", 
   "FS_RULES (what make target rules to build) and FS_LIBS (what add'l", 
   "libraries a test program should link against). clean up CFLAGS when", 
   "maintainer-mode is set since APR does this (and exports it) now. SUBST", 
   "abs_builddir for the Makefile. add platform-specific mechanism for", 
   "including makefiles. stop generating so many Makefiles; we just have one", 
   "AC_OUTPUT Makefile now.", 
   "* ac-helpers/.cvsignore: add libtool.m4 (a copy from /usr/share)", 
   "* ac-helpers/svn-apache.m4: set and SUBST the INSTALL_APACHE_RULE variable", 
   "to specify which apache make target rule to use for installation. define", 
   "and SUBST a new BUILD_APACHE_RULE for building mod_dav_svn. the", 
   "conditional and APACHE_MODULES are now obsolete."
  ], 
  "revision_id": "839402"
 }, 
 {
  "author": "gstein", 
  "date": "2001-05-24T10:48:59.000000Z", 
  "msg": [
   "Add optional header dependency generation. It runs by default, but can be", 
   "disabled by passing -s on the command line to gen-make.py."
  ], 
  "revision_id": "839401"
 }
]