[
 {
  "author": "stoddard", 
  "date": "1999-11-02T14:30:23.000000Z", 
  "msg": [
   "First cut at adding a sendfile API to IOL. Eventually need to move iol_socket", 
   "into APR..."
  ], 
  "revision_id": "84089"
 }, 
 {
  "author": "dreid", 
  "date": "1999-11-02T12:26:41.000000Z", 
  "msg": [
   "Change the BeOS iol_socket layer to use apr.  Also update mpmt_beos.c", 
   "to reflect this change."
  ], 
  "revision_id": "84088"
 }, 
 {
  "author": "fanf", 
  "date": "1999-11-02T12:18:17.000000Z", 
  "msg": [
   "link directly to the http server project home page rather than the ASF", 
   "homepage because that's what the surrounding text refers to."
  ], 
  "revision_id": "84087"
 }, 
 {
  "author": "dgaudet", 
  "date": "1999-11-01T21:48:49.000000Z", 
  "msg": [
   "i asked a friend who does interface design to comment on the \"it worked\"", 
   "page.  i liked what he had to say.", 
   "> From: James Home <jim@vagabondage.com>", 
   ">", 
   "> reading over the page, it appears that the primary audience for the", 
   "> page is the person who's installing Apache. this doesn't really make", 
   "> sense though; the only information it's necessary to convey to that", 
   "> person is that the server is working, and the simple presence of the", 
   "> page does that.  sure, there are the links to the Apache homepage and", 
   "> to documentation, but those don't require much prominence; if someone", 
   "> is looking for them, they're easy to find.", 
   ">", 
   "> I'd say that the primary audience for the *information* on the page", 
   "> is the poor befuddled user who doesn't know an Apache helicopter from", 
   "> an Apache web server and wants to know what happened to the website", 
   "> they've spent weeks working on.", 
   ">", 
   "> so how is a user like that going to experience the page?", 
   ">", 
   "> - a logo that they don't recognize at the bottom of the page", 
   "> apparently claiming responsibility for it;", 
   ">", 
   "> - some confusing \"It Worked!\" message at the top of the page;", 
   ">", 
   "> - a somewhat threatening and vague message that, despite the fact", 
   "> that this page is all about this mysterious software called Apache", 
   "> (note that it isn't explained that Apache is web server software", 
   "> until the very last line of small text), Apache isn't responsible for", 
   "> the site, and I should \"contact the administrator of the site", 
   "> involved\" (of course, if I was an end user who didn't understand how", 
   "> web servers work, I would assume *I* was the administrator of my", 
   "> site, leaving only this mysterious organization to contact).", 
   ">", 
   "> - clicking on the most prominent link takes me to another page that", 
   "> doesn't specifically mention web servers.  there's a contact link", 
   "> though, which takes me to the page with the email address and Sally's", 
   "> phone number.", 
   ">", 
   "> I did a quick mockup to demonstrate how I think this might work better:", 
   ">", 
   "> http://www.vagabondage.com/~jim/apache/worked2.html", 
   "Submitted by:\tJames Home <jim@vagabondage.com>"
  ], 
  "revision_id": "84086"
 }, 
 {
  "author": "fanf", 
  "date": "1999-11-01T15:01:40.000000Z", 
  "msg": [
   "I had to chase too many links to find the content negotiation docs", 
   "just now so this'll make it easier to get to."
  ], 
  "revision_id": "84085"
 }
]