[
 {
  "author": "martin", 
  "date": "1999-11-24T22:31:08.000000Z", 
  "msg": [
   "This patch fixes the some of the bogosity in regular expressions", 
   "on EBCDIC based machines: a character range [a-z] would match much more", 
   "than only the islower() characters because in the EBCDIC charset there", 
   "are \"holes in the contiguity\" between a-i, j-r and s-z.", 
   "This patch fixes [<lowercase>-<lowercase>] and [<uppercase>-<uppercase>]", 
   "ranges by only regarding alphabetic characters between the lower and", 
   "upper bound. (Any other range definition remains unchanged.)"
  ], 
  "revision_id": "84154"
 }, 
 {
  "author": "dgaudet", 
  "date": "1999-11-24T18:10:58.000000Z", 
  "msg": [
   "no comment on the rest of this... but this is for debugging, and i don't", 
   "want a debugging tool losing information for me for the sake of \"looking", 
   "good\"."
  ], 
  "revision_id": "84153"
 }, 
 {
  "author": "martin", 
  "date": "1999-11-24T17:12:25.000000Z", 
  "msg": [
   "Adapt the more generic interface introduced by IBM's TPF port"
  ], 
  "revision_id": "84152"
 }, 
 {
  "author": "dreid", 
  "date": "1999-11-24T16:46:03.000000Z", 
  "msg": [
   "Clean up some code that BeOS doesn't use."
  ], 
  "revision_id": "84151"
 }, 
 {
  "author": "rse", 
  "date": "1999-11-24T13:38:55.000000Z", 
  "msg": [
   "I know we don't want to see any \"fancy\" things in our printenv (as", 
   "they were already posted by various users over the last years), but", 
   "every time I need to use a little CGI script for testing purposes I get", 
   "annoyed by this really too weak printenv script. Sure, tables and other", 
   "stuff should be not our business, but at least the script should be a", 
   "little bit more robust and useful.", 
   "What I disliked most is that I usually have great problems to easily find a", 
   "variable (because the output is not sorted) and that various environment", 
   "values totally destroy the optical view on the table as a whole (mainly too", 
   "large values in $PATH and the nasty contents of SERVER_SIGNATURE). So here is", 
   "my minimal change to at least fix these problems without introducing fancy or", 
   "insecure stuff.  Nevertheless feel free to back it out if you definitely", 
   "dislike any changes to printenv at all.", 
   "My changes are:", 
   "1. add a comment line to make it clear to the user that this is more or less", 
   "just a silly _demo_ script (for those who don't have Perl as their", 
   "secondary language beside their native language)", 
   "2. use content type text/plain instead of text/html to easily avoid printing", 
   "problems with variables like SERVER_SIGNATURE which contains HTML", 
   "code. This way we have to add extra escaping steps and the script", 
   "remains small.", 
   "3. sort the variables lexicographically in the output!", 
   "4. make sure very large lines (usually from $PATH) do not destroy the", 
   "total optical view on the table by cutting values and replacing", 
   "the missing stuff with \"[...]\".", 
   "5. surround values with quotes to allow one to better recognize newlines (as", 
   "in SERVER_SIGNATURE) and whitespaces and also print newlines", 
   "as \\n and \" as \\\" for a more Shell- and C-style syntax."
  ], 
  "revision_id": "84150"
 }
]