[
 {
  "author": "sussman", 
  "date": "2002-04-23T21:37:35.602961Z", 
  "msg": [
   "* fs_dumprestore.txt:  new file, a fs dump/restore proposal.", 
   "* assurance.txt:  Brian Snow is a director, not a directory."
  ], 
  "revision_id": "841830"
 }, 
 {
  "author": "striker", 
  "date": "2002-04-23T21:25:14.937326Z", 
  "msg": [
   "* subversion/libsvn_delta/libsvn_delta.dsp", 
   "Add the diff code to the windows build."
  ], 
  "revision_id": "841829"
 }, 
 {
  "author": "striker", 
  "date": "2002-04-23T21:14:11.581877Z", 
  "msg": [
   "Move the diff code into libsvn_delta.  No need for", 
   "it to be in a seperate lib.", 
   "* subversion/libsvn_delta/diff.c", 
   "Moved from subversion/libsvn_diff", 
   "* subversion/libsvn_diff", 
   "Deleted."
  ], 
  "revision_id": "841828"
 }, 
 {
  "author": "kfogel", 
  "date": "2002-04-23T20:19:34.135316Z", 
  "msg": [
   "* HACKING", 
   "(String operations): Justify string security concerns better.", 
   "(Document everything): Remove comment about documenting security", 
   "boundaries.", 
   "There is not a single interface currently in Subversion that adheres", 
   "to the recommendation about documenting security boundaries.  None.", 
   "Zip.  Nada.  In fact, no source or header file contains the word", 
   "\"security\" at all, in either lower- or upper-case.  Hello? :-)", 
   "If we want to document such boundaries this way, fine, we should start", 
   "doing so.  But recommending a *completely* unused practice in HACKING", 
   "is counterproductive and insincere.  A reader looks at HACKING, looks", 
   "at the code, sees that there's no connection, and the result is that", 
   "the HACKING guidelines lose a degree of credibility (and they", 
   "currently have a lot of credibility, precisely because what they", 
   "recommend is, by and large, actually practiced in the code).", 
   "We don't need to wait for \"perfection\" here, but nor should we indulge", 
   "in total wishful thinking in the HACKING file.  Let's see some", 
   "real-life examples of security boundaries, and document them.  Then", 
   "we'll be able to write something about it in HACKING without", 
   "hypocrisy, using examples and recommendations that are specific to", 
   "Subversion instead of being generic guidelines never tested in this", 
   "particular project."
  ], 
  "revision_id": "841827"
 }, 
 {
  "author": "striker", 
  "date": "2002-04-23T20:02:52.180916Z", 
  "msg": [
   "Initial commit of the diff lib.", 
   "* subversion/libsvn_diff", 
   "New directory.", 
   "* subversion/libsvn_diff/diff.c", 
   "New file.", 
   "* subversion/include/svn_diff.h", 
   "New file."
  ], 
  "revision_id": "841826"
 }
]