[
 {
  "author": "martin", 
  "date": "1999-12-09T16:55:54.000000Z", 
  "msg": [
   "Take advantage of the new clean CRLF implementation.", 
   "The *ebcdic*_strictly() kludge is now no longer required."
  ], 
  "revision_id": "84259"
 }, 
 {
  "author": "martin", 
  "date": "1999-12-09T16:16:57.000000Z", 
  "msg": [
   "Cool but dry;"
  ], 
  "revision_id": "84258"
 }, 
 {
  "author": "martin", 
  "date": "1999-12-09T16:01:09.000000Z", 
  "msg": [
   "Language definition to go with czech homepage"
  ], 
  "revision_id": "84257"
 }, 
 {
  "author": "martin", 
  "date": "1999-12-09T15:56:34.000000Z", 
  "msg": [
   "Multiple Language Welcome Page - Czech translation (submitted Sep 1999)", 
   "Submitted by: Honza Jirousek <honza@ecn.cz>", 
   "The author writes:", 
   "couple notes:", 
   "1) My Netscape Communicator 4.6 for Linux lists Czech language under code", 
   "Czech(cs). I'm not sure what standards rule this, but it's quite likely wrong.", 
   "Since the split of Czechoslovakia into two independent countries about 7 years", 
   "ago, cz is an ISO code for Czech and sk for Slovak. Top level DNS domain cs", 
   "(which caused so much trouble to mail users from computer science departments", 
   "in US universities, who used to cut the domain part of local e-mail addreses", 
   "short (e.g. abc@cs.berkeley.edu-&gt;abc@cs) and were surprised to get messages", 
   "bounced by some Czechoslovakian mail servers) and other uses of the code cs", 
   "should be deprecated by now. I assume, however, that this is of no", 
   "significance to Apache, which handles thye country codes in httpd.conf only.", 
   "2) Note that while Slovak language uses the same character set as Czech and", 
   "while it's a fairly close to Czech, it is not identical and this translation", 
   "will not pass for a Slovak version of the page. Slovak users may likely use", 
   "the language negotiation feature, though, and set the order &quot;sk,cz,en&quot; in", 
   "their browsers.", 
   "3) There are two encoding for non-asci Czech characters. Supposed Internet", 
   "standard is iso-8559-2, but most windows browsers use windows-1250 (and thus", 
   "many Czech web pages are also created in this character set). Most browsers", 
   "(on all platforms) can handle both encodings, but have to be told which one to", 
   "use, as no good &quot;default&quot; can be assumed. One way is to configure Apache to", 
   "send proper character set in HTTP headers (this has to be set locally based on", 
   "website owner's preference), another is to include the character set in a META", 
   "tag. I think the latter would work better for default welcome page and so I", 
   "did in the page I'm sending.", 
   "Honza Jirousek"
  ], 
  "revision_id": "84256"
 }, 
 {
  "author": "martin", 
  "date": "1999-12-09T12:10:12.000000Z", 
  "msg": [
   "First cut at using the CRLF macro changes of Gil's patch.", 
   "Next step is replacement of all xxx_strictly stuff by xxx", 
   "(and renaming the os_toascii_strictly[] table to os_toascii[])"
  ], 
  "revision_id": "84255"
 }
]