[
 {
  "author": "fitz", 
  "date": "2002-12-09T15:36:01.608826Z", 
  "msg": [
   "Un-digit-ize.", 
   "* /trunk/doc/book/book/ch03.xml: Two not 2."
  ], 
  "revision_id": "844140"
 }, 
 {
  "author": "fitz", 
  "date": "2002-12-09T15:24:41.322210Z", 
  "msg": [
   "Make some changes suggested by Ben.", 
   "* /trunk/doc/book/book/ch03.xml: Explain the switch for revisions, and", 
   "what the colon does."
  ], 
  "revision_id": "844139"
 }, 
 {
  "author": "trow", 
  "date": "2002-12-09T07:46:22.164289Z", 
  "msg": [
   "OK, now I understand a bit more about how python's threads work.  It", 
   "turns out that the python thread API puts the burden on us to do some", 
   "of their bookkeeping and track some data on a per-thread basis.", 
   "Luckily, apr provides a wrapper around pthread_{set,get}specific so", 
   "that we can do this in a portable way.", 
   "* swigutil_py.c", 
   "(release_py_lock) Store the PyThreadState in the thread's private", 
   "address space.", 
   "(acquire_py_lock) When re-acquiring the interpreter lock, get the", 
   "PyThreadState from the thread's private address space."
  ], 
  "revision_id": "844138"
 }, 
 {
  "author": "fitz", 
  "date": "2002-12-09T07:28:51.631883Z", 
  "msg": [
   "More changes for Monday's deadline.  Chapter is done.", 
   "[ Hello to all my friends and fans at RCN Cable! 38% packet ]", 
   "[ loss is certainly an improvement, but still well into the ]", 
   "[ \"crappy\" category of net connectivity.  What are you guys ]", 
   "[ doing over there anyway, sleeping?  Work with me here...  ]", 
   "* /trunk/doc/book/book/ch03.xml: Add detailed section on conflict", 
   "resolution, some bits about update/checkout -r, and a few other", 
   "tweaks. Ready to ship it out."
  ], 
  "revision_id": "844137"
 }, 
 {
  "author": "fitz", 
  "date": "2002-12-09T05:57:38.190007Z", 
  "msg": [
   "More changes for Monday's deadline. Completing the chapter.", 
   "[ Hello to all my friends and fans at RCN Cable!  Just wanted  ]", 
   "[ to say thanks for the 84% packet loss and the imbecilic tech ]", 
   "[ support--you're really making my life hell, so keep up the   ]", 
   "[ good work. Next time I'll write my packets out on baseballs  ]", 
   "[ and throw them at Collab's office downtown.                  ]", 
   "* /trunk/doc/book/book/ch03.xml: Move the revision section to the top", 
   "of the chapter and add info on dates, etc. Other formatting changes.", 
   "* /trunk/doc/book/book/ch02.xml: Change \" to <quote>"
  ], 
  "revision_id": "844136"
 }
]