[
 {
  "author": "fanf", 
  "date": "2000-01-12T15:54:46.000000Z", 
  "msg": [
   "Revert the scoreboard change because Jim doesn't like it."
  ], 
  "revision_id": "84444"
 }, 
 {
  "author": "fanf", 
  "date": "2000-01-12T15:23:25.000000Z", 
  "msg": [
   "Don't convert auth to proxy auth when it shouldn't be."
  ], 
  "revision_id": "84443"
 }, 
 {
  "author": "fielding", 
  "date": "2000-01-12T03:38:19.000000Z", 
  "msg": [
   "this patch is intended to avoid a problem witnessed in apache", 
   "installations with certain third party libraries: if there are many", 
   "children, and then take sufficiently long to shut down, then apache's", 
   "reclaim child processes sends the remaining children SIGKILL.  that's", 
   "alright with me -- shutdown shouldn't take so long -- but the current code", 
   "doesn't wait around for them to die; if they haven't all finished", 
   "terminating right away, it sleeps for approximately 16 seconds before", 
   "noticing that they're dead. thus, the total time required to shut down is", 
   "generally a bit more than twenty seconds ... the last 16 seconds of which", 
   "is quite unnecessary.", 
   "anyway, what this patch does is change things so that after SIGKILL has", 
   "been sent, the parent checks a couple of times (approx: 16ms, 84ms, 350ms,", 
   "1.4sec) and then decides that the SIGKILL failed.  i could easily adjust", 
   "this so that the total time spent waiting for the SIGKILL to fail is what", 
   "it was -- 16 seconds, give or take -- but in writing this, i figured that", 
   "if they haven't died after 1.4 seconds, then the SIGKILL wasn't", 
   "sufficient; it's not instant, but it should never take that long.", 
   "Submitted by:\tEd Korthof <ed@apache.org>", 
   "Reviewed by:\tRoy Fielding"
  ], 
  "revision_id": "84442"
 }, 
 {
  "author": "fanf", 
  "date": "2000-01-12T01:18:07.000000Z", 
  "msg": [
   "Be more explicit about the performance of UseCanonicalName DNS", 
   "after the scoreboard change."
  ], 
  "revision_id": "84441"
 }, 
 {
  "author": "fanf", 
  "date": "2000-01-12T01:18:07.000000Z", 
  "msg": [
   "Be more explicit about the performance of UseCanonicalName DNS", 
   "after the scoreboard change."
  ], 
  "revision_id": "84440"
 }
]