[
 {
  "author": "", 
  "date": "2003-04-05T15:51:09.229360Z", 
  "msg": [
   "This is an empty revision for padding."
  ], 
  "revision_id": "845635"
 }, 
 {
  "author": "kfogel", 
  "date": "2003-04-05T07:33:49.977966Z", 
  "msg": [
   "\"Hey, you wanna see something *really* scary?\"  -- The Twilight Zone", 
   "Fix two colluding bugs whereby internal txdelta stream checksums were", 
   "both computed incorrectly, and never finalized.  Because they were not", 
   "finalized, stream->digest remained all zeroes, and the incorrect", 
   "checksums never got out where they could affect anything.", 
   "* subversion/libsvn_delta/text_delta.c", 
   "(svn_txdelta): Don't initialize the digest to all zeroes anymore,", 
   "that can only serve to mask a bug.  And remove the utterly", 
   "mysterious comment that seemed to be referring to an internal", 
   "function all the way over in libsvn_fs/util/skel.c.  Huh?", 
   "(svn_txdelta_next_window): Compute the checksum on the target data,", 
   "not on the source data; and finalize the checksum in the", 
   "end-of-stream case that the code actually reaches, not in the", 
   "bogus end-of-stream case that was never reached.  Therefore remove", 
   "the latter case, which means unwrapping one level of braces and", 
   "and reindenting.  Sorry about that, but it should help the", 
   "function breathe better.", 
   "Note that this is very old code; in fact, it predates Subversion's", 
   "self-hosting.  So if you've recently gotten a checksum error and you", 
   "think maybe this was the problem, it wasn't."
  ], 
  "revision_id": "845634"
 }, 
 {
  "author": "bdenny", 
  "date": "2003-04-05T05:38:07.664065Z", 
  "msg": [
   "Followup to r5521/Issue #1108 ('svn log' for switched file reports for", 
   "unswitched file).  Flesh out comments based on kfogel's remarks.", 
   "* include/svn_path.h", 
   "(svn_path_get_longest_ancestor): Improve comment.", 
   "(svn_path_condense_targets): Likewise."
  ], 
  "revision_id": "845633"
 }, 
 {
  "author": "kfogel", 
  "date": "2003-04-05T00:41:55.610854Z", 
  "msg": [
   "* www/variance-adjusted-patching.html: Remove an unnecessary comment", 
   "line that was tickling a display bug in Galeon."
  ], 
  "revision_id": "845632"
 }, 
 {
  "author": "kfogel", 
  "date": "2003-04-05T00:35:18.655761Z", 
  "msg": [
   "Thanks to Greg Stein for pointing this out as part of his review of", 
   "revision 5554:", 
   "* subversion/libsvn_ra_dav/fetch.c", 
   "(fetch_file): Check for null before dereferencing checksum."
  ], 
  "revision_id": "845631"
 }
]