[
 {
  "author": "ghudson", 
  "date": "2004-04-11T18:45:40.508418Z", 
  "msg": [
   "Implement node-rev IDs in make-revs, and make it reflect modifications", 
   "to structure document.", 
   "* libsvn_fs_fs/make-revs.c", 
   "(struct entry): Add a props_len field since prop reps are like text", 
   "reps now.  Make \"pred\" and \"copyroot\" pointers to previous entries", 
   "so that we can generate their node-rev IDs at marshalling time.", 
   "Store integer node_id and copy_id as part of the node-rev ID.", 
   "(struct parse_baton): Add next_node_id and next_copy_id fields for", 
   "generating fresh ID components.", 
   "(new_entry): Initialize changed fields appropriately.", 
   "(copy_entry): Adjust for entry field changes.  Generate a fresh copy", 
   "ID for copies; just take the old one for changes.", 
   "(node_rev_id): Convenience function to marshal an entry's node-rev ID.", 
   "(write_directory_rep): Values are now just node-rev IDs of children.", 
   "Rep end marker is now \"ENDREP\\n\".", 
   "(write_props_rep): Enclose prop rep in a rep header and trailer.", 
   "Record props_len.", 
   "(write_node_rev): Adjust for modifications in structure document.", 
   "Bonus: root of rev 0 can actually use self as copyroot (by", 
   "pointer), so we don't have to special-case it.", 
   "(new_revision_record): Initialize rev 0's root node_id and copy_id", 
   "fields, and use self as copyroot.  Set node_rev to 0 so it gets", 
   "written out.", 
   "(new_node_record): Inherit copy ID from parent for new nodes.", 
   "Adjust copyroot handling for copyroot being a pointer field.", 
   "(close_node): Rep end marker is now \"ENDREP\\n\".", 
   "(close_revision): Add comment noting that offsets should go at end.", 
   "(main): Initialize new parse_baton fields."
  ], 
  "revision_id": "849400"
 }, 
 {
  "author": "jpieper", 
  "date": "2004-04-11T18:41:39.104273Z", 
  "msg": [
   "Rework property list handling in libsvn_fs_fs so that representations", 
   "are generic and are read identically for file contents, directory", 
   "contents, and property lists.  Update the Node-ID type to be in sync", 
   "with the latest libsvn_fs_fs/structure document.  Remove a non-used", 
   "variable in read_hash noticed by rooneg.", 
   "* subversion/libsvn_fs_fs/fs.h", 
   "(svn_fs__node_revision_t): Add new fields for property lists so", 
   "that they can use generic representations.  Re-order the fields", 
   "for data and prop lists to match each other.", 
   "* subversion/libsvn_fs_fs/id.h", 
   "Change the textual description of a node-id to match that of", 
   "libsvn_fs_fs/structure.", 
   "* subversion/libsvn_fs_fs/id.c", 
   "(svn_fs_parse_id, svn_fs_unparse_id): Correctly parse and unparse", 
   "the new node-id format.", 
   "* subversion/libsvn_fs_fs/fs_fs.h", 
   "Change the \"rep\" field to be \"text\" since representations are now", 
   "generic.", 
   "* subversion/libsvn_fs_fs/fs_fs.c", 
   "(read_hash): Removed 'err', as it was no longer being used.", 
   "(read_rep_offsets): New, factorizes the code to parse both the", 
   "\"text\" and \"props\" fields in the revision file.", 
   "(svn_fs__fs_get_node_revision): Use the new read_rep_offsets.", 
   "(read_rep_line): Remove an unused statement after an abort.", 
   "(rep_read_get_baton): Instead of accepting a node_revision,", 
   "instead use the actual revision and offset so that it can be", 
   "equally used for text and property representations.", 
   "(get_representation_at_offset): New, gets a readable stream to an", 
   "arbitrary representation.", 
   "(svn_fs__fs_get_contents, svn_fs__fs_get_proplist): Use the new", 
   "get_representation_at_offset."
  ], 
  "revision_id": "849399"
 }, 
 {
  "author": "maxb", 
  "date": "2004-04-11T18:41:27.618819Z", 
  "msg": [
   "Typo corrections - patch from Eric Hanchrow.", 
   "* www/project_faq.html: Fix various spelling errors.", 
   "* doc/book/book/ch00.xml: Add missing word in preface. Add hyphen in 'Audience'.", 
   "* doc/book/book/ch08.xml: Fix typo in 'Using Languages Other than C and C++'", 
   "* packages/win32-innosetup/is_main.pas: Fix grammar in comments.", 
   "Fixes of my own, noticed whilst applying patch:", 
   "* packages/win32-innosetup/is_main.pas:", 
   "Clarify easily-misunderstandable comments."
  ], 
  "revision_id": "849398"
 }, 
 {
  "author": "ghudson", 
  "date": "2004-04-11T18:07:33.242257Z", 
  "msg": [
   "Make some changes to allow compressed property lists in libsvn_fs_fs.", 
   "* libsvn_fs_fs/structure:", 
   "Wrap a representation header and trailer around property reps.", 
   "Reorganize the way they are presented so that the term", 
   "\"representation\" is generic.  Simplify the representation of", 
   "directories and fold the resulting description into the presentation", 
   "of reps.  Change the \"rep\" field name to \"text\" in node-revs, since", 
   "\"rep\" is no longer specific to text reps."
  ], 
  "revision_id": "849397"
 }, 
 {
  "author": "ghudson", 
  "date": "2004-04-11T17:32:30.756183Z", 
  "msg": [
   "The BDB FS implementation relies heavily on being able to look up", 
   "information about node-revisions by FS and node-rev ID.  Make some", 
   "changes to the svn_fs_fs structure so that we can have a similar", 
   "primitive.", 
   "* libsvn_fs_fs/README:", 
   "In the high-level conception of a transaction directory, we will be", 
   "looking up changed node-revisions by node-ID, not by pathname, so", 
   "it doesn't make sense to store the changed information in a", 
   "hierarchical tree.  Describe the structure of a transaction in more", 
   "generic terms.  Also, while we're here, note that property lists,", 
   "and thus node-rev data for files, cannot be marshalled into the", 
   "prototype rev file until the end, since properties can be changed at", 
   "any time.", 
   "* libsvn_fs_fs/structure:", 
   "Add a section on how we will use the txn-id field of a node-rev ID", 
   "to support efficient lookup of node-revs by ID.  Store node-rev IDs", 
   "for the \"pred\" and \"copyroot\" fields of node-rev data.  Give a", 
   "straw-man description of what transactions might look like."
  ], 
  "revision_id": "849396"
 }
]