[
 {
  "author": "wrowe", 
  "date": "2000-05-26T04:22:14.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "Whoops, though I had already knocked off that nasty chomp() side effect."
  ], 
  "revision_id": "85299"
 }, 
 {
  "author": "wrowe", 
  "date": "2000-05-26T04:18:27.000000Z", 
  "msg": [
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:", 
   "Take advantage of Bill Stoddard's goof to change this over permanently.", 
   "Conversion is rather one way, for consistency.  We can't really maintain", 
   "a dsp version 5 file from version 6, since version 5 likes to split up", 
   "!MESSAGE lines in odd places.  This should make things more consistent.", 
   "Please execute cvstodsp5.pl from the helpers folder, prior to actually", 
   "using the MSVC 5.0 environment.  When you are ready to diff, update or", 
   "commit changes, use dsp5tocvs.pl from the helpers folder to convert", 
   "them all back.  (Be careful that you have CLOSED the DevStudio workspace", 
   "before you try either command!)"
  ], 
  "revision_id": "85298"
 }, 
 {
  "author": "rbb", 
  "date": "2000-05-25T23:29:59.000000Z", 
  "msg": [
   "This item doesn't really work properly, so we are removing it from the", 
   "STATUS file.  I was going to wait, but Manoj (the person who originally", 
   "put it in STATUS) said get rid of it, so away it goes."
  ], 
  "revision_id": "85297"
 }, 
 {
  "author": "trawick", 
  "date": "2000-05-25T20:51:25.000000Z", 
  "msg": [
   "APACHE_XLATE, CHARSET_EBCDIC stuff:", 
   "Provide new function ap_set_content_xlate() to simplify what needs", 
   "to be done to set up translation of content.  Use it where appropriate.", 
   "With this change, EBCDIC logic was tweaked so that ap_checkconv() does", 
   "not overlay a translation handle previously stored (e.g., by a module)", 
   "unless it is turning translation off.  Unless ap_checkconv() determines", 
   "that translation is inappropriate, it should leave the translation handle", 
   "alone."
  ], 
  "revision_id": "85296"
 }, 
 {
  "author": "coar", 
  "date": "2000-05-25T16:45:58.000000Z", 
  "msg": [
   "Add '-n' option to make htpasswd send user:pw result to", 
   "stdout instead of fiddling with a text file.", 
   "Reviewed by:\tGreg Stein"
  ], 
  "revision_id": "85295"
 }
]