[
 {
  "author": "wrowe", 
  "date": "2000-06-30T20:38:26.000000Z", 
  "msg": [
   "A good catch, this one was hurting PHP4, possibly others.", 
   "PR: 6260", 
   "Submitted by:\tJerone Janssen <jeroen@darius.demon.nl>", 
   "Reviewed by:"
  ], 
  "revision_id": "85734"
 }, 
 {
  "author": "rbb", 
  "date": "2000-06-30T19:57:49.000000Z", 
  "msg": [
   "Fix the problem with ./buildconf not working right out of CVS.  The", 
   "general problem, is that we were using AC_CONFIG_AUX_DIR_DEFAULT, which", 
   "the autoconf source says shouldn't be called directly.  It should be", 
   "called using AC_REQUIRE, but I couldn't make that work.  So, since we know", 
   "exactly where the files that we are looking for are located, we'll just", 
   "point autoconf directly to them, and ignore all of the hoops.  :-)", 
   "I am not convinced the AC_CONFIG_AUX_DIR(.) call that I am using is", 
   "strictly necessary, but it doesn't cause any problems and it logically", 
   "makes sense."
  ], 
  "revision_id": "85733"
 }, 
 {
  "author": "rbb", 
  "date": "2000-06-30T18:08:13.000000Z", 
  "msg": [
   "Combine some common code.  Before this, all platforms implemented their", 
   "own iol_sockets using APR.  This just combines all of that code to a", 
   "common file and moves that file to main.  I have tested this with all of", 
   "the Unix MPM's, but I am willing to bet I missed something (Makefiles) for", 
   "Windows, and possibly moving some code for OS/2 and BeOS."
  ], 
  "revision_id": "85732"
 }, 
 {
  "author": "rasmus", 
  "date": "2000-06-30T17:46:08.000000Z", 
  "msg": [
   "RFC 2617 consistently uses \"Basic\" in the examples, so there is a chance", 
   "that some server-side stuff does not recognize \"basic\" in the Authorization", 
   "header.  PHP was unfortunately a victim here.  This has been fixed in PHP,", 
   "but we might as well make ab play nice."
  ], 
  "revision_id": "85731"
 }, 
 {
  "author": "rbb", 
  "date": "2000-06-30T14:45:15.000000Z", 
  "msg": [
   "I am removing my veto and stepping away from this discussion for at least", 
   "two days.  This does NOT mean I like the patch at all, it just means I have", 
   "no desire to continue with this discussion right now.  Because I have no", 
   "plans to respond to any more e-mail on the topic currently, I have no right", 
   "to veto a patch."
  ], 
  "revision_id": "85730"
 }
]