[
 {
  "author": "jerenkrantz", 
  "date": "2006-02-10T03:03:50.465294Z", 
  "msg": [
   "ra_serf: Fix up pool issues and track/clean up empty directories.", 
   "We can now checkout an extracted httpd tarball without substantial memory leaks.", 
   "(We could do without tracking the dirs explicitly; but we'll leave it in so", 
   "that it's easy to debug this situation.)", 
   "* subversion/libsvn_ra_serf/update.c:", 
   "(report_dir_t): Add a pool for the baton; note our children and siblings.", 
   "(report_context_t): Store a pointer to our root so we can clean up later.", 
   "(push_state): Use calloc instead of alloc; point to ->root_dir or siblings", 
   "as appropriate.", 
   "(open_dir): Create the pool for the baton when we need it.", 
   "(close_dir): Use new pools; when we close, update our parent's children list.", 
   "(close_all_dirs): Walk from the directory and close all children.", 
   "(handle_fetch): Create a sub-pool from the dir_baton for the file and use it.", 
   "(delta_file, fetch_file): Use 'right' pool.", 
   "(finish_report): Always delay closing the dir and ensure they are closed", 
   "in the order we found them (i.e. FIFO); close all children at the end."
  ], 
  "revision_id": "858485"
 }, 
 {
  "author": "julianfoad", 
  "date": "2006-02-10T01:08:14.148983Z", 
  "msg": [
   "Improve the robustness of tools/dev/warn-ignored-err.sh.", 
   "* tools/dev/warn-ignored-err.sh", 
   "Rearrange the sequence of moves and modifications to reduce the chance that", 
   "a source file will be missing or truncated if the script is interrupted.", 
   "Now there is little chance of the former and none of the latter."
  ], 
  "revision_id": "858484"
 }, 
 {
  "author": "rooneg", 
  "date": "2006-02-10T00:36:19.906372Z", 
  "msg": [
   "* STATUS: Vote for r18291 and move it to approved."
  ], 
  "revision_id": "858483"
 }, 
 {
  "author": "dlr", 
  "date": "2006-02-09T23:32:34.580902Z", 
  "msg": [
   "* STATUS: A vote for r18249 is a vote for cheese."
  ], 
  "revision_id": "858482"
 }, 
 {
  "author": "rooneg", 
  "date": "2006-02-09T23:03:59.830414Z", 
  "msg": [
   "* STATUS: Propose r18249 for backport to 1.3.x."
  ], 
  "revision_id": "858481"
 }
]