[
 {
  "author": "julianfoad", 
  "date": "2006-03-27T20:25:26.280777Z", 
  "msg": [
   "Remove some obsolete test files.  Fix up the name of the command-line client", 
   "tests directory in places that were missed when it was changed in r17718.", 
   "Correct some information in the tests README file.", 
   "* INSTALL", 
   "* build/win32/vc6-build.bat.in", 
   "Fix up the name of the command-line client tests directory.", 
   "* subversion/tests/README", 
   "Fix up file and dir names and remove reference to an obsolete XML dir.", 
   "* subversion/tests/cmdline/xmltests", 
   "* subversion/tests/cmdline/xmltests/svn-test.sh", 
   "* subversion/tests/cmdline/xmltests/svn-test2.sh", 
   "Delete, as these tests are obsolete."
  ], 
  "revision_id": "859120"
 }, 
 {
  "author": "julianfoad", 
  "date": "2006-03-27T20:22:17.103037Z", 
  "msg": [
   "In \"svnadmin\" tests, don't use \"XFail\" for testing an operation that fails when", 
   "Subversion is working correctly, and other improvements.", 
   "* subversion/tests/README", 
   "Emphasise what XFAIL is not to be used for.", 
   "* subversion/tests/cmdline/svnadmin_tests.py", 
   "(load_and_verify_dumpstream): Enable use of SVNAnyOutput.  Don't try", 
   "to verify the result if an error was expected.", 
   "(clean_dumpfile): Convert from a variable to a function so that the", 
   "data cannot be modified in place, which was happening before (due to", 
   "only shallow copies being made of it).", 
   "(extra_blockcontent): Remove an obsolete comment.  Insert extra data", 
   "earlier in the stream to check that processing continues after it.", 
   "(inconsistent_headers): Expect an error in loading the dump stream.", 
   "(test_list): Remove \"XFail\" from \"inconsistent_headers\"."
  ], 
  "revision_id": "859119"
 }, 
 {
  "author": "adejong", 
  "date": "2006-03-27T20:19:03.378554Z", 
  "msg": [
   "Import release 0.6 of svn2cl, a tool for generating a classic", 
   "GNU-style ChangeLog from a subversion repository log. More information", 
   "about svn2cl can be found at http://ch.tudelft.nl/~arthur/svn2cl/.", 
   "[in contrib/client-side/svn2cl]", 
   "* svn2cl.sh: This is the main shell script that acts as a wrapper", 
   "around the xlst files (calling xsltproc) exporting the options.", 
   "* svn2cl.xsl: This XSLT script is used to transform output of", 
   "svn log --xml to a classic GNU-style ChangeLog.", 
   "* svn2html.xsl: This XSLT script transforms svn log output to a nice", 
   "looking HTML page."
  ], 
  "revision_id": "859118"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2006-03-27T17:51:55.337561Z", 
  "msg": [
   "ra_serf: Pass copy test #1 (basic copy and move commands -- on files only), #30", 
   "(copy a complex mixed-rev wc), #37 ('move --force' should not lose local mods).", 
   "* subversion/libsvn_ra_serf/commit.c", 
   "(close_file): Accept a 204 or 201 from a PUT as a valid response."
  ], 
  "revision_id": "859117"
 }, 
 {
  "author": "lundblad", 
  "date": "2006-03-27T07:54:37.273817Z", 
  "msg": [
   "* STATUS (r19039): Nominate."
  ], 
  "revision_id": "859116"
 }
]