[
 {
  "author": "coar", 
  "date": "2000-08-04T11:44:17.000000Z", 
  "msg": [
   "Whoops; forgot to apply this to the 2.0 docs..", 
   "Submitted by:\tJoshua Slive <slive@finance.commerce.ubc.ca>", 
   "Reviewed by:\tKen Coar"
  ], 
  "revision_id": "85984"
 }, 
 {
  "author": "rbb", 
  "date": "2000-08-04T07:07:33.000000Z", 
  "msg": [
   "Fix the Perchild MPM.  This does work now.  This change has us using", 
   "socketpair instead of sockets created with AF_UNIX.  There is very little", 
   "chance this will work anywhere other than Linux, but it is a start.  I", 
   "have a machine with two virtual hosts, which are started as two different", 
   "users.  When I make requests for each virtual host, they pass the request", 
   "to the correct child process.  It is possible for a virtual host to have", 
   "multiple child processes all with the same user ID, and they all share", 
   "the responsability for answering requests.", 
   "There are a lot of bugs in this code, and it is not for the faint", 
   "hearted, but it works, and that's saying quite a bit in my mind.", 
   "Docs coming tomorrow.  Right now, it's time to sleep."
  ], 
  "revision_id": "85983"
 }, 
 {
  "author": "trawick", 
  "date": "2000-08-04T02:25:08.000000Z", 
  "msg": [
   "Disable the dbm_ usage in mod_rewrite so that it links.", 
   "Still to do: decide at config time whether any modules need dbm, whether", 
   "to use the native one or sdbm, etc."
  ], 
  "revision_id": "85982"
 }, 
 {
  "author": "rbb", 
  "date": "2000-08-04T00:21:07.000000Z", 
  "msg": [
   "More progress with the perchild MPM.  This is serving pages again, but", 
   "only when the request is accepted by the server that supposed to serve the", 
   "result.  The biggest problem right now is descriptor passing.  This isn't", 
   "likely to work anyplace other than Linux right now either."
  ], 
  "revision_id": "85981"
 }, 
 {
  "author": "trawick", 
  "date": "2000-08-03T03:09:32.000000Z", 
  "msg": [
   "Clean up maintainer-mode compiles of mod_rewrite (use AP_INIT_xx macros", 
   "and clean up resulting warnings)."
  ], 
  "revision_id": "85980"
 }
]