[
 {
  "author": "ivan", 
  "date": "2006-09-15T13:25:22.475381Z", 
  "msg": [
   "* STATUS: Vote for r21387 and move to approved."
  ], 
  "revision_id": "861580"
 }, 
 {
  "author": "blair", 
  "date": "2006-09-15T06:42:09.158441Z", 
  "msg": [
   "* www/links.html:", 
   "In the community section, add a link to a Mediawiki based Wiki I set", 
   "up for Subversion."
  ], 
  "revision_id": "861579"
 }, 
 {
  "author": "dlr", 
  "date": "2006-09-14T23:56:47.672213Z", 
  "msg": [
   "On the merge-tracking branch: Handle skip notifications encountered", 
   "while performing a merge.  If all changes in a merge are skipped, no", 
   "merge info is recorded for the target.  If only some changes are", 
   "skipped, merge info is recorded for the target, and recorded as empty", 
   "(or with no modifications, if there is pre-existing merge info) for", 
   "the skipped items.", 
   "Open question: When directories are skipped, should we record merge", 
   "info for its children (to avoid them being overridden to having no", 
   "merge info from the merge), or are they too considered skipped?", 
   "* TODO", 
   "Update for fix to merge test #3.", 
   "* subversion/libsvn_client/diff.c", 
   "(notification_receiver_baton_t): Add new nbr_notifications field, a", 
   "counter for the number of notifications occurring over the course", 
   "of a merge.", 
   "(notification_receiver): Increment BATON->nbr_notifications.", 
   "(determine_merges_performed): Avoid recording any merge info when", 
   "all paths touched by a merge are skipped.  Add question about", 
   "children of a skipped directory.", 
   "(do_merge, do_single_file_merge): Initialize nbr_notifications to 0,", 
   "and clear the counter after merging a revision range.", 
   "* subversion/tests/cmdline/merge_tests.py", 
   "(delete_file_and_dir): Fix test, accounting for the fact that we no", 
   "longer record merge info when all paths touched by a merge are", 
   "skipped."
  ], 
  "revision_id": "861578"
 }, 
 {
  "author": "dlr", 
  "date": "2006-09-14T22:10:41.335585Z", 
  "msg": [
   "* www/links.html: Update links and text to CollabNet's Subversion offerings."
  ], 
  "revision_id": "861577"
 }, 
 {
  "author": "djames", 
  "date": "2006-09-14T21:52:48.766311Z", 
  "msg": [
   "* dist.sh: Don't run autogen.sh when we're building a Windows release,", 
   "as it's unnecessary. Also, don't run Neon's autogen.sh."
  ], 
  "revision_id": "861576"
 }
]