[
 {
  "author": "malcolm", 
  "date": "2006-10-18T22:14:54.981209Z", 
  "msg": [
   "FSFS: Remove a small race that would allow writes to a prototype revision file", 
   "in the period between the file's closure and moving the revision file into", 
   "place.", 
   "Found by: rooneg", 
   "me", 
   "* subversion/libsvn_fs_fs/fs_fs.c", 
   "(commit_body): Delay unlocking the prototype revision file until after it", 
   "has been moved into place."
  ], 
  "revision_id": "862100"
 }, 
 {
  "author": "adejong", 
  "date": "2006-10-18T22:03:55.795952Z", 
  "msg": [
   "Import release 0.8 of svn2cl. This version includes a number of bug", 
   "fixes in wrapping, working repository detection and other problems. It", 
   "adds couple of new options, mainly for formatting the generated html", 
   "and to set line spacing of text version.", 
   "[in contrib/client-side/svn2cl]", 
   "* svn2cl.sh: Detection of working repository was made more consistent", 
   "with running the svn log command. Additions of options --title and", 
   "--revision-link. Modification of option --break-before-msg. Some", 
   "fixes for repository names or directory names with spaces in them.", 
   "* svn2html.xsl: Additions and modifications of the options as", 
   "described with svn2cl.sh. Change of DOCTYPE declaration to support", 
   "more XSLT processors. Wrapping fixes.", 
   "* svn2cl.xsl: Additions and modifications of the options as described", 
   "with svn2cl.sh. Authors file content is now copied in instead as", 
   "flattened to a string first (this allows inserting html from the", 
   "authors file).", 
   "* authors.xml: Demonstration of including html in authors file.", 
   "* svn2cl.1: The new options and features were documented. The", 
   "information on authors files was split into a separate section.", 
   "* README: Added section on running svn2cl from ant. Pointer to", 
   "VBScript port of the wrapper shell script."
  ], 
  "revision_id": "862099"
 }, 
 {
  "author": "malcolm", 
  "date": "2006-10-18T20:52:36.228895Z", 
  "msg": [
   "Remove an unused static variable.", 
   "* subversion/libsvn_subr/simple_providers.c", 
   "(windows_crypto_type): Remove."
  ], 
  "revision_id": "862098"
 }, 
 {
  "author": "dlr", 
  "date": "2006-10-18T19:01:07.805175Z", 
  "msg": [
   "On the merge-tracking branch: Merge revisions 21902 through 22021 from", 
   "trunk."
  ], 
  "revision_id": "862097"
 }, 
 {
  "author": "lgo", 
  "date": "2006-10-18T18:30:05.945279Z", 
  "msg": [
   "Follow up to r22019: small fixes and cleanup", 
   "Reported by: malcolm", 
   "* subversion/tests/cmdline/authz_tests.py", 
   "(write_authz_file): expanded comment and renamed section param to sections.", 
   "(test_list): added comma after last test."
  ], 
  "revision_id": "862096"
 }
]