[
 {
  "author": "ehu", 
  "date": "2007-08-02T06:46:29.410653Z", 
  "msg": [
   "Fix issue #2826 (Conflicting prop update reported as 'U'pdate).", 
   "(Also start taking a stab at making prop-merging more robust.)", 
   "* subversion/libsvn_wc/props.c", 
   "(set_prop_merge_state): New.  Determines whether the state needs updating,", 
   "because the new value has a higher priority of being reported.", 
   "(apply_single_prop_add,", 
   "apply_single_prop_delete,", 
   "apply_single_prop_change): Factored out of svn_wc__merge_props().", 
   "(svn_wc__merge_props): Except for initialization, set value of 'state'", 
   "through set_prop_merge_state().  Adjust to call factored out functions.", 
   "* tests/cmdline/merge_tests.py", 
   "(simple_property_merges): If we expect a property conflict,", 
   "we also expect it to be reported.  Adjust expected_output.", 
   "(avoid_reflected_revs): Change the expected mergeinfo prop", 
   "to what we actually should expect."
  ], 
  "revision_id": "866005"
 }, 
 {
  "author": "kfogel", 
  "date": "2007-08-02T06:13:28.828008Z", 
  "msg": [
   "* tools/dev/contribulyze.py", 
   "(process_committers): Ignore dormant committers; that is, treat them", 
   "like full committers, which they are.", 
   "Without this change, Branko Čibej's name (for example) shows up in", 
   "contribulyzer output, and that's just a distraction for our purposes."
  ], 
  "revision_id": "866004"
 }, 
 {
  "author": "sage", 
  "date": "2007-08-01T22:57:25.806068Z", 
  "msg": [
   "Add a info method and helper functions to the python ctypes WC class. Wraps all", 
   "the functionality needed to allow the user to get info on the wc through callbacks", 
   "to a user defined function.", 
   "* (csvn/wc.py):", 
   "(__init__): Add initalization code to setup info callbacks.", 
   "(_info_wrapper): Internal method to wrap a call to the user provided info", 
   "function.", 
   "(set_info_func): New method to allow the user to set the info callback without", 
   "invoking the info method. Also used internally by the info method.", 
   "(info): Method to get information on the working copy using a callback."
  ], 
  "revision_id": "866003"
 }, 
 {
  "author": "sage", 
  "date": "2007-08-01T22:51:11.471620Z", 
  "msg": [
   "Add a propget method to the python ctypes WC class. Allows the user to get the", 
   "value of a prop for a given target (which may be a directory, in which case the", 
   "operation can recurse). Works as a wrapper for svn_client_propget2.", 
   "* (csvn/wc.py):", 
   "(propget): New method to get property values for the working copy."
  ], 
  "revision_id": "866002"
 }, 
 {
  "author": "sage", 
  "date": "2007-08-01T22:49:09.807637Z", 
  "msg": [
   "Add a checkout method to the python ctypes WC class. The checkout method checks", 
   "out a new working copy, placing it in the working copy as specified by the user.", 
   "Essentially works as a wrapper for svn_client_checkout2.", 
   "* (csvn/wc.py):", 
   "(checkout): New method to checkout a working copy from a repository."
  ], 
  "revision_id": "866001"
 }
]