[
 {
  "author": "pburba", 
  "date": "2007-11-16T15:12:02.550846Z", 
  "msg": [
   "Follow-up to r27764, document another restriction on svn:mergeinfo values.", 
   "* subversion/include/svn_mergeinfo.h", 
   "(overview of the mergeinfo prop): For now at least we don't consider", 
   "svn:mergeinfo valid if revision ranges have start revisions >= end", 
   "revisions.  I say \"For now\" because there is some current consideration", 
   "of implementing explicit reversed range svn:mergeinfo.  Also note that", 
   "we *don't* currently enforce this anywhere, that is coming shortly as", 
   "part of a larger change."
  ], 
  "revision_id": "867925"
 }, 
 {
  "author": "glasser", 
  "date": "2007-11-16T09:23:11.272339Z", 
  "msg": [
   "Followup to r27077.  When reparenting in the ra_svn client, allocate", 
   "the new session URL in the session's pool, not in some random", 
   "temporary pool.  Otherwise we get random memory corruption, wee!", 
   "* subversion/libsvn_ra_svn/client.c", 
   "(ra_svn_reparent): Allocate long-lived data in a long-lived pool."
  ], 
  "revision_id": "867924"
 }, 
 {
  "author": "cmpilato", 
  "date": "2007-11-16T07:04:41.131921Z", 
  "msg": [
   "Merge outstanding revisions from trunk to the 'mergeinfoless-copies' branch.", 
   "Merged /trunk:r27818-27847"
  ], 
  "revision_id": "867923"
 }, 
 {
  "author": "cmpilato", 
  "date": "2007-11-16T07:03:49.705014Z", 
  "msg": [
   "On the 'mergeinfoless-copies' branch, choose the lesser of two merge", 
   "management annoyances (but leave code for, and describe, both).", 
   "* subversion/libsvn_client/merge.c", 
   "(filter_merged_revisions): Describe and leave code for choosing", 
   "between two different codepaths, neither perfectly ideal.  But", 
   "leave the more-ideal one (in my opinion) live, the other dead."
  ], 
  "revision_id": "867922"
 }, 
 {
  "author": "glasser", 
  "date": "2007-11-16T03:49:28.454069Z", 
  "msg": [
   "[This revision finishes the work started in r27846; this log message", 
   "covers the changes in both revisions.]", 
   "On the sqlite-node-origins branch:", 
   "Abstract sqlite functionality that is not specific to mergeinfo out of", 
   "mergeinfo-sqlite-index.c and into a new sqlite-util.c.", 
   "Create an empty node_origins table (but don't use it yet); this", 
   "involved writing code to upgrade a db containing mergeinfo tables but", 
   "no node_origin table to have both.  While this is not strictly", 
   "necessary for compatibility (because 1.5 is not released yet), this", 
   "will both make lives easier for developers now *and* give us an", 
   "infrastructure for upgrading the database in future versions.", 
   "* subversion/libsvn_fs_util/sqlite-util.c", 
   "New.  Move a bunch of functions here (renaming them to", 
   "svn_fs__sqlite_*)...", 
   "* subversion/libsvn_fs_util/mergeinfo-sqlite-index.c", 
   "... from here.", 
   "* subversion/libsvn_fs_util/mergeinfo-sqlite-index.h", 
   "... and declare them here."
  ], 
  "revision_id": "867921"
 }
]