[
 {
  "author": "rbb", 
  "date": "2000-11-14T06:07:40.000000Z", 
  "msg": [
   "Make the header filter decide if a body should be sent.  This gives us a", 
   "chance to compute the proper content-length before we try to send a set", 
   "of headers.  If a handler wants to ignore the HEAD method, then it can", 
   "either just return from the handler function or pass an EOS bucket down", 
   "the filter stack.  Either method will still get the headers sent to the", 
   "client.", 
   "This change allows handlers to actually run the request like it is a GET", 
   "request.  The core itself will then ensure that no body is sent.  This", 
   "allows us to get more information about the request before sending out the", 
   "headers for the HEAD request."
  ], 
  "revision_id": "86954"
 }, 
 {
  "author": "rbb", 
  "date": "2000-11-14T04:52:33.000000Z", 
  "msg": [
   "If the content-length is zero, then we don't output the Content-Length", 
   "header file.  The only time that the C-L should be zero is if there is", 
   "no body.  Zero is a valid content-length, but the only time that we ever", 
   "really send it is on a HEAD request right now, and that is incorrect.", 
   "The HEAD response should have the actual content's length."
  ], 
  "revision_id": "86953"
 }, 
 {
  "author": "rbb", 
  "date": "2000-11-14T04:22:03.000000Z", 
  "msg": [
   "Associate a pool with the pool bucket so that it serves it's intended", 
   "purpose.  This also moves the create_pool function outside of an if to", 
   "decrease complexity."
  ], 
  "revision_id": "86952"
 }, 
 {
  "author": "rbb", 
  "date": "2000-11-14T02:42:51.000000Z", 
  "msg": [
   "Add the referer to the error log if one is available.", 
   "PR:\t73", 
   "Submitted by:\tMarkus Gyger <mgyger@itr.ch>"
  ], 
  "revision_id": "86951"
 }, 
 {
  "author": "trawick", 
  "date": "2000-11-14T02:30:35.000000Z", 
  "msg": [
   "Include ap_config.h to get the definition of AP_DECLARE_DATA."
  ], 
  "revision_id": "86950"
 }
]