[
 {
  "author": "julianfoad", 
  "date": "2008-12-03T10:53:54.770663Z", 
  "msg": [
   "On the merge-skips-obstructions branch: Merge changes from trunk up to r34540."
  ], 
  "revision_id": "874615"
 }, 
 {
  "author": "blair", 
  "date": "2008-12-02T23:56:56.124688Z", 
  "msg": [
   "[This was reverted in r34561.]", 
   "* subversion/libsvn_fs_base/bdb/env.c", 
   "(create_env):", 
   "Instead of relying upon the layout order of a bdb_env_t with the", 
   "errpfx_string as the first field so that casting a (bdb_env_t *)", 
   "to a (char *) works, refer to the errpfx_string field by name."
  ], 
  "revision_id": "874614"
 }, 
 {
  "author": "cmpilato", 
  "date": "2008-12-02T21:12:13.701012Z", 
  "msg": [
   "Tweak a regression test a little bit to demonstrate that without", 
   "glasser's r34506 fix, it is possible to not just error out of a", 
   "requested node-origin calculation, but to silently return and cache", 
   "the wrong value.  I first made these tweaks just to prove it to", 
   "myself, but I might as well commit them.", 
   "* subversion/tests/libsvn_fs/fs-test.c", 
   "(node_origin_rev): Throw another wrench into the test scenario."
  ], 
  "revision_id": "874613"
 }, 
 {
  "author": "hwright", 
  "date": "2008-12-02T20:48:22.891529Z", 
  "msg": [
   "Followup to r34537: Because we're now reading the entire manifest file into", 
   "the cache at once, we don't need fixed-width fields.  So, we can eliminate", 
   "the need to pad the offsets in the manifest file.", 
   "* subversion/libsvn_fs_fs/fs_fs.c", 
   "(PACK_MANIFEST_ENTRY_LEN): Remove.", 
   "(pack_shard): Don't right-pad the offsets in the manifest file.", 
   "* subversion/libsvn_fs_fs/structure", 
   "(Packing): Update manifest file format."
  ], 
  "revision_id": "874612"
 }, 
 {
  "author": "hwright", 
  "date": "2008-12-02T20:11:22.333213Z", 
  "msg": [
   "If we're going to spend the time to open a manifest file once, chances are we're", 
   "going to need additional information from that manifest file, so just read the", 
   "entire manifest file in, and cache it.", 
   "(I know there are more effecient ways to cache it now, we'll leave that for", 
   "Future Work.)", 
   "* subversion/libsvn_fs_fs/fs_fs.c", 
   "(get_packed_offset): Read the entire manifest file into the cache, not just", 
   "the one rev we're interested in."
  ], 
  "revision_id": "874611"
 }
]