[
 {
  "author": "stsp", 
  "date": "2009-09-30T10:26:35.223976Z", 
  "msg": [
   "Remove the 1.6.x-r38000 branch, reintegrated in r39695."
  ], 
  "revision_id": "879770"
 }, 
 {
  "author": "stsp", 
  "date": "2009-09-30T10:25:48.902133Z", 
  "msg": [
   "Reintegrate the 1.6.x-r38000 branch, fixing issue #3486.  This fixes many", 
   "errors and omissions in the tree conflict handling of node replacements, and", 
   "vastly reduces the chance of hitting the \"Attempt to add tree conflict that", 
   "already exists\" error.", 
   "* subversion/libsvn_client/merge.c", 
   "(make_tree_conflict): New function, factored out of tree_conflict().", 
   "(tree_conflict): Factor out a chunk into make_tree_conflict().", 
   "(tree_conflict_on_add): New function, like tree_conflict() but will combine", 
   "an existing action=delete conflict with a new action=add conflict to make", 
   "a single conflict (setting action=delete, the best we can do for lack of", 
   "a \"replace\" action in v1.6.x). In any other case where a tree conflict", 
   "already exists, leave the existing one in place and ignore the second one.", 
   "(merge_file_added): Use tree_conflict_on_add() instead of tree_conflict() so", 
   "an incoming file replacement results in a single tree conflict instead of", 
   "an (abortive) attempt to add two tree conflicts on the same victim.", 
   "Check for a tree conflict in more cases.", 
   "(merge_dir_added): Use tree_conflict_on_add() instead of tree_conflict() so", 
   "an incoming dir replacement results in a single tree conflict instead of", 
   "an (abortive) attempt to add two tree conflicts on the same victim.", 
   "(merge_dir_deleted): If the attempt to delete an existing directory fails,", 
   "the directory has local modifications, so flag a tree conflict.", 
   "* subversion/libsvn_client/repos_diff.c", 
   "Fix duplicate notifications for a merge tree-conflict with an incoming", 
   "replace. Rearrange the notification code for clarity.", 
   "(add_directory, close_file): In each function, ensure only one notification", 
   "is sent. Previously, if an earlier incoming deletion on this path had", 
   "raised a tree conflict, then this code sent one notification for the tree", 
   "conflict and another for the result of the present action. (The file-", 
   "replaced-with-file case was visible on the trunk in merge_tests.py", 
   "merge_replace_causes_tree_conflict2 on file A/mu during the final", 
   "merge: there was an additional \"A\" notification for A/mu.) Don't bother", 
   "setting NOTIFY's LOCK_STATE in case of a tree-conflict notification.", 
   "(close_directory): Don't notify on paths already notified by add_directory().", 
   "* subversion/libsvn_wc/update_editor.c", 
   "(schedule_existing_item_for_re_add): Add an option to leave the item's", 
   "copy-from info alone, in order to handle a node that was scheduled for", 
   "replacement rather than modified.", 
   "(do_entry_deletion): If we raise a tree conflict because the node is locally", 
   "replaced, re-schedule the node for addition (with or without history)", 
   "rather than trying to delete it.", 
   "* subversion/tests/cmdline/merge_tests.py", 
   "(delete_file_and_dir): On an incoming delete of a directory with local mods,", 
   "expect a tree conflict instead of a skip.", 
   "(merge_replace_causes_tree_conflict): New test.", 
   "(test_list): Add the new test.", 
   "* STATUS", 
   "Remove the entry that proposed this change.", 
   "(The above log message was written by Julian Foad from the source code diff,", 
   "the branch log messages and the original trunk log messages.)", 
   "The entry in STATUS that proposed this change was:", 
   "* r38000, r38006, r38099, r38100, r38181, r38198, r38803, r38831,", 
   "r38841, r38896, r38907, r39000, r39002, r39007, r39008, r39052,", 
   "r39096, r39124, r39125, r39127, r39561, r39562", 
   "Properly handle tree conflicts during replace.", 
   "(See issue #3281 \"Merge a replacement of a directory\")", 
   "Justification:", 
   "If a merge has a delete followed by an add on the same node, and", 
   "also that node is modified locally, svn tried to create two tree-", 
   "conflicts on the same node. That hit an assertion and bailed out,", 
   "breaking the working copy.", 
   "Notes:", 
   "The cmdline test for this issue is merge_replace_causes_tree_conflict", 
   "in merge_tests.py.", 
   "Some revisions depend on API and working copy meta data changes made", 
   "on trunk and don't merge cleanly. The backport branch omits any API", 
   "and working copy metadata changes.", 
   "Since some of these revisions revert or change edits from earlier", 
   "ones, it makes more sense to review the diff of the branch rather", 
   "than all the individual changes:", 
   "svn diff -x-p ^/branches/1.6.x@39642 ^/branches/1.6.x-r38000@39646", 
   "See the log messages on the branch as well as those on trunk.", 
   "Here is a summary of the revisions, grouped by purpose:", 
   "Fix the \"tree conflict that already exists\" error:", 
   "r38000, r38006, r38181, r38841, r39561, r39562", 
   "Add and tweak new merge tests:", 
   "r38099, r38100, r38198, r38803, r39000, r39002, r39007, r39052", 
   "Eliminate duplicate notifications and improve error messages:", 
   "r38831, r38896, r38907, r39008, r39096, r39124, r39125, r39127", 
   "Branch:", 
   "^/branches/1.6.x-r38000", 
   "Votes:", 
   "+1: stsp, sbutler, julianfoad"
  ], 
  "revision_id": "879769"
 }, 
 {
  "author": "stylesen", 
  "date": "2009-09-30T10:20:19.145086Z", 
  "msg": [
   "Create a 1.6.x backport branch for r39692."
  ], 
  "revision_id": "879768"
 }, 
 {
  "author": "rhuijben", 
  "date": "2009-09-30T10:00:30.449992Z", 
  "msg": [
   "Make svn_dirent_canonicalize() do what it's documentation says it does:", 
   "make all drive letters upper case on Windows. To do this without breaking", 
   "compatibility svn_dirent_is_canonical will still return TRUE for paths", 
   "with lower case drive letters.", 
   "As an added bonus svn_dirent_is_canonical stops allocating memory for", 
   "the common path formats.", 
   "Found by: rdonch", 
   "* subversion/include/svn_dirent_uri.h", 
   "(svn_relpath_is_canonical): Update argument name to match documentation.", 
   "* subversion/libsvn_subr/dirent_uri.c", 
   "(local_style): Correctly switch code between dirents and relpaths.", 
   "Remove obsolete comment.", 
   "(canonicalize): Upper case drive letters for dirents.", 
   "(svn_dirent_canonicalize): Upper case drive letter in special case.", 
   "(svn_dirent_is_canonical): Use specific implementation for the common", 
   "path formats.", 
   "* subversion/tests/libsvn_subr/dirent_uri-test.c", 
   "(test_dirent_canonicalize): Add test values on defined behavior.", 
   "(test_dirent_local_style,", 
   "test_dirent_internal_style): Add test values for new behavior and", 
   "update expected values for non canonical paths."
  ], 
  "revision_id": "879767"
 }, 
 {
  "author": "stylesen", 
  "date": "2009-09-30T09:38:03.858952Z", 
  "msg": [
   "Fix issue #3498 - Subversion password stores freeze Eclipse", 
   "* subversion/libsvn_auth_gnome_keyring/gnome_keyring.c", 
   "(simple_gnome_keyring_first_creds, simple_gnome_keyring_save_creds,", 
   "ssl_client_cert_pw_gnome_keyring_first_creds,", 
   "ssl_client_cert_pw_gnome_keyring_save_creds): If the keyring is locked", 
   "and we are in interactive mode but have no unlock prompt function, don't", 
   "throw a \"GNOME Keyring is locked and we are non-interactive\" error;", 
   "instead, continue without unlocking it, so that the unlocking may be", 
   "handled by the default GNOME Keyring unlock dialog box."
  ], 
  "revision_id": "879766"
 }
]