[
 {
  "author": "gstein", 
  "date": "2009-10-09T01:49:13.930981Z", 
  "msg": [
   "Followup to Julian's fix in r39885, and switch to use the SVN_DBG macro.", 
   "It brings in all the \"standard stuff\" for debug output: the DBG prefix,", 
   "and the correct output descriptor. The output is also subject to \"quiet", 
   "mode\" thru compilation or an envvar.", 
   "* subversion/libsvn_subr/dso.c:", 
   "(svn_dso_load): use SVN_DBG, as appropriate."
  ], 
  "revision_id": "879960"
 }, 
 {
  "author": "julianfoad", 
  "date": "2009-10-08T23:08:26.569544Z", 
  "msg": [
   "Adjust the warning messages that are emitted by debug builds on failure to", 
   "load a Dynamic Shared Object file (such as the KWallet or Gnome Keyring auth", 
   "libs) so that the test suite will ignore them. This is useful when testing", 
   "with just one of KWallet or Gnome Keyring because Subversion tries to load", 
   "both and we don't care if it can't find one of them.", 
   "We could have kept the message going to stderr and made the test suite", 
   "ignore debug messages on stderr as well as on stdout, but there is precedent", 
   "for such messages to go to stdout.", 
   "We probably should make Subversion consistent about whether it tries to load", 
   "these libs. It is odd to try loading both (assuming both are listed in the", 
   "config option) if built with support for either but not to try if built with", 
   "support for neither.", 
   "* subversion/libsvn_subr/dso.c", 
   "(svn_dso_load): Prefix the warning message with \"DBG: \" and emit it on", 
   "stdout rather than stderr."
  ], 
  "revision_id": "879959"
 }, 
 {
  "author": "esr", 
  "date": "2009-10-08T21:44:00.058711Z", 
  "msg": [
   "Initial commit of svncutter."
  ], 
  "revision_id": "879958"
 }, 
 {
  "author": "rhuijben", 
  "date": "2009-10-08T19:47:36.096146Z", 
  "msg": [
   "* STATUS: Cast some votes, approving r39880"
  ], 
  "revision_id": "879957"
 }, 
 {
  "author": "peters", 
  "date": "2009-10-08T19:31:49.392975Z", 
  "msg": [
   "* STATUS: Vote for r39880, something I've wanted since November 2006."
  ], 
  "revision_id": "879956"
 }
]