[
 {
  "author": "simoneg", 
  "date": "2009-11-20T03:33:15.709920Z", 
  "msg": [
   "LABS-365 LABS-494 : moved context based settings to foundation-basice"
  ], 
  "revision_id": "882400"
 }, 
 {
  "author": "oching", 
  "date": "2009-11-20T03:31:19.542399Z", 
  "msg": [
   "[MRM-1278] Wrong repository displayed in Archiva browse", 
   "o added selenium test that uploads SNAPSHOT artifacts in releases and snapshots repositories and checks artifact info page for correct artifact information", 
   "o refactored upload artifact methos in AbstractManagementTest, moved them over to AbstractArchivaTest to avoid repetition in other tests that uses it"
  ], 
  "revision_id": "882399"
 }, 
 {
  "author": "twilliams", 
  "date": "2009-11-20T03:25:14.581442Z", 
  "msg": [
   "Fix for FOR-993 add warn message instead of dumping the scary stacktrace."
  ], 
  "revision_id": "882398"
 }, 
 {
  "author": "taylor", 
  "date": "2009-11-20T03:19:45.064712Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/JS2-1057", 
   "- contribution from Gonzalo Aguilar Delgado", 
   "- toolbox retrieve portlets over ajax api", 
   "Reviewed. I've modified and fixed a few things...", 
   "- fixed the display names to display", 
   "- rewrote the row population script to use YUI Node api replacing direct DOM manipulation", 
   "- dont' use a onclick handler, simply call the first load of portlets directly inline", 
   "im actually not sure what should be populated first, perhaps a \"Whats New\" category", 
   "- added some TODOs for you, see source code for details", 
   "Im also thinking that it might be better to create the nodes directly from javascript, and not pass in the hidden table (I added a display:none attribute on it) although the hidden table is definitely easier. Optionally you may want to consider loading from a string, something like:", 
   "var clone = Y.Node.create(\"<table><tr>....etc....\");"
  ], 
  "revision_id": "882397"
 }, 
 {
  "author": "ping", 
  "date": "2009-11-20T03:17:20.192573Z", 
  "msg": [
   "update website pages", 
   "commitor:ping"
  ], 
  "revision_id": "882396"
 }
]