[
 {
  "author": "borisk", 
  "date": "2009-11-24T11:41:38.894902Z", 
  "msg": [
   "Doxygen documentation fixes."
  ], 
  "revision_id": "883665"
 }, 
 {
  "author": "woonsan", 
  "date": "2009-11-24T11:41:32.722969Z", 
  "msg": [
   "JS2-1086: Allowing portlet mode parameter in the portlet pipeline.", 
   "With this, client-side page aggregation engines such as desktop mode are able to render help, edit, about, edit_defaults, config and preview modes through portlet pipeline.", 
   "By the way, the portlet aggregator in portlet pipeline cannot depend on the navigational state generated from the portal url to decide which portlet mode is in concern. So, the portlet aggregator set a portlet mode in the navigational state based on the requested portlet mode parameter.", 
   "Also, the portlet renderer retrieves portlet content cache but it hasn't checked if the portlet mode was the same because the content cache has been already invalidated during resetting navigation states in the pre-executing valves. However, the portlet pipeline cannot depend on navigational state and encoded portal urls, so I added one more checking if the portlet content has the same portlet mode as the current portlet window.", 
   "TO-DO: Modify decorator to not show preview action in the portlet window ui. Add preview custom mode implementation in PickANumberPortlet as an example. Add default preview mode handling in the portlet proxy with thumbnail metadata in jetspeed-portlet.xml. Add configuration properties in jetspeed.properties for default handlings."
  ], 
  "revision_id": "883664"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-11-24T11:38:07.657692Z", 
  "msg": [
   "Some itemizedlists and orderedlists in Setup Help.", 
   "I used cdata in HELP_SystemInfoNotes.xml because username is a docbook reserved word and I was unable to use author mode.", 
   "BTW I did not find in HELPUI where HELP_SystemInfoNotes.xml is used..."
  ], 
  "revision_id": "883663"
 }, 
 {
  "author": "uschindler", 
  "date": "2009-11-24T11:37:44.433513Z", 
  "msg": [
   "merge from trunk"
  ], 
  "revision_id": "883662"
 }, 
 {
  "author": "uschindler", 
  "date": "2009-11-24T11:33:46.733243Z", 
  "msg": [
   "LUCENE-2046: wrong place in changes.txt"
  ], 
  "revision_id": "883661"
 }
]