[
 {
  "author": "wrowe", 
  "date": "2001-03-02T19:26:23.000000Z", 
  "msg": [
   "Per suggestion of Martin Kraemer, eliminated unused \"Your Name\", \"Your Company\"", 
   "screen (Customer Information) from the installer, moved the AllUsers/OnlySelf", 
   "choice to the ServerInformation screen.  Introduced full ProductName (including", 
   "the version) to the first and last dialogs of each path through the installer.", 
   "Per PR7345, changed the execution flags for ResolveServerName back to 193, and", 
   "while the ValidateServerName must stay at 65, we call it only on the condition", 
   "that WINSOCK2_RESOLVED was toggled (and therefore the .dll runs successfully.)", 
   "This is probably a very goofy linkage problem.", 
   "Per PR7344, all the .msi's to date would act quite goofy if forward slashes are", 
   "given in the path name.  Provide a very loud warning to tell the user to always", 
   "choose backslashes when picking an installation folder.", 
   "Correct the ALLUSER flag to trip back if the user backs up and changes their", 
   "mind, and condition the ApacheAdmin and ApacheNonAdmin shortcuts/registry", 
   "components to obey ALLUSER instead of AdminUser.", 
   "Correct the tripping when bounding through the sequence table for stopping and", 
   "uninstalling a prior \"Apache\" service, then installing and starting the new", 
   "service.  We won't touch the existing service if they are not performing an", 
   "ALLUSER install."
  ], 
  "revision_id": "88424"
 }, 
 {
  "author": "trawick", 
  "date": "2001-03-02T18:52:23.000000Z", 
  "msg": [
   "fix the type of ap_my_pid and make it static since it is used", 
   "in only one file per build (prefork.c or threaded.c)", 
   "PR:\t\t6980"
  ], 
  "revision_id": "88423"
 }, 
 {
  "author": "gregames", 
  "date": "2001-03-02T15:46:14.000000Z", 
  "msg": [
   "fix make install so that suexec is installed where the server expects to", 
   "find it ( <prefix>/sbin by default).", 
   "also enable ./configure --sbindir=DIR to work as advertised."
  ], 
  "revision_id": "88422"
 }, 
 {
  "author": "martin", 
  "date": "2001-03-02T12:35:53.000000Z", 
  "msg": [
   "Ignasi writes:", 
   "Both mod_ssl and KAME-ipv6 patch sets are adding the", 
   "if (fd >= 0) in the FD_SET(fd, &listenfds) on http_main.c.", 
   "I think this patch doesn't concert neither to mod_ssl nor to IPv6.", 
   "I agree, and I think it avoids a potential core dump too.", 
   "Submitted by:\t\"Roca Carrio, Ignasi\" <Ignasi.Roca@fujitsu-siemens.com>"
  ], 
  "revision_id": "88421"
 }, 
 {
  "author": "martin", 
  "date": "2001-03-02T09:36:15.000000Z", 
  "msg": [
   "Change icon for MSI packages"
  ], 
  "revision_id": "88420"
 }
]