[
 {
  "author": "cdouglas", 
  "date": "2009-11-25T21:57:18.738345Z", 
  "msg": [
   "MAPREDUCE-1182. Fix overflow in reduce causing allocations to exceed the", 
   "configured threshold."
  ], 
  "revision_id": "884290"
 }, 
 {
  "author": "cdouglas", 
  "date": "2009-11-25T21:57:05.397740Z", 
  "msg": [
   "MAPREDUCE-1182. Fix overflow in reduce causing allocations to exceed the", 
   "configured threshold."
  ], 
  "revision_id": "884289"
 }, 
 {
  "author": "cdouglas", 
  "date": "2009-11-25T21:56:53.430549Z", 
  "msg": [
   "MAPREDUCE-1182. Fix overflow in reduce causing allocations to exceed the", 
   "configured threshold."
  ], 
  "revision_id": "884288"
 }, 
 {
  "author": "zongaro", 
  "date": "2009-11-25T21:55:09.439043Z", 
  "msg": [
   "Applying patch contributed by Martin von Gagern for XALANJ-2493 and XALANJ-2424.", 
   "Quoting from Martin, \"The current implementation of nodeList2Iterator is", 
   "broken, because it can not deal with attribute nodes. It relies on copyNodes", 
   "which in turn tries to add attribute nodes as children of some top level node.", 
   "Attributes don't live on the children axis, though, so this is against DOM and", 
   "causes a DOM exception in the Xerces DOM implementation and probably most other", 
   "implementations. The resulting HIERARCHY_REQUEST_ERR was noted e.g. in", 
   "XALANJ-2424.  Furthermore, the implementation is inefficient, because it", 
   "manually copies each and every node from the source document to a new DTM to", 
   "some new DTM....", 
   "I dropped copyNodes in favor of Document.importNode, to avoid code duplication", 
   "and rely on supposedly more heavily tested code. I also added another level of", 
   "elements, so that there is one such dummy node for every item of the source", 
   "list, with always a single child or element. A few assertions help ensure this", 
   "single child policy. This is especially important in the new implementation,", 
   "because otherwise it would become difficult to get the proxied nodes and the", 
   "newly DTMified nodes into correct order."
  ], 
  "revision_id": "884287"
 }, 
 {
  "author": "tellison", 
  "date": "2009-11-25T21:48:59.480500Z", 
  "msg": [
   "Fix class path entry to point to updated JARs for JDK tools."
  ], 
  "revision_id": "884286"
 }
]