[
 {
  "author": "costin", 
  "date": "2009-11-26T06:45:13.932947Z", 
  "msg": [
   "Based on the code in tomcat.lite, but using the new http connector instead of coyote.", 
   "Also the ObjectManager and properties are no longer used.", 
   "This can be compiled against both 3.0 and 2.5 ( with proper exclude ), since one of the goals", 
   "of tomcat-lite is to be useable against current servers.", 
   "Note that this is mostly for testing and to allow existing servlets to be used _outside_ of a", 
   "servlet engine - this is not a servlet engine."
  ], 
  "revision_id": "884415"
 }, 
 {
  "author": "brett", 
  "date": "2009-11-26T06:44:40.016768Z", 
  "msg": [
   "[MRM-1283] migrate mailingLists() method to metadata repository"
  ], 
  "revision_id": "884414"
 }, 
 {
  "author": "costin", 
  "date": "2009-11-26T06:42:49.643411Z", 
  "msg": [
   "Proxy service - CONNECT doesn't seem to work ( probably because it didn't have a test ), the rest works", 
   "pretty well. Also includes a small socks server I used while testing. Almost all work is non-blocking and", 
   "done in the selector thread."
  ], 
  "revision_id": "884413"
 }, 
 {
  "author": "costin", 
  "date": "2009-11-26T06:41:00.561788Z", 
  "msg": [
   "The http implementation - it may be hard to recognize the original connector code from tomcat after many iterations.", 
   "Changes compared with coyote:", 
   "- both server and client mode", 
   "- HttpRequest/HttpResponse implement most of methods in the HttpServletRequest - with the addition of setters, for use", 
   "in client mode. They don't implement the interfaces - or 'servlet framework' specific methods - but should look", 
   "familiar to people using this as a library", 
   "- mapping is moved in this package, also support running HttpServices in the selector thread (proxy will run this way)", 
   "- MimeHeaders are gone, so are the parameters - replaced with the MultiMap, which is based on MimeHeaders but adds a HashMap", 
   "instead of linear scanning", 
   "See tests for examples."
  ], 
  "revision_id": "884412"
 }, 
 {
  "author": "noble", 
  "date": "2009-11-26T06:40:30.224175Z", 
  "msg": [
   "SOLR-1592"
  ], 
  "revision_id": "884411"
 }
]