[
 {
  "author": "markt", 
  "date": "2009-11-29T19:27:38.654920Z", 
  "msg": [
   "Add code that logs threads started but not stopped by the webapp.", 
   "I have some highly experimental code to shut those threads down but it a) needs more work and b) needs to be made configurable before I commit it."
  ], 
  "revision_id": "885260"
 }, 
 {
  "author": "gbrown", 
  "date": "2009-11-29T19:22:57.099757Z", 
  "msg": [
   "Clarify Javadoc for XMLSerializer path notation."
  ], 
  "revision_id": "885259"
 }, 
 {
  "author": "aadamchik", 
  "date": "2009-11-29T18:57:34.551921Z", 
  "msg": [
   "CAY-1319 Switch Cayenne configuration loading to cayenne-di container", 
   "* Extending DI container to support provider instance injection - useful for unit tests", 
   "* Unit tests", 
   "* Making injectable properties protected to allow meaningful subclassing", 
   "* XMLDataChannelDescriptorLoader", 
   "* XMLDataMapLoader"
  ], 
  "revision_id": "885258"
 }, 
 {
  "author": "scottbw", 
  "date": "2009-11-29T18:49:26.841388Z", 
  "msg": [
   "Implemented widget icons as a separate class rather than a single \"widgeticonlocation\" property of widget, added processing rules from W3C Widgets specification that identify default icons, and added processing rules for locating icons in localization folders. Also implemented conformance tests that cover icons. This corrects most of the issues in WOOKIE-58. Note that there are two problem areas remaining with this changeset: (1) GadgetUtils no longer supports icons; this should be resolved as part of the Shindig integration task; (2) the JSP pages still refer to a singular non-localized widget icon location; I've implemented a temporary method to cover this usage for now (and marked it deprecated) - this can be looked at when improving JSP localization."
  ], 
  "revision_id": "885257"
 }, 
 {
  "author": "jacopoc", 
  "date": "2009-11-29T18:32:31.811263Z", 
  "msg": [
   "Pretty big enhancements for the accounting processes and demo data:", 
   "1) completely refactored the trial balance report: now it is based on GLAccountHistory and no more on GlAccountOrganization records; the main advantage is that now it it possible to run the report per different financial time periods", 
   "2) big enhancements to the demo data: data was incomplete or wrong and this was affecting reports and the financial time period closing process", 
   "3) several fixes for the financial time period process", 
   "More fixes and enhancements will come, but now the closing process works fine and the financial reports make sense."
  ], 
  "revision_id": "885256"
 }
]