[
 {
  "author": "ashish", 
  "date": "2009-11-30T13:41:56.561137Z", 
  "msg": [
   "Applied patch from jira issue - OFBIZ-3249 - Shopping cart on checkout page does not gets update when a gift item is added in cart after applying coupon code.", 
   "Patch for update cart on one page checkout page when a gift item a added in cart after applying valid coupon code.", 
   "Steps to test:", 
   "1. Create a new product promo for 'Gift With Purchase' action with require coupon code.", 
   "2. Go to ecommerce -> main", 
   "3. Purchase X product and go for one page checkout page.", 
   "4. Enter coupon code", 
   "5 If this coupon code is valid according to condition given in promotion then a you will get Y product as gift in cart with 0.0 price.", 
   "Thanks Arun for the contribution."
  ], 
  "revision_id": "885425"
 }, 
 {
  "author": "rr", 
  "date": "2009-11-30T13:41:34.454034Z", 
  "msg": [
   "ODE-712: Resolving relative URIs as full paths - fix for schema loader imports problem"
  ], 
  "revision_id": "885424"
 }, 
 {
  "author": "spoole", 
  "date": "2009-11-30T13:35:29.627440Z", 
  "msg": [
   "made hprof execution target dir ignored"
  ], 
  "revision_id": "885423"
 }, 
 {
  "author": "cziegeler", 
  "date": "2009-11-30T13:35:23.303443Z", 
  "msg": [
   "SLING-1209 : Fix potential redirection problems."
  ], 
  "revision_id": "885422"
 }, 
 {
  "author": "kahatlen", 
  "date": "2009-11-30T13:32:53.686349Z", 
  "msg": [
   "DERBY-4442: Default value and identity in an INSERT result set evaluated too early", 
   "Always add a ProjectRestrictNode on top of the source result set for an", 
   "insert if the source columns are not ordered the same way as the target", 
   "columns, or if inserting into a subset of the columns, and the source is not", 
   "a table constructor. Then the adding of default values to the source result", 
   "column list happens on top of the original source result node, and not", 
   "inside that node. This means that the source result is produced before the", 
   "default values are added, and the generation of the defaults happens at the", 
   "correct time.", 
   "As a side-effect, these other issues are fixed:", 
   "DERBY-3 Identity column not filled consecutively with \"insert ... select distinct\"", 
   "DERBY-4433 Cannot insert from EXCEPT/INTERSECT when target table has more columns than the source", 
   "Much of the added code is actually old code revived from the Subversion", 
   "history. Before DERBY-1644, we used to put a ProjectRestrictNode on top of", 
   "the source result if it was a SetOperatorNode. The code that inserted the", 
   "ProjectRestrictNode was added back and changed to operate on ResultSetNode", 
   "instead of SetOperatorNode."
  ], 
  "revision_id": "885421"
 }
]