[
 {
  "author": "cmpilato", 
  "date": "2009-12-02T14:54:28.064505Z", 
  "msg": [
   "Propose r886164 for backport."
  ], 
  "revision_id": "886165"
 }, 
 {
  "author": "cmpilato", 
  "date": "2009-12-02T14:52:49.556568Z", 
  "msg": [
   "Fixup a blatant, flagrant, evil lie of the Devil found in the usage", 
   "message for 'svn switch'.", 
   "* subversion/svn/main.c", 
   "(svn_cl__cmd_table): Stop claiming that --set-depth (when used with", 
   "'svn switch') can't make directories more shallow, because since", 
   "1.6 was released, it certainly can.", 
   "* subversion/tests/cmdline/getopt_tests_data/svn_help_log_switch_stdout", 
   "Update expected output from 'svn help switch'."
  ], 
  "revision_id": "886164"
 }, 
 {
  "author": "fmeschbe", 
  "date": "2009-12-02T14:51:29.733627Z", 
  "msg": [
   "SLING-1208 Require Jackrabbit API 1.6 to be sure ..."
  ], 
  "revision_id": "886163"
 }, 
 {
  "author": "bpendleton", 
  "date": "2009-12-02T14:49:19.118733Z", 
  "msg": [
   "DERBY-3947: Cannot insert 994 char string into indexed column", 
   "A table created with \"CREATE TABLE t (x varchar(1000) primary key)\" could", 
   "encounter problems when a particularly long value of \"x\" was inserted,", 
   "because the index that was automatically created to support the PRIMARY KEY", 
   "constraint was created with a small page size. Such an insert statement", 
   "would get an error like: \"Limitation: Record of a btree secondary index", 
   "cannot be updated or inserted due to lack of space on the page.\"", 
   "This change enhances TableElementList so that, when creating an index for", 
   "a constraint, it now checks the approximate length of the columns in the", 
   "index, and, if they are sufficiently long, automatically chooses a larger", 
   "default page size for the index conglomerate."
  ], 
  "revision_id": "886162"
 }, 
 {
  "author": "jukka", 
  "date": "2009-12-02T14:48:02.853639Z", 
  "msg": [
   "JCR-1456: Database connection pooling", 
   "Move the pooled bundle db persistence managers to a new o.a.j.core.persistence.pool package."
  ], 
  "revision_id": "886161"
 }
]