[
 {
  "author": "thorsten", 
  "date": "2009-12-03T11:08:23.550292Z", 
  "msg": [
   "redoing r734405"
  ], 
  "revision_id": "886740"
 }, 
 {
  "author": "andrey", 
  "date": "2009-12-03T11:04:42.305652Z", 
  "msg": [
   "CAY-762 ERDiagram for Object Entities in Cayenne Modeler. Rebuild button"
  ], 
  "revision_id": "886739"
 }, 
 {
  "author": "ashish", 
  "date": "2009-12-03T10:59:07.463680Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3284 - Error at page - https://demo.ofbiz.org/ar/control/FindArInvoices.", 
   "After doing research on this error I got exact steps to produce this error, reason of the error and solution for the error. Here are my findings:", 
   "Steps to reproduce the error:", 
   "1) Start placing sales order from Order manager application by taking DemoCustomer.", 
   "2) Add any two products into the cart, choose shipping address and shipping method.", 
   "3) And then land on Order terms screens. Now select Term Type = Payment (net days) or any of its subtype.", 
   "4) Do not enter Term days and click on add button.", 
   "5) Select offline payment and create your order.", 
   "6) Now from payment section of order detail page, click on \"Receive Payment\" button and receive payment for Personal check by entering the amount and clicking on save button.", 
   "7) Complete the order by clicking on \"Quick ship entire order\" button on Action block.", 
   "8) Note the Invoice Id created and go to Find Invoices screen of AR by accessing https://demo.ofbiz.org/ar/control/FindArInvoices", 
   "9) Enter the Invoice ID and click on search, You will find error page.", 
   "Reason of error:", 
   "1) getInvoicePaymentInfoList Service returns error (in ListInvoices.ftl) for invoices of some specific order in which Term type = Payment (net days) or any of its subtype and user forgot to enter Term days.", 
   "2) Due to this reason code breaks while calling getDayEnd class method inside getInvoicePaymentInfoList simple method of PaymentServies.xml", 
   "Solution of error:", 
   "1) I have handled this situation by adding validation on Order terms screen .", 
   "2) Validation is like if User selects, Term type = Payment (net days) or any of its subtype and not entered Term days , then Error message will be returned to user", 
   "3) Error message will prompt : Order Term Days is required for this term type.", 
   "Thanks Divesh for the contribution."
  ], 
  "revision_id": "886738"
 }, 
 {
  "author": "apaliwal", 
  "date": "2009-12-03T10:56:34.526975Z", 
  "msg": [
   "Description: Initial version of the new Filter/FilterChain implementation", 
   "Submitted By: apaliwal at apache.org"
  ], 
  "revision_id": "886737"
 }, 
 {
  "author": "thorsten", 
  "date": "2009-12-03T10:54:20.550942Z", 
  "msg": [
   "Redoing r733422 in the dispatcher"
  ], 
  "revision_id": "886736"
 }
]