[
 {
  "author": "fmeschbe", 
  "date": "2009-12-04T12:43:40.476372Z", 
  "msg": [
   "SLING-1179 Servlet API is not available in the launcher any more, thus we", 
   "have to remove the system package declaration in the standalone application"
  ], 
  "revision_id": "887175"
 }, 
 {
  "author": "lofwyr", 
  "date": "2009-12-04T12:40:43.842027Z", 
  "msg": [
   "add deprecated annotation"
  ], 
  "revision_id": "887174"
 }, 
 {
  "author": "ashish", 
  "date": "2009-12-04T12:39:39.763462Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3304 - Remove links for adjustments in create return screen is not working.", 
   "Remove links for adjustment on return screen is not working.", 
   "Steps to regenerate issue:", 
   "1) Create an sales order and complete order by 'Quick Ship Entire Order' from order detail page.", 
   "2) Clicks on Create return link on order detail page", 
   "3) Clicks on Select all checkbox and then click on 'Return Selected items'", 
   "4) On Return Items screen 'Remove' links for adjustment gives secure url error.", 
   "Thanks Arun for the contribution."
  ], 
  "revision_id": "887173"
 }, 
 {
  "author": "ashish", 
  "date": "2009-12-04T12:34:22.383733Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3306 - Showing Promotion Item Duplicate, when click on Update Link on Order View Page.", 
   "In ordermgr when we update the items it will recreate the adjustments and promotion and cancel the previous promotion item, and showing deleted adjustment promotion item on the order view page (i.e showing duplicate promotion item with cancel status on order view page).", 
   "Steps to produce scenario :", 
   "– goto https://localhost:8443/ordermgr/control/main", 
   "– create aa sales order.", 
   "– on order view page click on \"Edit Items\" links.", 
   "– click on \"Update Items\" link.", 
   "Now on order view page it will show the duplicate promotion items of respective adjustment.", 
   "Thanks Arpit for the contribution."
  ], 
  "revision_id": "887172"
 }, 
 {
  "author": "ngn", 
  "date": "2009-12-04T12:30:06.979215Z", 
  "msg": [
   "Remove the use of addNamespaceAttribute(String) from most places as it is no longer needed"
  ], 
  "revision_id": "887171"
 }
]