[
 {
  "author": "rbb", 
  "date": "2001-04-18T22:29:31.000000Z", 
  "msg": [
   "Forgot to add this file."
  ], 
  "revision_id": "88889"
 }, 
 {
  "author": "rbb", 
  "date": "2001-04-18T21:06:07.000000Z", 
  "msg": [
   "Allow modules to specify their own logging format specifier.  Basically,", 
   "mod_log_config has registered an optional function, that other modules", 
   "can use to specify a function to be called.  This is analogous to the way", 
   "that mod_include works.  This also allows http to do the connection", 
   "logging itself, without exposing HTTP specific pieces to other modules."
  ], 
  "revision_id": "88888"
 }, 
 {
  "author": "rbb", 
  "date": "2001-04-18T20:56:04.000000Z", 
  "msg": [
   "There is a bug in how we sort some hooks, the pre-config hook is one that", 
   "is definately incorrect.  Basically, the first time we call the pre-config", 
   "hooks, they are sorted correctly.  However, when we call them the second", 
   "time, we use the order that modules are loaded into the server.  This", 
   "move basically puts the http_module after mod_log_config in the compiled", 
   "server.  It is a hack, and a work-around to allow for my next commit.", 
   "When the hook sort issue is solved, this should be re-named to config.m4"
  ], 
  "revision_id": "88887"
 }, 
 {
  "author": "dreid", 
  "date": "2001-04-18T20:51:35.000000Z", 
  "msg": [
   "This changes the build process as outlined in my email earlier this week.", 
   "Essentially we now build the static objects, then allow a platform to run", 
   "a given command, build the shared modules, then run another command before exiting.", 
   "This gets us building dso's on beos and may provide a better framework for some of", 
   "the other \"strange\" platforms out there without stopping the normal ones working."
  ], 
  "revision_id": "88886"
 }, 
 {
  "author": "rbb", 
  "date": "2001-04-18T20:46:46.000000Z", 
  "msg": [
   "Don't overwrite r->the_request.  This was causing us to never get the", 
   "request in the access_log"
  ], 
  "revision_id": "88885"
 }
]