[
 {
  "author": "jleroux", 
  "date": "2009-12-09T23:15:19.310155Z", 
  "msg": [
   "I found Long to appear too much. While at it I add all primtives wrappers"
  ], 
  "revision_id": "889015"
 }, 
 {
  "author": "jleroux", 
  "date": "2009-12-09T23:07:02.728010Z", 
  "msg": [
   "A patch from Erwan de FERRIERES \" Update and correction for the visual HTML editor\" (https://issues.apache.org/jira/browse/OFBIZ-3317) - OFBIZ-3317", 
   "The visual editor is using this line to fix a minimum height for the textarea box.", 
   "if (!o(idTa).rows < 5) o(idTa).rows='15';//IE won't use % from style", 
   "No matter the size we give it, it stays at 15. So I commented the line in the .js file. While I was at it, I updated whizzywig.js to the last version (55i ->59) and put the new toolbar icons system"
  ], 
  "revision_id": "889014"
 }, 
 {
  "author": "cmlenz", 
  "date": "2009-12-09T23:06:13.623858Z", 
  "msg": [
   "A couple of Futon improvements:", 
   "* JSON strings are now displayed as-is in the document view, without the escaping of new-lines and quotes. That dramatically improves readability of multi-line strings.", 
   "* Same goes for editing of JSON string values. When a change to a field value is submitted, and the value is not valid JSON it is assumed to be a string. This improves editing of multi-line strings a lot.", 
   "* Hitting tab in textareas no longer moves focus to the next form field, but simply inserts a tab character at the current caret position.", 
   "* Fixed some font declarations."
  ], 
  "revision_id": "889013"
 }, 
 {
  "author": "markrmiller", 
  "date": "2009-12-09T23:02:34.449893Z", 
  "msg": [
   "merge up to r888806"
  ], 
  "revision_id": "889012"
 }, 
 {
  "author": "jplevyak", 
  "date": "2009-12-09T23:01:29.878432Z", 
  "msg": [
   "TS-54: part 1", 
   "Convert iocore/net over to using the new List with the offset to the link specified", 
   "as part of the collection template.  Also, use atomic lists instead of just taking", 
   "a lock to handle enables from other threads and integrate the epoll data.  Finally,", 
   "unify the stle of member variables in the iocore/net directory.  This will be replaced", 
   "by our global style at a later date."
  ], 
  "revision_id": "889011"
 }
]