[
 {
  "author": "arkurth", 
  "date": "2009-12-14T15:12:42.471719Z", 
  "msg": [
   "VCL-279", 
   "Removed command line argument parsing from vcld. This now resides in utils.pm. Added checks for $SETUP_MODE and $DAEMON_MODE variables which are set in utils.pm.", 
   "Moved call to rename_vcld_process to earlier in the code, before daemonize is called and commented out line in daemonize which renamed the process. daemonize was unnecessarily renaming the process because it later got renamed by rename_vcld_process.", 
   "Added setup_management_node sub to vcld. This gets a list of the modules in the module table, checks each one for the implementation of a setup sub, and calls setup as needed."
  ], 
  "revision_id": "890365"
 }, 
 {
  "author": "kahatlen", 
  "date": "2009-12-14T15:09:06.363776Z", 
  "msg": [
   "DERBY-4380: Subqueries not allowed in ON clause", 
   "Removed translations of error message that was removed by the main", 
   "patch for this issue."
  ], 
  "revision_id": "890364"
 }, 
 {
  "author": "arkurth", 
  "date": "2009-12-14T15:09:02.441749Z", 
  "msg": [
   "VCL-279", 
   "Added get_module_info sub to utils.pm. It returns the info from the module table. It is used to retrieve a list of all modules in the database so they can each be checked for the implementation of a setup subroutine.", 
   "Added get_current_file_name, get_current_package_name, and get_current_subroutine_name subs to utils.pm. These are mainly for debugging purposes and return information about the code where they are called from.", 
   "Reworked the argument parsing section of utils.pm. All arguments are now parsed in utils.pm rather than having some parsed in vcld. Moved help sub from vcld to utils.pm so that it can be called from utils.pm if the -h switch is used or if an argument problem is detected.", 
   "Added $DAEMON_MODE and $SETUP_MODE variables to utils.pm. $DAEMON_MODE gets set if -d is specified and $SETUP_MODE gets set if -s is specified. This -d switch used to be contained within vcld to control if daemon mode was to be used.", 
   "Changed BEGIN block to INIT in utils.pm. This allows subs defined later in utils.pm (help) to be called within the INIT block.", 
   "Removed old, unused $TESTING variable from utils.pm and command line argument.", 
   "Added code to notify sub to save and restore the STDOUT and STDERR handles when the sub is entered and left. This allows other parts of the code to write to STDOUT and have it appear on the screen, rather than having all or none of the output written to the log file. This is needed to implement the setup framework, where the user is asked questions. notify messages still get written to the log file, but STDOUT gets written to the screen.", 
   "Other:", 
   "Temporarily added back disablesshd subroutine. This is still being called from reclaim.pm for lab computers. The logic in reclaim.pm needs to be reworked and then disablesshd can be removed again from utils.pm."
  ], 
  "revision_id": "890363"
 }, 
 {
  "author": "simoneg", 
  "date": "2009-12-14T15:08:47.500297Z", 
  "msg": [
   "LABS-502 : avoid displaying required fields marker when a form is without validation"
  ], 
  "revision_id": "890362"
 }, 
 {
  "author": "oching", 
  "date": "2009-12-14T15:08:03.978794Z", 
  "msg": [
   "[MRM-1296] Audit Log Report", 
   "o added constraint for custom query", 
   "o support custom query in view audit log action"
  ], 
  "revision_id": "890361"
 }
]