[
 {
  "author": "bago", 
  "date": "2009-12-30T15:22:10.793020Z", 
  "msg": [
   "Refactoring for MimeEntity:", 
   "- now takes a simple InputStream in input and add the buffering internally.", 
   "- now wants a MutableBodyDescripor to be used for this entity (and not a parent reference like before) (MIME5J-156)", 
   "- MimeEntity/AbstractEntity do not more depend on Maximal/Default BodyDescriptor implementations.", 
   "- removed T_IN_BODYPART and T_IN_MESSAGE \"dummy\" states (they are no more needed) (MIME4J-152)", 
   "- Zero parts multipart messages were parsed as 1 empty part multipart messages. Fixed (MIME4J-152)", 
   "- Added testmessages for the zero part multipart issue (MIME4J-152)", 
   "- MimeEntity.skipHeader removed. Headless parsing is now done simply passing a MutableBodyDescriptor with the right contenttype and a custom startState to the MimeEntity class (no hacks inside MimeEntity) (related to MIME4J-153)", 
   "- MimeTokenStream headless parsing doesn't start from T_END_HEADER state anymore but from the following state (MIME4J-153)", 
   "- mimeStream renamed to mimePartStream (and also related methods).", 
   "- MimeTokenStream now proxy the stop() request to the root mime entity (implemented MimeEntity.stop())."
  ], 
  "revision_id": "894645"
 }, 
 {
  "author": "norman", 
  "date": "2009-12-30T15:20:02.903496Z", 
  "msg": [
   "fix method name"
  ], 
  "revision_id": "894644"
 }, 
 {
  "author": "timothyjward", 
  "date": "2009-12-30T15:17:14.820605Z", 
  "msg": [
   "ARIES-99 : Initial drop of blog sample code"
  ], 
  "revision_id": "894643"
 }, 
 {
  "author": "bago", 
  "date": "2009-12-30T15:10:09.783905Z", 
  "msg": [
   "Added newChild method to MutableBodyDescriptor and its implementations (part of MIME4J-155)"
  ], 
  "revision_id": "894642"
 }, 
 {
  "author": "sebb", 
  "date": "2009-12-30T15:08:09.077454Z", 
  "msg": [
   "Fix multi-threading (data visibility) bugs in PoolTest nested class", 
   "Show details of Exception if it is not excepted", 
   "Improve failure message"
  ], 
  "revision_id": "894641"
 }
]