[
 {
  "author": "dirkx", 
  "date": "2001-07-13T21:25:47.000000Z", 
  "msg": [
   "Added the ENOPROTOOPT ent suggested by Ryan. Although", 
   "we propably need to hunt around on FreeBSD; as some", 
   "intermediate releases might have given a different Eno.", 
   "But then again those where on the current track. So they", 
   "are safe to ignore."
  ], 
  "revision_id": "89549"
 }, 
 {
  "author": "bnicholes", 
  "date": "2001-07-13T19:45:52.000000Z", 
  "msg": [
   "NetWare has a fixed lengh stack.  Since MAX_STRING_LEN is set", 
   "to 8k, one call to send_parsed_content() chews up 24k of stack space.", 
   "During a server-side include evaluation this function is", 
   "called recusively, allocating 24k each time.  Obviously it", 
   "doesn't take long to blow a 64k stack which is the default", 
   "for Apache for NetWare.  Since MAX_STRING_LEN is used all", 
   "throughout the Apache code, we should rethink using a default", 
   "of 8k especially in recursive functions."
  ], 
  "revision_id": "89548"
 }, 
 {
  "author": "stoddard", 
  "date": "2001-07-13T18:46:15.000000Z", 
  "msg": [
   "Win32: Prevent listening sockets from being inherited by", 
   "the Apache child process, CGI scripts, rotatelog process", 
   "etc.  If the Apache child process segfaults, any processes", 
   "that the child started are not reaped. Prior to this fix,", 
   "these processes inherited the listening sockets which sometimes", 
   "prevented the restarted Apache child process from accepting", 
   "connections (ie, the server would hang).", 
   "The Sleep(1000) is a bit of a hack but it is sufficient I believe. All", 
   "that is really necessary is for the parent to give up its quantum and", 
   "allow the child to run. I could not get WaitForInputIdle to work properly.", 
   "Will investigate alternative solutions later."
  ], 
  "revision_id": "89547"
 }, 
 {
  "author": "stoddard", 
  "date": "2001-07-13T12:45:19.000000Z", 
  "msg": [
   "Win32: First of two patches to prevent child processes from inheriting open", 
   "socket descriptors."
  ], 
  "revision_id": "89546"
 }, 
 {
  "author": "dirkx", 
  "date": "2001-07-13T07:32:48.000000Z", 
  "msg": [
   "Scratched an itch; it was just to painfull to move", 
   "binaries around on FreeBSD - due to differences on", 
   "the platform apache was compiled on and it was actually", 
   "ran on. This adds AcceptFilter on/off to make live", 
   "easier. Corresponding commit in doc's coming up.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "89545"
 }
]