[
 {
  "author": "robbie", 
  "date": "2010-01-06T22:11:26.431881Z", 
  "msg": [
   "QPID-2322: change the JMX parameter name for the password parameter to prevent the 0.5 management console from sending an MD5-hashed password to the once again versionless UserManagement MBean. Add compatibility check to alert users of the old console they should upgrade to a newer release.", 
   "merge r896692 from trunk"
  ], 
  "revision_id": "896695"
 }, 
 {
  "author": "chaase3", 
  "date": "2010-01-06T22:05:55.772564Z", 
  "msg": [
   "DERBY-4503: Documentation needs note on purpose of built-in authentication mechanism", 
   "Modified 10 topics in 10.2 branch.", 
   "Patch: DERBY-4503-10.2-2.diff"
  ], 
  "revision_id": "896694"
 }, 
 {
  "author": "robbie", 
  "date": "2010-01-06T22:04:43.758931Z", 
  "msg": [
   "QPID-2322: Add new createUser and setPassword methods using String for passwords. Position these after the older now-deprecated char[] methods within the UserManagement interface to manipulate the MBeanInfo generated, resulting in overwriting the OperationData of the deprecated method on the old 0.5 management console and forcing use of these newer methods rather than the incompatible char[] based methods. Remove previously added compatibility check as it is no longer required. Update current management console to use the new String based methods when available."
  ], 
  "revision_id": "896693"
 }, 
 {
  "author": "robbie", 
  "date": "2010-01-06T22:03:39.827818Z", 
  "msg": [
   "QPID-2322: change the JMX parameter name for the password parameter to prevent the 0.5 management console from sending an MD5-hashed password to the once again versionless UserManagement MBean. Add compatibility check to alert users of the old console they should upgrade to a newer release."
  ], 
  "revision_id": "896692"
 }, 
 {
  "author": "tomwhite", 
  "date": "2010-01-06T22:03:33.981824Z", 
  "msg": [
   "HADOOP-6479. TestUTF8 assertions could fail with better text. Contributed by Steve Loughran."
  ], 
  "revision_id": "896691"
 }
]