[
 {
  "author": "jonesde", 
  "date": "2010-01-07T11:59:48.380196Z", 
  "msg": [
   "Fixed some issues where code was destroying OrderItemShipGroup information, especially when loading an existing order; improved addOrderItem service to better support purchase order item adding"
  ], 
  "revision_id": "896855"
 }, 
 {
  "author": "rickmcguire", 
  "date": "2010-01-07T11:51:44.655872Z", 
  "msg": [
   "GERONIMO-5017 Create geronimo-annotation_1.1_spec jar", 
   "Missed the <scm> section updates."
  ], 
  "revision_id": "896854"
 }, 
 {
  "author": "jonesde", 
  "date": "2010-01-07T11:46:00.339421Z", 
  "msg": [
   "Small change to reduce the volume on this frequent error message that simply lets you know the system is falling back to a different way of doing things"
  ], 
  "revision_id": "896853"
 }, 
 {
  "author": "stephenc", 
  "date": "2010-01-07T11:44:07.525113Z", 
  "msg": [
   "[SUREFIRE-584] Fix the verifier based tests so that they work during mvn release:prepare", 
   "o I have used invoker:install to stage the artifacts required for the integration tests", 
   "o I use a JUnit test to setup the settings.xml that uses the staged local repository and uses the actual local repository as a remote repository while retaining all the running machine's settings (e.g. proxies) that should mean that the integration tests will work from behind a corporate proxy and they should be fast", 
   "o I use both surefire and failsafe maven plugins for test execution, failsafe is used for the integration tests and surefire runs the JUnit test that creates the settings.xml for the staged local repository.  I could have just used exec-maven-plugin and used a executible java class to create the staged settings.xml, but my concern is that that would introduce another dependency and complicate bootstrapping... failsafe will not be an issue in this respect as I will be adding it to surefire.", 
   "o All the integration tests have been renamed to be picked up by failsafe's default patterns."
  ], 
  "revision_id": "896852"
 }, 
 {
  "author": "rickmcguire", 
  "date": "2010-01-07T11:36:43.320736Z", 
  "msg": [
   "GERONIMO-5017 Create geronimo-annotation_1.1_spec jar"
  ], 
  "revision_id": "896851"
 }
]