[
 {
  "author": "rhuijben", 
  "date": "2010-01-07T16:21:20.396116Z", 
  "msg": [
   "On Windows don't retry a failed rename on every possible failure, but", 
   "only for access denied.", 
   "On the AnkhSVN error list we currently receive quite a few", 
   "\"Can't move '<PATH>\\.svn\\tmp\\entries' to '<PATH>\\.svn\\entries':", 
   "The system cannot find the file specified.\"", 
   "errors for Subversion 1.6.6 users who are updating their working copy.", 
   "The old code obscured the initial status code for this code path,", 
   "which makes it hard to determine the root cause. (The root cause is", 
   "most likely outside Subversion as we didn't see this error until early", 
   "November 2009)", 
   "* subversion/libsvn_subr/io.c", 
   "(svn_io_file_rename): Only try setting writable if we are trying to", 
   "resolve an access denied error. Then retry the move on further", 
   "access denied errors."
  ], 
  "revision_id": "896915"
 }, 
 {
  "author": "nick", 
  "date": "2010-01-07T16:15:20.161799Z", 
  "msg": [
   "Start on major HSMF refactoring. Should compile, but not quite all tests pass as a little bit of work is left"
  ], 
  "revision_id": "896914"
 }, 
 {
  "author": "markt", 
  "date": "2010-01-07T16:06:45.374371Z", 
  "msg": [
   "Add various EL test cases, mostly extracted from local test JSPs I have used for individual issues.", 
   "Thanks to kkolinko and the numerous bug reporters that provided the basis for many of these.", 
   "At present, although this is Tomcat 7, the tests only cover JSP 2.1 functionality."
  ], 
  "revision_id": "896913"
 }, 
 {
  "author": "henrib", 
  "date": "2010-01-07T16:04:40.888360Z", 
  "msg": [
   "Fix for Java 1.5 in MT test; changed tasks list declaration.", 
   "Cause:", 
   "In Java 5, the method is declared as:", 
   "ExecutorService#invokeAll(Collection<Callable<T>> tasks)", 
   "In Java 6, the method is declared as:", 
   "ExecutorService#invokeAll(Collection<? extends Callable<T>> tasks)"
  ], 
  "revision_id": "896912"
 }, 
 {
  "author": "schor", 
  "date": "2010-01-07T15:59:25.766980Z", 
  "msg": [
   "no jira - remove extraneous \"+\" signs due to a copy/paste from an email"
  ], 
  "revision_id": "896911"
 }
]