[
 {
  "author": "jerenkrantz", 
  "date": "2001-07-29T15:43:07.000000Z", 
  "msg": [
   "Add HTTP Keep-Alive support (rudimentary, but functional).", 
   "This is done by adding two new hooks:", 
   "open_req - Opens a socket (send_req used to do this implicitly).", 
   "create_req - Constructs the request (used to be part of get_next_url).", 
   "The open_req is executed *before* the create_req because we need to know", 
   "if we are a keepalive request and only the socket code knows whether we", 
   "are keepalive or not.  This is a slight performance penalty on non-keepalive", 
   "requests because we are creating the request buffer *after* we have opened", 
   "the socket.  We could do a \"create_sock\" that does everything but connect", 
   "and sets the keepalive flag?  I'll discuss this with Aaron on Monday.", 
   "We now have a field in the request that specifies if it should be", 
   "Keep-Alive or not.  Also, the response has a keepalive field to indicate", 
   "whether the connection was keptalive.  If the connection was not keptalive,", 
   "then the socket should be closed at each iteration."
  ], 
  "revision_id": "89764"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2001-07-29T15:36:11.000000Z", 
  "msg": [
   "Hey, you know, I actually saw the spelling \"connexion\" in a book", 
   "(I, Claudius by Robert Graves - crazy Brits.)"
  ], 
  "revision_id": "89763"
 }, 
 {
  "author": "jwoolley", 
  "date": "2001-07-29T02:44:39.000000Z", 
  "msg": [
   "Re-commit Greg's 1.262 CHANGES commit on APACHE_2_0_22-branch", 
   "(There might be a better way to do this, but I think this will work)"
  ], 
  "revision_id": "89762"
 }, 
 {
  "author": "gregames", 
  "date": "2001-07-28T23:39:07.000000Z", 
  "msg": [
   "Fix a problem where the threaded MPM stalls after restarts or segfaults.", 
   "Also prevent multiple active processes from using the same scoreboard slot."
  ], 
  "revision_id": "89761"
 }, 
 {
  "author": "wrowe", 
  "date": "2001-07-28T15:28:26.000000Z", 
  "msg": [
   "Now that the version is bumped... time to log some new efforts."
  ], 
  "revision_id": "89760"
 }
]