[
 {
  "author": "mamta", 
  "date": "2010-01-13T03:24:52.255105Z", 
  "msg": [
   "DERBY-4191", 
   "Require minimum select privilege from the tables in the SELECT sql if no column is selected from the table by the user eg", 
   "select count(*) from root.t;", 
   "select 1 from root.t;", 
   "For the query above, Derby was letting the user execute the select even if the user had no select privilege available on root.t With this fix, Derby will check if there is atleast one column on which the user has select privilege available to it or if the user select privilege at the table level. If yes, only then the user will be able to select from another user's table.", 
   "select myTable.a from myTable, admin.privateTable", 
   "for the query above, since no column is selected specifically from admin.privateTable, Derby will now see if there is table level select privilege or atleast one column level select privilege available on admin.privatTable", 
   "One other problem scenario was", 
   "update ruth.t_ruth set a = ( select max(c) from ruth.v_ruth );", 
   "For the query above, prior to fix for DERBY-4191, we were not looking for select privilege for the subquery. That has also been fixed with fix for DERBY-4191", 
   "All the existing tests passed with no regression. Added few tests for the fixes involved in this jira."
  ], 
  "revision_id": "898635"
 }, 
 {
  "author": "rajith", 
  "date": "2010-01-13T03:15:06.848015Z", 
  "msg": [
   "Added a null check for SASL client in the connectionOpenOk method"
  ], 
  "revision_id": "898634"
 }, 
 {
  "author": "brett", 
  "date": "2010-01-13T03:05:35.418809Z", 
  "msg": [
   "fix release profiles", 
   "Merged from: r898632"
  ], 
  "revision_id": "898633"
 }, 
 {
  "author": "brett", 
  "date": "2010-01-13T02:58:52.122647Z", 
  "msg": [
   "fix the release profiles"
  ], 
  "revision_id": "898632"
 }, 
 {
  "author": "hlship", 
  "date": "2010-01-13T02:43:07.545648Z", 
  "msg": [
   "TAP5-959: Ajax event handler methods that return a page instance, page class or page name should cause the client to redirect to that page, but doesn't work in IE7 or 8 if the URL has a query param"
  ], 
  "revision_id": "898631"
 }
]