[
 {
  "author": "lhazlewood", 
  "date": "2010-01-19T22:55:47.712007Z", 
  "msg": [
   "SHIRO-131 - initial implementation with simple test case"
  ], 
  "revision_id": "900995"
 }, 
 {
  "author": "cmpilato", 
  "date": "2010-01-19T22:53:54.891393Z", 
  "msg": [
   "* trunk/www/mailing-lists.html", 
   "Move the etiquette portion of this document...", 
   "* site/publish/docs/hacking/index.html", 
   "...into a new \"chapter\" of this one."
  ], 
  "revision_id": "900994"
 }, 
 {
  "author": "scheu", 
  "date": "2010-01-19T22:46:32.828561Z", 
  "msg": [
   "WSCOMMONS-518", 
   "Contributor: Rich Scheuerle", 
   "Analysis: Doug Larson", 
   "Summary of Problem:", 
   "The new XMLStreamReader wrappers and delegates in Axiom prevent consumers from directly accessing the original", 
   "parser.  This has caused regressions for some users.", 
   "Summary of Solution:", 
   "The XMLStreamReader wrappers and delegates remain intact.  Some of them have been marked with a new marker interface, XMLStreamReaderContainer.  New utility methods are added to XMLStreamReaderUtils to allow a consumer to access the original XMLStreamReader.", 
   "Tests are added to verify the function.", 
   "Note that an OMStAXWRapper is not an XMLStreamReaderContainer.  An OMStaXWrapper actually wraps a OM tree and", 
   "adapts it to an XMLStreamReader interface (versus wrapping an actual live parser)."
  ], 
  "revision_id": "900993"
 }, 
 {
  "author": "lektran", 
  "date": "2010-01-19T22:41:08.353046Z", 
  "msg": [
   "Partial revert of r830846 (I left the demo data file name change) and full revert of r887580 (was committed to avoid problems with the prior commit) as discussed in OFBIZ-3307.", 
   "The problem is that while ProductTypeAttr can be used in this way to constrain the ProductAttribute.attrName values, it shouldn't be enforced unless the data model is also enforcing this constraint.", 
   "The other problem is that I think there is no way currently to add ProductTypeAttr records, which means that with these changes no new attributes can be created via the UI."
  ], 
  "revision_id": "900992"
 }, 
 {
  "author": "juanpablo", 
  "date": "2010-01-19T22:40:18.975294Z", 
  "msg": [
   "JSPWIKI-538 replaced second surname with first surname"
  ], 
  "revision_id": "900991"
 }
]