[
 {
  "author": "stsp", 
  "date": "2010-02-02T12:02:40.234707Z", 
  "msg": [
   "Make svnserve in deamon mode prefer IPv4 addresses when resolving", 
   "the listen hostname, and add a switch to make it prefer IPv6 instead.", 
   "This avoids the typical \"I just started svnserve and it refuses all", 
   "connections\" problem, which is caused by svnserve defaulting to an", 
   "IPv6 wildcard socket on a server which is on an IPv4-only network.", 
   "Reported by: nucc1", 
   "(via IRC in #svn, but it's been reported countless times before)", 
   "* subversion/svnserve/main.c", 
   "(svnserve__options): Add a --prefer-ipv6 option (short form -6).", 
   "In the help text, document that listening on IPv4 and IPv6 addresses", 
   "at the same time is not supported in daemon mode, and suggest workarounds.", 
   "(main): If APR was compiled with IPv6 support, prefer IPv4 addresses", 
   "by default when resolving the listen hostname, unless the -6 option", 
   "was passed. If APR was not compiled with IPv6 support, the -6 option", 
   "is silently ignored."
  ], 
  "revision_id": "905595"
 }, 
 {
  "author": "davsclaus", 
  "date": "2010-02-02T11:58:42.791537Z", 
  "msg": [
   "CAMEL-2436: Bean component now detects void methods and accepts methods returning null as a valid response. Removed @deprecated BEAN_HOLDER."
  ], 
  "revision_id": "905594"
 }, 
 {
  "author": "gtully", 
  "date": "2010-02-02T11:55:13.680298Z", 
  "msg": [
   "merge -c 904005 https://svn.apache.org/repos/asf/activemq/trunk - validate jetty availabilty via socket connect to take out the guess work on loaded machines - avoid connection refused intermittent failures"
  ], 
  "revision_id": "905593"
 }, 
 {
  "author": "ritchiem", 
  "date": "2010-02-02T11:52:24.493751Z", 
  "msg": [
   "QPID-2370 : Committing patch to improve broker logging. This will not cleanly apply to trunk due to IO changes."
  ], 
  "revision_id": "905592"
 }, 
 {
  "author": "scottbw", 
  "date": "2010-02-02T11:51:25.231245Z", 
  "msg": [
   "Changed the demoWidget function to also include the proxy information in the URL, so that the Weather widget (and others using remote services) can be tested from the gallery view. This required making CheckProxy() public and return the String form of the proxy URL for the request, and adding the proxy URL to the response attributes."
  ], 
  "revision_id": "905591"
 }
]