[
 {
  "author": "chrisd", 
  "date": "2010-02-02T22:22:52.807056Z", 
  "msg": [
   "Fix lookup of process command lines when using FcgidWrapper or", 
   "access control directives, including within .htaccess files.", 
   "Making the existing command-line-to-group-ID mapping work with dynamically", 
   "discovered configurations (i.e., .htaccess files) and making it thread-safe", 
   "would require global shared-memory storage with locks, or something similar.", 
   "Instead we just use the raw command lines to help distinguish different", 
   "processes.", 
   "Also clean up some interactions between access control directives and", 
   "wrappers, specifically, since AAA directives perform a check for an", 
   "extant (executable) file based on the path they're configured with,", 
   "they can only work with wrappers if the wrapper is an actual file, not", 
   "a virtual one, and thus we can remove the additional get_wrapper_info() calls", 
   "for these directives.  Effectively, the AAA directives are themselves a", 
   "kind of wrapper, since we're not looking up their process from the requested", 
   "URL.  Future work might allow the AAA directives to take a command line", 
   "with arguments, making them equal citizens with non-AAA wrappers."
  ], 
  "revision_id": "905820"
 }, 
 {
  "author": "lindner", 
  "date": "2010-02-02T22:20:39.235740Z", 
  "msg": [
   "numerous jsdoc cleanups"
  ], 
  "revision_id": "905819"
 }, 
 {
  "author": "tabish", 
  "date": "2010-02-02T22:20:32.873401Z", 
  "msg": [
   "More fixes for: http://issues.apache.org/activemq/browse/AMQNET-218"
  ], 
  "revision_id": "905818"
 }, 
 {
  "author": "dianes", 
  "date": "2010-02-02T22:17:15.777006Z", 
  "msg": [
   "corrections to doc errata that were previously overlooked"
  ], 
  "revision_id": "905817"
 }, 
 {
  "author": "tabish", 
  "date": "2010-02-02T22:15:51.556606Z", 
  "msg": [
   "* MessageConsumer.cs:", 
   "http://issues.apache.org/activemq/browse/AMQNET-218", 
   "Only call ResetAbort if state has AbortRequested on."
  ], 
  "revision_id": "905816"
 }
]