[
 {
  "author": "slaws", 
  "date": "2010-02-05T11:11:29.912572Z", 
  "msg": [
   "Add constants for some of the intents defined by SCA policy spec."
  ], 
  "revision_id": "906900"
 }, 
 {
  "author": "veithen", 
  "date": "2010-02-05T11:08:11.858989Z", 
  "msg": [
   "Added documentation relevant for AXIS2-4465."
  ], 
  "revision_id": "906899"
 }, 
 {
  "author": "ritchiem", 
  "date": "2010-02-05T11:00:45.045518Z", 
  "msg": [
   "QPID-2059 : Updated test to try and wait for the subscriber message to appear in the log file.", 
   "QPID-2059 : One of the main causes of SubscriptionLoggingTest failing was that the aynchronous broker call preceding the log scraping would not always have time to complete the logging to file.", 
   "So I have added a waitAndFindMessages method that will attempt to retreive the required string for a set period of time. If it is found then it will perform the findMessages as before. I have updated the LoggingTests to use this method first. This will ensure that we have a more sophoiticated wait that just adding Thread.sleep()s to the tests.", 
   "QPID-2059 : Being even more explicit in some of the Logging tests as the previous update caused a sinle ExchangeLoggingTest failure. Updated tests where I can to explicitly wait for a message ID they are testing for. Then used a findMatches with the more general match. i.e. wait for QUE-1001 but find all QUE- messages.", 
   "merged changes from 0.5.x r 906559,906459,905600"
  ], 
  "revision_id": "906898"
 }, 
 {
  "author": "julianfoad", 
  "date": "2010-02-05T11:00:37.821134Z", 
  "msg": [
   "Follow-up r901797: ensure the URLs in libsvn_ra_neon are always canonical.", 
   "* subversion/libsvn_ra_neon/props.c", 
   "(end_element): Canonicalize the URL read from an \"href\" element in the", 
   "other code path. (One code path was fixed in r901797.)", 
   "Patch by: Kannan R <kannanr{_AT_}collab.net>", 
   "Suggested by: julianfoad"
  ], 
  "revision_id": "906897"
 }, 
 {
  "author": "robinanil", 
  "date": "2010-02-05T11:00:25.031697Z", 
  "msg": [
   "MAHOUT-221 Parallel FPGrowth with FPBonsai pruning. Code tweaks and style changes mostly"
  ], 
  "revision_id": "906896"
 }
]