[
 {
  "author": "hindessm", 
  "date": "2010-02-12T18:59:23.737403Z", 
  "msg": [
   "More nls refactoring and in the process fixing bug because", 
   "EnumConstantNotPresentException was using a new 'luni.03'", 
   "token but with the old message catalog."
  ], 
  "revision_id": "909560"
 }, 
 {
  "author": "rdonkin", 
  "date": "2010-02-12T18:58:32.928398Z", 
  "msg": [
   "This file is one of my and missing the header was an oversight"
  ], 
  "revision_id": "909559"
 }, 
 {
  "author": "arkurth", 
  "date": "2010-02-12T18:58:22.905583Z", 
  "msg": [
   "VCL-301", 
   "Added disable_hibernation() and disable_ceip() (customer experience improvement program) subroutines to Windows.pm and added calls from pre_capture().", 
   "Modified Windows.pm::reg_add() to allow 0 to be passed as the registry data argument.", 
   "Added DisableSR=1 registry key to Windows.pm::disable_system_restore().  It had only been setting the DisableConfig key.", 
   "Updated the SSH firewall subroutines in Version_6.pm.  A single SSH command is executed which consists of multiple netsh.exe commands chained together.  The existing SSH rules need to be deleted and then the desired rule is added in the same SSH command.  It would occasionally hang because the SSH connection is broken when the rules are deleted.  I added the get_firewall_state() sub.  When the SSH firewall rules are modified, the firewall state is first checked -- on or off.  If it's on, it gets turned off, the SSH rules are modified, then turned back on.  This should prevent the SSH process from hanging.  Also updated other firewall subroutines for consistency."
  ], 
  "revision_id": "909558"
 }, 
 {
  "author": "dkulp", 
  "date": "2010-02-12T18:57:53.725967Z", 
  "msg": [
   "Test failed in hudson, I think due to not having the strong encryption", 
   "stuff."
  ], 
  "revision_id": "909557"
 }, 
 {
  "author": "tcunning", 
  "date": "2010-02-12T18:57:39.480933Z", 
  "msg": [
   "JUDDI-361", 
   "Had to add export-package to the bundle configuration so that the JAR had classes in it."
  ], 
  "revision_id": "909556"
 }
]