[
 {
  "author": "djencks", 
  "date": "2010-02-19T00:59:18.870301Z", 
  "msg": [
   "GERONIMO-5150 don't expand the pool when releasing idle connections."
  ], 
  "revision_id": "911665"
 }, 
 {
  "author": "heyongqiang", 
  "date": "2010-02-19T00:58:28.867899Z", 
  "msg": [
   "HIVE-1178. enforce bucketing for a table.(Namit Jain via He Yongqiang)"
  ], 
  "revision_id": "911664"
 }, 
 {
  "author": "pquerna", 
  "date": "2010-02-19T00:58:23.759713Z", 
  "msg": [
   "Add another error text that ec2 can send back on invalid creds"
  ], 
  "revision_id": "911663"
 }, 
 {
  "author": "djencks", 
  "date": "2010-02-19T00:58:07.548353Z", 
  "msg": [
   "GERONIMO-5150 don't expand the pool when releasing idle connections.  Also include error checking merge from 2.2"
  ], 
  "revision_id": "911662"
 }, 
 {
  "author": "neels", 
  "date": "2010-02-19T00:55:46.756575Z", 
  "msg": [
   "Instead of giving wrong information, rather give no information on source-", 
   "left in 'svn info' output with a tree-conflict on a locally added node during", 
   "update.", 
   "The long term goal for source-left information on a locally added node is to", 
   "say which URL at which revision did not exist before the local add took place", 
   "(a large todo-comment in this patch outlines desired behavior). So, for now,", 
   "rather say less wrong stuff for source-left, i.e. nothing, on add vs. add", 
   "during update/switch.", 
   "Note: This does not change behavior for tree-conflicts during merge. Only the", 
   "tree-conflict info that came from an update is affected, and only for", 
   "tree conflicts with locally added nodes (add vs. add).", 
   "* subversion/libsvn_wc/update_editor.c", 
   "(check_tree_conflict):", 
   "In case of a tree conflict with a locally added node, pass a", 
   "SRC_LEFT_VERSION of NULL. Still use the relpath of the added node", 
   "for the source-right URL. Comment.", 
   "* subversion/svn/util.c", 
   "(svn_cl__node_description):", 
   "If SRC_LEFT_VERSION is NULL, simply print \"(none)\" (or equivalent).", 
   "* subversion/svn/cl.h (svn_cl__node_description): Comment."
  ], 
  "revision_id": "911661"
 }
]