[
 {
  "author": "bfoster", 
  "date": "2008-05-01T15:17:07.955906Z", 
  "msg": [
   "-RetrievalMethod is now automatically determined by parser map", 
   "-Property file downloading now has the same capabilities as data file downloading", 
   "-added hashcode method to ProtocolFile to fix hashing bug in currently downloading files hashset in FileRetrievalSystem", 
   "-fixed bug in Imaps text reader to support format=flowed for text emails", 
   "-ProtocolHandlers paging is now completely in sync with remote sites when files are deleted from server", 
   "- before, when remote files where deleted, pager location was not moved back if needed and, for dynamic directories, the directory snapshot was not updated (this was fine, since pager never went backwards, however if an ls was made then the snapshot with broken links would have been returned)", 
   "- now, all the above is fixed!!!", 
   "-The Protocol class methods have all been changed to protected. All calls to Protocol class must now be made through the ProtocolHandler (no features have be lost -- all calls are still available, just must be called through the ProtocolHandler now).  This gives the ProtocolHandler more control over the way calls are made to the Protocol class and is now aware of any calls made to the Protocol class.", 
   "--------------------------------", 
   "OODT-167", 
   "OODT-168", 
   "OODT-169"
  ], 
  "revision_id": "913640"
 }, 
 {
  "author": "mattmann", 
  "date": "2008-04-24T04:48:24.058481Z", 
  "msg": [
   "- fix for OODT-161"
  ], 
  "revision_id": "913639"
 }, 
 {
  "author": "mattmann", 
  "date": "2008-04-24T02:35:01.242425Z", 
  "msg": [
   "- redo OODT-93: in prep for fix for OODT-161"
  ], 
  "revision_id": "913638"
 }, 
 {
  "author": "woollard", 
  "date": "2008-04-23T16:38:49.860888Z", 
  "msg": [
   "Changed XmlRpcFilemgrClient to accept only a vector for reduced metadata method."
  ], 
  "revision_id": "913637"
 }, 
 {
  "author": "bfoster", 
  "date": "2008-04-21T14:55:48.143854Z", 
  "msg": [
   "- cleaned up OCO PGE xslt file", 
   "========================"
  ], 
  "revision_id": "913636"
 }
]