[
 {
  "author": "coar", 
  "date": "2001-10-17T14:50:48.000000Z", 
  "msg": [
   "The argument that this is a reversion to the httpd/access/srm", 
   "multifile scenario is bogus, IMHO; the problem with those", 
   "was that their purposes were not clear, nor were the orders", 
   "of invocation.  Putting massive (or tiny but uncommon) chunks", 
   "of easily self-contained special-function directives into", 
   "separate files simplifies the basic configuration and doesn't", 
   "revert to either of the trinity-file complaints, since these", 
   "would need to be explicitly invoked with an Include directive."
  ], 
  "revision_id": "91524"
 }, 
 {
  "author": "stoddard", 
  "date": "2001-10-17T14:45:29.000000Z", 
  "msg": [
   "Win32: The Apache Win32 developers generally recommend that", 
   "MaxRequestsPerChild be set to 0 to prevent the child process", 
   "from ever recycling. However, for those that do require a", 
   "non-zero setting, this patch fixes a serious bug that can cause", 
   "an apparent 'server-hang' condition where the server stops", 
   "responding to requests for a period of time. Prior to this", 
   "fix, when the child process handled MaxRequestsPerChild", 
   "connnections, the child process would stop accepting new", 
   "connections and begin allowing inactive threads to exit. The", 
   "problem was that a new process would not be created to begin", 
   "handling requests until the old process fully exited. The old", 
   "process can take an indeterminate amount of time to exit because", 
   "it may be sending large responses to clients connected over slow", 
   "links, or it may have threads blocked in read awaiting requests", 
   "(eg, one attack mode of the Nimda worm is to establish a", 
   "connection to the server but not send an HTTP request. This", 
   "connection will be timed out according to the setting of the", 
   "Timeout directive, 300 seconds). This fix allows the new process", 
   "to be immediately started and begin accepting requests when the", 
   "old child process reaches MaxRequestsPerChild."
  ], 
  "revision_id": "91523"
 }, 
 {
  "author": "stoddard", 
  "date": "2001-10-17T13:57:49.000000Z", 
  "msg": [
   "Win32: Suppress spurious emmision of the \"server reached ThreadsPerChild\" message", 
   "across a shutdown/restart."
  ], 
  "revision_id": "91522"
 }, 
 {
  "author": "wrowe", 
  "date": "2001-10-17T13:42:22.000000Z", 
  "msg": [
   "Some type correctness fixes for LARGEFILES platforms."
  ], 
  "revision_id": "91521"
 }, 
 {
  "author": "dougm", 
  "date": "2001-10-17T02:56:24.000000Z", 
  "msg": [
   "make File::Spec::Unix the default for all platforms", 
   "Apache likes everything to be in /unix/path/file.ext format", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "91520"
 }
]