[
 {
  "author": "xuhaihong", 
  "date": "2010-02-25T10:19:21.723482Z", 
  "msg": [
   "GERONIMO-5155 Locking a keystore under \"Available\" results in exception (Patch from Ashish Jain)"
  ], 
  "revision_id": "916220"
 }, 
 {
  "author": "ashish", 
  "date": "2010-02-25T10:19:02.047531Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3508 -", 
   "When we create a new customer profile, it doesn't send correct mail according to \"UPD_PRSNL_INF_CNFRM\", \"PARTY_REGIS_CONFIRM\" and \"RDS_CUST_REGISTER\" emailType. Currently it grabs the first from the list of ProductStoreEmailSetting entity and uses it's email settings to send the email.", 
   "It was due to unavailability of productStoreId for sending mail so whenever new customer profile will be created it should be associated to certain product store and its role type will be \"CUSTOMER\".", 
   "Apart from this customer profile page should have information about associated product stores.", 
   "Following points are covered:", 
   "1.  Improved patch from OFBIZ-3000.", 
   "2. Improved Product Store Roles screens.", 
   "3. Added ProductStores portlet into party profile screen.", 
   "4. Created updateProductStoreRole service for updating ProductStoreRole record.", 
   "5. Removed EditProductStoreRoles.groovy and EditProductStoreRoles.ftl .", 
   "Thanks to Amit Sharma for the contribution."
  ], 
  "revision_id": "916219"
 }, 
 {
  "author": "xuhaihong", 
  "date": "2010-02-25T10:15:16.050420Z", 
  "msg": [
   "GERONIMO-5155 Locking a keystore under \"Available\" results in exception (Patch from Ashish Jain)"
  ], 
  "revision_id": "916218"
 }, 
 {
  "author": "oching", 
  "date": "2010-02-25T10:14:17.132704Z", 
  "msg": [
   "[MRM-1312] mda5 and sha are not generated for snapshot jars", 
   "merge from 1.3.x branch -r916197 with a few tweaks in variable name in UploadArtifactTest to resolve conflict"
  ], 
  "revision_id": "916217"
 }, 
 {
  "author": "struberg", 
  "date": "2010-02-25T10:14:04.644505Z", 
  "msg": [
   "OWB-303 disable broken cache of Javassist ProxyFactory", 
   "This has actually no effect on OWB since we already cache generated proxyClasses", 
   "ourselfs. This will simply disable the javassist internal cache which got filled", 
   "but not used anyway."
  ], 
  "revision_id": "916216"
 }
]