[
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:27.925712Z", 
  "msg": [
   "cpp: Exit TNonBlockingServer on memmory allocation failure", 
   "setrlimit causes bad_alloc exceptions, but undefined behavior occurs if", 
   "we don't exit.  It is not typical for libraries to call exit, but it is", 
   "not clear what other behavior is possible."
  ], 
  "revision_id": "920665"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:25.754022Z", 
  "msg": [
   "cpp: TNonBlockingServer overload handling and optimizations", 
   "- Establish a mechanism for TNonBlockingServer to handle overloads by", 
   "limiting the number of connections accepted or in-process.", 
   "- Provide a framework for further work in handling server overloads.", 
   "- Limit memory consumption of connection object pool.", 
   "- Drop connections when overloaded.", 
   "- Add overload-handling behavior allowing pending tasks to be dropped", 
   "from the front of the task queue (short of the ability to terminate", 
   "running tasks, these are the oldest tasks in the system and thus the", 
   "most likely to be beyond their freshness date).  This reduces the", 
   "chance of spending valuable CPU time processing a request that the", 
   "client has already timed out.", 
   "- Uses a single persistent pipe() to communicate task completion instead", 
   "of constructing and monitoring a new socketpair() for every task in", 
   "the system."
  ], 
  "revision_id": "920664"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:22.915558Z", 
  "msg": [
   "THRIFT-660. php: Use the accelerator to write return values from servers", 
   "Previously, we only used the acclerator module for clients to", 
   "write calls and read returns.  Now PHP servers will use it for", 
   "writing returns.  We cannot use it to read calls on the server side", 
   "(without modifications), because the module requires that", 
   "the structure type be known before reading the message header."
  ], 
  "revision_id": "920663"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:20.368767Z", 
  "msg": [
   "THRIFT-659. php: Make php_thrift_protocol handle std::exception cleanly", 
   "Any std::exceptions thrown from within the extension will now be", 
   "converted into php exceptions."
  ], 
  "revision_id": "920662"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:18.099571Z", 
  "msg": [
   "THRIFT-475. python: Eliminate DeprecationWarning"
  ], 
  "revision_id": "920661"
 }
]