[
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:50.320418Z", 
  "msg": [
   "cpp: TSocketPool: make it possible to add servers by struct"
  ], 
  "revision_id": "920675"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:47.975146Z", 
  "msg": [
   "cpp: TTransport: set END_OF_FILE TException code if read returns 0"
  ], 
  "revision_id": "920674"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:45.816190Z", 
  "msg": [
   "cpp: TNonblockingServer: Allow unrun tasks to expire after a time limit", 
   "Enhance ThreadManager to allow a expiration time interval to be assigned", 
   "to tasks, and expire those tasks after that time limit has passed.", 
   "Enhance TNonblockingServer to utilize this capability so it can be used", 
   "for overload resilience.", 
   "Note: expired entries are only removed from the queue head, so the", 
   "mechanism in ThreadManager may not do what you expect if you have", 
   "heterogeneous expiration times. That's not an issue with", 
   "TNonblockingServer (which will give all tasks the same limit) and might", 
   "not be in other cases where most tasks have the same limit and the rest", 
   "execute quickly. A full-up timeout queue would be more complex and have", 
   "greater overhead than that used here. It's unnecessary for the task at", 
   "hand so I didn't go that route...", 
   "The TNonblocking interface is simple: a setTaskExpireTime() accepts a", 
   "64-bit millisecond argument. 0 means infinite. A getTaskExpireTime()", 
   "accessor completes the interface.", 
   "The ThreadManager interface involves an added argument to add() for the", 
   "expiration interval and a setExpireCallback() function for setting a", 
   "callback that is called for expired tasks (for this project this is", 
   "necessary to shut down the associated connection)."
  ], 
  "revision_id": "920673"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:43.204102Z", 
  "msg": [
   "cpp: Log unexpected exceptions in TThreadPoolServer"
  ], 
  "revision_id": "920672"
 }, 
 {
  "author": "dreiss", 
  "date": "2010-03-09T05:19:41.062041Z", 
  "msg": [
   "cpp: Fix max TCP port number"
  ], 
  "revision_id": "920671"
 }
]