[
 {
  "author": "woonsan", 
  "date": "2010-03-19T19:07:10.897189Z", 
  "msg": [
   "JS2-1131: Fixing the NPE problem when a user tries to edit the user's own space. (Caused because of looking up the system spaces only by name.)", 
   "Adding flexibility to configure space admin roles preference.", 
   "Also, adding security access check in space manager portlet."
  ], 
  "revision_id": "925380"
 }, 
 {
  "author": "woonsan", 
  "date": "2010-03-19T19:04:01.097614Z", 
  "msg": [
   "JS2-1131: Set the space editing psml to allow user role to view.", 
   "The security access checking is now done inside the SpaceManager portlet.", 
   "Adding a method, isUserSpace(Space) in Spaces service interface because I think we need to know whether a space is from the user home or from the system spaces. For example, currently, space management portlets communicate each other by the space name, which is ambiguous. What if there is \"hello\" system space, while there is also \"hello\" user space? This is a TO-DO.", 
   "Also, change the warning logging in j2 logger."
  ], 
  "revision_id": "925379"
 }, 
 {
  "author": "sergeyb", 
  "date": "2010-03-19T18:58:06.980532Z", 
  "msg": [
   "Moving some duplicate code into AttachmentUtil"
  ], 
  "revision_id": "925378"
 }, 
 {
  "author": "kmarsden", 
  "date": "2010-03-19T18:54:04.531663Z", 
  "msg": [
   "DERBY-4322  intermittent failure in runtimeinfo.", 
   "Contributed by Myrna van Lunteren.", 
   "The theory is that this failure is caused by a problem in the previous test DerbyNetAutostart which launches a process to start the server and can be left pinging if the check for the server in the launching process, does not allow enough time for the server to come up.  The pings increment the session number as seen by runtimeinfo.  So the changes are to DerbyNetAutoStart and are to", 
   "1) Make sure the server launching process retries enough times for the launched process comes up.", 
   "2) Make sure if something does go wrong, the launched process is destroyed"
  ], 
  "revision_id": "925377"
 }, 
 {
  "author": "jvazquez", 
  "date": "2010-03-19T18:49:31.878099Z", 
  "msg": [
   "Deleted old pipeline folder"
  ], 
  "revision_id": "925376"
 }
]