[
 {
  "author": "ashish", 
  "date": "2010-03-22T09:35:08.941288Z", 
  "msg": [
   "Its better to pass partyId in context so that custom service could use it without any issue.", 
   "Patch from Arun(Thanks!)."
  ], 
  "revision_id": "926010"
 }, 
 {
  "author": "vvalchev", 
  "date": "2010-03-22T09:30:38.497605Z", 
  "msg": [
   "Resolved FELIX-1996 /Console should warn when config is bound to a different bundle/", 
   "https://issues.apache.org/jira/browse/FELIX-1996"
  ], 
  "revision_id": "926009"
 }, 
 {
  "author": "davsclaus", 
  "date": "2010-03-22T09:27:32.667585Z", 
  "msg": [
   "CAMEL-2540: Fixed ToAsync having to keep producer until task is complete, to avoid pooled producers being reused to early."
  ], 
  "revision_id": "926008"
 }, 
 {
  "author": "genspring", 
  "date": "2010-03-22T09:21:20.555154Z", 
  "msg": [
   "GERONIMO-4535 Alternate Node Discovery for Plugin Based Farming,  Resolved this JIRA with a WADI based plugin farm implementation:", 
   "A, Refactored geronimo-farm module to only include the commone classes that a plugin based farm needs as well as a multi-cast discovery implementation.", 
   "B, added geronimo-clustering-wadi/src/main/java/org/apache/geronimo/clustering/wadi/BasicWADISessionManagerHolder.java  so that one can start a WADISessionManager by defining a GBean in deployment plan directly.", 
   "C, added 4 maven module:", 
   "1, geronimo-farm-wadi", 
   "It's Jar module that includes implementions of major wadi based node discovery logic.", 
   "2, plugin-farm-wadi", 
   "It's a config that defines the GBeans a plugin based farm controller needs.", 
   "3, plugin-farm-member-wadi", 
   "It's a config that defines the GBeans a plugin based farm member needs.", 
   "4, geronimo-plugin-farm-node-wadi", 
   "It's a customized assembly that includes the minimum set of plugins for plugin based farm member."
  ], 
  "revision_id": "926007"
 }, 
 {
  "author": "erwan", 
  "date": "2010-03-22T09:10:24.485850Z", 
  "msg": [
   "Adding alternate tag when using hyperlink in forms. If the image is not found, then the alternate text will be displayed"
  ], 
  "revision_id": "926006"
 }
]