[
 {
  "author": "rhuijben", 
  "date": "2010-03-26T12:06:07.613161Z", 
  "msg": [
   "Apply some common sense to the patch test code. This doesn't fix the test on", 
   "Windows yet as the file that is compared has a unix eol on Windows.", 
   "* subversion/tests/libsvn_client/client-test.c", 
   "(check_patch_result):", 
   "Assume that our own apis return paths encoded as utf-8 (as we do", 
   "everywhere) So don't try to translate the path to utf-8 again..", 
   "and certainly not with the stream encoding, instead of the path", 
   "encoding. This also allows us to use Subversion apis directly.", 
   "Return more details in an error message from comparing the file."
  ], 
  "revision_id": "927785"
 }, 
 {
  "author": "rickmcguire", 
  "date": "2010-03-26T11:58:33.778599Z", 
  "msg": [
   "Fix the ProviderLocator to not fail if the registry service is not started.  Also fix unit tests, which were not fully running"
  ], 
  "revision_id": "927784"
 }, 
 {
  "author": "jacopoc", 
  "date": "2010-03-26T11:57:41.404276Z", 
  "msg": [
   "Implemented new method to group a set of events by date ranges:", 
   "if event #1 starts at date A and ends at date C and event #2 starts at date B and ends at date D then the metod will return the following maps:", 
   "A-B: event #1", 
   "B-C: events #1 and #2", 
   "C-D: event #2", 
   "This is useful for example to get statistics about calendar events, for example the max number of concurrent events or the max number of persons allocated in the same time; I have added the latter to the month view as an example of its usage."
  ], 
  "revision_id": "927783"
 }, 
 {
  "author": "edwardsmj", 
  "date": "2010-03-26T11:45:16.151584Z", 
  "msg": [
   "Fix for TUSCANY-3515, adding an mport-Package statement into MANIFEST.MF of binding-hazelcast-runtime for the package:"
  ], 
  "revision_id": "927782"
 }, 
 {
  "author": "jbonofre", 
  "date": "2010-03-26T11:41:24.692253Z", 
  "msg": [
   "[SMX4-510] Build ServiceMix bundle for Rome."
  ], 
  "revision_id": "927781"
 }
]