[
 {
  "author": "gnodet", 
  "date": "2010-03-26T09:31:11.686790Z", 
  "msg": [
   "[utils] remove unneeded import"
  ], 
  "revision_id": "927745"
 }, 
 {
  "author": "ashish", 
  "date": "2010-03-26T09:28:49.351325Z", 
  "msg": [
   "Applied patch from jira issue OFBIZ-3552 - Initial Inventory Item Status is saved wrong in case of non-serialized inventory and when reason of return is \"Defective Item\", at the the time of receiving returns.", 
   "Problem Description:", 
   "1) When returns are received and reason of return is \"Defective Item\" ,whether inventoryItemType is serialized or non-serialized, Initial Inventory Item Status is always saved as \"INV_DEFECTIVE\"", 
   "2) This should not be the case, value of Initial Inventory Item Status should be dependent on inventoryItemType.", 
   "3) i. e In Receive Return screen , when user selects inventoryItemType value of Initial Inventory Item Status should be changed dynamically .", 
   "4) So when inventoryItemType is non-serialized then value of Initial Inventory Item Status should be INV_NS_DEFECTIVE and if inventoryItemType is serialized value of value of Initial Inventory Item Status should be INV_DEFECTIVE.", 
   "5) This is a real bug, which causes ATP inventory figures wrong when sales order is placed. This is so because when sales order is placed, defective inventory items are assigned to sales order.", 
   "6) Reason of #5 is when inventory reservations are done in case of non-serialized inventory, In reserveForInventoryItemInline simple-method of InventoryReserveServices.xml , checks are made on value of inventoryItem.statusId = \"INV_NS_DEFECTIVE\".", 
   "And as described in #1, Initial Inventory Item Status is always saved as \"INV_DEFECTIVE\". So this checks never gets satisfied.", 
   "Thanks Divesh & Pranay for the contribution."
  ], 
  "revision_id": "927744"
 }, 
 {
  "author": "lukaszlenart", 
  "date": "2010-03-26T09:21:01.791226Z", 
  "msg": [
   "Resolved WW-3421 - upgrade FreeMarker to 2.3.16"
  ], 
  "revision_id": "927743"
 }, 
 {
  "author": "bodewig", 
  "date": "2010-03-26T09:19:29.387337Z", 
  "msg": [
   "not sure whether this is the correct syntax for non-absolute redirects"
  ], 
  "revision_id": "927742"
 }, 
 {
  "author": "gpetracek", 
  "date": "2010-03-26T09:11:05.905884Z", 
  "msg": [
   "codi module for jsf 2.0"
  ], 
  "revision_id": "927741"
 }
]