[
 {
  "author": "dblevins", 
  "date": "2010-04-13T00:17:26.171711Z", 
  "msg": [
   "initiate connects inside the main loop.  keep tighter track of pending connections and current connections.  Still get some possible duplication on connections between machines."
  ], 
  "revision_id": "933450"
 }, 
 {
  "author": "gstein", 
  "date": "2010-04-13T00:00:48.389418Z", 
  "msg": [
   "complete_directory() should not bother with the WORKING tree at all. An", 
   "udpate or switch only concerns the BASE tree. Revamp a bunch of the logic", 
   "to only look at BASE nodes.", 
   "Note: a lot of the comments in this function already seem bit-rotted, and", 
   "these changes are making it worse. I'm not quite sure what to write on", 
   "some of these, so I just left markers that the comment is probably", 
   "obsolete. Something may be better than deleting the comments.", 
   "* subversion/libsvn_wc/update_editor.c:", 
   "(complete_directory): when examining the TARGET_ABSPATH (which is a", 
   "child of the root), just get the BASE info. there are at least a", 
   "couple conditions where the BASE may not exist, so just exit. the", 
   "iterpool is created a bit earlier so it can be used for a scratch pool", 
   "in some of the calls before the loop. for the depth handling, just", 
   "look at the BASE info (and a re-indent here). only fetch/iterate over", 
   "the BASE children, rather than all of them, and fetch the BASE info", 
   "only for our tests (and DEPTH is not needed here). simplify some of", 
   "the logic since we're only considering BASE."
  ], 
  "revision_id": "933449"
 }, 
 {
  "author": "stack", 
  "date": "2010-04-12T23:50:51.010089Z", 
  "msg": [
   "HBASE-1933  Upload Hbase jars to a public maven repository"
  ], 
  "revision_id": "933448"
 }, 
 {
  "author": "ate", 
  "date": "2010-04-12T23:28:52.892198Z", 
  "msg": [
   "- future apa-logging release should (at least) use portals-pom-1.2 too", 
   "- fix svn $Id$ marker", 
   "- remove no longer needed assembly-plugin override (apache-7 pom now correctly defines it with runOnlyAtExecutionRoot=true)"
  ], 
  "revision_id": "933447"
 }, 
 {
  "author": "ate", 
  "date": "2010-04-12T23:28:19.115243Z", 
  "msg": [
   "Remove no longer needed assembly-plugin overrides as inherited apache-7 pom now correctly defines it with runOnlyAtExecutionRoot=true"
  ], 
  "revision_id": "933446"
 }
]