[
 {
  "author": "ningjiang", 
  "date": "2010-04-15T01:46:01.500254Z", 
  "msg": [
   "CAMEL-2646 Upgraded jsch version of camel-ftp to 0.1.42"
  ], 
  "revision_id": "934260"
 }, 
 {
  "author": "pgollucci", 
  "date": "2010-04-15T01:22:55.812477Z", 
  "msg": [
   "ubuntu version updates"
  ], 
  "revision_id": "934259"
 }, 
 {
  "author": "peter_firmstone", 
  "date": "2010-04-15T01:11:12.079479Z", 
  "msg": [
   "This patch integrates changes to replace the RMIClassLoaderSPI with a CodebaseAccessClassLoader as per River-336. Although it doesn't include all changes to PreferredClassProvider.", 
   "Additional changes to net.jini.io have been made to allow a subset of this package to be built at a later stage for CDC Personal Profile 1.11 (a subset of Java 1.4.2).", 
   "An additional interface has been created, which is a subset of ServiceRegistrar, which ServiceRegistrar now extends, this is to enable building a release for CDC Personal Profile 1.11 or greater at a later point in time, without causing any breakage to existing application software.", 
   "Furthermore additional permissions have been granted to the qa test defaulttest.policy in order for some random test failures to pass.  This was specific to the Java 1.6 platform and I believe related to the -source=5 and -target=jsr14 compiler optimisations that load a security manager earlier, it is also related to the removal of the need to utilise the jre/etc directory for jsk-policy.jar", 
   "These changes are experimental, and some incomplete, please feel free to make comments and reccommendations or hightlite any unforseen issues.", 
   "The Apache River version has been changed to 2.2.0"
  ], 
  "revision_id": "934258"
 }, 
 {
  "author": "tillw", 
  "date": "2010-04-15T01:00:49.979493Z", 
  "msg": [
   "- added implementation for fn:deep-equal"
  ], 
  "revision_id": "934257"
 }, 
 {
  "author": "tillw", 
  "date": "2010-04-15T00:58:40.103263Z", 
  "msg": [
   "- fixed type annotation"
  ], 
  "revision_id": "934256"
 }
]