[
 {
  "author": "jerenkrantz", 
  "date": "2002-02-15T17:16:54.000000Z", 
  "msg": [
   "Cliff weighs in.", 
   "(It seems no one has time to update STATUS themselves!)"
  ], 
  "revision_id": "93429"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-02-15T16:33:33.000000Z", 
  "msg": [
   "- Unset content-length in mod_deflate so that the network-layer filters are", 
   "free to do what they want and that no C-L is improperly returned.", 
   "- Allow non-GET requests and non-html responses to be compressed.", 
   "Submitted by:\tSander Striker <striker@apache.org>", 
   "Reviewed by:\tJustin Erenkrantz"
  ], 
  "revision_id": "93428"
 }, 
 {
  "author": "slive", 
  "date": "2002-02-15T16:07:28.000000Z", 
  "msg": [
   "Change the format slightly so that each \"context\" get's its own tag in", 
   "a <contextlist>.  This should make it easier to, for example, generate", 
   "an index of all the directives available in a certain context.", 
   "Also, add a css stylesheet, turn off link underlining, and turn all the", 
   "directive and module names green.  Further refinement necessary for sure."
  ], 
  "revision_id": "93427"
 }, 
 {
  "author": "martin", 
  "date": "2002-02-15T11:32:34.000000Z", 
  "msg": [
   "[Security] Prevent invalid client hostnames from appearing in", 
   "the log file. If a double-reverse lookup was performed (e.g.,", 
   "for an \"Allow from .my.domain\" directive) but failed, then", 
   "a spoofed dns-reverse-address could appear in the logs. Now", 
   "the numeric address is logged instead. Note that", 
   "reverse-address-spoofing did NOT actually allow access", 
   "to any protected resource! It was only possible to cause apache to", 
   "log arbitrary names (for resources protected thusly) if you had", 
   "control over the reverse dns zone."
  ], 
  "revision_id": "93426"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-02-15T07:43:20.000000Z", 
  "msg": [
   "Fix ap_directory_walk() per-dir merge bug seen when no <Directory /> is", 
   "present.", 
   "showstoppers--", 
   "Kudos to Jeff for finding it.", 
   "Kudos to BrianP for leading us in the right direction.", 
   "Kudos to OtherBill for pointing out the right way to fix this."
  ], 
  "revision_id": "93425"
 }
]