[
 {
  "author": "trawick", 
  "date": "2002-02-21T11:42:03.000000Z", 
  "msg": [
   "fix the linkage of and add a prototype for ap_proxy_table_unmerge()"
  ], 
  "revision_id": "93529"
 }, 
 {
  "author": "trawick", 
  "date": "2002-02-21T11:20:01.000000Z", 
  "msg": [
   "zap an incorrect comment"
  ], 
  "revision_id": "93528"
 }, 
 {
  "author": "minfrin", 
  "date": "2002-02-21T06:06:31.000000Z", 
  "msg": [
   "Some browsers ignore cookies that have been merged into a", 
   "single Set-Cookie header. Set-Cookie and Set-Cookie2 headers", 
   "are now unmerged in the http proxy before being sent to the", 
   "client.", 
   "Fix a problem with proxy where each entry of a duplicated", 
   "header such as Set-Cookie would overwrite and obliterate the", 
   "previous value of the header, resulting in multiple header", 
   "values (like cookies) going missing.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "93527"
 }, 
 {
  "author": "minfrin", 
  "date": "2002-02-21T06:03:08.000000Z", 
  "msg": [
   "When proxy enabled a slow frontend client to read from an", 
   "expensive backend server, it would wait until it had delivered", 
   "the response to the slow frontend client completely before", 
   "closing the backend connection. The backend connection is now", 
   "closed as soon as the last byte is read from it, freeing up", 
   "resources that would have been tied up unnecessarily.", 
   "The proxy code read chunks from the backend server in a", 
   "hardcoded amount of 8k. The existing ProxyReceiveBufferSize", 
   "parameter has been overloaded to specify the size of this buffer.", 
   "PR:", 
   "Obtained from:", 
   "Submitted by:", 
   "Reviewed by:"
  ], 
  "revision_id": "93526"
 }, 
 {
  "author": "ianh", 
  "date": "2002-02-21T04:05:21.000000Z", 
  "msg": [
   "bump bumpty bump", 
   "Placing the thread-limit and server-limit values, those which define the", 
   "size of internal structures in the scoreboard, actually into the", 
   "scoreboard allow third-party applications to access those structures."
  ], 
  "revision_id": "93525"
 }
]