[
 {
  "author": "kmarsden", 
  "date": "2010-04-19T18:39:32.828378Z", 
  "msg": [
   "DERBY-4441 Change sysinfo to print out more specific JVM information", 
   "Contributed by lilywei at yahoo dot com", 
   "Show system properties java.runtime.version and java.fullversion with sysinfo  to give more specific JVM information."
  ], 
  "revision_id": "935700"
 }, 
 {
  "author": "schor", 
  "date": "2010-04-19T18:38:51.715047Z", 
  "msg": [
   "fix up scm entry to be uniform"
  ], 
  "revision_id": "935699"
 }, 
 {
  "author": "schor", 
  "date": "2010-04-19T18:38:27.889091Z", 
  "msg": [
   "fix up scm entry to be uniform"
  ], 
  "revision_id": "935698"
 }, 
 {
  "author": "schor", 
  "date": "2010-04-19T18:37:42.375670Z", 
  "msg": [
   "[UIMA-1756] point the <url> to the top uima website, always, including the http:// prefix.  Be careful about using ${project.url} in child projects, because the inheritance (if not defined in the child project) constructs the url by appending the parent pom artifact names.  Because of this, change the use of ${project.url} in the Jar configuration to instead use the fixed top-level uima website.", 
   "Change the scm configuration to make it identical for this and all other poms in the project.  Note that it cannot be inherited, though, because the inheritance makes assumptions that are not true for our project layout.  But with this form, you can cut/paste it into every project.", 
   "Add properties for the top uima website url, and the scm root and scm directory (project) names.  The project is usually the artifact name, but not always (e.g., artifact name = jVinci, scm = jvinci (different \"case\").", 
   "Put back the Project-Title manifestEntry in built Jars.", 
   "Remove (comment out for now) ant dependency for ant-contrib:1.0b3 - causing ant problems if ant is used."
  ], 
  "revision_id": "935697"
 }, 
 {
  "author": "jbellis", 
  "date": "2010-04-19T18:29:57.490306Z", 
  "msg": [
   "r/m redundant specification of ThriftValidation classname.  patch by jbellis"
  ], 
  "revision_id": "935696"
 }
]