[
 {
  "author": "felicity", 
  "date": "2004-03-11T23:26:30.246502Z", 
  "msg": [
   "bug 1843: try less complex S.1618 matching"
  ], 
  "revision_id": "9364"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-03-11T23:12:11.683421Z", 
  "msg": [
   "* Make sure clover is working correctly so we can get a true measure of test", 
   "coverage.  USED FORK OPTION WITH UNIT TEST PLUGIN SO CLOVER CORRECTLY", 
   "COLLECTS ITS STATS.", 
   "* Added utility method overloads to decode() in the abstract BERDecoderTest", 
   "which is used as the basis for decoder test cases:", 
   "- decode( Tuple )", 
   "- decode( byte )", 
   "- decode( byte[] )", 
   "* Wrote unit tests for Tuple encode functions", 
   "* Took a good look at how we can use the largest integer possible - right now", 
   "we truncate values due to byte boundries when encoding and decoding tags but", 
   "lengths do use the maximum value expressible by an int.  The length might be", 
   "best a long but we'll leave that until we find a need.  Presently over two", 
   "billion bytes, 2,147,483,647 to be exact can be transmitted in a single TLV's", 
   "tuple which equals a transfer stream of 2 GB.  I don't think we'll be hitting", 
   "this soon.", 
   "* svn mv src/java/org/apache/snickers/test/TestBitString.java to the", 
   "respective src/test/org/apache/snickers/asn directory to get it out of the", 
   "way for now."
  ], 
  "revision_id": "9363"
 }, 
 {
  "author": "felicity", 
  "date": "2004-03-11T22:42:59.682791Z", 
  "msg": [
   "bug 2168: look for malformed/non-existent mozilla user-agent ..."
  ], 
  "revision_id": "9362"
 }, 
 {
  "author": "felicity", 
  "date": "2004-03-11T22:30:11.977976Z", 
  "msg": [
   "bug 2279: bayes shouldn't use 0.5 as an error condition.  leave that up to the calling functions.  we now return undef when a probability can't be calculated.  the BAYES_* rules can now include 0.5 as that's a valid probabality now."
  ], 
  "revision_id": "9361"
 }, 
 {
  "author": "felicity", 
  "date": "2004-03-11T18:52:14.529909Z", 
  "msg": [
   "bug 3112: if at least one bayes token was found in the db, but they were all discounted due to their overall strength, we'd potentially continue and get division by zero errors when calculating probability.  so exit out if there are no 'strong' tokens available."
  ], 
  "revision_id": "9360"
 }
]