[
 {
  "author": "rbowen", 
  "date": "2002-03-04T02:38:42.000000Z", 
  "msg": [
   "Conversion to xml"
  ], 
  "revision_id": "93689"
 }, 
 {
  "author": "rbb", 
  "date": "2002-03-03T22:34:55.000000Z", 
  "msg": [
   "Classify some of the input filters as the correct types.  Previous to", 
   "this patch, the type wasn't too important, because all filters were", 
   "put on the same list.  After this patch, the filter type is very important,", 
   "because there are three different types of filters, and they are all treated", 
   "differently, namely:", 
   "CONNECTION:\tFilters of this type are valid for the lifetime of this", 
   "connection.", 
   "PROTOCOL:\tFilters of this type are valid for the lifetime of this", 
   "request from the point of view of the client, this means", 
   "that the request is valid from the time that the request", 
   "is sent until the time that the response is received.", 
   "CONTENT:\tFilters of this type are valid for the time that this", 
   "content is used to satisfy a request.  For simple requests,", 
   "this is identical to PROTOCOL, but internal redirects", 
   "and sub-requests can change the content without ending", 
   "the request.", 
   "It is important to realize that the three major types above are actually", 
   "broken down into smaller groups in the code, to ensure that the ordering", 
   "of filters is always correct."
  ], 
  "revision_id": "93688"
 }, 
 {
  "author": "rbb", 
  "date": "2002-03-03T22:18:45.000000Z", 
  "msg": [
   "I forgot the return, which mean meaningless log messages.  This makes us", 
   "return the correct information."
  ], 
  "revision_id": "93687"
 }, 
 {
  "author": "rbb", 
  "date": "2002-03-03T22:04:03.000000Z", 
  "msg": [
   "This fixes most of the header bug that was committed last night.  The server", 
   "is seg faulting on pipelined requests currently, but I want to get people", 
   "back to a running server."
  ], 
  "revision_id": "93686"
 }, 
 {
  "author": "slive", 
  "date": "2002-03-03T15:32:57.000000Z", 
  "msg": [
   "Updates to the XSLT transformation:", 
   "- Add a facility for translations.", 
   "- Add a type=\"warning\" for <note>.", 
   "- Clean up some variable definitions.", 
   "Submitted by:  Patrik Grip-Jansson <patrikj@gnulix.org>"
  ], 
  "revision_id": "93685"
 }
]