[
 {
  "author": "kristwaa", 
  "date": "2010-04-22T16:45:22.236756Z", 
  "msg": [
   "DERBY-2017: Client driver can insert and commit partial data when a LOB stream throws IOException or does not match the specified length", 
   "Made the client tell the server (if supported) if the EXTDTA transfer was", 
   "successful or not, by appending a Derby-specific status byte to the user data.", 
   "If the transfer was unsuccessful, an exception will be thrown on the server", 
   "side even if the data was padded by the client to avoid a protocol exception.", 
   "There are three types of errors that can happen on the client when reading", 
   "the user stream:", 
   "a) the stream is shorter than specified", 
   "b) the stream is longer than specified", 
   "c) an IOException is thrown when reading the stream", 
   "The fix consists of logic to allow the client and the server to determine if", 
   "the status byte will be sent, code to append the status byte on the client, and", 
   "code on the server to parse / read the status byte.", 
   "Some code in DRDAConnThread was also refactored (mostly readAndSetExtParam).", 
   "Patch file: derby-2017-3c-fix.diff"
  ], 
  "revision_id": "936950"
 }, 
 {
  "author": "woonsan", 
  "date": "2010-04-22T16:44:40.841407Z", 
  "msg": [
   "PB-104: Adding script dependencies subprojects."
  ], 
  "revision_id": "936949"
 }, 
 {
  "author": "kkolinko", 
  "date": "2010-04-22T16:38:23.831163Z", 
  "msg": [
   "bugreport.html: Remove search links for the mailing lists from the bugreport page. The lists.html page provides more recent links for that. Update the \"Recently fixed issues\" section.", 
   "lists.html: Add links to the \"Mail Archive\" mail archive site"
  ], 
  "revision_id": "936948"
 }, 
 {
  "author": "hughesj", 
  "date": "2010-04-22T16:36:57.647162Z", 
  "msg": [
   "prepare for next development iteration"
  ], 
  "revision_id": "936947"
 }, 
 {
  "author": "dwoods", 
  "date": "2010-04-22T16:36:08.658449Z", 
  "msg": [
   "readme updates"
  ], 
  "revision_id": "936946"
 }
]