[
 {
  "author": "daijy", 
  "date": "2010-04-22T22:51:31.416494Z", 
  "msg": [
   "PIG-1384: Adding contrib javadoc to main Pig javadoc"
  ], 
  "revision_id": "937095"
 }, 
 {
  "author": "lhazlewood", 
  "date": "2010-04-22T22:49:21.564564Z", 
  "msg": [
   "SHIRO-141:", 
   "Refactored SecurityManager.createSubject and SubjectFactory.createSubject methods to take in a new interface: SubjectContext.  SubjectContext is essentially a Map with a few extra type-safe getters/setters and some resolve* methods.  The resolve methods use heuristics to acquire data used to construct subject instances.", 
   "This logic used to be entirely in the SubjectFactory implementations, but it was also needed by the RememberMeManager implementations, which didn't have access to/knowledge of a SubjectFactory (and shouldn't).  So that logic was extracted to a SubjectContext implementation that could be shared across both RememberMeManager and SubjectFactory implementations.", 
   "Also removed two Exceptions that were never used.  Updated test cases to reflect the new interface addition.", 
   "Finally, the default CipherService used by the AbstractRememberMeManager is now an AesCipherService instead of the previous BlowfishCipherService default.  AES is more commonly used in most end-user environments.  Existing RememberMe cookies will therefore fail with this configuration, but this is a non-critical problem - the next login w/ rememberMe enabled will create an AES-encrypted cookie and work from that point on."
  ], 
  "revision_id": "937094"
 }, 
 {
  "author": "dhruba", 
  "date": "2010-04-22T22:47:44.352276Z", 
  "msg": [
   "HADOOP-6719. Insert all missing methods in FilterFs.", 
   "(Rodrigo Schmidt via dhruba)"
  ], 
  "revision_id": "937093"
 }, 
 {
  "author": "dhruba", 
  "date": "2010-04-22T22:40:23.876135Z", 
  "msg": [
   "HADOOP-6690. FilterFileSystem correctly handles setTimes call.", 
   "(Rodrigo Schmidt via dhruba)"
  ], 
  "revision_id": "937092"
 }, 
 {
  "author": "daijy", 
  "date": "2010-04-22T22:40:09.487488Z", 
  "msg": [
   "PIG-1384: Adding contrib javadoc to main Pig javadoc"
  ], 
  "revision_id": "937091"
 }
]