[
 {
  "author": "kahatlen", 
  "date": "2010-04-23T07:29:36.188863Z", 
  "msg": [
   "DERBY-4582: Timestamps inserted with GMT calendar are 1 hour later", 
   "when subsequently read with GMT calendar (Server Mode Only)", 
   "Partial fix. This patch makes the server read time, date and timestamp", 
   "values from ResultSets and CallableStatements using the getter methods", 
   "that take a Calendar object. A GMT calendar is used, so that times", 
   "that are not possible to represent in the local time zone (like the", 
   "\"lost hour\" when switching to daylight saving time) are not silently", 
   "modified. The GMT calendar is also used when formatting the value", 
   "before it's sent to the client."
  ], 
  "revision_id": "937170"
 }, 
 {
  "author": "djencks", 
  "date": "2010-04-23T07:27:31.314468Z", 
  "msg": [
   "GERONIMO-5005 latest juddi builds but server does not start. We need to fix juddi"
  ], 
  "revision_id": "937169"
 }, 
 {
  "author": "kahatlen", 
  "date": "2010-04-23T07:05:06.213008Z", 
  "msg": [
   "DERBY-4506: Document NATURAL JOIN in the reference manual"
  ], 
  "revision_id": "937168"
 }, 
 {
  "author": "jacopoc", 
  "date": "2010-04-23T06:43:59.341977Z", 
  "msg": [
   "Tag release 4.0.", 
   "The release has been created from the branch release4.0 (revision 935322) and has been officially voted in the dev list.", 
   "The results of the vote have been posted to the dev list on April 23 2010 in a mail with subject \"[VOTE] [RESULT] [RELEASE] Apache OFBiz 4.0\".", 
   "The vote has passed with the following result:", 
   "binding +1 votes: 7 (Ashish Vijaywargiya, Adrian Crum, Bruno Busco, Bilgin Ibryam, Anil Patel, Jacques Le Roux, Jacopo Cappellato)", 
   "non binding +1 votes: 4 (Michael Xu, BJ Freeman, Tim Ruppert, Sam Hamilton)", 
   "binding -1 votes: 1 (Scott Gray)", 
   "non binding -1 votes: 0"
  ], 
  "revision_id": "937167"
 }, 
 {
  "author": "kayyagari", 
  "date": "2010-04-23T06:43:57.533708Z", 
  "msg": [
   "o added a new LdapConnection implementation based on CoreSession", 
   "o a new cursor to convert Entry objects to SearchResponse objects", 
   "o added dependency on ldap-client-api"
  ], 
  "revision_id": "937166"
 }
]