[
 {
  "author": "arkurth", 
  "date": "2010-05-27T13:08:22.614049Z", 
  "msg": [
   "VCL-298", 
   "Updated OS.pm::is_ssh_responding() to display if port 22 or 24 is open.", 
   "Added insertloadlog call to wait_for_response() which creates an 'osrespond' log entry.  This line is currently commented out until the schema is updated.  This will be used to indicate when the OS has responded in the reservation status information.", 
   "Added update_ssh_known_hosts() subroutine.  This checks the known_hosts file, removes old entries for the node, and adds the correct entry.  This code was duplicated in every provisioning module.  It will eventually be called during OS post_load.", 
   "Added update_public_ip_address() subroutine.  This checks if static or dynamic addresses are used, and either sets the static address or updates the dynamic address in the database.  This code was also duplicated in every provisioning module and this will eventually be called during OS post_load()."
  ], 
  "revision_id": "948820"
 }, 
 {
  "author": "gertv", 
  "date": "2010-05-27T13:04:36.089997Z", 
  "msg": [
   "SMXCOMP-751: Ensure that multiple threads can safely use the JBI endpoint Producer"
  ], 
  "revision_id": "948819"
 }, 
 {
  "author": "jukka", 
  "date": "2010-05-27T13:02:50.581756Z", 
  "msg": [
   "JCR-2640: Internal repository context", 
   "Streamline namespace and node type registry creation"
  ], 
  "revision_id": "948818"
 }, 
 {
  "author": "ningjiang", 
  "date": "2010-05-27T12:56:14.253455Z", 
  "msg": [
   "CAMEL-2757 fix the camel-cxf unit test failures"
  ], 
  "revision_id": "948817"
 }, 
 {
  "author": "arkurth", 
  "date": "2010-05-27T12:55:39.161556Z", 
  "msg": [
   "VCL-298", 
   "Updated DataStructure.pm to allow objects to be cloned and to allow a computer or image ID argument to be specified when creating a DataStructure object.  This allows objects to be created containing data for a specific computer or image.  This is used to create an object representing a VM host, with the VM host's computer and image data saved in the object.", 
   "Added or uncommented the accessors to vmhost.id, vmhost.computerid, vmhost.imageid, and vmprofile.imageid."
  ], 
  "revision_id": "948816"
 }
]