[
 {
  "author": "yoshiki", 
  "date": "2002-05-14T06:30:32.000000Z", 
  "msg": [
   "Update translation."
  ], 
  "revision_id": "95079"
 }, 
 {
  "author": "wrowe", 
  "date": "2002-05-14T05:36:22.000000Z", 
  "msg": [
   "One last commit for tonight I'd postponed ... take variable names within", 
   "mod_isapi out of Eastern Europe.  Hungarian now applies to ISAPI and MS", 
   "defined fields of structures, only."
  ], 
  "revision_id": "95078"
 }, 
 {
  "author": "wrowe", 
  "date": "2002-05-14T05:23:54.000000Z", 
  "msg": [
   "Now for the major refactoring.  Introduce mod_isapi.h, as we have had", 
   "untold problems with compatibility between different Visual Studio and", 
   "PlatformSDK users [based on their generation of the MS ISAPI header.]", 
   "This header is coded from scratch in native APR types.", 
   "Replace the apr_array_t with an apr_hash_t, mutex protected, to allow us", 
   "to preload and late-load isapi modules.  This closes a significant bug", 
   "with trafficed sites using uncached isapi modules, where one would be", 
   "closing the module just as another request is opening it [as if for the", 
   "first time.]  This would cause some ISAPI modules to crash.  Now that", 
   "we load modules for the lifetime of the server, a simple graceful restart", 
   "is all that's required to unload all the non-precached modules.", 
   "Crack out all FAKE_ASYNC code while we complete it.  Total support for", 
   "the Completion Context callback and end-of-request termination is required", 
   "before we can toggle this on.", 
   "My next commit; complete fake async support.  But this was all I'd had", 
   "in me for one night."
  ], 
  "revision_id": "95077"
 }, 
 {
  "author": "dougm", 
  "date": "2002-05-14T00:27:16.000000Z", 
  "msg": [
   "disabled term coloring by default (enable with env var APACHE_TEST_COLOR=1)"
  ], 
  "revision_id": "95076"
 }, 
 {
  "author": "dirkx", 
  "date": "2002-05-13T23:12:02.000000Z", 
  "msg": [
   "Write a 100 times - save your files before copy and commit.. fixed", 
   "missing parenthesis which breaks the build."
  ], 
  "revision_id": "95075"
 }
]