[
 {
  "author": "mccreedy", 
  "date": "2002-05-19T04:55:39.000000Z", 
  "msg": [
   "TPF-specific changes for syslog and option passing (such as -f)."
  ], 
  "revision_id": "95174"
 }, 
 {
  "author": "wrowe", 
  "date": "2002-05-18T21:43:24.000000Z", 
  "msg": [
   "As the prior commit message indicated, pass the accept thread a listen", 
   "rec as opposed to simply the listen socket.", 
   "However, the prior commit (which I crossed up with this patch) really", 
   "closed a segfault where we attempted to log messages to ap_server_conf,", 
   "after the server conf was destroyed, and prior to setting the new", 
   "value in the next go-around of post_config."
  ], 
  "revision_id": "95173"
 }, 
 {
  "author": "wrowe", 
  "date": "2002-05-18T21:41:36.000000Z", 
  "msg": [
   "Begin passing about apr types instead of odd local conventions.", 
   "It seems there may be other uses for tracking information within", 
   "an ap_listen_rec, outside of the socket.  One of my hassles (that", 
   "FirstBill found another way around) was tracking the current", 
   "accept socket when the only common data was the listen socket."
  ], 
  "revision_id": "95172"
 }, 
 {
  "author": "wrowe", 
  "date": "2002-05-18T17:22:23.000000Z", 
  "msg": [
   "Resolve the EXEC_ON_READ bit for ServerRoot and other modules that test", 
   "the directive context.  Should eliminate the segfault."
  ], 
  "revision_id": "95171"
 }, 
 {
  "author": "wrowe", 
  "date": "2002-05-18T16:35:57.000000Z", 
  "msg": [
   "Although it appears reasonable to immediately gather the Error log and", 
   "level from the config; these are per-vhost entities that can't be", 
   "processed as we preload the config tree.  There is more work to do,", 
   "as Cliff Woolley guesses, before we can make this change.", 
   "In the meantime, -e and -E should provide the admin sufficient options", 
   "to work around problematic configs.  So I'm reverting those changes,", 
   "for now.", 
   "ServerRoot is global only, and it MUST be read immediately, so that", 
   "part of the last patch stays."
  ], 
  "revision_id": "95170"
 }
]