[
 {
  "author": "werpu", 
  "date": "2010-06-09T09:26:10.548399Z", 
  "msg": [
   "https://issues.apache.org/jira/browse/MYFACES-2747", 
   "Ok IE6 as usual hates dom manipulation while it renders the body and terminates upfront with an error (old ie6 bug never fixed and never will be), deferring is not an option since inline scripts might rely on", 
   "jsf.ajax already being present.", 
   "What I am doing now is simply to run the globalEval in case of IE6 instead of relying on the head manipulating loading routines.", 
   "I have changed the code my example now works again with IE6 even if it loads the jsf.js automatically within the body.", 
   "This problem occurs anyway only in debug mode when the subloading happens (new feature of the 2.0.1 codebase per request from Leonardo) and only on IE6 (and maybe ie7 but I doubt it) which is the only browser which has this problem.", 
   "In either way we have to add a fallback for those browsers that under no circumstances the scripts should be attached to the body but the head instead (while other browsers like chrome forbid explict html head alteration, one reason why globaleval for instance in jquery fails on webkit)"
  ], 
  "revision_id": "952920"
 }, 
 {
  "author": "rjung", 
  "date": "2010-06-09T09:22:32.020212Z", 
  "msg": [
   "Cleanup JDT vs. ECJ:", 
   "- Replace \"jasper-jdt.jar component\" with \"Eclipse JDT Java compiler\"", 
   "in license texts", 
   "- Add JDT version to our ant version filter", 
   "and replace explicit version in release notes file with version tag", 
   "- Replace \"jasper-jdt.jar\" by \"ecj-*.jar\" in generated documentation.", 
   "I assume people know what we mean by \"ecj-*.jar\".", 
   "We shouldn't maintain detailed versions in those pages. Alternatively", 
   "running them through the filter means either adding maintenance by", 
   "keeping the file list up-to-date or much overhead by running all of", 
   "them through the filter.", 
   "Renaming the ecj-*.jar to simply ecj.jar or ecj-3.jar would hide", 
   "the full version from the interested observer."
  ], 
  "revision_id": "952919"
 }, 
 {
  "author": "gnodet", 
  "date": "2010-06-09T09:17:02.110867Z", 
  "msg": [
   "FELIX-2341: the gogo-commands module should be moved back to karaf"
  ], 
  "revision_id": "952918"
 }, 
 {
  "author": "hiranya", 
  "date": "2010-06-09T09:15:23.615148Z", 
  "msg": [
   "Fixing SYNAPSE-659. Synchronized access to the MBeanRegistrat from the stat collector."
  ], 
  "revision_id": "952917"
 }, 
 {
  "author": "stylesen", 
  "date": "2010-06-09T06:52:30.189920Z", 
  "msg": [
   "On the '1.6.x' branch:", 
   "* STATUS: Vote for r901304."
  ], 
  "revision_id": "952916"
 }
]