[
 {
  "author": "markt", 
  "date": "2010-06-14T12:53:20.693532Z", 
  "msg": [
   "Fix https://issues.apache.org/bugzilla/show_bug.cgi?id=49213", 
   "Add permissions required by Manager application"
  ], 
  "revision_id": "954435"
 }, 
 {
  "author": "ritchiem", 
  "date": "2010-06-14T12:37:11.494751Z", 
  "msg": [
   "Update SAMQQT to use an initialised Direct exchange rather than make its own."
  ], 
  "revision_id": "954434"
 }, 
 {
  "author": "ritchiem", 
  "date": "2010-06-14T12:36:56.806161Z", 
  "msg": [
   "QPID-2638 : Add initial support for Topics section in configuration file.", 
   "Added getQueueConfiguration(AMQQueue) which will return a new configuration for the given queue reflecting its binding status. This will allow the queue", 
   "to be reconfigured during the binding process. Full Docs on this approach to appear on wiki.", 
   "AMQQueue.configure and getConfiguration() have been updated to use ConfigurationPlugin rather than QueueConfiguration, The queue may be configured by a TopicConfiguration now.", 
   "Update SlowConsumerTest to be GlobalQueuesTest and add a GlobalTopicsTest to match, where the config is added to the queues or topics section respectively"
  ], 
  "revision_id": "954433"
 }, 
 {
  "author": "ritchiem", 
  "date": "2010-06-14T12:35:51.608931Z", 
  "msg": [
   "QPID-2625 : Moved Logging generation to moudule.xml to allow plugins to utilise the same functionality.", 
   "To enable generation for your plugin just add :", 
   "<target name=\"precompile\" depends=\"gen_logging\"/>", 
   "to your build.xml", 
   "Logging is now defined in a X_logmessage.properties file. Where X is used to make the XMessages.java class.", 
   "Also updated all existing usages to remove the 3 digit prefix that wasn't adding any info.", 
   "Updated ConfigStore and Transaction Log to use named properties rather than numeric values.", 
   "If we are going to continue with <3 alpha>-<4 numeric> ids for messages then we'll need to have some registry to prevent", 
   "clases. Perhaps it is simpler to relax this and require a plugin creator to provide a unique identifier for their messages."
  ], 
  "revision_id": "954432"
 }, 
 {
  "author": "ritchiem", 
  "date": "2010-06-14T12:34:48.232809Z", 
  "msg": [
   "Update LogMessage Generation to be based on a the existance of a _logmessages.property file."
  ], 
  "revision_id": "954431"
 }
]