[
 {
  "author": "akundu", 
  "date": "2010-06-14T15:55:08.211660Z", 
  "msg": [
   "- Bryan Call's bringing in of uf_swapcontext to avoid calling sigprocmask on every fiber context switch", 
   "- Raghav's first version of UFConf to provide a config system for UF", 
   "- Vijaya's fix to UFConnectionPoolImpl.C to reset the group's TTL on every DNS call to the resolver", 
   "- Steve Jiang's makefile changes to better integrate UFAres and getting around undefined symbols from the c-ares lib. in the archive libUF.a", 
   "- Anirban's fixes", 
   "- UF", 
   "- support 64-bit makecontext", 
   "- addFiberToScheduler now allows to pass a list or a single UF to be added", 
   "- call uf_swapcontext in 64-bit mode", 
   "- UFPC", 
   "- support for both streaming and non-streaming modes of data exchange between prod./consumer. (wake up only after all the data has been gotten by the producer)", 
   "- support to not use any locks or signaling mechanisms while interacting between producer and consumer, if the developer knows that the producer and consumer are being executed in the same thread", 
   "- optimization of not creating the iterator to iterate through consumers if there is only one consumer", 
   "- UFPC now returns an int for status instead of UFPC code (This allows the dev. to specify random error codes to cooperate between consumer + producer)", 
   "- producer now sits on a condWait (instead of a timer) to get notified about consumers removing the producer from their list", 
   "- broke out the c'tor of the producer into a init fxn and provided a reset fxn to be used by a factory and by the d'tor. Applies to consumer too.", 
   "- UFIO", 
   "- added the active flag to be able to not activate ufs for inactive ufios", 
   "- using the above flag, the UFConnPool can now turn off the activation of UFIOs that are not being actively managed by UFs (especially if the conn. is waiting to be used and has some activity)", 
   "- conn pool now respects the ttl setting for a name and sets the ttl to the lowest ttl of the resolved to A-records", 
   "- follow a map of group names -> list of ips and each ip -> ipinfo map structure", 
   "- implement the sleep processing for inactive connections", 
   "- break-out c-ares usage inside #defines (since there is some unexpected crashes w/ the c-ares usage)", 
   "- UFServer", 
   "- automatically restart a child worker process that has died", 
   "- only allow NETIO threads (not ACCEPT threads) to handle client communication", 
   "- better error message outputs for the various tasks that threads are being allocated for in init time"
  ], 
  "revision_id": "954525"
 }, 
 {
  "author": "pburba", 
  "date": "2010-06-14T15:53:42.066787Z", 
  "msg": [
   "* STATUS: Nominate fix for issue #3654 'added subtrees with mergeinfo", 
   "break reintegrate'."
  ], 
  "revision_id": "954524"
 }, 
 {
  "author": "kahatlen", 
  "date": "2010-06-14T15:51:06.913267Z", 
  "msg": [
   "Set svn:eol-style for LogDeviceTest_app.properties"
  ], 
  "revision_id": "954523"
 }, 
 {
  "author": "lofwyr", 
  "date": "2010-06-14T15:44:55.806517Z", 
  "msg": [
   "TOBAGO-893: Optimize StyleClasses", 
   "- new class \"Classes\" which builds the style classes like a factory (caching possible)"
  ], 
  "revision_id": "954522"
 }, 
 {
  "author": "nick", 
  "date": "2010-06-14T15:43:47.033267Z", 
  "msg": [
   "Fix bug #49432 - Lazy caching of XSSFComment CTComment objects by reference, to make repeated comment searching faster"
  ], 
  "revision_id": "954521"
 }
]