[
 {
  "author": "markrmiller", 
  "date": "2010-06-25T11:52:02.659919Z", 
  "msg": [
   "Solr 1.4.1 release news"
  ], 
  "revision_id": "957900"
 }, 
 {
  "author": "gtully", 
  "date": "2010-06-25T11:49:01.880214Z", 
  "msg": [
   "fix intermittent failure in JDBCNegativeQueueTest, sync store add and cursor add such that cursor is always in order w.r.t the store. Hense, when the cursor cache is exhausted, resuming from the store is just fine. Without the sync, moving from cache to store can result in duplicate messages, out of order messages and on occasion missing messages. disabling the cache resolved all of the above but kills performance. Syncing the sore add and cursor add is the correct solution, but it has an impact on concurrent transaction completion for a destination, paralell completion across destinations can still continue, so there is still some batching potential"
  ], 
  "revision_id": "957899"
 }, 
 {
  "author": "jeremias", 
  "date": "2010-06-25T11:47:57.461260Z", 
  "msg": [
   "Added an equals() method to ColorExt.java", 
   "Use ColorExt whenever possible instead of java.awt.Color due to the way its equals() method is written (it doesn't detect two different colors with the same sRGB fallback).", 
   "Change CIE Lab color space to normalize the native color components to the range 0.0..1.0 because, oddly, Color requires that even through ColorSpace provides methods for the min and max values for each component.", 
   "Accessors for XYZ and derived sRGB values for NamedColor, as well as an equals() method.", 
   "Changed ICCColor.profileURI to .profileSrc with a String instead of an URI because we use Strings all over which may not always be valid URIs (ex. filenames are supported as a convenience)."
  ], 
  "revision_id": "957898"
 }, 
 {
  "author": "amareshwari", 
  "date": "2010-06-25T11:47:29.290969Z", 
  "msg": [
   "Adding missing file from earlier commit."
  ], 
  "revision_id": "957897"
 }, 
 {
  "author": "amareshwari", 
  "date": "2010-06-25T11:46:12.976034Z", 
  "msg": [
   "MAPREDUCE-1876. Fixes TaskAttemptStartedEvent to correctly log event type for all task types. Contributed by Amar Kamat"
  ], 
  "revision_id": "957896"
 }
]