[
 {
  "author": "rjung", 
  "date": "2010-07-04T16:01:43.776447Z", 
  "msg": [
   "Remove *.rtf from fixcrlf patternset.", 
   "No need for native line ends in RTF files.", 
   "Their spec indicates they should use CRLF."
  ], 
  "revision_id": "960350"
 }, 
 {
  "author": "koji", 
  "date": "2010-07-04T15:58:54.340490Z", 
  "msg": [
   "LUCENE-2524: FastVectorHighlighter: use mod for getting colored tag"
  ], 
  "revision_id": "960349"
 }, 
 {
  "author": "markt", 
  "date": "2010-07-04T15:44:45.573361Z", 
  "msg": [
   "Revert r958362, r960083, r958406, r960069. r958362 broke the TCK tests and the other commits were sufficiently tightly coupled to it that it was easier to revert all of them than try to unpick them."
  ], 
  "revision_id": "960348"
 }, 
 {
  "author": "markt", 
  "date": "2010-07-04T15:38:40.599454Z", 
  "msg": [
   "Revert r960283, r960316, r960318. r960283 broke the spec and the other commits were sufficiently tightly coupled to it that it was easier to revert all of them than try to unpick them."
  ], 
  "revision_id": "960347"
 }, 
 {
  "author": "mikem", 
  "date": "2010-07-04T15:36:37.801895Z", 
  "msg": [
   "DERBY-4419: NPE with INSERT .. SELECT .. UNION and identity columns", 
   "backporting this fix #831304 from trunk to 10.5 branch.", 
   "The following SQL was causing problems:", 
   "create table t3(x int, y int generated always as identity);", 
   "insert into t3(x) select * from t1 union select * from t2;", 
   "During the insert, the value of column Y is not specified by the INSERT", 
   "statement, and therefore Derby notices that Y's value is to be generated,", 
   "and so Derby generates code to compute a value for Y when inserting each", 
   "row into T3.", 
   "When Derby is compiling the INSERT statement, Derby checks that the", 
   "column information for the column(s) to be inserted matches the correpsonding", 
   "column information for the column(s) that are selected by the SELECT", 
   "clause in the INSERT statement.", 
   "In the above example, Derby expands the \"*\" expression for each of tables", 
   "T1 and T2, and verifies that the result is a single integer column, thus", 
   "matching column X in T3.", 
   "However, at that point in processing, the ResultColumnList also contains", 
   "information about column Y, since its value is to be automatically generated.", 
   "Therefore, Derby needs to skip over such columns during datatype checking;", 
   "these columns are marked isGeneratedForUnmatchedColumnInInsert, so this", 
   "change causes Derby to check that value.", 
   "A similar behavior (DERBY-4425) occurs for columns which are generated by", 
   "expressions, which is a new feature in recent versions of Derby.", 
   "This change also fixes DERBY-4425. A separate commit for DERBY-4425 will", 
   "add an additional regression test for that situation."
  ], 
  "revision_id": "960346"
 }
]