[
 {
  "author": "stroucki", 
  "date": "2010-07-06T00:30:49.209905Z", 
  "msg": [
   "sync back to master"
  ], 
  "revision_id": "960735"
 }, 
 {
  "author": "struberg", 
  "date": "2010-07-06T00:03:43.391758Z", 
  "msg": [
   "fix webbeans-doc project setup"
  ], 
  "revision_id": "960734"
 }, 
 {
  "author": "struberg", 
  "date": "2010-07-05T23:58:38.716678Z", 
  "msg": [
   "remove broken release tag"
  ], 
  "revision_id": "960733"
 }, 
 {
  "author": "struberg", 
  "date": "2010-07-05T23:55:25.713204Z", 
  "msg": [
   "[maven-release-plugin] rollback the release of openwebbeans-1.0.0-alpha-1"
  ], 
  "revision_id": "960732"
 }, 
 {
  "author": "mikem", 
  "date": "2010-07-05T23:15:43.692702Z", 
  "msg": [
   "DERBY-4442: Default value and identity in an INSERT result set evaluated too early", 
   "backporting change #885421 from trunk to 10.5 branch.", 
   "Always add a ProjectRestrictNode on top of the source result set for an", 
   "insert if the source columns are not ordered the same way as the target", 
   "columns, or if inserting into a subset of the columns, and the source is not", 
   "a table constructor. Then the adding of default values to the source result", 
   "column list happens on top of the original source result node, and not", 
   "inside that node. This means that the source result is produced before the", 
   "default values are added, and the generation of the defaults happens at the", 
   "correct time.", 
   "As a side-effect, these other issues are fixed:", 
   "DERBY-3 Identity column not filled consecutively with \"insert ... select distinct\"", 
   "DERBY-4433 Cannot insert from EXCEPT/INTERSECT when target table has more columns than the source", 
   "Much of the added code is actually old code revived from the Subversion", 
   "history. Before DERBY-1644, we used to put a ProjectRestrictNode on top of", 
   "the source result if it was a SetOperatorNode. The code that inserted the", 
   "ProjectRestrictNode was added back and changed to operate on ResultSetNode", 
   "instead of SetOperatorNode."
  ], 
  "revision_id": "960731"
 }
]