[
 {
  "author": "struberg", 
  "date": "2010-07-06T07:01:33.785798Z", 
  "msg": [
   "[maven-scm] copy for tag openwebbeans-1.0.0-alpha-1"
  ], 
  "revision_id": "960820"
 }, 
 {
  "author": "struberg", 
  "date": "2010-07-06T07:01:23.405840Z", 
  "msg": [
   "[maven-release-plugin] prepare release openwebbeans-1.0.0-alpha-1"
  ], 
  "revision_id": "960819"
 }, 
 {
  "author": "azeez", 
  "date": "2010-07-06T06:52:59.917817Z", 
  "msg": [
   "Removing default cleanup behavior. This has to be implemented by the relevant deployers."
  ], 
  "revision_id": "960818"
 }, 
 {
  "author": "bayard", 
  "date": "2010-07-06T06:52:21.143818Z", 
  "msg": [
   "Applying Jeremy Boynes' refactoring of SetSupport per #49548", 
   "\"Patch primarily refactors the large \"if\" clause that sets", 
   "the result into smaller methods. It also clears up IDE warnings (at least from", 
   "IDEA).", 
   "One side effect was I18N of the exception message for \"SET_BAD_DEFERRED_SCOPE\"", 
   "I18N also needed access to the original value (which was not being retained)", 
   "and in conjunction with that I replaced the \"scopeSpecified\" indicator with a", 
   "check on whether the \"scope\" attribute is null.", 
   "I also changed the comment where the exception is thrown when target is null.", 
   "This can happen as target is a request-time attribute and the spec does define", 
   "this behaviour.", 
   "When setting a bean property, the for loop now exits after setting its property", 
   "rather than continuing to iterate through all of them. This should have no", 
   "impact unless a bean can have two PropertyDescriptors with the same name and I", 
   "don't believe it can.", 
   "Finally, all throws of JspException were replaced with JspTagException as these", 
   "are errors coming from a Tag Handler rather than the JSP Engine itself.\""
  ], 
  "revision_id": "960817"
 }, 
 {
  "author": "dhruba", 
  "date": "2010-07-06T06:52:20.439237Z", 
  "msg": [
   "HDFS-1202.  DataBlockScanner throws NPE when updated before", 
   "initialized. (Todd Lipcon via dhruba)"
  ], 
  "revision_id": "960816"
 }
]