[
 {
  "author": "slive", 
  "date": "2002-07-23T17:46:39.000000Z", 
  "msg": [
   "Nothing to see here.  Just committing a very small change to the transformations."
  ], 
  "revision_id": "96159"
 }, 
 {
  "author": "slive", 
  "date": "2002-07-23T17:45:36.000000Z", 
  "msg": [
   "Introduce changes necessary to bring the remainder of the manual into xml.", 
   "1. Add a <relative-path href=\"whatever\"/> element to the manualpage", 
   "DTD.  This should give the path from the location of the page to", 
   "the root of the manual directory.  It is necessary for proper linking", 
   "to directives, etc.", 
   "2. Add the stuff to common.xsl necessary to transform a <manualpage>.", 
   "This is basically the minimum.  It creates something VERY similar to", 
   "what we had before (with the exception of a little css here and", 
   "there).  I very much hope that this will be improved soon to look", 
   "nicer.", 
   "3. Add configuring.xml, which was written by Astrid Kessler.  I made only", 
   "a very few small changes to bring it in line with the current DTD.", 
   "I have not yet committed the corresponding configuring.html.en, since I", 
   "want to give people a little opporunity to comment on this stuff.", 
   "My appologies, but I am committing a few style changes to common.xsl", 
   "along with the substantial changes.  That file is really hard to", 
   "work with, and should probably be broken up."
  ], 
  "revision_id": "96158"
 }, 
 {
  "author": "rbb", 
  "date": "2002-07-23T17:44:55.000000Z", 
  "msg": [
   "After an install, the default config files are useful.  After an upgrade", 
   "they aren't.", 
   "If the config directive's syntax changed, Apache will tell", 
   "you which one changed, and the docs are a better place to go for details", 
   "then the default config files.  BTW, the syntax of a directive hasn't", 
   "changed for a VERY long time.", 
   "If the semantics changed, then nobody will ever know that they need to", 
   "look in the default config files to determine that they semantics changed,", 
   "because there is no error message.", 
   "The argument that you want to be able to get the defaults back doesn't", 
   "hold water, because 99.9% of all admins backup their files before", 
   "modifying them.  If you aren't backing them up, then that is your problem.", 
   "The argument that you may not have a full config directory also doesn't", 
   "hold water, because the assumption is that the conf/ directory is coming", 
   "from a working server."
  ], 
  "revision_id": "96157"
 }, 
 {
  "author": "jerenkrantz", 
  "date": "2002-07-23T17:40:01.000000Z", 
  "msg": [
   "Update to use AUTOCONF variable if present"
  ], 
  "revision_id": "96156"
 }, 
 {
  "author": "trawick", 
  "date": "2002-07-23T17:24:35.000000Z", 
  "msg": [
   "sysconfdir/examples is my current favorite"
  ], 
  "revision_id": "96155"
 }
]