[
 {
  "author": "nickchalko", 
  "date": "2004-03-20T07:35:53.614561Z", 
  "msg": [
   "Fixed project name."
  ], 
  "revision_id": "9649"
 }, 
 {
  "author": "nickchalko", 
  "date": "2004-03-20T07:33:55.968591Z", 
  "msg": [
   "Fixed project name."
  ], 
  "revision_id": "9648"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-03-20T04:03:12.227639Z", 
  "msg": [
   "Ok there were some major pitfall discoveries I've made regarding monitors.", 
   "Basically they should do as little as possible to effect the code that", 
   "they monitor.  It's got alot to do with Heisenberg Uncertainty principle:", 
   "measuring something changes it so keep what you do while measuring down", 
   "to a minimum.", 
   "Monitors should", 
   "- never modify control flow or set variables that do", 
   "- never throw exceptions", 
   "- never return any values", 
   "Don't mess with monitors cuz they'll mess with you! I learned that the", 
   "hard way and cleaned up all the monitors that did stupid stuff that falls", 
   "in line with the above.", 
   "Alex"
  ], 
  "revision_id": "9647"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-03-20T03:55:12.780220Z", 
  "msg": [
   "Cleaned up the processor code.  I think we're golden here.  I really want", 
   "the logging stuff to work but I'll retrofit that.  For now we just need a", 
   "few more test cases for the other message types just to confirm then we", 
   "move on to the encoder and the output module."
  ], 
  "revision_id": "9646"
 }, 
 {
  "author": "akarasulu", 
  "date": "2004-03-20T03:51:56.015312Z", 
  "msg": [
   "o Found bug where we were not cleaning up threads due to exceptions from", 
   "the active worker list to perform graceful shutdowns of the stage.", 
   "o Also cleaned up the monitor situation.  And created a real logging monitor", 
   "that for the time being logs to the console but I think this can be", 
   "changed using logger settings so the name is a misnomer: will have to", 
   "change that on subsequent checkins."
  ], 
  "revision_id": "9645"
 }
]