[
 {
  "author": "woonsan", 
  "date": "2010-07-16T23:56:17.659734Z", 
  "msg": [
   "JS2-1203: Exposing the default decorator actions factory as a constructor arg to allow injection in spring assembly."
  ], 
  "revision_id": "964985"
 }, 
 {
  "author": "rajith", 
  "date": "2010-07-16T23:50:13.292694Z", 
  "msg": [
   "QPID-2736", 
   "The session.createQueue and session.createTopic methods will behave as", 
   "follows.", 
   "session.createQueue", 
   "===================", 
   "1. If just a queue name is passed,", 
   "1.1 If the destination syntax is BURL, a queue", 
   "by that name will be created and bound to the amq.direct exchange using", 
   "the queue name as the binding key. If published using this destination,", 
   "then the message will be sent to amq.direct with routing key set to the", 
   "queue name.", 
   "1.2 If destination syntax is ADDR, a queue is created by that name.", 
   "If published using this exchange then the message will be sent to the", 
   "defualt exchange (nameless exchange) with routing key set to the", 
   "queue name.", 
   "2. If an address string or binding url is passed, it will be passed", 
   "accordingly.", 
   "session.createTopic", 
   "===================", 
   "1. If just a topic name is passed,", 
   "1.1 If destination syntax is ADDR, a temp queue is created and bound to", 
   "the amq.topic with the topic name as binding key. If published using", 
   "this destination, then the message will be sent to amq.topic with the", 
   "topic name set to routing key. The topic name will also be set as", 
   "\"qpid.subject\" in the outgoing message.", 
   "1.2 Same as above except there will be no subject set.", 
   "2. If an address string or binding url is passed, it will be passed", 
   "accordingly."
  ], 
  "revision_id": "964984"
 }, 
 {
  "author": "toulmean", 
  "date": "2010-07-16T23:46:24.841847Z", 
  "msg": [
   "making sure hibernate works with the ODE build."
  ], 
  "revision_id": "964983"
 }, 
 {
  "author": "rahul", 
  "date": "2010-07-16T23:36:32.647456Z", 
  "msg": [
   "Add an example of a guard condition operating over the XML payload of an event."
  ], 
  "revision_id": "964982"
 }, 
 {
  "author": "rawson", 
  "date": "2010-07-16T23:29:19.043548Z", 
  "msg": [
   "HBASE-2840  Remove the final remnants of the old Get code - the query matchers and other helper classes"
  ], 
  "revision_id": "964981"
 }
]