[
 {
  "author": "brandonwilliams", 
  "date": "2010-07-19T23:54:12.181640Z", 
  "msg": [
   "DynamicEndpointSnitch improvements, make it the default.  Patch by brandonwilliams; reviewed by jbellis for CASSANDRA-1296"
  ], 
  "revision_id": "965685"
 }, 
 {
  "author": "mcooper", 
  "date": "2010-07-19T23:54:05.109635Z", 
  "msg": [
   "TRINIDAD-1840 - UIXTable and UIXTreeTable should provide hooks into decode/validate/updateChildrenImpl", 
   "Thanks to Kamran Kashanian for the patch:", 
   "The Trinidad UIXCollection class provides hooks for processing of stamped/unstamped children and facets during decode/validate/update-model JSF lifecycle phases for any collection components that extent UIXCollection.", 
   "See the abstract method \"processFacetsAndChildren\" in decode/validate/updateChildrenImpl in UIXCollection. This allows collection component subclasses to perform special logic for handling stamped/unstamped children, and facets during decode/validate/update-model phases.", 
   "UIXTable and UIXTreeTable provide concrete implementations for processFacetsAndChildren. However, both of these components make processFacetsAndChildren final and disallow any subclasses from overriding and customizing the child processing logic.", 
   "The proposal is to make UIXTable and UIXTreeTable child component processing more extensible as follows:", 
   "1) Remove the 'final' keyword from processFacetsAndChildren and allow subclasses to override these methods", 
   "2) Provide more hooks into the existing processFacetsAndChildren processing by making the utility methods in TableUtils (processStampedChildren, processColumnFacets, and processFacets) public."
  ], 
  "revision_id": "965684"
 }, 
 {
  "author": "lindner", 
  "date": "2010-07-19T23:51:26.051586Z", 
  "msg": [
   "SHINDIG-1389 | Patch from Bastian Hofmann | Typo in RequestItem exception message"
  ], 
  "revision_id": "965683"
 }, 
 {
  "author": "ctan", 
  "date": "2010-07-19T23:49:18.564599Z", 
  "msg": [
   "[CONTINUUM-2545] forgot to add unit test for ContinuumBuildAgentDavResource"
  ], 
  "revision_id": "965682"
 }, 
 {
  "author": "gbrown", 
  "date": "2010-07-19T23:46:51.109150Z", 
  "msg": [
   "Trim whitespace."
  ], 
  "revision_id": "965681"
 }
]