[
 {
  "author": "ningjiang", 
  "date": "2010-07-22T08:38:32.186655Z", 
  "msg": [
   "CAMEL-2981 DefaultHttpBinding's populateRequestParameters should be more flexible when checking the content type on POST"
  ], 
  "revision_id": "966540"
 }, 
 {
  "author": "philip", 
  "date": "2010-07-22T08:32:17.230184Z", 
  "msg": [
   "* subversion/libsvn_wc/adm_crawler.c", 
   "(svn_wc__internal_transmit_text_deltas): Use svn_stream_open_unique, this", 
   "might also fix the runtime failure on Windows."
  ], 
  "revision_id": "966539"
 }, 
 {
  "author": "jleroux", 
  "date": "2010-07-22T08:32:00.696525Z", 
  "msg": [
   "\"Applied fix from trunk for revision: 966525\"", 
   "------------------------------------------------------------------------", 
   "r966525 | jleroux | 2010-07-22 09:27:35 +0200 (jeu. 22 juil. 2010) | 6 lignes", 
   "Better Product French UI labels.", 
   "I began by stumping upon the default page labels. The wording I certainly done some years ago without checking all changes in the UI was not really clear. So I wanted to remove the Id (r‚f‚rence in French) part but as we use really an Id there (and not a name or description or what not) I preferred to keep the Id concept. Then, while at it, I checked all the file to be consistent. I have not the courage to do it in all OFBiz :/", 
   "So the idea is to keep the Id words (r‚f‚rence, R‚f. or sometimes [R‚f.]) to make clear that in those places in OFBiz OOTB we use an Id. This because in some custom application we could prefer to use a name (for instance for lookup, or text field, display, etc.) and when you begin to mix the two things begin to be really less clear...", 
   "In one word, when you remove a \"r‚f‚rence\" word, please be careful... (sometimes it makes sense because nothing else could be there, for instance for UOM which are abbrev and may be considered name even if actually they are Id, but it's really subjective and I'd prefer to make the difference real clear: an Id is not a name and a name may be used too)", 
   "------------------------------------------------------------------------"
  ], 
  "revision_id": "966538"
 }, 
 {
  "author": "reto", 
  "date": "2010-07-22T08:26:39.847619Z", 
  "msg": [
   "CLEREZZA-234: applied patch Florent"
  ], 
  "revision_id": "966537"
 }, 
 {
  "author": "veithen", 
  "date": "2010-07-22T08:21:11.014617Z", 
  "msg": [
   "Disable the build of the documentation module until the Maven site refactoring has been completed."
  ], 
  "revision_id": "966536"
 }
]