[
 {
  "author": "ts:ez.no", 
  "date": "2006-01-10T12:10:24.978795Z", 
  "msg": [
   "- Refactored ImageAnalysis to be able use multiple handlers (to be capable of analyzing more formats):", 
   "- Added ezcImageAnalyzerHandler (abstract base class for all handlers).", 
   "- Added ezcImageAnalyzerPhpHandler (implementation of the original ImageAnalysis functionality in this handler).", 
   "- Added ezcImageAnalyzerImagemagickHandler (still to implement, will use ImageMagick's \"identify\" binary to analyze a file).", 
   "- Implemented loading and choosing of a feasible handler in ezcImageAnalysis.", 
   "- Added static getHandlerClasses() and setHandlerClasses() methods on the ezcImageAnalyzer to manipulate the handler classes.", 
   "- Implemented ezcImageAnalyzerData struct to store the data gathered by an ezcImageAnalyzerHandler class (attention: Interface change!!).", 
   "# Instead of $analyzer->size you now do $analyzer->data->size. Rest stays as it is.", 
   "- Migrated ezcImageConversion to use the new interface.", 
   "- Fixed test cases of ImageAnalysis package to use the new interface."
  ], 
  "revision_id": "969065"
 }, 
 {
  "author": "ts:ez.no", 
  "date": "2006-01-10T11:05:09.862710Z", 
  "msg": [
   "- Migrated from exec() to proc_open() in ezcImageImagemagickHandler, for better error processing facilities and to remove enoying console output, if ImageMagick throws an error."
  ], 
  "revision_id": "969064"
 }, 
 {
  "author": "dr:ez.no", 
  "date": "2006-01-09T15:57:36.791981Z", 
  "msg": [
   "- Update exceptions doc with outcome of meeting."
  ], 
  "revision_id": "969063"
 }, 
 {
  "author": "ts:ez.no", 
  "date": "2006-01-09T15:36:38.845107Z", 
  "msg": [
   "- Refined implementaion of ezcImageGeometryFilter::scale(). This method is now implemented as intended originally and allows scaling of an image to fit in a certain box (e.g. 640x480). The scaleExact() filter (which was by now an alias to scale()) still offers the functionality which was offered by scale until now (stretching/scaling to an exact size).", 
   "- Adjusted test cases to the new behavior.", 
   "- Fixed test cases relying on this filter."
  ], 
  "revision_id": "969062"
 }, 
 {
  "author": "dr:ez.no", 
  "date": "2006-01-09T15:34:07.232094Z", 
  "msg": [
   "- Fixed examples."
  ], 
  "revision_id": "969061"
 }
]