[
 {
  "author": "dr:ez.no", 
  "date": "2008-09-03T12:20:19.423160Z", 
  "msg": [
   "- Added the $last argument to the view handler's process() method. This is", 
   "required so that results of different view handlers can be mixed more easily.", 
   "Specifically, it allows content from the PHP and Template view handlers to", 
   "be used with a top level JSON view handler."
  ], 
  "revision_id": "976195"
 }, 
 {
  "author": "dr:ez.no", 
  "date": "2008-09-03T12:14:03.488762Z", 
  "msg": [
   "- Moved the responsibility for running request, result and response filters", 
   "to the dispatcher.", 
   "- Changed ezcMvcController from an interface to an abstract class, so we", 
   "can provide a default contructor that makes all the request variables", 
   "easily accessible as object properties of the controller class.", 
   "- Changed the return values of the router. Instead of the controller itself,", 
   "it returns a ezcMvcRoutingInformation object that contains the classname for", 
   "the controller, but also the matched route's pattern. This routing information", 
   "object is also passed to the configuration's runRequestFilters,", 
   "runResultFilters, runResponseFilters, createView and createResponseWriter", 
   "methods, so the matched route's pattern can be used for further decisions.", 
   "This trick also removes the need for requiring a seperate view or response", 
   "writer router.", 
   "- A matched route now updates the $request, by adding the default variables", 
   "from the route specification to the request's variable storage."
  ], 
  "revision_id": "976194"
 }, 
 {
  "author": "ts:ez.no", 
  "date": "2008-09-03T10:26:16.066487Z", 
  "msg": [
   "- Further unified $_SERVER array in client test generator.", 
   "# White list instead of blacklist to reduce noise when regenerating client tests.", 
   "- Adjust nonce comparison in client tests.", 
   "- Regenerated Litmus tests to reflect changes.", 
   "# Further client tests will now be regenerated, too."
  ], 
  "revision_id": "976193"
 }, 
 {
  "author": "kn:ez.no", 
  "date": "2008-09-03T08:38:23.691498Z", 
  "msg": [
   "- Started with docbook to RST conversions"
  ], 
  "revision_id": "976192"
 }, 
 {
  "author": "kn:ez.no", 
  "date": "2008-09-03T08:36:53.687148Z", 
  "msg": [
   "- Updated TODO file"
  ], 
  "revision_id": "976191"
 }
]