[
 {
  "author": "dennisl", 
  "date": "2010-07-28T22:02:29.193451Z", 
  "msg": [
   "o Fix syntax in Maven Settings example and typos"
  ], 
  "revision_id": "980245"
 }, 
 {
  "author": "rfeng", 
  "date": "2010-07-28T21:57:29.261014Z", 
  "msg": [
   "Add implementation-spring-webapp into the build"
  ], 
  "revision_id": "980244"
 }, 
 {
  "author": "dennisl", 
  "date": "2010-07-28T21:54:54.186871Z", 
  "msg": [
   "o Fix typos."
  ], 
  "revision_id": "980243"
 }, 
 {
  "author": "veithen", 
  "date": "2010-07-28T21:45:31.190419Z", 
  "msg": [
   "1. Moved the site from the documentation module to the root project. This has different advantages:", 
   "* It conforms to the standard Maven project layout.", 
   "* Generating the Javadocs becomes straightforward. No need for fancy ant scripts.", 
   "* We will be able to use other aggregator-style reporting plugins if we want to.", 
   "* We will be able to include sites for selected submodules. This is interesting for the AAR/MAR Maven plugins, because maven-plugin-plugin can be used to generate documentation based on the annotations on the Mojos. This would avoid the problem of out of date documentation for these plugins.", 
   "2. Moved the docs assembly from the distribution module to the root project and modified the POM and assembly descriptor to include a copy of the site instead of the Xdocs (see discussion on the mailing list). This is now triggered in the apache-release profile.", 
   "3. Disabled some reporting plugins (changes, surefire-report, etc.) activated in various submodules. They were not executed in the old build process (because the site was built in the documentation submodule), but cause troubles now that the site is in the root project. This will require some more cleanup.", 
   "Note that this is kind of a revert of the changes made for AXIS2-2966. However, there is no regression because we simply build the docs distribution in a different way."
  ], 
  "revision_id": "980242"
 }, 
 {
  "author": "rhuijben", 
  "date": "2010-07-28T21:39:27.889816Z", 
  "msg": [
   "* subversion/tests/cmdline/svntest/verify.py", 
   "(display_lines): If expected or actual is a string, convert it to", 
   "a list before calling unified_diff() on it."
  ], 
  "revision_id": "980241"
 }
]