[
 {
  "author": "nick", 
  "date": "2010-07-29T13:03:53.477705Z", 
  "msg": [
   "Add Office Open XML (OOXML) support to the Zip container aware detector (TIKA-447)", 
   "If an OOXML zip file entry is found, passes this to POI and fetches the content type through that. Also updates the OOXML text extractor to take advantage of the open package if detection was already done."
  ], 
  "revision_id": "980430"
 }, 
 {
  "author": "jonathan", 
  "date": "2010-07-29T12:58:38.561059Z", 
  "msg": [
   "Added overview page, designed to list starting points for developers.", 
   "Currently lists starting points for the broker. Need similar sections for client, management, etc."
  ], 
  "revision_id": "980429"
 }, 
 {
  "author": "mikemccand", 
  "date": "2010-07-29T12:56:52.763005Z", 
  "msg": [
   "fix (again) TestIW.testThreadInterruptDeadlock to properly close (abort) its writer"
  ], 
  "revision_id": "980428"
 }, 
 {
  "author": "dannas", 
  "date": "2010-07-29T12:43:56.284653Z", 
  "msg": [
   "Make 'svn patch' do notifications for property hunks.", 
   "We use the same notification actions as for text hunks but replace", 
   "the headers to look like:", 
   "'## -1,6 +1,7 ##'", 
   "instead of:", 
   "'@@ -1,6 +1,7 @@'", 
   "Note that we don't specify what property a hunk belongs to (that information", 
   "is available in the reject file).", 
   "* subversion/svn/notify.c", 
   "(notify): Print different hunk headers depending on whether we have", 
   "a property or not.", 
   "* subversion/include/svn_wc.h", 
   "(svn_wc_notify_t): Add 'is_prop_hunk' field.", 
   "* subversion/libsvn_client/patch.c", 
   "(send_patch_notification): Iterate over the hunks of the property", 
   "targets in the same manner as is done for the text hunks.", 
   "* subversion/tests/cmdline/patch_tests.py", 
   "(test_with_properties): Mark as XFail. We get a notification saying", 
   "a hunk that adds one line to a non-existent property is beeing applied", 
   "with offset 1."
  ], 
  "revision_id": "980427"
 }, 
 {
  "author": "bentmann", 
  "date": "2010-07-29T12:37:41.897740Z", 
  "msg": [
   "o Fixed typo"
  ], 
  "revision_id": "980426"
 }
]