[
 {
  "author": "kmalhi", 
  "date": "2010-07-29T23:17:05.553754Z", 
  "msg": [
   "Excellent patch from Ivan Xu for OPENEJB-1314. Thanks Ivan."
  ], 
  "revision_id": "980605"
 }, 
 {
  "author": "hossman", 
  "date": "2010-07-29T23:15:03.275084Z", 
  "msg": [
   "SOLR-397: merging r940556 from trunk -- the code itself merged cleanly, but the test merged very painfully because of a lot of test code refactoring that's been done on the trunk.  the test changes also illumnated a hiden-bug in an unrelated prefix faceting test which assumed a fixed set of facet values would be returned for a field with facetmincount=0 -- even though the index wasn't being cleaned up prior to the test.  it was essentailly only working because of luck about when segment merges were happening"
  ], 
  "revision_id": "980604"
 }, 
 {
  "author": "elecharny", 
  "date": "2010-07-29T23:03:41.150458Z", 
  "msg": [
   "Added code and tests for move, rename and move&rename methods. atm, it just throw an UnwillingToPerform exception when applied on AdminsitrativePoint."
  ], 
  "revision_id": "980603"
 }, 
 {
  "author": "rhuijben", 
  "date": "2010-07-29T22:52:14.926768Z", 
  "msg": [
   "Following up on r920592 and r980069, fix the missing calculations in", 
   "the working copy crawler. These regression were in most cases invisible", 
   "from our test suite because the wc-database reported these cases as", 
   "obstructions. In single-db mode this is no longer the case, so the", 
   "problems started to show up.", 
   "* subversion/libsvn_wc/adm_crawler.c", 
   "(report_revisions_and_depths): Only report a node as missing if we miss", 
   "the administrative area or if it is impossible to restore this node.", 
   "In single-db mode never report nodes as missing.", 
   "(svn_wc_crawl_revisions5): Re-enable missing detection. Move code before", 
   "the actual reporting to allow easier error handling. Use equivalent", 
   "test as used in report_revisions_and_depths."
  ], 
  "revision_id": "980602"
 }, 
 {
  "author": "mbenson", 
  "date": "2010-07-29T22:41:53.664037Z", 
  "msg": [
   "compiler warnings + 1 TODO"
  ], 
  "revision_id": "980601"
 }
]