[
 {
  "author": "bpendleton", 
  "date": "2010-07-30T14:08:31.854316Z", 
  "msg": [
   "DERBY-4746: Server support for UTF8 in DRDA", 
   "This patch was contributed by Tiago R. Espinha (tiago dot derby at yahoo dot co dot uk)", 
   "The code portion of this change puts in place all the switches necessary", 
   "on the server-side to enable and disable UTF8 support. Principally, the", 
   "new internal methods switchToUtf8() and switchToEbcdic() are added to", 
   "DRDAConnThread, and called appropriately from the ACCSEC code point.", 
   "The test portion of this change contains the protocol tests and changes", 
   "to the framework required for the UTF8 protocol tests. The test changes", 
   "implement the command 'switchToUtf8CcsidManager' in the protocol tests", 
   "that essentially tells the framework to switch its DDMWriter and Reader", 
   "to UTF8. Normally, a client would negotiate this through the MGRLVLS", 
   "but the ProtocolTest doesn't take this into consideration and has to", 
   "be forced into UTF8 mode.", 
   "Note that due to DERBY-2031,  each time we add a feature to the JUnit", 
   "protocol test we have to do the same for the other or it'll break."
  ], 
  "revision_id": "980800"
 }, 
 {
  "author": "hwright", 
  "date": "2010-07-30T14:07:49.610931Z", 
  "msg": [
   "Merge r959004 from trunk:", 
   "* r959004", 
   "Make 'svn' raise an error when the --reintegrate flag is supplied to a", 
   "2-URL merge (which isn't a supported use-case).", 
   "Justification:", 
   "Currently, the --reintegrate option is silently ignored, which has", 
   "led to at last one confused user.", 
   "Votes:", 
   "+1: cmpilato, rhuijben, stsp"
  ], 
  "revision_id": "980799"
 }, 
 {
  "author": "dwoods", 
  "date": "2010-07-30T14:07:27.854160Z", 
  "msg": [
   "OPENJPA-1751 Update assembly inclusion of simple examples and update simple build with new root path"
  ], 
  "revision_id": "980798"
 }, 
 {
  "author": "philip", 
  "date": "2010-07-30T14:04:47.109388Z", 
  "msg": [
   "* subversion/libsvn_wc/adm_files.c", 
   "(svn_wc__internal_ensure_adm): Treat not-present like deleted, this", 
   "makes single-db copy_tests 21 get a bit further."
  ], 
  "revision_id": "980797"
 }, 
 {
  "author": "gdusbabek", 
  "date": "2010-07-30T14:02:56.498473Z", 
  "msg": [
   "merge from 0.6"
  ], 
  "revision_id": "980796"
 }
]