[
 {
  "author": "mgrigorov", 
  "date": "2010-07-31T10:38:58.861789Z", 
  "msg": [
   "Re-introduce SwitchProtocolRequestHandler from Wicket 1.4 (SwitchProtocolRequestTarget)", 
   "The user application need to configure HttpsConfig via ISecuritySettings#setHttpsConfig() to enable this functionality."
  ], 
  "revision_id": "981030"
 }, 
 {
  "author": "davsclaus", 
  "date": "2010-07-31T10:27:46.924927Z", 
  "msg": [
   "CAMEL-3012: CamelContext supports suspend/resume to temporary stop a Camel application."
  ], 
  "revision_id": "981029"
 }, 
 {
  "author": "jacopoc", 
  "date": "2010-07-31T10:13:49.911755Z", 
  "msg": [
   "Always close the stream of the xml file after the parsing is done: this fixes a bug where the file was not deleted when it was successfully imported at the second or third attempt."
  ], 
  "revision_id": "981028"
 }, 
 {
  "author": "markt", 
  "date": "2010-07-31T09:58:17.558481Z", 
  "msg": [
   "Fix possible threading issue in unit tests. Adding some Thread.sleep() calls in the right place can cause the tests to fail. This is probably one of the causes of the current Gump failures."
  ], 
  "revision_id": "981027"
 }, 
 {
  "author": "ashish", 
  "date": "2010-07-31T09:51:16.477084Z", 
  "msg": [
   "Applied fix from trunk for revision: 981025", 
   "When we pass fractional package weight to UPS like (0.5) then it gives error. This is because in UpsServices.java file, package weight has been changed to boxWeight.intValue() so it converts 0.5 to 0. Now if we pass only boxWeight big decimal number, code runs perfectly fine on confirming shipment.", 
   "Searched out in ups shipping document and found that we should pass this fractional weight to ups to its next full weight. For example 0.5 will be sent as 1.0 and 1.2 will be sent as 2.0 etc. Here is the link: http://www.ups.com/content/us/en/resources/prepare/oversize.html", 
   "search for this text \"Determine the Actual Weight\" in this link.", 
   "Having come to know this fact I converted boxWeight.intValue() code into boxWeight.setScale(0, boxWeight.ROUND_CEILING) which solves this purpose which is given in above mentioned link.", 
   "Patch from Vivek Mishra(Thanks!)"
  ], 
  "revision_id": "981026"
 }
]