[
 {
  "author": "fmeschbe", 
  "date": "2010-08-05T14:26:27.189859Z", 
  "msg": [
   "FELIX-2523 Fix test case for component reactivation after configuration deletion"
  ], 
  "revision_id": "982640"
 }, 
 {
  "author": "erans", 
  "date": "2010-08-05T14:26:13.540640Z", 
  "msg": [
   "\"PowellOptimizer\": Added a constructor for setting of the absolute tolerance,", 
   "removed one redundant function evaluation.", 
   "Line search relative tolerance explicitly set in the optimizer instance", 
   "created in \"PowellOptimizerTest\"."
  ], 
  "revision_id": "982639"
 }, 
 {
  "author": "brett", 
  "date": "2010-08-05T14:25:51.609376Z", 
  "msg": [
   "add snapshot repository for redback"
  ], 
  "revision_id": "982638"
 }, 
 {
  "author": "bpendleton", 
  "date": "2010-08-05T14:25:39.234616Z", 
  "msg": [
   "DERBY-4587: Add tools for query plan analysis", 
   "This patch was contributed by C.S. Nirmal J. Fernando (nirmal070125 at gmail dot com)", 
   "This patch adds a new tool, PlanExporter, to derbytools.jar. The PlanExporter", 
   "tool's primary purpose is to gather the information about a particular query", 
   "execution from the Derby XPLAIN tables, and to format that data into an", 
   "export format for usage by other tools. The most important export format is", 
   "XML, but the tool can also format the query into HTML or other formats by", 
   "running an appropriate XSL Stylesheet across the XML data.", 
   "The tool is run as follows:", 
   "java org.apache.derby.tools.PlanExporter dbURL username pwd schema stmt_id", 
   "-xml outputFileName", 
   "This patch includes the tool itself, and changes to the XplainStatisticsTest", 
   "to incorporate regression testing of the PlanExporter tool. Documentation of", 
   "the new tool is being developed under DERBY-4758.", 
   "The basic implementation of the tool is complete and operational, and ready", 
   "for use by the Derby community. Depending on community feedback, possible", 
   "future enhancements to the tool might include improved formatting stylesheets,", 
   "additional output formats, more detailed XML output, etc."
  ], 
  "revision_id": "982637"
 }, 
 {
  "author": "brett", 
  "date": "2010-08-05T14:25:28.930198Z", 
  "msg": [
   "add snapshot repository for redback"
  ], 
  "revision_id": "982636"
 }
]