[
 {
  "author": "hboutemy", 
  "date": "2010-08-16T09:46:29.864877Z", 
  "msg": [
   "avoid enforcer requireMavenVersion failure when built with Maven 3.0-SNAPSHOT"
  ], 
  "revision_id": "985845"
 }, 
 {
  "author": "ashish", 
  "date": "2010-08-16T09:44:39.794170Z", 
  "msg": [
   "Applied fix from trunk for revision: 940851", 
   "===", 
   "Fixed a bug in vendor return. The service getReturnableItems returns a map containing the returable quantity corresponding to an item along with", 
   "certain other things. Earlier this service was returning an empty map for a purchase order and a vendor return. On order detail page action", 
   "block there is a check on this map and if the map comes out to be empty the system does not show the options to create return for the", 
   "purchase order. Similary if you create a vendor return directly from the Return Header screen and try to add items on the Return Item screen", 
   "using an order Id, this display a message \"No returnable items found for order\"", 
   "Also the method sendItemsShipped in the service sendGoogleShipRequest was throwing a NPE because the code try to pull a product through", 
   "ItemIssuance > OrderItem > Product", 
   "In the vendor return of type refund the items are issued to the return shipment and a purchase return invoice is generated and hence the process", 
   "is not linked to any Order. Adding a condition on the ECA so that this service is not invoked."
  ], 
  "revision_id": "985844"
 }, 
 {
  "author": "jeremias", 
  "date": "2010-08-16T09:39:34.899481Z", 
  "msg": [
   "Improvements/Bugfixes for PDF attachments (embedded files):", 
   "- Acrobat doesn't like indirect objects for the /Length entry of embedded files (make on-the-fly generation more easily configurable).", 
   "- Added the /Size entry for embedded files to keep Acrobat happy.", 
   "- Moved the embedded files' Names tree to the end of the PDF to be on the safe side.", 
   "- Made hyperlinks to embedded files work by using a JavaScript Action (thanks to Matthias Reischenbacher for that idea).", 
   "- Added sorting to the names tree node because Acrobat relies on it.", 
   "- Added some filename manipulation code to work around possible encoding problems with special characters in the filenames."
  ], 
  "revision_id": "985843"
 }, 
 {
  "author": "jukka", 
  "date": "2010-08-16T09:36:48.038211Z", 
  "msg": [
   "JCR-2708: Merge jcr-benchmark into the performance test suite"
  ], 
  "revision_id": "985842"
 }, 
 {
  "author": "felixk", 
  "date": "2010-08-16T09:35:47.713294Z", 
  "msg": [
   "Start with advanced-user-guide"
  ], 
  "revision_id": "985841"
 }
]