[
 {
  "author": "tdunning", 
  "date": "2010-08-19T14:49:48.767188Z", 
  "msg": [
   "Another silly build issue."
  ], 
  "revision_id": "987175"
 }, 
 {
  "author": "jbeard", 
  "date": "2010-08-19T14:49:06.085406Z", 
  "msg": [
   "Checked in small web worker test. As suspected, XML processing API's are not available in web worker global scope, so at this moment, it will not be possible to use web workers to process XSL stylesheets, unless a pure-JavaScript implementation of XSLT is used."
  ], 
  "revision_id": "987174"
 }, 
 {
  "author": "jbeard", 
  "date": "2010-08-19T14:48:56.114719Z", 
  "msg": [
   "Added facilities for compiling compiler to Java bytecode.", 
   "Makefile includes tasks to:", 
   "- compile with RequireJS (and optionally closure compiler), to create a single js file.", 
   "- compile single js file to Java class file", 
   "- run Java class file against a file to see that it gives correct output.", 
   "Other changes in this check-in facilitate this build. These changes include:", 
   "- changing xml dependencies to text dependencies", 
   "- changing all xsl processor modules to accept XML documents as both parsed DOM and string forms", 
   "- changing SCXML compiler to use slightly clunkier code to accommodate RequireJS build", 
   "- modifying RequireJS text module to work under Rhino without needing to emulate XMLHttpRequest", 
   "- created build/rhino.js, a rhino-specific, build-friendly front-end, which accepts command-line arguments, and passes them to main module", 
   "Also, fixed small bug in AbstractStatechartGenrator.xsl which was breaking just-in-time compilation, state backend in Chrome.", 
   "All unit tests pass (rhino, ahead-of-time browser, and just-in-time browser). All demos seem to work."
  ], 
  "revision_id": "987173"
 }, 
 {
  "author": "gbrown", 
  "date": "2010-08-19T14:48:51.479730Z", 
  "msg": [
   "Minor example updates; add deploy-example.xml build script."
  ], 
  "revision_id": "987172"
 }, 
 {
  "author": "jbeard", 
  "date": "2010-08-19T14:48:32.018603Z", 
  "msg": [
   "Updated the xsl transformation frontend for Rhino to accept XML documents as strings, as well as to use a more efficient Java transformation API."
  ], 
  "revision_id": "987171"
 }
]