[
 {
  "author": "arkurth", 
  "date": "2010-08-20T20:07:48.632223Z", 
  "msg": [
   "VCL-164", 
   "Made minor changes to vcld::setup_management_node to improve the vcld setup menus. It now uses module.prettyname."
  ], 
  "revision_id": "987625"
 }, 
 {
  "author": "norman", 
  "date": "2010-08-20T20:07:01.268795Z", 
  "msg": [
   "Add new abstract class which allow to easy write a Mailbox implementation and not depend on the MessageMapper (IMAP-202)"
  ], 
  "revision_id": "987624"
 }, 
 {
  "author": "arkurth", 
  "date": "2010-08-20T20:06:13.602537Z", 
  "msg": [
   "VCL-164", 
   "Added setup and setup_capture_base_image subroutines to image.pm which allows the base image creation steps to be automated via a command-line interface when vcld is run with the -setup argument.  Added get_computer_ids, get_os_info, and get_user_info subroutines to utils.pm which are called by image.pm::setup.", 
   "Removed call to enable DHCP in Windows.pm::pre_capture and added a switch to Windows.pm::shutdown allowing the caller to specify whether or not DHCP should be disabled immediately before shutting down the computer. This allows a base image to be captured which has been configured with a static address.", 
   "VCL-298", 
   "Updated VMware.pm. Split up prepare_vmx subroutine to create another subroutine which only removes existing VMs which were created for the VM assigned to the reservation.", 
   "Reworked VMware.pm::capture to display more meaningful error and warning messages.", 
   "Reworked most of the get_vmx...path and get_vmdk...path subroutines to display more meaningful error and warning messages.", 
   "Updated vSphere.pm::copy_virtual_disk to retrieve the adapter type from the source vmdk rather than using lsiLogic as the default value if the argument was not specified."
  ], 
  "revision_id": "987623"
 }, 
 {
  "author": "yonik", 
  "date": "2010-08-20T20:01:39.367727Z", 
  "msg": [
   "javadoc"
  ], 
  "revision_id": "987622"
 }, 
 {
  "author": "oheger", 
  "date": "2010-08-20T20:01:10.971395Z", 
  "msg": [
   "Added a new isSuccessful() method to the result object of MultiBackgroundInitializer."
  ], 
  "revision_id": "987621"
 }
]