[
 {
  "author": "rjung", 
  "date": "2010-08-26T10:56:01.350615Z", 
  "msg": [
   "Fix missing line break in example.", 
   "Example formating is not verbatim."
  ], 
  "revision_id": "989600"
 }, 
 {
  "author": "jleroux", 
  "date": "2010-08-26T10:55:16.283665Z", 
  "msg": [
   "A modified patch from Sascha Rodekamp \"selectall.js jquery transformation\" (https://issues.apache.org/jira/browse/OFBIZ-3863) - OFBIZ-3863", 
   "Fix some issues I reported:", 
   "# the quick product access in main catalog page (you enter a productId and then choose the page you want to go) does not work (not sure to what it's related at this stage), not in Opera 10.61", 
   "# ajaxUpdateArea is not working in FF (this is maybe due to my environment, many plugins) see https://localhost:8443/catalog/control/ProductStoreFacilities?productStoreId=9000, ok in Opera for the add and update but not the delete, same in Chrome. All work well on trunk demo", 
   "# I may have missed something but I did not find any use cases for ajaxUpdateAreaPeriodic OOTB (did not find any use of autoUpdateLink but in templates)", 
   "# nor for ajaxSubmitRequestUpdateAreas", 
   "# nor for submitFormInBackground", 
   "# nor for setSelection", 
   "Actually Sascha forgot the keywordsearchbox.ftl file, but it was easy to fix", 
   "I have also added the error handling (same than failure in Prototype)", 
   "For the parts where there are no use cases, I commit as is as the changes looks good to me", 
   "I don't close the issue as there are still some Prototype stuff in selectall.js, notably a patch from Rupert Howell for the dropdown autocomplete stuff, but also some other (easily spotted looking for $)", 
   "Also I crossed again an issue I have for a long time in FF with application/x-json, and I guess application/json as well (I'm on Windows but I don't think it's the reason). When I press the Add or Update button when editing a facility at https://localhost:8443/catalog/control/ProductStoreFacilities?productStoreId=9000, the FF download popup window surges and I'm trapped there. Even if the action is correctly executed underneath (I can see it if I refresh the page). I did not find any good solution either using https://addons.mozilla.org/en-US/firefox/addon/10869/ or http://www.spasche.net/openinbrowser/ because they only allow to see the file. I did not find yet a way to bypass the dowload popup window"
  ], 
  "revision_id": "989599"
 }, 
 {
  "author": "rjung", 
  "date": "2010-08-26T10:51:43.632852Z", 
  "msg": [
   "Add information about \"||\" piped log syntax", 
   "to the docs."
  ], 
  "revision_id": "989598"
 }, 
 {
  "author": "jukka", 
  "date": "2010-08-26T10:48:44.661341Z", 
  "msg": [
   "2.1: Merged revision 950440 (JCR-2673)"
  ], 
  "revision_id": "989597"
 }, 
 {
  "author": "odeakin", 
  "date": "2010-08-26T10:38:46.448067Z", 
  "msg": [
   "Start implementation of SSLSessionImpl in terms of OpenSSL. Also add a temporary RSA key callback function to enable some more cipher suites (e.g. TLS_RSA_EXPORT_WITH_RC4_40_MD5) that fail without this."
  ], 
  "revision_id": "989596"
 }
]