[
 {
  "author": "simonetripodi", 
  "date": "2010-08-30T19:47:49.265238Z", 
  "msg": [
   "upgrated the apache commons-beanutils dependency to 1.8.3"
  ], 
  "revision_id": "990920"
 }, 
 {
  "author": "hwright", 
  "date": "2010-08-30T19:43:52.295705Z", 
  "msg": [
   "Remove the separate target for invoking the JavaHL compat tests, and fold", 
   "them into the standard JavaHL test target.  Run the standard tests before", 
   "the compat ones.", 
   "* Makefile.in", 
   "(check-javahl): Run both compat and standard tests.", 
   "(check-javahl-compat): Remove."
  ], 
  "revision_id": "990919"
 }, 
 {
  "author": "jfthomps", 
  "date": "2010-08-30T19:39:30.830283Z", 
  "msg": [
   "VCL-208", 
   "Ability to easily put the VCL site into a maintenance state", 
   "xmlrpcWrappers.php: modified XMLRPCextendRequest and XMLRPCsetRequestEnding - added check for isAvailable returning -2; if so, return errorcode 46: requested time is during a maintenance window", 
   "utils.php:", 
   "-modified initGlobals - added case statement for including sitemaintenance.php", 
   "-added maintenanceCheck - prints notice about site being down for maintenance if during maintenance window", 
   "-added maintenanceNotice - prints notice about upcoming maintenance window", 
   "-modified isAvailable - calls schCheckMaintenance to see if request conflicts with scheduled maintenance window; return -2 if it does", 
   "-added schCheckMaintenance - checks for time window conflicting with a maintenance window", 
   "-added numdatetimeToDatetime", 
   "-modified getTimeSlots - create entries for maintenance windows", 
   "-modified showTimeTable - print blocks for maintenance windows", 
   "-added checkInMaintenanceForTimeTable", 
   "-added getMaintItems", 
   "-added getMaintItemsForTimeTable", 
   "-modified printHTMLHeader - added call to maintenanceNotice", 
   "-modified getNavMenu - added entry for Site Maintenance to show up for ADMIN_DEVELOPER users", 
   "-modified getExtraCSS - return empty array if no matched modes (removes a php warning message)", 
   "-modified getDojoHTML - added includes and header stuff for siteMaintenance mode", 
   "states.php: added siteMaintenance, AJcreateSiteMaintenance, AJgetSiteMaintenanceData, AJgetDelSiteMaintenanceData, AJeditSiteMaintenance, and AJDeleteSiteMaintenance", 
   "conf-default.php: added DEFAULTTHEME - this is the theme that will be used when the site is placed in maintenance if $_COOKIE['VCLSKIN'] is not set", 
   "requests.php: modified AJupdateWaitTime and submitEditRequest - added check for isAvailable returning -2 and if so, display message about not being able to schedule due to scheduled downtime", 
   "sitemaintenance.php: initial add", 
   "maintenance: added directory for placing maintenance files", 
   "testsetup.php: added section to test write access to maintenance directory", 
   "index.php: added call to maintenanceCheck before calling dbConnect", 
   "css/vcl.css: added #maintenancenotice - this is the div that shows up notifying users of an upcoming maintenance window", 
   "js/sitemaintenance.js - initial add"
  ], 
  "revision_id": "990918"
 }, 
 {
  "author": "tross", 
  "date": "2010-08-30T19:38:31.824299Z", 
  "msg": [
   "QPID-2827 - QPID Cpp WinSDK does not contain 64-bit libraries", 
   "Patch from Chuck Rolke", 
   "* Adds the x64 platform to the cpp\\example solution and six example projects.", 
   "* Adds the x64 platform to the qpid messaging .NET binding dlls and examples.", 
   "* Adds QPID_BUILD_ROOT environment variable to .NET binding projects for locating C++ libraries and headers, and for storing generated output. This is required to compensate for the varying location of cmake-generated directories. For a given build QPID_BUILD_ROOT must be set to the directory in which cmake was run.", 
   "* Reorganize the bld-winsdk.ps1 script to build x86 (Win32) and x64 platforms.", 
   "* Update Readme-winsdk.txt content. Also switch this file to DOS line endings to improve its usability on a Windows system.", 
   "* Add a shadow solution file and shadow project files for the C# examples. The new build process copies the development example source tree to get the example sources organized into a hierarchy and then overlays the copied tree with the shadow .sln and .csproj files. Users then build the examples directly using the customized solution."
  ], 
  "revision_id": "990917"
 }, 
 {
  "author": "hwright", 
  "date": "2010-08-30T19:37:05.563098Z", 
  "msg": [
   "JavaHL: Create a persistent C client context, in order to reuse the working", 
   "copy context between client API invocations.", 
   "Note: This introduces a test failure which I believe to be a manifestation of", 
   "a bug in wc-ng.", 
   "* subversion/bindings/javahl/native/ClientContext.h", 
   "(persistentCtx): New.", 
   "* subversion/bindings/javahl/native/ClientContext.cpp", 
   "(ClientContext): Populate the persistentCtx in the global pool on", 
   "construction.", 
   "(getContext): Reuse the persistent context, rather than create a new one."
  ], 
  "revision_id": "990916"
 }
]