[
 {
  "author": "dannas", 
  "date": "2010-09-08T19:18:29.667153Z", 
  "msg": [
   "In the patch code, factor out the code dealing with closing streams to", 
   "its own function for readability.", 
   "* subversion/libsvn_client/patch.c", 
   "(close_target_streams): New. Created with code from ...", 
   "(apply_one_patch): .. here.", 
   "Suggested by: stsp"
  ], 
  "revision_id": "995210"
 }, 
 {
  "author": "vdichev", 
  "date": "2010-09-08T19:08:53.266654Z", 
  "msg": [
   "Fix occasionally failing TwitterAPI test"
  ], 
  "revision_id": "995209"
 }, 
 {
  "author": "jfthomps", 
  "date": "2010-09-08T19:08:24.406939Z", 
  "msg": [
   "VCL-254", 
   "block request improvements", 
   "when edit a block allocation, removed requirement that start date be today or later", 
   "utils.php: modified getDojoHTML - set javascript variable pagemode to 'edit' if editing, 'new' otherwise", 
   "blockallocations.php:", 
   "-modified blockAllocationForm - initially set owner of block allocation to self", 
   "-modified AJblockAllocationSubmit - if editing and start date is < today, call createWeeklyBlockTimes/createMonthlyBlockTimes with a start date of today", 
   "-modified getCurrentBlockHTML, getUserCurrentBlockHTML, and getPendingBlockHTML - set ORDER BY on several queries for blockWebDate/blockWebTime data", 
   "-modified processBlockAllocationInput - fixed problem where expire time of list might not be last date; if editing, allow start date to be in the past", 
   "js/blockallocations.js: modified blockFormVerifyWeekly and blockFormVerifyMonthly to allow the start date to < today if editing and to require last date to be > today if editing"
  ], 
  "revision_id": "995208"
 }, 
 {
  "author": "doogie", 
  "date": "2010-09-08T19:03:48.206807Z", 
  "msg": [
   "Expose actions variable to other code."
  ], 
  "revision_id": "995207"
 }, 
 {
  "author": "doogie", 
  "date": "2010-09-08T19:03:42.563513Z", 
  "msg": [
   "Move duplicated code that has one screen widget calling another screen,", 
   "into a global helper method.  Eventually, this method will be altered to", 
   "be able to 'change' which screen is actually included, based on various", 
   "conditions at runtime.  This will be used to eventually support partial", 
   "ajax page updates."
  ], 
  "revision_id": "995206"
 }
]