[
 {
  "author": "jfthomps", 
  "date": "2010-09-13T19:22:31.793738Z", 
  "msg": [
   "VCL-313", 
   "need a way to set computers as vmhosts without a bare metal provisioning engine", 
   "this is just some initial work on this so that people can get started with VCL using preloaded vm hosts without having to touch the database directly;", 
   "it allows computers to be added in the vmhostinuse state, but the state cannot be set to vmhostinuse afterward without xCAT", 
   "computers.php:", 
   "-modified viewComputers, editOrAddComputer, and bulkAddComputer - added vmhostinuse as an option for the state", 
   "-modified confirmEditOrAddComputer and confirmAddBulkComputers- if stateid = 20 (vmhostinuse) set nextmode to addComputerSetVMHostProfile", 
   "-added addComputerSetVMHostProfile", 
   "-modified submitAddBulkComputers and addComputer - if stateid = 20, insert entry into vmhost; changed from using SELECT LAST_INSERT_ID to calling dbLastInsertID; changed queries to insert into resourcegroupmembers to be a single query", 
   "-modified computerUtilities - changed text for setting state to vmhostinuse to 'convert to vmhostinuse' to help distinguish from adding computers in the vmhostinuse state", 
   "-modified compStateChange - for vmprofile, use inline prints to create select object instead of calling printSelectInput since it doesn't have name or prettyname", 
   "errors.php:", 
   "-removed 196, 197, 236, and 237", 
   "states.php: added addComputerSetVMHostProfile"
  ], 
  "revision_id": "996650"
 }, 
 {
  "author": "cutting", 
  "date": "2010-09-13T19:21:10.613574Z", 
  "msg": [
   "AVRO-634.  IDL: Add support for aliases."
  ], 
  "revision_id": "996649"
 }, 
 {
  "author": "cutting", 
  "date": "2010-09-13T19:15:09.715778Z", 
  "msg": [
   "Merge r996640,996642 from trunk to 1.4 branch.  Fixes: AVRO-655, AVRO-657."
  ], 
  "revision_id": "996648"
 }, 
 {
  "author": "uschindler", 
  "date": "2010-09-13T19:11:21.025017Z", 
  "msg": [
   "LUCENE-2642: Fix small problem with one incorrectly written contrib test and add a extra exception, if somebody uses a static declared test method"
  ], 
  "revision_id": "996647"
 }, 
 {
  "author": "tabish", 
  "date": "2010-09-13T19:10:46.160945Z", 
  "msg": [
   "fix for: https://issues.apache.org/activemq/browse/AMQ-2915"
  ], 
  "revision_id": "996646"
 }
]