[
 {
  "author": "ivaynberg", 
  "date": "2010-09-22T01:02:08.765397Z", 
  "msg": [
   "Issue: WICKET-3069"
  ], 
  "revision_id": "999705"
 }, 
 {
  "author": "rajith", 
  "date": "2010-09-22T01:01:18.966799Z", 
  "msg": [
   "QPID-2881", 
   "When a topic based destination is used in creating a consumer, the code looks to see if the address is already resolved.", 
   "If it is then it could mean two things.", 
   "1. A consumer is being recreated after failover.", 
   "2. This destination was used previously to create a consumer or a producer. In this case we assume it was used for a consumer.", 
   "For case #1, we need to preserve the queue name. The reason being if it was either a durable subscription or if it was a named queue (name property specified in link) then we need to maintain the same name.", 
   "For case #2 we need to ensure that each consumer gets it's own queue,hence we clone the destination object and the queue name is set to null", 
   "so name is auto-generated.", 
   "I have removed the incorrect logic (in BasicMessageConsumer_0_10) of looking at the durable property as one factor in deciding if it's case #1.", 
   "A durable subscription does use a named queue, therefore it is not nessacery to look at the durable property in order to identify it as case #1.", 
   "I have made modifications to createDurableTopic method in AMQTopic to set the queue name in the link properties.", 
   "The above changes enable a user to create more than one consumer (each with it's own unique queue) when using the same destination created off an addressing string that has durable set to true."
  ], 
  "revision_id": "999704"
 }, 
 {
  "author": "daijy", 
  "date": "2010-09-22T00:50:52.208564Z", 
  "msg": [
   "PIG-1598: Pig gobbles up error messages - Part 2"
  ], 
  "revision_id": "999703"
 }, 
 {
  "author": "hwright", 
  "date": "2010-09-22T00:50:47.815390Z", 
  "msg": [
   "On the object-model branch:", 
   "Use the C++ bindings to implement checkout() for JavaHL.", 
   "* subversion/bindings/javahl/native/SVNClient.h", 
   "(checkout): Remove.", 
   "* subversion/bindings/javahl/native/Revision.cpp", 
   "(fromJ): Add an additional parameter.", 
   "* subversion/bindings/javahl/native/JNIRevision.h", 
   "(fromJ): Add an additional parameter, but default it to false.", 
   "* subversion/bindings/javahl/native/SVNClient.cpp", 
   "(checkout): Remove.", 
   "* subversion/bindings/javahl/native/org_apache_subversion_javahl_SVNClient.cpp", 
   "(Java_org_apache_subversion_javahl_SVNClient_checkout): Use the C++", 
   "client, instead of the JavaHL one."
  ], 
  "revision_id": "999702"
 }, 
 {
  "author": "dims", 
  "date": "2010-09-22T00:50:40.939654Z", 
  "msg": [
   "."
  ], 
  "revision_id": "999701"
 }
]